window.sgscq_update = {
	version: '1.1.0',
	'1.1.0': {
		changeLog: [
			//----------------1.0.0--------------//
			'可联机',
			'当前版本:1.1.0',
			'更新日期:2024-05-23',
			'------------更新详情------------',
			'- 本扩展需本体版本为1.12以上,建议最新版.',
			'- 添加台词.',
			'--------------声明--------------',
			'- 代码中部分文字用ASCII和Unicode进行了转化,以避免剧透.',
			'- 制作仓促,有bug烦请加群反馈.',
			'- 交流QQ群:744674127.',
		],
		players: [
		],
		cards: [
		],
		files: [
		],
	},
	'1.0.0': {
		changeLog: [
			//----------------1.0.0--------------//
			'理论上可联机(需一劳永逸)',
			'当前版本:1.0.0',
			'更新日期:2024-02-03',
			'------------更新详情------------',
			'- 本扩展需本体版本为1.10.7以上,建议最新版!.',
			'- 新的开始.',
			'--------------声明--------------',
			'- 代码中部分文字用ASCII和Unicode进行了转化,以避免剧透.',
			'- 制作仓促,有bug烦请加群反馈.',
			'- 交流QQ群:744674127.',
		],
		players: [
		],
		cards: [
		],
		files: [
		],
	},
};
