import { lib, game, ui, get, ai, _status } from '../../noname.js'
game.import('extension', function (lib, game, ui, get, ai, _status) {
    return {
        name: '东方七宿',
        content(config, pack) {
            if (lib.rank) {
                var rank = {
                    s: [
                        // boss将
                    ],
                    ap: [
                        // 阴间
                    ],
                    a: [
                        // 阳顶天
                    ],
                    am: [
                        //中强将
                    ],
                    bp: [
                        // 中等偏上强度
                    ],
                    b: [
                        // 中规中矩
                    ],
                    bm: [
                        // 一般没发挥的武将
                    ],
                    c: [
                        // 很弱的
                    ],
                    d: [
                        // ……呃？
                    ],
                    rarity: {
                        legend: [
                            // 传说SSS
                            '黄月英改',
                            '卧龙',
                            '赵云改',
                            '徐登',
                            '公孙瓒改',
                            '张楚',
                            '曹金瓠',
                            '界吕布改',
                            '邢夫人',
                            '张心岂',
                        ],
                        epic: [
                            // 史诗SS
                            '吕梦茹',
                            '赵妪',
                            '谋关羽',
                            '祝融改',
                            '左髭丈八',
                            '木鹿大王',
                            '夏侯子萼',
                            '吕布改',
                            '李飞燕',
                            '吕玲绮',
                            '周仓改',
                            '济火',
                            '池阳君',
                            '朵思大王改',
                            '张琪瑛改',
                            '兀突骨改',
                            '刘虞改',
                            '张飞改',
                            '诸葛亮改',
                            '廖化改',
                            '大乔改',
                            '王异改',
                            '貂蝉改',
                            '谋典韦',
                        ],
                        rare: [
                            // 稀有S
                            '马琳',
                            '刘禅改',
                            '审配改',
                            '董太后',
                            '华佗改',
                            '宋金生',
                            '孟获改',
                            '胡金定改',
                            '张文姬',
                            '关兴张苞改',
                            '张休',
                            '董璜',
                            '俄何烧戈',
                            '甘夫人改',
                            '颜良文丑改',
                            '吕蒙改',
                            '孙坚改',
                            '庞统改',
                            '张辽改',
                            '彭虎&彭琦',
                            '夏侯岚',
                            '张葳',
                            '许褚改',
                            '典满',
                            '赵娥',
                            '田钏',
                            '董白改',
                        ],
                        junk: [
                            // 平凡A
                            '朗吉力',
                            '朗伯多',
                            '董荼那',
                            '金环三结',
                            '落头氏',
                            '嬄眸',
                            '胡轸',
                            '迷当大王',
                        ],
                    },
                };
                var addRank = function (rank) {
                    if (!lib.rank) return;
                    for (var i in rank) {
                        if (i == 'rarity') continue;
                        lib.rank[i].addArray(rank[i]);
                    }
                    if (rank.rarity && lib.rank.rarity) {
                        for (var i in rank.rarity) {
                            if (lib.rank.rarity[i] === undefined) {
                                lib.rank.rarity[i] = [];
                            }
                            lib.rank.rarity[i].addArray(rank.rarity[i]);
                        }
                    }
                };
                addRank(rank);
            }
        },
        precontent() {
            //—————————————————————————————————————————————————————————————————————————————数据操作相关自定义函数
            const numfunc = function () {
                if (!lib.number) {
                    lib.number = [];
                    for (var i = 1; i < 14; i++) {
                        lib.number.add(i);
                    }
                } //添加lib.number
                window.sgn = function (bool) {
                    if (bool) return 1;
                    return -1;
                };//true转为1,false转为-1
                window.numberq0 = function (num) {
                    if (isNaN(Number(num))) return 0;
                    return Math.abs(Number(num));
                };//始终返回正数(取绝对值)
                window.numberq1 = function (num) {
                    if (isNaN(Number(num))) return 1;
                    return Math.max(Math.abs(Number(num)), 1);
                };//始终返回正数且至少为1(取绝对值)
                window.number0 = function (num) {
                    if (isNaN(Number(num))) return 0;
                    return Math.max(Number(num), 0);
                };//始终返回正数
                window.number1 = function (num) {
                    if (isNaN(Number(num))) return 1;
                    return Math.max(Number(num), 1);
                };//始终返回正数且至少为1
                window.deepClone = function (obj, visited = new WeakMap()) {
                    if (obj === null || typeof obj !== 'object' || obj instanceof window.Element) {
                        return obj;
                    }
                    if (visited.has(obj)) {
                        return visited.get(obj);
                    }
                    if (Array.isArray(obj)) {
                        return obj.map((item) => deepClone(item, visited));
                    }
                    const clonedObj = {};
                    visited.set(obj, clonedObj);
                    for (let key in obj) {
                        if (Object.hasOwn(obj, key)) {
                            clonedObj[key] = deepClone(obj[key], visited);
                        }
                    }
                    return clonedObj;
                }; //深拷贝对象
                window.factorial = function (num) {
                    num = Math.round(num);
                    if (num < 0) {
                        return 0;
                    }
                    if (num < 2) {
                        return 1;
                    }
                    let result = 1;
                    for (let i = 2; i <= num; i++) {
                        result *= i;
                    }
                    return result;
                }; //阶乘
                window.isPrime = function (num) {
                    if (num === 2 || num === 3) return true;
                    if (num < 2 || num % 2 === 0 || num % 3 === 0) return false;
                    for (let i = 5; i * i <= num; i += 6) {
                        if (num % i === 0 || num % (i + 2) === 0) return false;
                    }
                    return true;
                }; // 质数
            };
            numfunc();
            //—————————————————————————————————————————————————————————————————————————————视为转化虚拟牌相关自创函数
            const shiwei = function () {
                lib.element.player.filterCardx = function (card, filter) {
                    if (typeof card == 'string') {
                        card = { name: card };
                    }
                    const player = this, info = get.info(card);
                    if (!lib.filter.cardEnabled(card, player)) return false; //卡牌使用限制
                    if (info.notarget) return true;
                    if (!info.filterTarget) return true;
                    if (!info.enable) return true;
                    return game.hasPlayer(function (current) {
                        if (info.multicheck && !info.multicheck(card, player)) return false;
                        if (filter) {
                            if (!lib.filter.targetInRange(card, player, current)) return false; //距离限制
                            return lib.filter.targetEnabledx(card, player, current);
                        }
                        return lib.filter.targetEnabled(card, player, current); //目标限制
                    });
                }; //适用于choosetouse的filtercard
                lib.element.player.filterCard = function (card, filter) {
                    if (typeof card == 'string') {
                        card = { name: card };
                    }
                    const player = this, info = get.info(card), event = _status.event;
                    const evt = event.name.startsWith('chooseTo') ? event : event.getParent((q) => q.name.startsWith('chooseTo'));
                    if (evt.filterCard2) {
                        return evt._backup.filterCard(card, player, evt);
                    }//viewAs的技能会修改chooseToUse事件的filterCard
                    else if (evt.filterCard && evt.filterCard != lib.filter.filterCard) {
                        return evt.filterCard(card, player, evt);//这里也有次数限制
                    }
                    else {
                        if (!lib.filter.cardEnabled(card, player)) return false;//卡牌使用限制
                        if (info.notarget) return true;
                        if (!info.filterTarget) return true;
                        if (!info.enable) return true;
                        if (evt.name == 'chooseToRespond') return true;//chooseToRespond无次数距离目标限制
                        if (filter) {
                            if (!lib.filter.cardUsable(card, player, evt)) return false;//次数限制
                        }
                        if (evt.filterTarget && evt.filterTarget != lib.filter.filterTarget) {
                            return game.hasPlayer(function (current) {
                                return evt.filterTarget(card, player, current);
                            });
                        }
                        return game.hasPlayer(function (current) {
                            if (info.multicheck && !info.multicheck(card, player)) return false;
                            if (filter) {
                                if (!lib.filter.targetInRange(card, player, current)) return false;//距离限制
                                return lib.filter.targetEnabledx(card, player, current);
                            }
                            return lib.filter.targetEnabled(card, player, current);//目标限制
                        });
                    }
                };//删除次数限制//filter决定有无次数距离限制//viewAs的技能会修改chooseToUse事件的filterCard
                lib.element.player.qcard = function (type, filter, range) {
                    const list = [];
                    for (const i in lib.card) {
                        const info = lib.card[i];
                        if (info.mode && !info.mode.includes(lib.config.mode)) {
                            continue;
                        }
                        if (!info.content) {
                            continue;
                        }
                        if (['delay', 'equip'].includes(info.type)) {
                            continue;
                        }
                        if (type && info.type != type) {
                            continue;
                        }
                        if (filter !== false) {
                            const player = this;
                            if (range !== false) {
                                range = true;
                            }
                            if (!player.filterCard(i, range)) {
                                continue;
                            }
                        }
                        list.push([lib.suits.randomGet(), lib.number.randomGet(), i]); //花色/点数/牌名/属性/应变
                        if (i == 'sha') {
                            for (const j of Array.from(lib.nature.keys())) {
                                list.push([lib.suits.randomGet(), lib.number.randomGet(), 'sha', j]);
                            }
                        }
                    }
                    return list;
                }; //可以转化为的牌//filter控制player.filterCard//range控制是否计算次数与距离限制
            };
            shiwei();
            game.import('character', function () {
                var dfqx = {
                    name: 'dfqx',
                    characterSort: {
                        dfqx: {
                            online: ['董白改', '吕玲绮', '张文姬', '孟优', '俄何烧戈', '迷当大王', '典满', '刘虞改'],
                            shizhounian: ['大乔改', '兀突骨改', '王异改', '孙尚香改', '司马懿改', '夏侯子萼', '池阳君', '嬄眸', '董璜', '邢夫人', '赵娥', '董太后', '张休', '胡轸', '济火', '曹金瓠', '甘夫人2改', '张飞改', '赵云改', '界吕布改', '卧龙', '徐登', '任氏', '阴贵人', '大懿皇后', '黄月英改', '公孙瓒改'],
                            yidong: ['胡金定改', '谋关羽', '谋典韦', '审配改', '谋袁绍', '金环三结', '董荼那', '甘夫人改', '祝融改', '庞统改', '朗吉力', '朗伯多', '落头氏', '夏侯岚', '马琳'],
                            haiwai: ['吕布改', '朵思大王改', '吕梦茹', '张心岂', '田钏', '张葳', '左髭丈八', '木鹿大王', '赵妪', '张楚', '宋金生', '李飞燕', '彭虎&彭琦', '玛纽'],
                            tongyong: ['张辽改', '关兴张苞改', '颜良文丑改', '周仓改', '孙坚改', '孟获改', '貂蝉改', '廖化改', '吕蒙改', '张琪瑛改', '诸葛亮改', '许褚改', '刘禅改', '华佗改'],
                        },
                    },
                    character: {
                        黄月英改: ['female', 'shu', 3, ['集智', '奇才', '勤持'], []],
                        迷当大王: ['male', 'qun', 4, ['羌王', '迷乱'], []],
                        刘禅改: ['male', 'shu', 3, ['享乐', 'refangquan', '若愚'], []],
                        吕梦茹: ['female', 'wu', 3, ['拆招', '界袭', '换影'], []],
                        祝融改: ['female', 'shu', 4, ['烈刃', '巨象'], []],
                        孟获改: ['male', 'shu', 4, ['祸首', 'rezaiqi'], []],
                        卧龙: ['male', 'shu', 3, ['八阵', '火计', '看破', 'cangzhuo'], []],
                        赵云改: ['male', 'shu', 4, ['龙胆', '涯角'], []],
                        谋关羽: ['male', 'shu', 4, ['武圣', '义绝'], []],
                        华佗改: ['male', 'qun', 3, ['青囊', '急救'], []],
                        胡金定改: ['female', 'shu', '2/6', ['仁释', '武缘', '怀子'], []],
                        左髭丈八: ['male', '', 4, ['命器', '抵抗'], []],
                        夏侯子萼: ['female', 'xun', 4, ['血影', '承芳'], ['des:<姐姐不在,我必须肩负起血婆娑的使命!>']],
                        夏侯岚: ['female', 'wei', 3, ['影箭', '请戍', '熾魂'], ['doublegroup:wei:shu']],
                        张心岂: ['male', 'xun', 4, ['游侠', '五岳'], []],
                        董璜: ['male', 'qun', '5/7', ['残戾'], []],
                        关兴张苞改: ['male', 'shu', 4, ['父魂'], []],
                        吕布改: ['male', 'qun', 4, ['射戟', 'wushuang'], []],
                        宋金生: ['male', 'qun', 3, ['犬计', '佢守'], []],
                        池阳君: ['female', 'qun', 3, ['征兆', '貔魔'], []],
                        李飞燕: ['female', 'shu', 3, ['暗恋', '呤作'], []],
                        张文姬: ['female', 'qun', 3, ['问道', '驱恶'], []],
                        张休: ['male', 'shu', 4, ['狩境'], []],
                        吕玲绮: ['female', 'qun', 4, ['战姬', '武勇'], []],
                        周仓改: ['male', 'shu', 4, ['忠勇'], []],
                        济火: ['male', 'qun', 16, ['护彝'], []],
                        俄何烧戈: ['male', 'qun', '4/8', ['血激', '奔营'], []],
                        胡轸: ['male', 'qun', 5, ['暴乱', '魔贱'], []],
                        大乔改: ['female', 'wu', 3, ['国色', 'liuli'], []],
                        兀突骨改: ['male', 'qun', 15, ['燃伤', 'hanyong'], []],
                        貂蝉改: ['male', 'qun', 3, ['离间', '闭月'], []],
                        刘虞改: ['male', 'qun', 2, ['止戈', 'df_宗祚'], []],
                        甘夫人改: ['female', 'shu', 3, ['shushen', '神智'], []],
                        公孙瓒改: ['male', 'qun', 4, ['义从', '踏虏', '溃京'], []],
                        颜良文丑改: ['male', 'qun', 4, ['双雄'], []],
                        张飞改: ['male', 'shu', 5, ['咆哮', 'oltishen'], []],
                        诸葛亮改: ['male', 'shu', 3, ['观星', '空城', '承龙'], []],
                        吕蒙改: ['male', 'wu', 4, ['克己', 'qinxue', 'rebotu'], []],
                        孙坚改: ['male', 'wu', '4/5', ['gzyinghun', '奠基'], []],
                        庞统改: ['male', 'shu', 3, ['ollianhuan', '涅槃'], []],
                        张辽改: ['male', 'wei', 4, ['new_retuxi', '摧锋'], []],
                        廖化改: ['male', 'shu', 4, ['当先', '伏枥'], ['des:4']],
                        落头氏: ['female', 'wu', '1/1/4', ['合身', '离头'], []],
                        嬄眸: ['female', 'qun', 3, ['从一'], ['des:3']],
                        木鹿大王: ['male', 'qun', '4/4/2', ['纵兽', '兽踏'], []],
                        界吕布改: ['male', 'qun', 5, ['无双', 'new_liyu'], []],
                        张楚: ['female', 'qun', 3, ['授道', '神影', '洗牌'], ['doublegroup:wu:wei:shu:qun']],
                        马琳: ['female', 'shu', '2/2/3', ['轻盈', '照月'], []],
                        赵娥: ['female', 'qun', 3, ['仇涤', '砺刃'], ['doublegroup:qun:wei']],
                        朗吉力: ['male', 'qun', '4/4/1', ['狼威', '神子'], []],
                        谋典韦: ['male', 'wei', 4, ['强袭'], []],
                        审配改: ['male', 'qun', '2/2/2', ['守邺', 'liezhi'], []],
                        董太后: ['female', 'qun', 3, ['预政', '托绶'], ['des:3']],
                        邢夫人: ['female', 'wei', 3, ['娇颜', '明忌'], []],
                        徐登: ['female', 'wu', '3/3/3', ['断流', '藏阴', '斩龙'], []],
                        赵妪: ['female', '', 4, ['垂乳', '斩鲸', '奔踏'], []],
                        田钏: ['female', 'xun', 4, ['离逝'], []],
                        张葳: ['female', 'xun', 4, ['突骑', '领威'], []],
                        朗伯多: ['male', 'qun', 3, ['血佑', '孤煞'], []],
                        董白改: ['female', 'qun', 3, ['连珠', '黠慧'], []],
                        朵思大王改: ['male', 'qun', '4/5', ['恶泉', '蛮汲'], []],
                        张琪瑛改: ['female', 'qun', 3, ['xinfu_falu', 'xinfu_dianhua', '真仪'], []],
                        董荼那: ['male', 'qun', 4, ['juman'], []],
                        金环三结: ['male', 'qun', 4, ['qiangman'], []],
                        '彭虎&彭琦': ['none', 'qun', 4, ['山影', '缭影', '千激'], []],
                        许褚改: ['male', 'wei', 4, ['裸衣'], []],
                        典满: ['male', 'wei', 4, ['武魄'], []],
                        曹金瓠: ['female', 'wei', 3, ['晨露', '夭逝'], []],
                        王异改: ['female', 'wei', 4, ['zhenlie', '秘计'], []],
                        甘夫人2改: ['female', 'shu', 3, ['shushen', 'dfqx_shenzhi'], []],
                        谋袁绍: ['male', 'qun', 4, ['dfqx_qiji', 'olxueyi'], []],
                        任氏: ['female', 'qun', 3, ['dfqx_jiechi'], []],
                        阴贵人: ['female', 'wei', 3, ['dfqx_chongxing', 'dfqx_boming'], []],
                        大懿皇后: ['female', 'wu', 3, ['dfqx_rugong', 'dfqx_youshang'], []],
                        玛纽: ['female', 'shu', 3, ['dfqx_tianhu', 'dfqx_jiangzi'], []],
                        孙尚香改: ['female', 'wu', 3, ['dfqx_jieyin', 'xiaoji'], []],
                        孟优: ['male', 'qun', 4, ['dfqx_yuyong', 'dfqx_linwei'], []],
                        司马懿改: ['male', 'wei', 3, ['dfqx_fankui', 'dfqx_guicai'], []],
                    },
                    characterIntro: {
                        徐登: '闽中人,本为女子,假扮为男子.  少牧牛山巅,遇异人,得仙术.时有东阳赵炳者亦得仙术,遇于高盖山,各试所能,登能禁水为不流,炳喷酒着树辄成花.又有庄君平者,不知何许人,居福州,人亦疑其仙云.徐登是闽中(今福建泉州)的人,精于道家的方术,特别善于用禁术治疗各种疾病.赵炳,又名侯,字公阿,是东阳(今山东恩县)的人.他也善用方术,并能使用古代<越方>为人治病.越方主要是使用(包括禁术在内的)方术来治病的方法.',
                        张楚: '<阵面对决>第九弹<燎原>中登场的一个原创人物.她是张角的女儿,张宁的姐姐,在逃亡途中被刘备捕获.之后在诸葛亮的建议下,张楚被囚禁.在<阵面对决>的<怒焰>故事线中,张楚随着刘备入了西川,并被软禁在成都.夷陵之战后,刘备大败,全国主力外出用以支援刘备,朝内空虚,张楚趁机逃跑.',
                        赵娥: '东汉酒泉郡禄福县(即肃州)人.丈夫庞子夏,表氏县(今高台县)人.庞子夏去世后,赵娥在禄福县抚养其子庞淯.她的父亲被李寿击杀.灵帝光和二年(公元179年)二月上旬的一天早晨,赵娥在都亭前与李寿相遇,她奋力挥刀击杀了李寿,随后到了都亭尊长的面前认罪伏法.后来,凉州刺史周洪、酒泉太守刘班等人共同上表朝廷,禀奏赵娥的烈义行为,刻石立碑显其赵家门户.黄门侍郎梁宽 [1]  还著书追述赵娥的事迹,为其作传.西晋政治家傅玄为其作<秦女休行>诗,加以赞美.',
                        董太后: '(？―189年7月7日),董氏,河间(今属河北)人,解渎亭侯刘苌的妻子,汉灵帝刘宏的生母. 永康元年(167年),汉桓帝去世无子,其皇后窦妙被尊为皇太后,与其父窦武立刘宏为帝,是为汉灵帝.汉灵帝继位后,追尊父亲刘苌为孝仁皇,尊母亲董氏为慎园贵人.建宁二年(169年),尊董氏为孝仁皇后.因居于永乐宫,故通称<永乐太后>.熹平元年(172年),太后窦妙死后,董氏成为太后,开始干预朝政.卖官求货,收纳金钱,扰乱朝政.中平六年(189年),汉灵帝去世,其子刘辩继位,刘辩母亲皇后何氏为太后.同年(189年),董氏在与何皇后的斗争中失败,终因忧惧成疾而死,附葬慎陵.',
                        赵妪: '(225－248年4月9日),又称赵氏贞或赵贞娘,东吴时期的交州九真盗贼.她曾击退收复交州的东吴士兵,很快就被平定下去.数百年后独立的越南人追尊她为民族英雄,宣称她是越南的<圣女贞德>.',
                        田钏: '出现在江东的神秘女刺客,她犹如一只狡猾的狐狸,穿梭于人群之中,执行着不为人知的暗杀任务.她能潜伏在目标身边数月,只为了逐渐消磨目标的意志,慢慢折磨他直到死亡.她不知道自己的生父是谁,只知道自己名叫田钏,出生名门,却从来没见过自己的父母.她来自暗影,遁于暗影.在她的手中,再具有权势的人,也终将成为亡魂.',
                        董荼那: '古典名著<三国演义>里的人物,南蛮王孟获属下大将,第二洞元帅,与金环三结、阿会喃等人一起担任孟获的援军出征,但是被俘虏,又被诸葛亮释放,孟获怀疑其叛变,将他击杀.',
                        金环三结: '<三国演义>中的虚构人物,南蛮王孟获部下三洞元帅之一,第一洞元帅.奉孟获之命出战蜀军,但被蜀将赵云所杀.',
                        彭虎: '生卒年不详,汉末三国时鄱阳起义军首领,后为孙权部将董袭所败.彭琦,为原创武将 为彭虎转性之后.',
                        落头氏: '起源于中国晋代干宝的<搜神记.卷十二>,相传三国时期东吴的大将朱桓便曾遇到过<落头氏>.',
                        济火: '(175年—238年),彝名妥阿哲,或谓济火是彝族传说人物.相传,蜀汉建兴三年(公元225年),诸葛亮南征时,水西彝族远祖酋长济火(彝名<妥阿哲>)曾于黔西北和滇东北部分地区亲迎蜀军,在今贵州西北积粮通道,协助平孟获有功,受封为<罗甸王>.',
                        俄何烧戈: '羌将.正始八年,陇西、南安、金城、西平诸羌饿何、烧戈、伐同、蛾遮塞等相结叛乱,攻围城邑,南招蜀兵,凉州名胡治无戴复叛应之.讨蜀护军夏侯霸督诸军屯为翅.郭淮退姜维,维遁退.进讨叛羌,斩饿何、烧戈,降服者万馀落.',
                        张休: '三国蜀汉将领,与马谡一起守街亭失败被杀.',
                        李飞燕: '电视剧<武神赵子龙>中的原创角色.李全之女,赵子龙的师妹,出身武林世家,端庄大气,柔中带刚.生得清丽,能吟诗弄作.她暗恋赵子龙,随不会武功,却追随赵子龙出生入死,无怨无悔,柳慎对其一见钟情,功夫不负有心人,柳慎誓死救护的真情最终成功俘获李飞燕芳心.',
                        池阳君: '董卓之母,姓氏不详,年九十,于郿坞坞门被斩首.',
                        迷当大王: '羌族之王.响应姜维,进击魏军,但是中了魏将陈泰之计,将魏军引到蜀营.',
                        吕梦茹: '东吴名将吕蒙之女,她凭借神族天赋,独创与众不同的刺杀之术.',
                    },
                    characterTitle: {
                        huanyueying: ['re_huangyueying', 'huangyueying', '黄月英改'],
                    },
                    characterReplace: {},
                    translate: {
                        online: 'OL',
                        shizhounian: '十周年',
                        yidong: '移动',
                        haiwai: '海外',
                        tongyong: '通用',
                        黄月英改: '黄月英改',
                        迷当大王: '迷当大王',
                        刘禅改: '刘禅改',
                        吕梦茹: '吕梦茹',
                        祝融改: '祝融改',
                        孟获改: '孟获改',
                        卧龙: '卧龙',
                        赵云改: '赵云改',
                        谋关羽: '谋关羽',
                        华佗改: '华佗改',
                        胡金定改: '胡金定改',
                        左髭丈八: '左髭丈八',
                        夏侯子萼: '夏侯子萼',
                        夏侯岚: '夏侯岚',
                        张心岂: '张心岂',
                        董璜: '董璜',
                        关兴张苞改: '关兴张苞改',
                        吕布改: '吕布改',
                        宋金生: '宋金生',
                        池阳君: '池阳君',
                        李飞燕: '李飞燕',
                        张文姬: '张文姬',
                        张休: '张休',
                        吕玲绮: '吕玲绮',
                        周仓改: '周仓改',
                        济火: '济火',
                        俄何烧戈: '俄何烧戈',
                        胡轸: '胡轸',
                        大乔改: '大乔改',
                        兀突骨改: '兀突骨改',
                        貂蝉改: '貂蝉改',
                        刘虞改: '刘虞改',
                        甘夫人改: '甘夫人改',
                        公孙瓒改: '公孙瓒改',
                        颜良文丑改: '颜良文丑改',
                        张飞改: '张飞改',
                        诸葛亮改: '诸葛亮改',
                        吕蒙改: '吕蒙改',
                        孙坚改: '孙坚改',
                        庞统改: '庞统改',
                        张辽改: '张辽改',
                        廖化改: '廖化改',
                        落头氏: '落头氏',
                        嬄眸: '嬄眸',
                        木鹿大王: '木鹿大王',
                        界吕布改: '界吕布改',
                        张楚: '张楚',
                        马琳: '马琳',
                        赵娥: '赵娥',
                        朗吉力: '朗吉力',
                        谋典韦: '谋典韦',
                        审配改: '审配改',
                        董太后: '董太后',
                        邢夫人: '邢夫人',
                        徐登: '徐登',
                        赵妪: '赵妪',
                        田钏: '田钏',
                        张葳: '张葳',
                        朗伯多: '朗伯多',
                        董白改: '董白改',
                        朵思大王改: '朵思大王改',
                        张琪瑛改: '张琪瑛改',
                        董荼那: '董荼那',
                        金环三结: '金环三结',
                        '彭虎&彭琦': '彭虎&彭琦',
                        许褚改: '许褚改',
                        典满: '典满',
                        曹金瓠: '曹金瓠',
                        王异改: '王异改',
                        甘夫人2改: '甘夫人2改',
                        谋袁绍: '谋袁绍',
                        任氏: '任氏',
                        阴贵人: '阴贵人',
                        大懿皇后: '大懿皇后',
                        玛纽: '玛纽',
                        孙尚香改: '孙尚香改',
                        孟优: '孟优',
                        司马懿改: '司马懿改',
                        秘计: '秘计',
                        秘计_info: '准备阶段或结束阶段,若你已受伤,则可以摸X张牌,可以将等量的牌交给一名其他角色(X为你已损失的体力值).',
                        夭逝: '夭逝',
                        夭逝_info: '锁定技,游戏开始时,你依次失去所有体力.',
                        晨露: '晨露',
                        晨露_info: '锁定技,你的体力值发生变化时,你摸X张牌,X为与你体力值不相同的角色数,若你的手牌大于其他角色手牌数之和的一半(向下取整),你弃置一半的手牌(向下取整)',
                        武魄: '武魄',
                        武魄_info: '锁定技,每当你使用【杀】指定目标时/成为其他角色【杀】的目标时,你与对方角色各失去1点体力.',
                        淚状: '淚状',
                        裸衣: '裸衣',
                        裸衣_info: '摸牌阶段结束后,你可亮出牌堆顶的X张牌,你可以获得其中的基本牌、武器牌和【决斗】.若如此做,直到你的下回合开始,你为伤害来源的【杀】或【决斗】造成伤害时,此伤害+1.(X为你已损失的体力值).',
                        集智: '集智',
                        集智_info: '当你使用非转化的普通锦囊牌时,你可以摸一张牌,若此牌:为基本牌,你可以弃置此牌,本回合手牌上限+1.;为锦囊牌,你可以弃置此牌,令此次使用的锦囊牌(须有合法目标)额外结算一次.',
                        勤持: '勤持',
                        勤持_info: '每回合限一次,当你需要使用【无懈可击】时,你可以进行判定,若为♠️️或♥️️,视为你使用了一张【无懈可击】,你可以将此牌交给一名其他角色.',
                        奇才: '奇才',
                        奇才_info: '锁定技,你使用锦囊牌无距离限制,你装备区内的防具牌和宝物牌不能被其他角色弃置.',
                        羌王: '羌王',
                        羌王_info: '锁定技,一名角其他色的回合结束时,其弃置X张牌(X为其本回合对你造成的伤害值).',
                        迷乱: '迷乱',
                        迷乱_info: '准备阶段,若你的体力值与手牌数相等,你可以令至多X名角色依次摸一张牌并展示,展示黑色牌的角色失去一点体力(X为你当前的体力值).',
                        享乐: '享乐',
                        享乐_info: '锁定技,当其他角色使用【杀】指定你为目标时,其需交给你一张基本牌,否则此【杀】对你无效.',
                        若愚: '若愚',
                        若愚_info: '主公技,觉醒技,准备阶段,若你的体力值为全场最少,则你加1点体力上限,将体力回复至3点,获得技能〖思蜀〗和〖下士〗.',
                        下士: '下士',
                        下士_info: '锁定技,当你的【乐不思蜀】生效后,你须将本回合摸牌阶段获得的牌交给一名其他角色.',
                        拆招: '拆招',
                        拆招_info: '其他角色的准备阶段,你可以将一张装备牌置入其装备区内,令其交给你一张【杀】,若无法如此做,你获得其一张牌.',
                        界袭: '界袭',
                        界袭_info: '每回合限一次,当一张装备牌置入一名角色的装备区时,你可以弃置一张牌,获得之.',
                        换影: '换影',
                        换影_info: '准备阶段,若你的体力值与上回合的准备阶段时不相同,你可以与一名其他角色交换手牌.',
                        巨象: '巨象',
                        巨象_info: '锁定技.①【南蛮入侵】对你无效.②其他角色使用的【南蛮入侵】结算结束后,你获得此牌对应的所有实体牌和此牌结算过程中打出的所有【杀】.',
                        烈刃: '烈刃',
                        烈刃_info: '当你使用【杀】指定目标后,你可以和目标角色进行拼点.若你赢,你令此【杀】不能被相应并获得其一张牌.若你没赢,你获得对方的拼点牌,其获得你的拼点牌.',
                        juxiang3: '',
                        juxiang3_info: '',
                        jux1: '巨象',
                        jux1_info: '',
                        jux2: '巨象',
                        jux2_info: '',
                        八阵: '八阵',
                        八阵_info: '锁定技,若你的防具栏内没有牌且没有被废除,则你视为装备着【八卦阵】,当你装备着【八卦阵】时,跳过弃牌阶段.',
                        看破: '看破',
                        看破_info: '你可以将一张黑色牌当作【无懈可击】使用,你的【无懈可击】不可被响应.',
                        火计: '火计',
                        火计_info: '你可以将一张红色牌当作【火攻】使用,当你使用【火攻】造成伤害后,你摸一张牌.',
                        bazhen_skip: '八阵',
                        bazhen_skip_info: '',
                        huoji_draw: '火计',
                        huoji_draw_info: '',
                        kanpo_no: 'kanpo_no',
                        kanpo_no_info: '',
                        祸首: '祸首',
                        祸首_info: '锁定技,【南蛮入侵】对你无效;你视为所有【南蛮入侵】的伤害来源.当你因【南蛮入侵】造成的伤害大于你的体力上限时,你增加一点体力上限并回复一点体力,清除已记录的伤害值.',
                        huoshou3: '祸首',
                        huoshou3_info: '',
                        龙胆: '龙胆',
                        龙胆_info: '你可以将一张基本牌当做【闪】或【杀】使用或打出.当你使用【杀】造成伤害时,若此牌对应的实体牌为:【闪】,你摸一张牌;【桃】,你回复一点体力;【酒】,此牌伤害改为本回合你使用过的【杀】的数量',
                        涯角: '涯角',
                        涯角_info: '当你于回合外因使用或打出而失去手牌后,你可以展示牌堆顶的一张牌.若这两张牌的类别相同,你可以这些牌交给一名角色;若类别不同,你可弃置攻击范围内包含你的角色区域里的两张牌.',
                        义绝: '义绝',
                        义绝_info: '出牌阶段限一次,你可以弃置一张牌并令一名有手牌的其他角色展示一张手牌.若此牌为黑色,则该角色不能使用或打出牌,非锁定技失效且受到来自你的♥️️【杀】的伤害+X(X为<斩>标记的数量)直到回合结束.若此牌为红色,则你可以获得此牌,并可以令其回复一点体力.',
                        武圣: '武圣',
                        武圣_info: '你可以将一张红色牌当做【杀】使用或打出.你使用的♦️️杀没有距离限制,你使用的♥️️杀不可被响应.当你使用或打出【杀】时,你获得一个<斩>标记,当你击杀一名角色时,你移除所有<斩>标记.',
                        yjeffect: '义绝',
                        yjeffect_info: '',
                        zhan: '武圣',
                        zhan_info: '',
                        青囊: '青囊',
                        青囊_info: '出牌阶段,你可以弃置一张手牌,令一名角色回复一点体力.若你弃置的是黑色牌或该角色本回合内成为过〖青囊〗的目标,则你本回合内不能再发动〖青囊〗.',
                        急救: '急救',
                        急救_info: '你的回合外,你可以将一张红色牌当做【桃】使用,你使用非转化【桃】的回复量+1.',
                        jijiu_add: '急救',
                        jijiu_add_info: '',
                        仁释: '仁释',
                        仁释_info: '锁定技,当你受到【杀】的伤害时,若你已受伤,则你防止此伤害,若此【杀】:为红色,你从牌堆中获得两张【杀】,不为红色,你获得此【杀】对应的所有实体牌.你减1点体力上限.',
                        武缘: '武缘',
                        武缘_info: '出牌阶段限一次,你可将一张【杀】交给一名其他角色,你回复1点体力,其摸一张牌.若此【杀】为:红色【杀】,其回复1点体力;属性【杀】,其改为摸两张牌.',
                        怀子: '怀子',
                        怀子_info: '锁定技,你的手牌上限为你的体力上限;结束阶段,你从牌堆中获得一张【杀】.',
                        命器: '命器',
                        命器_info: '锁定技,准备阶段,你从牌堆或弃牌堆将【丈八蛇矛】置入你的武器区;你发动【丈八蛇矛】使用的【无】无距离限制,当以此法使用的【杀】造成伤害时,你摸两张牌.',
                        抵抗: '抵抗',
                        抵抗_info: '锁定技,当你受到伤害后时,若你有手牌,则防止此伤害,你弃置一张手牌.',
                        血影: '血影',
                        血影_info: '①游戏开始时,你将牌堆顶X张牌置于武将牌上;弃牌阶段结束时,若你此阶段弃置的牌大于3,则你可以将其中一张置于武将牌上.②你因【血影】和【承芳】置于武将牌上的牌称为<影>,你至多拥有X张<影>.③你可以将一张<影>当作【杀】、【闪】、【桃】、【无懈可击】使用.(X为当前场上势力数)',
                        承芳: '承芳',
                        承芳_info: '①当你受到伤害后,你可以将牌堆顶一张牌置于武将牌上,可以移动场上一张牌.②当你造成伤害时,你可以移去一张<影>,令此伤害+1.',
                        影箭: '影箭',
                        影箭_info: '准备阶段开始时,你可以弃一张牌并视为使用一张无距离限制的【杀】.',
                        请戍: '请戍',
                        请戍_info: '蜀势力技,当一名角色成为【杀】的目标后,你可以弃一张牌,视为对此【杀】使用者使用了一张【杀】.',
                        熾魂: '熾魂',
                        熾魂_info: '魏势力技,出牌阶段限一次,你可以弃一张牌,令一名已受伤的角色回复一点体力.若你弃置的牌为【桃】或【酒】,你令一名角色翻面.你对武将牌背面朝上的角色使用牌无次数和距离限制',
                        五岳: '五岳',
                        五岳_info: '当你进入濒死时,你可以亮出牌堆顶5张牌,弃置其中的红色牌并回复等量体力,获得其余牌.',
                        游侠: '游侠',
                        游侠_info: '出牌阶段开始时,你可以用一张牌依次与所有体力值与你相同的其他角色拼点,赢的角色摸一张牌,没赢的角色受到你造成的一点伤害.',
                        残戾: '残戾',
                        残戾_info: '锁定技,结束阶段,你选择一项:1.弃置三张不同类型的手牌,可以视为使用一张基本牌;2.减一点体力上限,摸三张牌.',
                        父魂: '父集智魂',
                        父魂_info: '你可以将两张手牌当做【杀】使用或打出,若这两张牌花色相同,你摸一张牌;出牌阶段,若你以此法使用的【杀】造成了伤害,你获得技能〖武圣〗和〖咆哮〗直到回合结束.',
                        fu222: '父魂',
                        fu222_info: '',
                        射戟: '射戟',
                        射戟_info: '锁定技,当你使用【杀】对目标角色造成伤害时,若你不在其攻击范围内,则此杀伤害+1;当你装备着武器时,你使用红色【杀】无距离限制.',
                        犬计: '犬计',
                        犬计_info: '出牌阶段,你可以选择至多三张手牌,若你选择的牌的数量为:1,你将此牌当作随机一张普通锦囊牌使用,当你为此牌指定目标后,目标改为随机一名角色;2,你将这些牌当作随机一张普通锦囊牌使用;3,你将这些牌当作你指定的一张普通锦囊牌使用.',
                        佢守: '佢守',
                        佢守_info: '锁定技,当你受到伤害时,你进行判定,若为红色,此伤害-1,若为黑色,此伤害+1.',
                        征兆: '征兆',
                        征兆_info: '你距离1以内的角色出牌阶段开始时,你可以预测其此阶段使用的牌数(至少为1,至多为5).此阶段结束时,若你预测成功,你摸等量的牌.',
                        貔魔: '貔魔',
                        貔魔_info: '锁定技,当你摸牌时,若你的体力不为全场最多,你令体力值为全场最多的一名角色摸等量的牌.',
                        暗恋: '暗恋',
                        暗恋_info: '回合结束时,你可以将一张牌置于一名男性角色武将牌上,称为<恋>,其出牌阶段开始时,选择一项:1.将<恋>置入弃牌堆,弃置与<恋>花色相同的牌;2.获得<恋>,你摸X张牌(X为其与<恋>同花色的牌数).',
                        呤作: '呤作',
                        呤作_info: '出牌阶段限一次,你可以展示一名其他角色的所有手牌并选择其中一张基本牌或锦囊牌,直到你下个回合开始,你可以将一张牌当作此牌使用或打出(每回合限一次).',
                        暗恋2: '暗恋2',
                        暗恋2_info: '',
                        问道: '问道',
                        问道_info: '出牌阶段限一次,你可以将至多四张与你武将牌上的牌花色均不相同的牌置于武将牌上,摸等量的牌.当一张判定牌生效前,你可以用武将牌上的一张牌代替判定牌,立即生效.',
                        驱恶: '驱恶',
                        驱恶_info: '准备阶段,你可以选择一项:1.令一名角色回复你上个回合开始时武将牌的状态;2.令一名角色弃置判定区的所有牌.',
                        狩境: '狩境',
                        狩境_info: '回合开始时,你可以展示一张手牌,直到你下个回合开始:当你使用点数小于此牌的牌指定其他角色为目标时,你摸一张牌;当你成为其他角色点数大于此牌的牌的目标时,你弃置其一张牌.',
                        战姬: '战姬',
                        战姬_info: '锁定技,当你使用【杀】指定目标后,其只能用与此【杀】同花色的【闪】响应;当你使用【决斗】指定一个目标或成为一名角色【决斗】的目标后,其只能用与此【决斗】同花色的牌响应.',
                        武勇: '武勇',
                        武勇_info: '准备阶段,你可以视为对一名其他角色使用一张无距离限制的【杀】,若此【杀】造成了伤害,你本回合出牌阶段使用【杀】的次数改为你当前体力值.',
                        止戈: '止戈',
                        止戈_info: '出牌阶段限一次,你可以令一名攻击范围内含有你的其他角色交给你一张【杀】或武器牌,否则其视为对你指定的另一名其攻击范围内的角色使用了一张由你指定属性的【杀】.',
                        df_宗祚: '宗祚',
                        df_宗祚_info: '锁定技,游戏的第一个回合开始前,你加X点体力上限并回复X点体力并摸X张牌(X为全场势力数),立即进入你的回合;当一名角色死亡后,若没有与其势力相同的角色,你减1点体力上限并摸两张牌.',
                        忠勇: '忠勇',
                        忠勇_info: '当一名角色使用【杀】指定目标后,你可以弃一张牌令此【杀】伤害+1,若如此做,此【杀】结算完毕后,你与使用者各摸一张牌,若此【杀】为红色,使用者回收此牌.',
                        护彝: '护彝',
                        护彝_info: '锁定技,当一名角色成为群体锦囊的目标后,你代替该角色成为此牌的目标,当你因此牌受到伤害后,你获得此牌对应的所有实体牌.',
                        血激: '血激',
                        血激_info: '锁定技,准备阶段,你减一点体力上限,视为对一名体力上限不大于你的其他角色使用一张【杀】,若此【杀】造成了伤害:你摸两张牌,若其体力不小于你,你回复一点体力,若其体力上限等于你,你增加一点体力上限.',
                        奔营: '奔营',
                        奔营_info: '回合结束时,若你于本回合完成了以下选项中的至少两项,你可以进行一个额外的回合:1.本回合造成的伤害数大于3;2.本回合击杀过角色;3.本回合使用过四种花色的牌.',
                        暴乱: '暴乱',
                        暴乱_info: '锁定技,出牌阶段开始时,若你的手牌数大于5,你将手牌弃至5张,若你弃置的牌数大于你当前体力值,你失去一点体力.',
                        魔贱: '魔贱',
                        魔贱_info: '当你于回合内造成伤害时,你可以将伤害值改为X,若受伤角色未死亡,你弃置X张牌,否则你摸X张牌(X为你本回合因【暴乱】弃置的牌的数量).',
                        国色: '国色',
                        国色_info: '出牌阶段开始时,你可以选择一项:将一张♦️️牌当做【乐不思蜀】使用;或弃置一张♦️️牌并弃置场上的一张【乐不思蜀】.选择完成后,你摸一张牌,你可以展示所有手牌,若其中没有♦️️牌,你摸一张牌.',
                        离间: '离间',
                        离间_info: '出牌阶段限一次,你可以弃置一张牌,视为一名男性角色对另一名男性角色使用一张【决斗】(不可被【无懈可击】响应),你可以令获胜的角色摸一张牌,弃置失败的角色一张牌.',
                        闭月: '闭月',
                        闭月_info: '结束阶段,你每有一个区域内的牌为全场最少,你摸一张牌.',
                        燃伤: '燃伤',
                        燃伤_info: '锁定技,当你受到1点火焰伤害后,你获得1枚<燃>标记;结束阶段开始时,你失去X点体力,摸X张牌.若X大于2,则你减2点体力上限并摸两张牌.(X为<燃>标记的数量)',
                        神智: '神智',
                        神智_info: '使命技,锁定技,准备阶段,若你已受伤,你须弃置所有手牌(至少一张).成功:若你弃置的牌数不小于你的体力值,你升级【淑慎】,增加1点体力上限回复1点体力;失败:若你弃置的牌数小于你的体力值,你本回合手牌上限-1.',
                        淑慎改: '淑慎改',
                        淑慎改_info: '当你回复1点体力时,你可以令一名其他角色选择回复1点体力和摸四张牌.',
                        踏虏: '踏虏',
                        踏虏_info: '当你使用【杀】或黑色普通锦囊牌指定唯一目标时,若你不在其攻击范围内,你可以获得其一张手牌.',
                        囿驹: '囿驹',
                        囿驹_info: '锁定技,其他角色计算与你的距离+4;其他角色不能对你使用【桃】;准备阶段和结束阶段,你摸四张牌并选择一项:1.失去2点体力;2.弃置两张装备牌.',
                        溃京: '溃京',
                        溃京_info: '限定技,当你进入濒死时,你可以弃置区域内的所有牌,重置武将牌,将手牌摸至体力上限,将体力回复至体力上限,从牌堆中使用四张不同副类别的装备,失去所有技能并获得【囿驹】.',
                        双雄: '双雄',
                        双雄_info: '出牌阶段开始时,你可以进行一次判定:你获得此判定牌,且你可以于此回合内将任意一张与此判定牌不同颜色的手牌当做【决斗】使用,将任意一张与此判定牌相同颜色的手牌当做【杀】使用或打出.',
                        sx2: '双雄',
                        sx2_info: '出牌阶段开始时,你可以进行一次判定:你获得此判定牌,且你可以于此回合内将任意一张与此判定牌不同颜色的手牌当做【决斗】使用,将任意一张与此判定牌相同颜色的手牌当做【杀】使用或打出.',
                        义从: '义从',
                        义从_info: '锁定技,你计算与其他角色的距离时-1;其他角色计算与你的距离时+1.',
                        咆哮: '咆哮',
                        咆哮_info: '出牌阶段开始时,你可以弃置所有非基本牌,本回合使用【杀】无次数和距离限制,使用【杀】造成伤害时摸一张牌.',
                        观星: '观星',
                        观星_info: '准备阶段和结束阶段,你可以观看牌堆顶的3张牌,并将其以任意顺序置于牌堆项或牌堆底.',
                        空城: '空城',
                        空城_info: '锁定技,当你没有手牌时,你不能成为【杀】、【决斗】和【南蛮入侵】的目标.',
                        承龙: '承龙',
                        承龙_info: '限定技,当你进入濒死时,你可以重铸所有手牌,将体力回复至一点,将武将牌替换为<界姜维>.七个会合后,你死亡.',
                        djs: '承龙',
                        djs_info: '',
                        克己: '克己',
                        克己_info: '弃牌阶段结束时,你可以摸X张牌(X为你此阶段弃置的【杀】的数量).',
                        奠基: '奠基',
                        奠基_info: '其他角色进入濒死时,你可以失去一点体力,令其回复一点体力.',
                        涅槃: '涅槃',
                        涅槃_info: '限定技,当你处于濒死状态时,你可以弃置你区域内的所有牌并复原你的武将牌,摸三张牌并将体力回复至3点.你可以选择至多X名角色,对这些角色各造成一点火焰伤害(X为你因【涅槃】弃置的♥️️牌的数量).',
                        摧锋: '摧锋',
                        摧锋_info: '当你的一个阶段被跳过后,你可以判定,若为黑,你视为使用一张无距离和次数限制的【杀】',
                        当先: '当先',
                        当先_info: '你可以令本回合摸牌阶段和出牌阶段交换顺序,若如此做,本回合摸牌阶段的摸牌数改为X(X为你本回合出牌阶段使用的牌数).',
                        伏枥: '伏枥',
                        伏枥_info: '限定技,当你处于濒死状态时,可以将体力回复至X点并将手牌摸至X张(X为场上势力数),你立即进行一个额外的回合,此回合结束后,你翻面.',
                        tuOr: '伏枥',
                        tuOr_info: '',
                        合身: '合身',
                        合身_info: '锁定技,你的手牌上限无限.',
                        离头: '离头',
                        离头_info: '锁定技,当你濒死时,你弃一张牌,将体力回复至体力上限.',
                        从一: '从一',
                        从一_info: '锁定技,你摸牌时,受到伤害时,造成伤害时,回复体力时的数值改为1;当你的牌因弃置进入弃牌堆前,你改为弃置一张牌.',
                        纵兽: '纵兽',
                        纵兽_info: '锁定技,游戏开始时,你获得<蛇>、<鹰>、<虎>、<象>四种<兽>标记各一张.根据你拥有的标记,你获得以下效果:<蛇>,当你造成伤害后,获得受伤角色一张牌;<鹰>,你使用红色牌无距离限制;<虎>,你使用黑色牌造成的伤害+1;<象>,当你受到伤害时,令伤害值改为1.',
                        兽踏: '兽踏',
                        兽踏_info: '锁定技,当你受到火焰伤害后,随机失去一个<兽>标记,当你令一名其他角色进入濒死时,你获得一点护甲,随机获得你没有的一个<兽>标记;回合开始时,若你有<兽>标记,你失去X点体力(X为4-<兽>标记的数量),若你没有<兽>标记,你死亡.',
                        无双: '无双',
                        无双_info: '锁定技,当你使用【杀】或【决斗】指定目标后,你令此牌需要依次使用或打出两张【闪】或【杀】响应;你的【杀】伤害基数+1.',
                        rewushuang1: '无双',
                        rewushuang1_info: '2233',
                        天音: '天音',
                        天音_info: '牌堆顶的一张牌对你始终可见,你可以打出或使用牌堆顶的一张牌,你以此法使用的牌无距离限制,若此牌为【杀】,你可以为此牌额外指定任意名目标.',
                        轻盈: '轻盈',
                        轻盈_info: '每回合限一次,当一名角色令你获得牌时,你可以令当前回合角色摸一张牌.',
                        仇涤: '仇涤',
                        仇涤_info: '锁定技,你回合内的使用【杀】的次数上限等于你本回合发动<砺刃>的次数,当你于回合内使用的【杀】的次数达到上限后,将手牌摸至体力上限.',
                        砺刃: '砺刃',
                        砺刃_info: '出牌阶段,你可以重铸一张牌,若你以此法摸的牌为【杀】或武器牌,<砺刃>失效直至回合结束.',
                        狼威: '狼威',
                        狼威_info: '当你的牌被抵消时,你可以失去一点体力上限,对目标再次使用此牌,若仍被抵消,你摸两张牌并获得一点护甲.',
                        神子: '神子',
                        神子_info: '锁定技,当你脱离濒死后,你加一点体力上限并回复一点体力.',
                        强袭: '强袭',
                        强袭_info: '出牌阶段对每名其他角色限一次,你可以选择一项:1. 失去一点体力并对你攻击范围内的一名其他角色造成一点伤害,若你的体力因此变为1,你对其攻击范围的一名角色再造成一点伤害,若该角色为你,改为你获得一点护甲;2. 弃置一张武器牌并对你攻击范围内的一名其他角色造成一点伤害.',
                        守邺: '守邺',
                        守邺_info: '每回合限一次.当其他角色使用牌指定你为唯一目标时,你可以与其进行【对策】.若你赢,则你取消此牌的目标, 增加一点护甲,且你于此牌结算完成后获得其对应的所有实体牌.',
                        照月: '照月',
                        照月_info: '锁定技,若你的体力:不大于2,其他角色的黑色牌对你无效;不大于1,你使用红色牌无距离限制,你使用的♥️️牌可以额外结算一次.',
                        预政: '预政',
                        预政_info: '每轮限一次,当一张牌指定唯一目标后,若你既不是此牌的使用者,也不是此牌的目标,你可以成为此牌的唯一目标或使用者.',
                        托绶: '托绶',
                        托绶_info: '摸牌阶段,你可以改为摸至全场最多,若如此做,弃牌阶段,你改为弃牌至全场最少.',
                        娇颜: '娇颜',
                        娇颜_info: '当你拼点时,你可以摸两张牌,须选择其中一张作为拼点牌.',
                        明忌: '明忌',
                        明忌_info: '锁定技,当你使用牌指定其他角色为目标或成为其他角色使用牌的目标时,使用者须与目标进行拼点,若使用者没赢,此牌对目标无效.',
                        断流: '断流',
                        断流_info: '当你造成/受到伤害后,你可以弃置一半数量的手牌(向下取整),令此伤害+1/-1.',
                        藏阴: '藏阴',
                        藏阴_info: '当你于弃牌阶段外弃牌时,你可以将弃置的牌置于武将牌上,变换性别.',
                        斩龙: '斩龙',
                        斩龙_info: '锁定技,当你发动<藏阴>后,若你武将牌上的牌多于你的手牌,须与手牌交换之,若你的体力上限:不为1,你减少一点体力上限并获得一点护甲;为1且有护甲,你失去一点护甲并对一名其他角色造成一点伤害.',
                        垂乳: '垂乳',
                        垂乳_info: '锁定技,当你对男性角色造成一点伤害时,你回复一点体力;当男性角色对你造成伤害时,其回复一点体力.',
                        斩鲸: '斩鲸',
                        斩鲸_info: '锁定技,当你没有装备武器牌时,你的攻击范围无限.',
                        奔踏: '奔踏',
                        奔踏_info: '当你使用【杀】指定目标时,你可以弃置场上一张牌,若此牌点数:为X(X为你发动此技能的次数),此【杀】不可闪避;为K,你令目标直接死亡,失去<斩鲸>和<奔踏>.',
                        授道: '授道',
                        授道_info: '其他角色回合结束时,若其手牌数小于体力上限,你可以摸一张牌并交给其一张牌,若为装备牌,其可以使用之.',
                        神影: '神影',
                        神影_info: '限定技,出牌阶段,你可以弃置四张不同花色的手牌(若牌堆洗过牌则无需此操作),增加两点护甲,回复体力至体力上限,失去<授道>,并获得<天音>和<残梦>',
                        残梦: '残梦',
                        残梦_info: '限定技,当牌堆洗牌时,你可令一名角色增加一点体力上限直到牌堆再次洗牌,若该角色不为你,其于出牌阶段视为拥有<天音>直到牌堆再次洗牌.',
                        离逝: '离逝',
                        离逝_info: '每轮限一次,其他角色的摸牌阶段开始时,你可以令其获得你一张牌并跳过此阶段,你对其造成一点伤害,若其因此死亡,你重置此技能.',
                        突骑: '突骑',
                        突骑_info: '当你使用【杀】指定目标后,若其不在你的攻击范围内,你可以令此杀不可被闪避.',
                        领威: '领威',
                        领威_info: '限定技,出牌阶段,你可以令任意名角色摸一张牌,以此法摸牌的女性角色获得<义从>.',
                        血佑: '血佑',
                        血佑_info: '一名角色的出牌阶段开始时,你可以减一点体力上限,令攻击范围内的一名体力值大于其的其他角色选择一项:令当前回合角色获得<无双>;弃置两张手牌.此阶段结束时,若此阶段进入弃牌堆的牌数大于进行选择的体力值,你增加一点体力上限并回复一点体力.',
                        孤煞: '孤煞',
                        孤煞_info: '觉醒技,准备阶段,若你的体力值为全场最小,你增加一点体力上限,获得<崩坏>,将描述中的<最小>、<失去>、<减>改为<最大><回复><加>.',
                        崩坏: '崩坏',
                        崩坏_info: '结束阶段,若你的体力不是全场最大的(或之一),你须回复1点体力或加1点体力上限.',
                        连珠: '连珠',
                        连珠_info: '出牌阶段限一次,你可以展示并交给一名其他角色一张牌,若此牌不为黑色,你摸一张牌,若此牌为黑色,其选择一项:1.你摸两张牌;2.弃置两张牌',
                        黠慧: '黠慧',
                        黠慧_info: '锁定技,你的黑色牌不计入手牌上限;其他角色获得你的黑色牌时,其不能使用、打出、弃置这些牌直到其体力值减少为止;其他角色回合结束时,若其本回合失去过<黠慧>牌且手牌中没有<黠慧>牌,其失去一点体力.',
                        xiehuig: '黠慧',
                        xiehuig_info: '',
                        恶泉: '恶泉',
                        恶泉_info: '锁定技.①当有角色于你的回合内受到伤害后,其获得X枚<毒>(X为伤害值).②准备阶段,你令所有拥有<毒>标记的角色移去所有<毒>标记,弃一张牌并失去等量的体力.③当有角色因〖恶泉②〗进入濒死状态时,你令其所有技能失效直到回合结束.',
                        蛮汲: '蛮汲',
                        蛮汲_info: '锁定技.其他角色失去体力后,若你的体力值:不大于该角色,你回复1点体力;不小于该角色,你摸一张牌.',
                        真仪: '真仪',
                        真仪_info: '你可以在以下时机弃置相应的标记来发动以下效果:一名角色的判定牌生效前,你可以弃置一枚「紫薇」,将判定结果改为任意结果;你的回合外,你可以弃置一枚「后土」,将你的一张手牌当【桃】使用;当你造成伤害时,你可以弃置一枚「玉清」,令此伤害+1;当你受到伤害后,你可以弃置一张「勾陈」,你从牌堆中随机获得三种类型的牌各一张.',
                        zheyisp: '真仪',
                        zheyisp_info: '',
                        洗牌: '洗牌',
                        洗牌_info: '若弃牌堆有牌,你可以洗一次牌',
                        qiangman: '镪蛮',
                        qiangman_info: '当你于其他角色的回合内第一次使用或打出牌时,你可以视为使用一张【杀】并摸一张牌,失去一点体力.',
                        juman: '厥蛮',
                        juman_info: '锁定技,当你于一回合内使用或打出第二张牌时,若此牌为基本牌,你摸一张牌.',
                        山影: '山影',
                        山影_info: '每名角色回合限一次,当与你距离大于1的角色需要打出【闪】时,你可以废除一个装备栏,视为其使用或打出了一张【闪】,若你选择的装备栏不为空,你摸两张牌.',
                        缭影: '缭影',
                        缭影_info: '出牌阶段开始时,你可以视为使用一张无距离和目标数限制的【杀】,当此【杀】造成伤害时,你须弃置一张此次技能结算中未弃置过的花色的牌,否则防止此伤害.',
                        千激: '千激',
                        千激_info: '限定技,出牌阶段,你可以回复所有装备栏并摸等同于已废除装备栏数的牌,将【山影】中的【闪】改为【杀】.',
                        shanying: '山影',
                        shanying_info: '',
                        shanying2: '山影',
                        shanying2_info: '',
                        dfqx_shenzhi: '神智',
                        dfqx_shenzhi_info: '使命技,锁定技,准备阶段,若你已受伤,你弃置所有手牌(至少一张).成功:若你弃置的牌数不小于你的体力值,你升级【淑慎】回复1点体力,手牌上限+1,失败:若你弃置的牌数小于你的体力值,你失去<淑慎>获得<玉身>.',
                        dfqx_shushen: '淑慎',
                        dfqx_shushen_info: '当你回复1点体力时, 你可以令一名其他角色选择回复1点体力并获得1点护甲或摸3张牌',
                        dfqx_yushen: '玉身',
                        dfqx_yushen_info: '锁定技,其他角色使用【杀】或【决斗】指定你为目标时,其须交给你一张相同颜色的牌,否则此[杀]或[决斗]对你无效.',
                        dfqx_qiji: '齐击',
                        dfqx_qiji_info: '出牌阶段限一次,你可以将所有手牌(不得少于当前体力值)当一张【万箭齐发】使用,你令此【万箭齐发】结算改为X次( X为你已此法使用的花色数),结算过程中,其他可以交给你一张牌视为打出一张【闪】',
                        dfqx_qiji_respond: '齐击',
                        dfqx_qiji_respond_info: '交给袁绍一张牌,视为打出一张【闪】.',
                        dfqx_jiechi: '戒饬',
                        dfqx_jiechi_info: '锁定技,结束阶段,若你此回合有未使用过的花色的牌,你选择下列至多等量的选择: 1. 下回合摸牌阶段额外摸X张牌,2.下回合出牌阶段额外使用X张[杀],3.本轮其他角色计算与你的距离+X, 4.防止你本轮受到的X次伤害. (X为你选择的选项数),若选择了所有选择,你永久删除一个选项,增加1点体力上限回复1点体力.',
                        dfqx_chongxing: '宠幸',
                        dfqx_chongxing_info: '每当你翻面后,你可以获得一名男性角色的至多两张牌.',
                        dfqx_boming: '薄命',
                        dfqx_boming_info: '锁定技,结束阶段,若你未受伤,你失去1点体力摸两张牌,若你已受伤,你回复1点体力并将武将牌翻面.',
                        dfqx_rugong: '入宫',
                        dfqx_rugong_info: '男性角色的出牌阶段限一次,其可以交给你至少一张牌;以此法交给你牌数唯一最多角色于此轮视为拥有<制衡> .',
                        rugong2: '入宫',
                        rugong2_info: '你可以交给大懿皇后至少一张牌,若你本轮以此法交给其的牌数唯一最多,你本轮视为拥有<制衡>.',
                        dfqx_youshang: '忧殇',
                        dfqx_youshang_info: '锁定技,准备阶段,你令一名手牌数少于你的角色失去1点体力,你将手牌其至等于其的手牌数.',
                        dfqx_tianhu: '天葫',
                        dfqx_tianhu_info: '摸牌阶段结束后,你可以展示手牌,若花色均不相同,你摸等量的牌,若点数均不相同,你于此回合内使用的牌无次数与距离限制.',
                        dfqx_jiangzi: '降籽',
                        dfqx_jiangzi_info: '其他角色的出牌阶段开始时,你可以弃置一张牌,其此阶段使用此花色的牌时,你可以令此牌无效或连续结算两次.',
                        dfqx_jieyin: '结姻',
                        dfqx_jieyin_info: '出牌阶段限一次,你可以选择一 名男性角色,弃置一张手牌或将一张装备牌置入其装备区.若如此做,你与其之中体力值较大的角色摸两张牌,体力值较小的角色回复1点体力;体力值相等则各摸一张牌.',
                        dfqx_yuyong: '愚勇',
                        dfqx_yuyong_info: '出牌阶段限一次,你可以将至少X张锦囊牌当一张[杀]使用,若此[杀]对其造成伤害,你可以执行你所弃置的其中一种锦囊效果(不可被[无懈可击]抵消),未造成伤害,你将武将牌翻面.( X为你当前体力值).',
                        dfqx_linwei: '临危',
                        dfqx_linwei_info: '出牌阶段限两次,你可以与一名其他角色拼点,若你赢,其可视为对你使用一-张指定你为目标的单一锦囊牌;若你没赢,你令其摸两张牌.',
                        dfqx_fankui: '反馈',
                        dfqx_fankui_info: '当你受到1点伤害后,你可以获得或弃置伤害来源的一张牌.若为弃置,你摸一张牌.若你获得或弃置的牌与对你造成伤害的牌颜色相同,你摸一张牌.',
                        dfqx_guicai: '鬼才',
                        dfqx_guicai_info: '一名角色的判定牌生效前,你可以打出一-张牌代替或替换之.结算后,若为替换,你受到由你指定来源的1点伤害,若你打出的牌与原判定牌花色相同,你回复1点体力.',
                    },
                    skill: {
                        集智: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                player: 'useCard',
                            },
                            preHidden: true,
                            filter(event, player) {
                                return get.type(event.card, 'trick') == 'trick';
                            },
                            content() {
                                'step 0';
                                player.draw();
                                ('step 1');
                                event.card = result[0];
                                if (get.type(event.card) != 'equip') {
                                    player
                                        .chooseBool('是否弃置' + get.translation(event.card) + '？')
                                        .set('ai', function (evt, player) {
                                            return _status.currentPhase == player && player.needsToDiscard(-3) && _status.event.value < 6;
                                        })
                                        .set('value', get.value(event.card, player));
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.discard(event.card);
                                    if (get.type(event.card) == 'basic') {
                                        if (!player.storage.集智) player.storage.集智 = 0;
                                        player.storage.集智++;
                                        if (_status.currentPhase == player) {
                                            player.markSkill('集智');
                                        }
                                    } else {
                                        player.addTempSkill('集智_effect', 'useCardAfter');
                                        trigger.集智_effect = player;
                                    }
                                } else event.finish();
                            },
                            ai: {
                                threaten: 1.4,
                                noautowuxie: true,
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.storage.集智;
                                },
                            },
                            intro: {
                                content: '本回合手牌上限+#',
                            },
                            group: '集智_clear',
                            subSkill: {
                                clear: {
                                    trigger: {
                                        global: 'phaseAfter',
                                    },
                                    silent: true,
                                    content() {
                                        player.storage.集智 = 0;
                                        player.unmarkSkill('集智');
                                    },
                                    forced: true,
                                    popup: false,
                                },
                                effect: {
                                    trigger: {
                                        global: 'useCardToTargeted',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    popup: false,
                                    lastDo: true,
                                    filter(event, player) {
                                        return event.parent.集智_effect == player && event.targets.length == event.parent.triggeredTargets4.length;
                                    },
                                    content() {
                                        trigger.parent.targets = trigger.parent.targets.concat(trigger.targets);
                                        trigger.parent.triggeredTargets4 = trigger.parent.triggeredTargets4.concat(trigger.targets);
                                    },
                                },
                            },
                        },
                        勤持: {
                            trigger: {
                                player: ['chooseToUseBegin'],
                            },
                            hiddenCard(player, name) {
                                if (lib.inpile.includes(name)) return true;
                            },
                            filter(event, player) {
                                if (!event.filterCard || !event.filterCard({ name: 'wuxie' }, player, event)) return false;
                                return true;
                            },
                            usable: 1,
                            content() {
                                'step 0';
                                player.judge('勤持', function (card) {
                                    return card.suit == 'heart' || card.suit == 'spade' ? 1.5 : -0.5;
                                }).judge2 = function (result) {
                                    return result.bool;
                                };
                                ('step 1');
                                if (result.judge > 0) {
                                    trigger.untrigger();
                                    trigger.set('responded', true);
                                    trigger.result = { bool: true, card: { name: 'wuxie' } };
                                    event.card = result.card;
                                    if (get.position(event.card, true) == 'd') {
                                        player
                                            .chooseTarget('令一名角色获得' + get.translation(event.card), function (card, player, target) {
                                                return player != target;
                                            })
                                            .set('ai', function (target) {
                                                var player = _status.event.player;
                                                var att = get.attitude(player, target);
                                                if (player == target) att /= 2;
                                                return att;
                                            });
                                    } else event.finish();
                                } else event.finish();
                                ('step 2');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    target.gain(card, 'gain2', 'log');
                                } else event.finish();
                            },
                        },
                        奇才: {
                            mod: {
                                targetInRange(card, player, target, now) {
                                    var type = get.type(card);
                                    if (type == 'trick' || type == 'delay') return true;
                                },
                                canBeDiscarded(card) {
                                    if (get.position(card) == 'e' && ['equip2', 'equip5'].includes(get.subtype(card))) return false;
                                },
                            },
                        },
                        秘计: {
                            audio: 2,
                            trigger: { player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'] },
                            filter(event, player) {
                                return player.hp < player.maxHp;
                            },
                            content() {
                                'step 0';
                                event.num = player.getDamagedHp();
                                player.draw(event.num);
                                ('step 1');
                                var check = player.countCards('h') - event.num;
                                player
                                    .chooseCardTarget({
                                        selectCard: event.num,
                                        filterTarget(card, player, target) {
                                            return player != target;
                                        },
                                        ai1(card) {
                                            var player = _status.event.player;
                                            if (player.maxHp - player.hp == 1 && card.name == 'du') return 30;
                                            var check = _status.event.check;
                                            if (check < 1) return 0;
                                            if (player.hp > 1 && check < 2) return 0;
                                            return get.unuseful(card) + 9;
                                        },
                                        ai2(target) {
                                            var att = get.attitude(_status.event.player, target);
                                            if (ui.selected.cards.length == 1 && ui.selected.cards[0].name == 'du') return 1 - att;
                                            return att - 2;
                                        },
                                        prompt: '将' + get.cnNumber(event.num) + '张手牌交给一名其他角色',
                                    })
                                    .set('check', check);
                                ('step 2');
                                if (result.bool) {
                                    player.give(result.cards, result.targets[0]);
                                    player.line(result.targets, 'green');
                                }
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == 1) return 3;
                                    if (target.hp == 2) return 1.5;
                                    return 0.5;
                                },
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'recover') && player.hp >= player.maxHp - 1) return [0, 0];
                                    },
                                },
                            },
                        },
                        晨露: {
                            trigger: {
                                player: 'changeHp',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.num = 0;
                                for (var i of game.players) {
                                    if (i.hp != player.hp) {
                                        event.num++;
                                    }
                                }
                                player.draw(event.num);
                                ('step 1');
                                var num1 = 0;
                                var num2 = player.countCards('h');
                                game.countPlayer(function (current) {
                                    if (current != player) num1 += current.countCards('h');
                                });
                                if (num2 > Math.floor(num1 / 2)) player.chooseToDiscard('h', Math.floor(num2 / 2));
                            },
                        },
                        夭逝: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.num = player.hp;
                                ('step 1');
                                if (event.num > 0) {
                                    player.loseHp();
                                    event.num--;
                                    event.redo();
                                } else {
                                    event.finish();
                                }
                            },
                        },
                        武魄: {
                            trigger: {
                                player: 'shaBegin',
                                target: 'shaBegin',
                            },
                            forced: true,
                            content() {
                                trigger.player.loseHp();
                                trigger.target.loseHp();
                            },
                        },
                        羌王: {
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player.countMark('羌王_dam') > 0;
                            },
                            content() {
                                var num = trigger.player.countMark('羌王_dam');
                                trigger.player.chooseToDiscard('he', true, num);
                                trigger.player.removeMark('羌王_dam', trigger.player.countMark('羌王_dam'));
                            },
                            group: '羌王_dam',
                            subSkill: {
                                dam: {
                                    marktext: '羌',
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return event.source == _status.currentPhase && event.source != player;
                                    },
                                    content() {
                                        trigger.source.addMark('羌王_dam', trigger.num);
                                        trigger.source.markSkill('羌王_dam');
                                    },
                                    intro: {
                                        content: '对迷当大王造成了#点伤害',
                                    },
                                },
                            },
                        },
                        迷乱: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.hp == player.countCards('h');
                            },
                            content() {
                                'step 0';
                                var num = player.hp;
                                player.chooseTarget(get.prompt2('请选择目标'), [1, num]);
                                ('step 1');
                                if (result.bool) {
                                    result.targets.sortBySeat();
                                    event.targets = result.targets;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    target.draw();
                                    event.current = target;
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                event.card = result[0];
                                event.current.showCards(event.card);
                                if (get.color(event.card) == 'black') event.current.loseHp();
                                event.goto(2);
                            },
                        },
                        享乐: {
                            audio: 'ext:东方七宿/audio:2',
                            audioname: ['re_liushan', 'ol_liushan'],
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            forced: true,
                            preHidden: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                var eff = get.effect(player, trigger.card, trigger.player, trigger.player);
                                trigger.player
                                    .chooseCard('享乐:交给' + get.translation(player) + '一张基本牌,否则杀对' + get.translation(player) + '无效', function (card) {
                                        return get.type(card) == 'basic';
                                    })
                                    .set('ai', function (card) {
                                        if (_status.event.eff > 0) {
                                            return 10 - get.value(card);
                                        }
                                        return 0;
                                    })
                                    .set('eff', eff);
                                ('step 1');
                                if (result.bool == false) {
                                    trigger.parent.excluded.add(player);
                                } else {
                                    var cards = result.cards;
                                    player.gain(cards, trigger.player, 'give');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (card.name == 'sha' && get.attitude(player, target) < 0) {
                                            if (_status.event.name == 'xiangle') return;
                                            var bs = player.getCards('h', { type: 'basic' });
                                            if (bs.length < 2) return 0;
                                            if (player.hasSkill('jiu') || player.hasSkill('tianxianjiu')) return;
                                            if (bs.length <= 3 && player.countCards('h', 'sha') <= 1) {
                                                for (var i = 0; i < bs.length; i++) {
                                                    if (bs[i].name != 'sha' && get.value(bs[i]) < 7) {
                                                        return [1, 0, 1, -0.5];
                                                    }
                                                }
                                                return 0;
                                            }
                                            return [1, 0, 1, -0.5];
                                        }
                                    },
                                },
                            },
                        },
                        若愚: {
                            audio: 'ext:东方七宿/audio:2',
                            juexingji: true,
                            zhuSkill: true,
                            keepSkill: true,
                            derivation: ['rejijiang', 'sishu'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (!player.hasZhuSkill('若愚')) return false;
                                return player.isMinHp();
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('若愚');
                                player.gainMaxHp();
                                ('step 1');
                                if (player.hp < 3) player.recover(3 - player.hp);
                                game.log(player, '获得了技能', '#g【下士】', '和', '#g【激将】');
                                player.addSkill('下士');
                                if (player.hasSkill('若愚')) {
                                    player.addSkill('rejijiang');
                                } else {
                                    player.addAdditionalSkill('若愚', 'rejijiang');
                                }
                                if (!player.isZhu) {
                                    player.storage.zhuSkill_若愚 = ['rejijiang'];
                                } else {
                                    event.trigger('zhuUpdate');
                                }
                            },
                        },
                        下士: {
                            trigger: {
                                player: 'judgeAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.cardname == 'lebu';
                            },
                            content() {
                                if (trigger.result.bool == false) player.addTempSkill('下士_effect');
                            },
                            subSkill: {
                                effect: {
                                    trigger: {
                                        player: 'phaseDrawEnd',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        var cards = [];
                                        event.player.getHistory('gain', function (evt) {
                                            if (evt.parent.name == 'draw' && evt.getParent('phaseDraw') == event) cards.addArray(evt.cards);
                                        });
                                        player.storage.xiashi = cards;
                                        return cards.length;
                                    },
                                    content() {
                                        'step 0';
                                        player
                                            .chooseTarget('令一名角色获得摸牌阶段获得的牌', true, function (card, player, target) {
                                                return player != target;
                                            })
                                            .set('ai', function (target) {
                                                var player = _status.event.player;
                                                var att = get.attitude(player, target);
                                                if (player == target) att /= 2;
                                                return att;
                                            });
                                        ('step 1');
                                        var cards = player.storage.xiashi;
                                        if (result.targets?.length) {
                                            var target = result.targets[0];
                                            player.line(target, 'green');
                                            target.gain(cards, player, 'give');
                                        }
                                    },
                                },
                            },
                        },
                        拆招: {
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return event.player != player && player.countCards('he', { type: 'equip' }) > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseCard({
                                    filterCard(card, player) {
                                        return get.type(card) == 'equip';
                                    },
                                    position: 'he',
                                    ai1(card) {
                                        return 6 - get.value(card);
                                    },
                                    ai2(target) {
                                        return get.attitude(_status.event.player, target) - 3;
                                    },
                                    prompt: get.prompt2('拆招'),
                                });
                                ('step 1');
                                if (result.bool) {
                                    var thisTarget = trigger.player;
                                    var thisCard = result.cards[0];
                                    thisTarget.equip(thisCard);
                                    event.target = thisTarget;
                                    if (thisTarget != player) {
                                        player.$give(thisCard, thisTarget, false);
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var target = event.target;
                                if (
                                    target.hasCard(function (card) {
                                        return card.name == 'sha';
                                    })
                                ) {
                                    target
                                        .chooseCard('拆招:交给' + get.translation(player) + '一张[杀]', true, function (card) {
                                            return card.name == 'sha';
                                        })
                                        .set('ai', get.unuseful);
                                } else {
                                    player.gainPlayerCard(target, true);
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool) {
                                    var cards = result.cards;
                                    player.gain(cards, event.target, 'give');
                                }
                                event.finish();
                            },
                        },
                        界袭: {
                            trigger: {
                                global: 'equipEnd',
                            },
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                player.chooseToDiscard('he', true);
                                player.gain(trigger.card, 'gain2');
                            },
                        },
                        换影: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                if (player.storage.hy) {
                                    return player.hp != player.storage.hy;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget('选择一名其他角色', true, function (card, player, target) {
                                    return player != target;
                                });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    player.swapHandcards(target);
                                }
                            },
                            group: '换影_mem',
                            subSkill: {
                                mem: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    popup: false,
                                    lastDo: true,
                                    filter(event, player) {
                                        return true;
                                    },
                                    content() {
                                        player.storage.hy = player.hp;
                                    },
                                },
                            },
                        },
                        巨象: {
                            audio: 'juxiang1',
                            audioname: ['re_zhurong', 'ol_zhurong'],
                            group: ['jux1', 'jux2'],
                            preHidden: ['jux1', 'jux2'],
                            ai: {
                                effect: {
                                    target(card) {
                                        if (card.name == 'nanman') return [0, 1];
                                    },
                                },
                            },
                        },
                        烈刃: {
                            shaRelated: true,
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && player.canCompare(event.target);
                            },
                            check(event, player) {
                                return get.attitude(player, event.target) < 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(trigger.target).clear = false;
                                ('step 1');
                                if (result.bool) {
                                    trigger.parent.directHit.add(trigger.target);
                                    if (trigger.target.countGainableCards(player, 'he')) player.gainPlayerCard(trigger.target, true, 'he');
                                    ui.clear();
                                } else {
                                    var card1 = result.player;
                                    var card2 = result.target;
                                    if (get.position(card1) == 'd') trigger.target.gain(card1, 'gain2');
                                    if (get.position(card2) == 'd') player.gain(card2, 'gain2');
                                }
                            },
                            ai: {
                                directHit_ai: true,
                            },
                        },
                        juxiang3: {
                            trigger: {
                                global: 'respondEnd',
                            },
                            filter(event, player) {
                                if (event.card.name != 'sha') return false;
                                if (event.player == player) return false;
                                if (event.cards) {
                                    if (Array.isArray(event.cards)) for (var i of event.cards) {
                                        if (get.position(i, true) == 'o') return true;
                                    }
                                }
                                return false;
                            },
                            charlotte: true,
                            forced: true,
                            popup: false,
                            forced: true,
                            content() {
                                var cards = trigger.cards.filter((i) => get.position(i, true) == 'o');
                                if (!player.storage.jux) player.storage.jux = [];
                                if (Array.isArray(cards)) for (var i of cards) {
                                    player.storage.jux.push(i);
                                }
                            },
                        },
                        jux1: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                global: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'nanman' && event.player != player;
                            },
                            content() {
                                player.addSkill('juxiang3');
                            },
                        },
                        jux2: {
                            audio: 'juxiang1',
                            trigger: {
                                global: 'useCardAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'nanman' && event.cards.filterInD().length && event.player != player;
                            },
                            content() {
                                player.storage.ju = trigger.cards.filterInD();
                                player.gain(trigger.cards.filterInD(), 'gain2');
                                if (player.storage.jux) {
                                    var c = player.storage.jux;
                                    player.gain(c, 'gain2');
                                    delete player.storage.jux;
                                }
                                player.removeSkill('juxiang3');
                            },
                        },
                        八阵: {
                            audio: 'ext:东方七宿/audio:2',
                            audioname: ['re_sp_zhugeliang', 'ol_sp_zhugeliang', 'ol_pangtong'],
                            group: ['bazhen_bagua', 'bazhen_skip'],
                        },
                        看破: {
                            mod: {
                                aiValue(player, card, num) {
                                    if (card.name != 'wuxie' && get.color(card) != 'black') return;
                                    var cards = player.getCards('hs', function (card) {
                                        return card.name == 'wuxie' || get.color(card) == 'black';
                                    });
                                    cards.sort(function (a, b) {
                                        return (b.name == 'wuxie' ? 1 : 2) - (a.name == 'wuxie' ? 1 : 2);
                                    });
                                    var geti = function () {
                                        if (cards.includes(card)) {
                                            return cards.indexOf(card);
                                        }
                                        return cards.length;
                                    };
                                    if (card.name == 'wuxie') return Math.min(num, [6, 4, 3][Math.min(geti(), 2)]) * 0.6;
                                    return Math.max(num, [6, 4, 3][Math.min(geti(), 2)]);
                                },
                                aiUseful() {
                                    return lib.skill.rekanpo.mod.aiValue.apply(this, arguments);
                                },
                            },
                            audio: 'ext:东方七宿/audio:2',
                            audioname: ['ol_sp_zhugeliang', 'ol_pangtong'],
                            group: 'kanpo_no',
                            position: 'hes',
                            enable: 'chooseToUse',
                            filterCard(card, player) {
                                return get.color(card) == 'black';
                            },
                            viewAsFilter(player) {
                                return player.countCards('hes', { color: 'black' }) > 0;
                            },
                            viewAs: {
                                name: 'wuxie',
                            },
                            prompt: '将一张黑色牌当无懈可击使用',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4, 3],
                                    value: [6, 4, 3],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        火计: {
                            position: 'hes',
                            audio: 'ext:东方七宿/audio:2',
                            audioname: ['ol_sp_zhugeliang', 'ol_pangtong'],
                            group: ['huoji_draw'],
                            enable: 'chooseToUse',
                            filterCard(card, player) {
                                return get.color(card) == 'red';
                            },
                            viewAs: {
                                name: 'huogong',
                                nature: 'fire',
                            },
                            viewAsFilter(player) {
                                if (!player.countCards('hes', { color: 'red' })) return false;
                            },
                            prompt: '将一张红色牌当火攻使用',
                            check(card) {
                                var player = _status.currentPhase;
                                if (player.countCards('h') > player.hp) {
                                    return 6 - get.value(card);
                                }
                                return 4 - get.value(card);
                            },
                            ai: {
                                fireAttack: true,
                                basic: {
                                    order: 4,
                                    value: [3, 1],
                                    useful: 1,
                                },
                                wuxie(target, card, player, current, state) {
                                    if (get.attitude(current, player) >= 0 && state > 0) return false;
                                },
                                result: {
                                    player(player) {
                                        var nh = player.countCards('h');
                                        if (nh <= player.hp && nh <= 4 && _status.event.name == 'chooseToUse') {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'huogong' }, player, _status.event)) {
                                                return -10;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'huogong') return -10;
                                                if (viewAs && viewAs.name == 'huogong') return -10;
                                            }
                                        }
                                        return 0;
                                    },
                                    target(player, target) {
                                        if (target.hasSkill('huogong2') || target.countCards('h') == 0) return 0;
                                        if (player.countCards('h') <= 1) return 0;
                                        if (target == player) {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'huogong' }, player, _status.event)) {
                                                return -1.15;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'huogong') return -1.15;
                                                if (viewAs && viewAs.name == 'huogong') return -1.15;
                                            }
                                            return 0;
                                        }
                                        return -1.15;
                                    },
                                },
                                tag: {
                                    damage: 1,
                                    fireDamage: 1,
                                    natureDamage: 1,
                                    norepeat: 1,
                                },
                            },
                        },
                        bazhen_skip: {
                            trigger: {
                                player: 'phaseDiscardBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isEmpty(2) || player.countCards('e', { name: 'bagua' }) > 0;
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '跳过了弃牌阶段');
                            },
                        },
                        huoji_draw: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event._notrigger.includes(event.player)) return false;
                                return event.card && event.card.name == 'huogong';
                            },
                            content() {
                                player.draw(1);
                            },
                        },
                        kanpo_no: {
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card.name == 'wuxie';
                            },
                            content() {
                                trigger.nowuxie = true;
                            },
                        },
                        祸首: {
                            audio: 'huoshou1',
                            audioname: ['re_menghuo'],
                            group: ['huoshou1', 'huoshou2', 'huoshou3'],
                            preHidden: ['huoshou1', 'huoshou2', 'huoshou3'],
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (card.name == 'nanman') return 0;
                                    },
                                },
                            },
                        },
                        huoshou3: {
                            marktext: '蛮',
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'nanman';
                            },
                            content() {
                                player.addMark('huoshou3', trigger.num);
                                if (player.countMark('huoshou3') > player.maxHp && player.maxHp < 8) {
                                    player.gainMaxHp();
                                    player.recover();
                                    player.removeMark('huoshou3', player.countMark('huoshou3'));
                                }
                            },
                            intro: {
                                content: '已通过【南蛮入侵】造成#点伤害',
                            },
                        },
                        龙胆: {
                            audio: 'longdan_sha',
                            group: ['龙胆_sha', '龙胆_shan', '龙胆_draw'],
                            subSkill: {
                                draw: {
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && event.cards && event.cards[0] && event.cards[0].name != 'sha';
                                    },//QQQ
                                    content() {
                                        if (trigger.cards[0].name == 'shan') player.draw();
                                        if (trigger.cards[0].name == 'tao') player.recover();
                                        if (trigger.cards[0].name == 'jiu') trigger.num = player.countUsed('sha', true);
                                    },
                                },
                                sha: {
                                    audio: 'longdan_sha',
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    filterCard: {
                                        type: 'basic',
                                    },
                                    viewAs: {
                                        name: 'sha',
                                    },
                                    viewAsFilter(player) {
                                        if (!player.countCards('hs', { type: 'basic' })) return false;
                                    },
                                    position: 'hs',
                                    prompt: '将一张基本牌当杀使用或打出',
                                    check() {
                                        return 1;
                                    },
                                    ai: {
                                        effect: {
                                            target(card, player, target, current) {
                                                if (get.tag(card, 'respondSha') && current < 0) return 0.6;
                                            },
                                        },
                                        respondSha: true,
                                        skillTagFilter(player) {
                                            if (!player.countCards('hs', 'shan')) return false;
                                        },
                                        order() {
                                            return get.order({ name: 'sha' }) + 0.1;
                                        },
                                        useful: -1,
                                        value: -1,
                                        yingbian(card, player, targets, viewer) {
                                            if (get.attitude(viewer, player) <= 0) return 0;
                                            var base = 0,
                                                hit = false;
                                            if (get.cardtag(card, 'yingbian_hit')) {
                                                hit = true;
                                                if (
                                                    targets.filter(function (target) {
                                                        return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            if (get.cardtag(card, 'yingbian_all')) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            if (get.cardtag(card, 'yingbian_damage')) {
                                                if (
                                                    targets.filter(function (target) {
                                                        return (
                                                            get.attitude(player, target) < 0 &&
                                                            (hit ||
                                                                !target.mayHaveShan() ||
                                                                player.hasSkillTag(
                                                                    'directHit_ai',
                                                                    true,
                                                                    {
                                                                        target: target,
                                                                        card: card,
                                                                    },
                                                                    true
                                                                )) &&
                                                            !target.hasSkillTag('filterDamage', null, {
                                                                player: player,
                                                                card: card,
                                                                jiu: true,
                                                            })
                                                        );
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            return base;
                                        },
                                        canLink(player, target, card) {
                                            if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                            if (
                                                target.mayHaveShan() &&
                                                !player.hasSkillTag(
                                                    'directHit_ai',
                                                    true,
                                                    {
                                                        target: target,
                                                        card: card,
                                                    },
                                                    true
                                                )
                                            )
                                                return false;
                                            if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                            return true;
                                        },
                                        basic: {
                                            useful: [5, 3, 1],
                                            value: [5, 3, 1],
                                        },
                                        result: {
                                            target(player, target, card, isLink) {
                                                var eff = (function () {
                                                    if (!isLink && player.hasSkill('jiu')) {
                                                        if (
                                                            !target.hasSkillTag('filterDamage', null, {
                                                                player: player,
                                                                card: card,
                                                                jiu: true,
                                                            })
                                                        ) {
                                                            if (get.attitude(player, target) > 0) {
                                                                return -7;
                                                            } else {
                                                                return -4;
                                                            }
                                                        }
                                                        return -0.5;
                                                    }
                                                    return -1.5;
                                                })();
                                                if (
                                                    !isLink &&
                                                    target.mayHaveShan() &&
                                                    !player.hasSkillTag(
                                                        'directHit_ai',
                                                        true,
                                                        {
                                                            target: target,
                                                            card: card,
                                                        },
                                                        true
                                                    )
                                                )
                                                    return eff / 1.2;
                                                return eff;
                                            },
                                        },
                                        tag: {
                                            respond: 1,
                                            respondShan: 1,
                                            damage(card) {
                                                if (card.nature == 'poison') return;
                                                return 1;
                                            },
                                            natureDamage(card) {
                                                if (card.nature) return 1;
                                            },
                                            fireDamage(card, nature) {
                                                if (card.nature == 'fire') return 1;
                                            },
                                            thunderDamage(card, nature) {
                                                if (card.nature == 'thunder') return 1;
                                            },
                                            poisonDamage(card, nature) {
                                                if (card.nature == 'poison') return 1;
                                            },
                                        },
                                    },
                                },
                                shan: {
                                    audio: 'longdan_sha',
                                    audioname: ['re_zhaoyun'],
                                    enable: ['chooseToRespond', 'chooseToUse'],
                                    filterCard: {
                                        type: 'basic',
                                    },
                                    viewAs: {
                                        name: 'shan',
                                    },
                                    prompt: '将一张基本牌当闪使用或打出',
                                    check() {
                                        return 1;
                                    },
                                    position: 'hs',
                                    viewAsFilter(player) {
                                        if (!player.countCards('hs', { type: 'basic' })) return false;
                                    },
                                    ai: {
                                        respondShan: true,
                                        skillTagFilter(player) {
                                            if (!player.countCards('hs', 'sha')) return false;
                                        },
                                        effect: {
                                            target(card, player, target, current) {
                                                if (get.tag(card, 'respondShan') && current < 0) return 0.6;
                                            },
                                        },
                                        order: 4,
                                        useful: -1,
                                        value: -1,
                                        basic: {
                                            useful: [7, 5.1, 2],
                                            value: [7, 5.1, 2],
                                        },
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                            },
                        },
                        涯角: {
                            audio: 'reyajiao',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != _status.currentPhase && event.hs && event.hs.length && ['useCard', 'respond'].includes(event.parent.name);
                            },
                            content() {
                                'step 0';
                                event.card = get.cards()[0];
                                game.cardsGotoOrdering(event.card);
                                event.videoId = lib.status.videoId++;
                                var judgestr = get.translation(player) + '发动了【涯角】';
                                game.addVideo('judge1', player, [get.cardInfo(event.card), judgestr, event.videoId]);
                                game.broadcastAll(
                                    function (player, card, str, id, cardid) {
                                        var event;
                                        if (game.online) {
                                            event = {};
                                        } else {
                                            event = _status.event;
                                        }
                                        if (game.chess) {
                                            event.node = card.copy('thrown', 'center', ui.arena).addTempClass('start');
                                        } else {
                                            event.node = player.$throwordered(card.copy(), true);
                                        }
                                        if (lib.cardOL) lib.cardOL[cardid] = event.node;
                                        event.node.cardid = cardid;
                                        event.node.classList.add('thrownhighlight');
                                        ui.arena.classList.add('thrownhighlight');
                                        event.dialog = ui.create.dialog(str);
                                        event.dialog.classList.add('center');
                                        event.dialog.videoId = id;
                                    },
                                    player,
                                    event.card,
                                    judgestr,
                                    event.videoId,
                                    get.id()
                                );
                                game.log(player, '展示了', event.card);
                                if (get.type(event.card, 'trick') == get.type(trigger.parent.card, 'trick')) {
                                    player
                                        .chooseTarget('选择获得此牌的角色')
                                        .set('ai', function (target) {
                                            var att = get.attitude(_status.event.player, target);
                                            if (_status.event.du) {
                                                if (target.hasSkillTag('nodu')) return 0;
                                                return -att;
                                            }
                                            if (att > 0) {
                                                return att + Math.max(0, 5 - target.countCards('h'));
                                            }
                                            return att;
                                        })
                                        .set('du', event.card.name == 'du');
                                } else {
                                    event.disbool = true;
                                    player
                                        .chooseTarget('是否弃置攻击范围内包含你的一名角色区域内的两张牌？', function (card, player, target) {
                                            return target.inRange(player) && target.countDiscardableCards(player, 'hej') > 0;
                                        })
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.effect(target, { name: 'guohe' }, player, player);
                                        });
                                }
                                ('step 1');
                                if (event.disbool) {
                                    if (result.bool) {
                                        player.line(result.targets[0], 'green');
                                        player.discardPlayerCard(result.targets[0], 'hej', 2, true);
                                    }
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    game.addVideo('deletenode', player, [get.cardInfo(event.node)]);
                                    event.node.delete();
                                    game.broadcast(
                                        function (id, card) {
                                            var dialog = get.idDialog(id);
                                            if (dialog) {
                                                dialog.close();
                                            }
                                            if (card.clone) {
                                                card.clone.delete();
                                            }
                                            ui.arena.classList.remove('thrownhighlight');
                                        },
                                        event.videoId,
                                        event.card
                                    );
                                    ui.arena.classList.remove('thrownhighlight');
                                } else if (result.targets?.length) {
                                    var list = [];
                                    for (var i = 0; i < trigger.parent.cards.length; i++) {
                                        if (i.isInPile()) {
                                            list.push(i);
                                        }
                                    }
                                    result.targets[0].gain(list, 'gain2');
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    player.line(result.targets, 'green');
                                    result.targets[0].gain(event.card, 'log');
                                    event.node.moveDelete(result.targets[0]);
                                    game.addVideo('gain2', result.targets[0], [get.cardInfo(event.node)]);
                                    ui.arena.classList.remove('thrownhighlight');
                                    game.broadcast(
                                        function (card, target, id) {
                                            var dialog = get.idDialog(id);
                                            if (dialog) {
                                                dialog.close();
                                            }
                                            ui.arena.classList.remove('thrownhighlight');
                                            if (card.clone) {
                                                card.clone.moveDelete(target);
                                            }
                                        },
                                        event.cards,
                                        result.targets[0],
                                        event.videoId
                                    );
                                } else {
                                    game.addVideo('deletenode', player, [get.cardInfo(event.node)]);
                                    event.node.delete();
                                    game.broadcast(
                                        function (id) {
                                            var dialog = get.idDialog(id);
                                            if (dialog) {
                                                dialog.close();
                                            }
                                            if (card.clone) {
                                                card.clone.delete();
                                            }
                                            ui.arena.classList.remove('thrownhighlight');
                                        },
                                        event.videoId,
                                        event.card
                                    );
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    ui.arena.classList.remove('thrownhighlight');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'respond') && target.countCards('h') > 1) return [1, 0.2];
                                    },
                                },
                            },
                        },
                        义绝: {
                            audio: 'yijue',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            filterCard: true,
                            check(card) {
                                return 8 - get.value(card);
                            },
                            content() {
                                'step 0';
                                if (!target.countCards('h')) {
                                    event.finish();
                                    return;
                                } else
                                    target.chooseCard(true, 'h').set('ai', function (card) {
                                        var player = _status.event.player;
                                        if ((player.hasShan() || player.hp < 3) && get.color(card) == 'black') return 0.5;
                                        return Math.max(1, 20 - get.value(card));
                                    });
                                ('step 1');
                                target.showCards(result.cards);
                                event.card2 = result.cards[0];
                                if (get.color(event.card2) == 'black') {
                                    if (!target.hasSkill('fengyin')) {
                                        target.addTempSkill('fengyin');
                                    }
                                    target.addTempSkill('yjeffect');
                                    event.finish();
                                } else {
                                    player.gain(event.card2, target, 'give', 'bySelf');
                                    if (target.hp < target.maxHp) {
                                        player.chooseBool('是否让目标回复一点体力？').ai = function (event, player) {
                                            return get.recoverEffect(target, player, player) > 0;
                                        };
                                    }
                                }
                                ('step 2');
                                if (result.bool) {
                                    target.recover();
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        var hs = player.getCards('h');
                                        if (hs.length < 3) return 0;
                                        if (target.countCards('h') > target.hp + 1 && get.recoverEffect(target) > 0) {
                                            return 1;
                                        }
                                        if (player.canUse('sha', target) && (player.countCards('h', 'sha') || player.countCards('he', { color: 'red' }))) {
                                            return -2;
                                        }
                                        return -0.5;
                                    },
                                },
                                order: 9,
                                directHit_ai: true,
                                skillTagFilter(player, tag, arg) {
                                    if (!arg.target.hasSkillTag('new_yijue2')) return false;
                                },
                            },
                        },
                        武圣: {
                            mod: {
                                targetInRange(card) {
                                    if (card.suit == 'diamond' && card.name == 'sha') return true;
                                },
                            },
                            audio: 'wusheng',
                            audioname: ['re_guanyu', 'guanzhang', 'jsp_guanyu', 'guansuo'],
                            group: ['zhan'],
                            enable: ['chooseToRespond', 'chooseToUse'],
                            filterCard(card, player) {
                                if (get.zhu(player, 'shouyue')) return true;
                                return get.color(card) == 'red';
                            },
                            position: 'hes',
                            viewAs: {
                                name: 'sha',
                            },
                            viewAsFilter(player) {
                                if (get.zhu(player, 'shouyue')) {
                                    if (!player.countCards('hes')) return false;
                                } else {
                                    if (!player.countCards('hes', { color: 'red' })) return false;
                                }
                            },
                            prompt: '将一张红色牌当杀使用或打出',
                            check(card) {
                                var val = get.value(card);
                                if (_status.event.name == 'chooseToRespond') return 1 / Math.max(0.1, val);
                                return 5 - val;
                            },
                            ai: {
                                respondSha: true,
                                skillTagFilter(player) {
                                    if (get.zhu(player, 'shouyue')) {
                                        if (!player.countCards('hes')) return false;
                                    } else {
                                        if (!player.countCards('hes', { color: 'red' })) return false;
                                    }
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                                            }) &&
                                            game.countPlayer(function (current) {
                                                return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                                            }) > 1
                                        )
                                            return 3.1;
                                        return 3;
                                    }
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                        },
                        yjeffect: {
                            marktext: '义绝',
                            trigger: {
                                player: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.source && event.source.hasSkill('义绝') && event.card && event.card.name == 'sha' && event.card.suit == 'heart' && event.notLink();
                            },
                            silent: true,
                            popup: false,
                            forced: true,
                            content() {
                                trigger.num += trigger.source.countMark('zhan');
                            },
                            mark: true,
                            mod: {
                                cardEnabled2(card) {
                                    if (get.position(card) == 'h') return false;
                                },
                            },
                            intro: {
                                content: '不能使用或打出手牌',
                            },
                        },
                        zhan: {
                            marktext: '斩',
                            trigger: {
                                source: 'dieAfter',
                                player: ['useCard', 'respondAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                return (event.card && event.card.name == 'sha') || event.source;
                            },
                            content() {
                                if (trigger.card) {
                                    player.addMark('zhan', 1);
                                    if (trigger.card.suit == 'heart' && trigger.name == 'useCard') trigger.directHit.addArray(game.players);
                                } else player.removeMark('zhan', player.countMark('zhan'));
                            },
                            intro: {
                                content: '斩汝#次,也不够!!!',
                            },
                        },
                        青囊: {
                            subSkill: {
                                off: {
                                },
                                off2: {
                                },
                            },
                            audio: 'qingnang',
                            enable: 'phaseUse',
                            filterCard: true,
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    game.countPlayer(function (current) {
                                        return get.recoverEffect(current, player, player) > 0 && get.attitude(player, current) > 2;
                                    }) > 1 &&
                                    get.color(card) == 'black' &&
                                    player.countCards('h', { color: 'red' }) > 0
                                )
                                    return 3 - get.value(card);
                                return 9 - get.value(card);
                            },
                            filter(event, player) {
                                return !player.hasSkill('青囊_off2');
                            },
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            content() {
                                if (target.hasSkill('青囊_off')) player.addTempSkill('青囊_off2');
                                target.addTempSkill('青囊_off');
                                if (get.color(cards[0]) == 'black') player.addTempSkill('青囊_off2');
                                target.recover();
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        if (target.hp == 1) return 5;
                                        if (player == target && player.countCards('h') > player.hp) return 5;
                                        return 2;
                                    },
                                },
                                threaten: 2,
                            },
                        },
                        急救: {
                            mod: {
                                aiValue(player, card, num) {
                                    if (card.name != 'tao' && get.color(card) != 'red') return;
                                    var cards = player.getCards('hs', function (card) {
                                        return card.name == 'tao' || get.color(card) == 'red';
                                    });
                                    cards.sort(function (a, b) {
                                        return (a.name == 'tao' ? 1 : 2) - (b.name == 'tao' ? 1 : 2);
                                    });
                                    var geti = function () {
                                        if (cards.includes(card)) {
                                            return cards.indexOf(card);
                                        }
                                        return cards.length;
                                    };
                                    return Math.max(num, [6.5, 4, 3, 2][Math.min(geti(), 2)]);
                                },
                                aiUseful() {
                                    return lib.skill.kanpo.mod.aiValue.apply(this, arguments);
                                },
                            },
                            audio: 'ext:东方七宿/audio:2',
                            group: ['jijiu_add'],
                            enable: 'chooseToUse',
                            viewAsFilter(player) {
                                return player != _status.currentPhase && player.countCards('hes', { color: 'red' }) > 0;
                            },
                            filterCard(card, player) {
                                return get.color(card) == 'red';
                            },
                            position: 'hes',
                            viewAs: {
                                name: 'tao',
                            },
                            prompt: '将一张红色牌当桃使用',
                            check(card) {
                                return 15 - get.value(card);
                            },
                            ai: {
                                threaten: 1.5,
                                basic: {
                                    order(card, player) {
                                        if (player.hasSkillTag('pretao')) return 5;
                                        return 2;
                                    },
                                    useful: [6.5, 4, 3, 2],
                                    value: [6.5, 4, 3, 2],
                                },
                                result: {
                                    target: 2,
                                    target_use(player, target) {
                                        // if(player==target&&player.hp<=0) return 2;
                                        if (player.hasSkillTag('nokeep', true, null, true)) return 2;
                                        var nd = player.needsToDiscard();
                                        var keep = false;
                                        if (nd <= 0) {
                                            keep = true;
                                        } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                            keep = true;
                                        }
                                        var mode = get.mode();
                                        if (target.hp >= 2 && keep && target.hasFriend()) {
                                            if (target.hp > 2 || nd == 0) return 0;
                                            if (target.hp == 2) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        if (target != current && get.attitude(target, current) >= 3) {
                                                            if (current.hp <= 1) return true;
                                                            if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                        }
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                        if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                        var att = get.attitude(player, target);
                                        if (att < 3 && att >= 0 && player != target) return 0;
                                        var tri = _status.event.getTrigger();
                                        if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                                var num = game.countPlayer(function (current) {
                                                    if (current.identity == 'fan') {
                                                        return current.countCards('h', 'tao');
                                                    }
                                                });
                                                if (num > 1 && player == target) return 2;
                                                return 0;
                                            }
                                        }
                                        if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                                return 0;
                                            }
                                        }
                                        if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                            return 0;
                                        }
                                        return 2;
                                    },
                                },
                                tag: {
                                    recover: 1,
                                    save: 1,
                                },
                            },
                        },
                        jijiu_add: {
                            forced: true,
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'tao' && event.cards && event.cards[0]?.name == 'tao';
                            },//QQQ
                            content() {
                                trigger.baseDamage++;
                            },
                        },
                        仁释: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                player: 'damageBegin4',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isDamaged() && event.card && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                trigger.cancel();
                                var cards = trigger.cards.filterInD();
                                if (cards.length == 1 && get.color(cards[0]) == 'red') {
                                    var cards2 = [];
                                    while (cards2.length < 2) {
                                        var card = get.cardPile2(function (i) {
                                            return i.name == 'sha' && !cards2.includes(i);
                                        });
                                        if (!card) break;
                                        else cards2.push(card);
                                    }
                                    if (cards2.length) player.gain(cards2, 'gain2');
                                } else if (cards.length) player.gain(cards, 'gain2', 'log');
                                ('step 1');
                                player.loseMaxHp();
                            },
                            ai: {
                                filterDamage: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.card && arg.card.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        武缘: {
                            audio: 'ext:东方七宿/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            filterCard: {
                                name: 'sha',
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    get.color(card) == 'red' &&
                                    game.hasPlayer(function (current) {
                                        return current != player && current.isDamaged() && get.attitude(player, current) > 2;
                                    })
                                )
                                    return 2;
                                if (get.nature(card)) return 1.5;
                                return 1;
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            content() {
                                'step 0';
                                player.give(cards, target, 'give');
                                player.recover();
                                ('step 1');
                                var num = 1;
                                if (get.nature(cards[0])) num++;
                                target.draw(num);
                                if (get.color(cards[0]) == 'red') target.recover();
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player, target) {
                                        if (player.isDamaged()) return 1;
                                        return 0;
                                    },
                                    target(player, target) {
                                        if (ui.selected.cards.length) {
                                            var num = 1;
                                            if (get.nature(ui.selected.cards[0])) num++;
                                            if (target.hasSkillTag('nogain')) num = 0;
                                            if (get.color(ui.selected.cards[0]) == 'red') return num + 2;
                                            else return num + 1;
                                        }
                                        return 1;
                                    },
                                },
                            },
                        },
                        怀子: {
                            mod: {
                                maxHandcardBase(player, num) {
                                    return player.maxHp;
                                },
                            },
                            forced: true,
                            firstDo: true,
                            filter(event, player) {
                                return player.isDamaged() && player.countCards('h') > player.hp;
                            },
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            content() {
                                var card = get.cardPile2(function (card) {
                                    return card.name == 'sha';
                                });
                                if (card) player.gain(card, 'gain2');
                            },
                        },
                        命器: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                var card = get.cardPile('zhangba');
                                if (card) {
                                    player.chooseUseTarget(card, true).set('animate', false).set('nopopup', true);
                                }
                            },
                            group: '命器_zb',
                            subSkill: {
                                zb: {
                                    mod: {
                                        targetInRange(card, player, target) {
                                            if (_status.event.skill == 'zhangba_skill') return true;
                                        },
                                    },
                                    trigger: {
                                        source: 'damageSource',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.parent.skill == 'zhangba_skill' && event.card.name == 'sha';
                                    },
                                    content() {
                                        player.draw(2);
                                    },
                                },
                            },
                        },
                        抵抗: {
                            trigger: {
                                player: 'damageBegin4',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                trigger.cancel();
                                player.chooseToDiscard('h', true);
                            },
                        },
                        血影: {
                            trigger: {
                                player: 'enterGame',
                                global: 'phaseBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.getExpansions('血影').length && player.getExpansions('血影').length >= game.countGroup()) return false;
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            content() {
                                var cards = get.cards(game.countGroup());
                                player.addToExpansion(cards, 'gain2').gaintag.add('血影');
                            },
                            marktext: '影',
                            intro: {
                                mark(dialog, storage, player) {
                                    var cards = player.getExpansions('血影');
                                    if (player.isUnderControl(true)) dialog.addAuto(cards);
                                    else return '共有' + get.cnNumber(cards.length) + '张牌';
                                },
                                markcount: 'expansion',
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            group: ['血影_use', '血影_add'],
                            subSkill: {
                                add: {
                                    trigger: {
                                        player: 'phaseDiscardEnd',
                                    },
                                    filter(event, player) {
                                        return event.cards && event.cards.length > 1 && player.getExpansions('血影').length < game.countGroup();
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseCardButton('将一张牌置于武将牌上', trigger.cards, true);
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.num++;
                                            player.addToExpansion(result.links, 'gain2').gaintag.add('血影');
                                        }
                                    },
                                },
                                use: {
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    hiddenCard(player, name) {
                                        if (name == 'tao' || name == 'shan' || name == 'sha' || name == 'wuxie') {
                                            return player.getExpansions('血影').length;
                                        }
                                        return false;
                                    },
                                    filter(event, player) {
                                        return player.getExpansions('血影').length;
                                    },
                                    chooseButton: {
                                        dialog(event, player) {
                                            var list = ['wuxie'];
                                            for (var i of lib.inpile) {
                                                if (get.type(i) != 'basic' || i == 'jiu') continue;
                                                var card = { name: i };
                                                if (event.filterCard && event.filterCard(card, player, event)) {
                                                    list.push(['基本', '', i]);
                                                    if (i == 'sha') {
                                                        for (var j of lib.inpile_nature) {
                                                            card.nature = j;
                                                            list.push(['基本', '', i, j]);
                                                        }
                                                    }
                                                }
                                            }
                                            var dialog = ui.create.dialog('选择要使用的牌.', 'hidden');
                                            dialog.add([list, 'vcard']);
                                            dialog.add('选择一张<影>.');
                                            dialog.add(player.getExpansions('血影'));
                                            return dialog;
                                        },
                                        filter(button, event, player) {
                                            if (button.link.suit == 'none' && _status.event.parent.type == 'wuxie') {
                                                if (button.link[2] != 'wuxie') return false;
                                            }
                                            if (button.link.suit == 'none' && _status.event.parent.type != 'wuxie') {
                                                if (button.link[2] == 'wuxie') return false;
                                            }
                                            if (!ui.selected.buttons.length && button.link.suit != 'none') return false;
                                            if (ui.selected.buttons.length && button.link.suit == 'none') return false;
                                            return true;
                                        },
                                        select: 2,
                                        backup(links, event, player) {
                                            return {
                                                filterCard: (card) => card == lib.skill.血影_use_backup.card,
                                                selectCard: -1,
                                                position: 'x',
                                                viewAs: { name: links[0][2], nature: links[0][3] },
                                                card: links[1],
                                            };
                                        },
                                        prompt(links, player) {
                                            var name1 = links[1];
                                            var name2 = { name: links[0][2], nature: links[0][3] };
                                            return '将<' + get.translation(name1) + '>当做【' + get.translation(name2) + '】使用';
                                        },
                                    },
                                },
                            },
                        },
                        承芳: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.getExpansions('血影').length && player.getExpansions('血影').length >= game.countGroup()) return false;
                                return event.num > 0;
                            },
                            content() {
                                var cards = get.cards(1);
                                player.addToExpansion(cards, 'gain2').gaintag.add('血影');
                                player.moveCard();
                            },
                            group: '承芳_source',
                            subSkill: {
                                source: {
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return player.getExpansions('血影').length;
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseCardButton('将一张<影>置入弃牌堆', player.getExpansions('血影'), true);
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.num++;
                                            player.loseToDiscardpile(result.links);
                                        }
                                    },
                                },
                            },
                        },
                        影箭: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseCardTarget({
                                    position: 'he',
                                    filterCard: true,
                                    selectCard: [1],
                                    filterTarget(card, player, target) {
                                        return player != target;
                                    },
                                    prompt: '请选择弃置的牌和【杀】的目标.',
                                });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    var cards = result.cards;
                                    player.discard(cards);
                                    player.useCard({ name: 'sha' }, target, false);
                                } else event.finish();
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        请戍: {
                            trigger: {
                                global: 'useCardToTargeted',
                            },
                            filter(event, player) {
                                return player.group == 'shu' && event.card.name == 'sha' && player.countCards('he') > 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.target) < 0;
                            },
                            content() {
                                player.chooseToDiscard('he', true);
                                player.useCard({ name: 'sha' }, trigger.player, false);
                            },
                        },
                        熾魂: {
                            mod: {
                                targetInRange(card, player, target) {
                                    if (target.isTurnedOver()) {
                                        return true;
                                    }
                                },
                                cardUsableTarget(card, player, target) {
                                    if (target.isTurnedOver()) return true;
                                },
                            },
                            enable: 'phaseUse',
                            filterCard: true,
                            usable: 1,
                            check(card) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                target.recover();
                                if (cards[0].name == 'jiu' || cards[0].name == 'tao') {
                                    player.chooseTarget('熾魂:是否令一名角色翻面？');
                                }
                                ('step 1');
                                if (result.bool) result.targets[0].turnOver();
                            },
                        },
                        五岳: {
                            trigger: {
                                player: 'dying',
                            },
                            limited: true,
                            filter(event, player) {
                                return player.storage.五岳 == false;
                            },
                            marktext: '五岳',
                            content() {
                                'step 0';
                                player.storage.五岳 = true;
                                event.cards = get.cards(5);
                                game.cardsGotoOrdering(event.cards);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (get.color(i) == 'red') {
                                        num++;
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    player.recover(num);
                                }
                                ('step 2');
                                if (event.cards.length) {
                                    player.gain(event.cards, 'gain2');
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        游侠: {
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current.hp == player.hp && current != player && player.canCompare(current);
                                });
                            },
                            content() {
                                var targets = [];
                                for (var i of game.players) {
                                    if (i.hp == player.hp && i != player) targets.push(i);
                                }
                                player.chooseToCompare(targets).callback = lib.skill.游侠.callback;
                            },
                            callback() {
                                'step 0';
                                if (event.num1 < event.num2) {
                                    player.damage();
                                    target.draw();
                                }
                                ('step 1');
                                if (event.num1 >= event.num2) {
                                    target.damage();
                                    player.draw();
                                }
                                ('step 2');
                                if (event.num1 == event.num2) {
                                    player.damage();
                                    target.damage();
                                }
                            },
                            ai: {
                                expose: 0.1,
                            },
                        },
                        残戾: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                if (player.countCards('h', { type: 'equip' }) == 0 || player.countCards('h', { type: 'basic' }) == 0 || (player.countCards('h', { type: 'trick' }) == 0 && player.countCards('h', { type: 'delay' }) == 0)) {
                                    event._result = { index: 1 };
                                } else {
                                    player.chooseControl().set('choiceList', ['展示三张不同类型的牌,可以视为使用一张基本牌.', '失去一点体力上限,摸三张牌.']);
                                }
                                ('step 1');
                                if (result.index == 0) {
                                    player
                                        .chooseCard(
                                            '弃置三张不同类型的牌',
                                            function (card) {
                                                if (ui.selected.cards.length == 0) return true;
                                                if (Array.isArray(ui.selected.cards)) for (var i of ui.selected.cards) {
                                                    if (get.type(i, 'trick') == get.type(card, 'trick')) return false;
                                                }
                                                return true;
                                            },
                                            'h',
                                            true
                                        )
                                        .set('complexCard', true)
                                        .set('selectCard', function () {
                                            return ui.selected.cards.length + 1;
                                        });
                                } else {
                                    player.loseMaxHp();
                                    player.draw(3);
                                    event.finish();
                                }
                                ('step 2');
                                var cards = result.cards;
                                player.showCards(cards);
                                var list = [];
                                for (var i of lib.inpile) {
                                    if (get.type(i) != 'basic' || i == 'shan') continue;
                                    var card = { name: i };
                                    list.push(['基本', '', i]);
                                    if (i == 'sha') {
                                        for (var j of lib.inpile_nature) {
                                            card.nature = j;
                                            list.push(['基本', '', i, j]);
                                        }
                                    }
                                }
                                if (list.length) {
                                    player.chooseButton(
                                        ['是否视为使用一张基本牌？', [list, 'vcard']],
                                        function (button) {
                                            return _status.event.player.getUseValue({ name: button.link[2], nature: button.link[3] });
                                        },
                                        function (button) {
                                            return _status.event.player.hasUseTarget({ name: button.link[2], nature: button.link[3] });
                                        }
                                    );
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result && result.bool && result.links[0]) {
                                    var card = { name: result.links[0][2], nature: result.links[0][3] };
                                    player.chooseUseTarget(card, true);
                                }
                            },
                        },
                        父魂: {
                            enable: ['chooseToUse', 'chooseToRespond'],
                            filterCard: true,
                            selectCard: 2,
                            position: 'hs',
                            audio: 'ext:东方七宿/audio:2',
                            derivation: ['new_rewusheng', 'olpaoxiao'],
                            viewAs: {
                                name: 'sha',
                            },
                            prompt: '将两张手牌当杀使用或打出',
                            viewAsFilter(player) {
                                return player.countCards('hs') > 1;
                            },
                            precontent() {
                                if (event.result.cards[0].suit == event.result.cards[1].suit) player.draw();
                            },
                            check(card) {
                                if (_status.event.player.hasSkill('new_rewusheng') && get.color(card) == 'red') return 0;
                                if (_status.event.name == 'chooseToRespond') {
                                    if (card.name == 'sha') return 0;
                                    return 6 - get.useful(card);
                                }
                                if (_status.event.player.countCards('hs') < 4) return 6 - get.useful(card);
                                return 7 - get.useful(card);
                            },
                            ai: {
                                respondSha: true,
                                skillTagFilter(player) {
                                    if (player.countCards('hs') < 2) return false;
                                },
                                order(item, player) {
                                    if (player.hasSkill('new_rewusheng') && player.hasSkill('olpaoxiao')) {
                                        return 1;
                                    }
                                    if (player.countCards('hs') < 4) {
                                        return 1;
                                    }
                                    return 4;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                            group: 'fu222',
                        },
                        fu222: {
                            trigger: {
                                source: 'damageSource',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.hasSkill('fuhun3')) return false;
                                return event.parent.skill == '父魂';
                            },
                            content() {
                                player.addTempSkill('new_rewusheng');
                                player.addTempSkill('olpaoxiao');
                                player.addTempSkill('fuhun3');
                            },
                        },
                        射戟: {
                            mod: {
                                targetInRange(card, player) {
                                    if (get.color(card) == 'red' && card.name == 'sha' && player.getEquip(1)) return true;
                                },
                            },
                            trigger: {
                                source: 'damageBegin1',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            forced: true,
                            filter(event, player) {
                                return event.parent.name == 'sha' && !event.player.inRange(player);
                            },
                            content() {
                                trigger.num++;
                            },
                        },
                        //出牌阶段,你可以选择至多三张手牌,若你选择的牌的数量为:1,你将此牌当作随机一张普通锦囊牌使用,当你为此牌指定目标后,目标改为随机一名角色;2,你将这些牌当作随机一张普通锦囊牌使用;3,你将这些牌当作你指定的一张普通锦囊牌使用
                        犬计: {
                            enable: 'phaseUse',
                            audio: 'ext:东方七宿/audio:2',
                            forced: true,
                            filter(event, player) {
                                return player.countCards('hs') > 0;
                            },
                            async content(event, trigger, player) {//QQQ
                                const { result: { cards } } = await player.chooseCard('选择1~3张牌', 'h', true, [1, 3])
                                    .set('ai', (c) => 6 - get.value(c));
                                if (cards?.length) {
                                    const list = player.qcard('trick', true, false);
                                    if (cards.length == 1) {
                                        await player.useCard({ name: list.randomGet()[2] }, cards, game.players.randomGet());
                                    }
                                    if (cards.length == 2) {
                                        await player.chooseUseTarget({ name: list.randomGet()[2] }, cards, true, false, 'nodistance');
                                    }
                                    if (cards.length == 3) {
                                        const { result: { links } } = await player.chooseButton(['将' + get.translation(cards) + '牌当作一张锦囊牌使用', [list, 'vcard']])
                                            .set('ai', (button) => {
                                                const num = player.getUseValue({
                                                    name: button.link[2],
                                                    nature: button.link[3],
                                                }, null, true);
                                                return number0(num) / 2 + 10;
                                            });
                                        if (links?.length) {
                                            await player.chooseUseTarget({ name: links[0][2] }, cards, true, false, 'nodistance');
                                        }
                                    }
                                }
                            },
                        },
                        佢守: {
                            trigger: {
                                player: 'damageBegin4',
                            },
                            forced: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.judge('佢守', function (card) {
                                    return get.color(card) == 'red' ? 1.5 : -0.5;
                                }).judge2 = function (result) {
                                    return result.bool;
                                };
                                ('step 1');
                                if (result.bool > 0) {
                                    game.log(player, '令伤害-1');
                                    trigger.num--;
                                } else {
                                    game.log(player, '令伤害+1');
                                    trigger.num++;
                                }
                            },
                        },
                        征兆: {
                            marktext: '兆',
                            trigger: {
                                global: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return get.distance(player, event.player) <= 1;
                            },
                            content() {
                                'step 0';
                                var list = [];
                                for (var i = 1; i < 6; i++) {
                                    list.push(i);
                                }
                                player.chooseControl(list).set('prompt', '选择一个数字');
                                ('step 1');
                                if (result.control) {
                                    trigger.player.addTempSkill('征兆_count');
                                    trigger.player.addMark('征兆', result.control);
                                    trigger.player.markSkill('征兆');
                                }
                            },
                            subSkill: {
                                count: {
                                    trigger: {
                                        player: 'phaseUseEnd',
                                    },
                                    filter(event, player) {
                                        var list = game.filterPlayer(function (current) {
                                            return current.hasSkill('征兆');
                                        });
                                        return player.countUsed(null, true) == player.countMark('征兆') && list.length;
                                    },
                                    content() {
                                        var list = game.filterPlayer(function (current) {
                                            return current.hasSkill('征兆');
                                        });
                                        list[0].draw(player.countMark('征兆'));
                                        player.removeMark('征兆', player.countMark('征兆'));
                                    },
                                    forced: true,
                                },
                            },
                            intro: {
                                content: '池阳君的预言为#.',
                            },
                        },
                        貔魔: {
                            trigger: {
                                player: 'drawBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return !player.isMaxHp();
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(
                                    '令一名体力最大的角色摸等量的牌',
                                    function (card, player, target) {
                                        return target.isMaxHp();
                                    },
                                    true
                                );
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].draw(trigger.num);
                                }
                            },
                        },
                        暗恋: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            audio: 'ext:东方七宿/audio:2',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseCardTarget({
                                    filterCard: true,
                                    position: 'he',
                                    filterTarget(card, player, target) {
                                        return player != target && !target.getExpansions('暗恋2').length && target.hasSex('male');
                                    },
                                    ai1(card) {
                                        return 7 - get.value(card);
                                    },
                                    ai2(target) {
                                        var num = target.hasSkillTag('maixie') ? 2 : 0;
                                        return -get.attitude(_status.event.player, target) - num;
                                    },
                                    prompt: get.prompt2('暗恋'),
                                });
                                ('step 1');
                                if (result.bool) {
                                    event.forceDie = true;
                                    var target = result.targets[0];
                                    event.target = target;
                                    event.card = result.cards[0];
                                    target.storage.暗恋2 = [result.cards[0], player];
                                    target.addToExpansion(result.cards[0], player, 'giveAuto').gaintag.add('暗恋2');
                                } else event.finish();
                                ('step 2');
                                if (target.getExpansions('暗恋2').includes(card)) {
                                    target.addSkill('暗恋2');
                                } else delete target.storage.暗恋2;
                            },
                            ai: {
                                threaten: 1.7,
                                expose: 0.3,
                            },
                        },
                        呤作: {
                            mark: true,
                            marktext: '呤作',
                            intro: {
                                content: '呤作:$',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h') > 0;
                            },
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player && current.countCards('h') > 0;
                                });
                            },
                            content() {
                                'step 0';
                                target.showHandcards();
                                player.chooseCardButton(target, target.getCards('h')).set('ai', function (button) {
                                    return get.value(button.link);
                                }).filterButton = function (button) {
                                    return get.type(button.link) != 'equip';
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.storage.呤作 = result.links[0].name;
                                    player.addTempSkill('呤作_use', { player: 'phaseBegin' });
                                }
                            },
                            subSkill: {
                                use: {
                                    group: '呤作_block',
                                    usable: 1,
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    hiddenCard(player, name) {
                                        var name1;
                                        var list = game.filterPlayer(function (current) {
                                            return current.hasSkill('呤作');
                                        });
                                        if (list[0].storage.呤作) name1 = list[0].storage.呤作;
                                        return name == name1 && !player.hasSkill('呤作_cc');
                                    },
                                    filterCard: true,
                                    selectCard: 1,
                                    position: 'he',
                                    filter(event, player, card) {
                                        var name1 = player.storage.呤作;
                                        var card = { name: name1 };
                                        if (!event.filterCard || !event.filterCard(card, player, event)) return false;
                                        return player.countCards('he') > 0 && !player.hasSkill('呤作_cc');
                                    },
                                    viewAs(cards, player) {
                                        var name;
                                        name = player.storage.呤作;
                                        return { name: name };
                                    },
                                    prompt(player) {
                                        var player = _status.event.player;
                                        var name = player.storage.呤作;
                                        return '将一张牌当做【' + get.translation(name) + '】使用';
                                    },
                                },
                                block: {
                                    forced: true,
                                    charlotte: true,
                                    popup: false,
                                    trigger: {
                                        player: ['useCardAfter', 'respondAfter'],
                                    },
                                    filter(event, player) {
                                        return event.skill == '呤作_use';
                                    },
                                    content() {
                                        player.addTempSkill('呤作_cc');
                                    },
                                },
                                cc: {
                                    charlotte: true,
                                    popup: false,
                                },
                            },
                        },
                        暗恋2: {
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            charlotte: true,
                            audio: 'ext:东方七宿/audio:2',
                            filter(event, player) {
                                return player.storage.暗恋2 && player.getExpansions('暗恋2').includes(player.storage.暗恋2[0]);
                            },
                            content() {
                                'step 0';
                                if (player.storage.暗恋2[1].isAlive()) {
                                    player.chooseControl().set('choiceList', ['弃置<恋>.', '获得<恋>.']).ai = function (event, player) {
                                        if (get.attitude(player, player.storage.暗恋2[1]) > 0) return 1;
                                        return 0;
                                    };
                                }
                                ('step 1');
                                var cards = player.getCards('hej').filter((i) => i.suit == player.storage.暗恋2[0].suit);
                                if (result.index == 0) {
                                    player.discard(cards);
                                } else {
                                    player.gain(player.storage.暗恋2[0], 'draw');
                                    player.storage.暗恋2[1].draw(cards.length);
                                }
                                ('step 2');
                                player.removeSkill('暗恋2');
                            },
                            marktext: '恋',
                            intro: {
                                markcount: 1,
                                name: '暗恋',
                                content: '已成为〖暗恋〗的目标',
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                                delete player.storage[skill];
                            },
                        },
                        问道: {
                            marktext: '道',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filterCard(card, player, event) {
                                var suits = player.getExpansions('问道');
                                if (suits == 0) return true;
                                for (var i = 0; i < suits.length; i++) {
                                    if (suits[i].suit == card.suit) return false;
                                }
                                return true;
                            },
                            selectCard: [1, 4],
                            prompt: '选择至多四张牌置于武将牌上并摸等量的牌',
                            discard: false,
                            content() {
                                player.draw(cards.length);
                                player.addToExpansion(cards, 'gain2').gaintag.add('问道');
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            group: ['问道_judge'],
                            subSkill: {
                                judge: {
                                    trigger: {
                                        global: 'judge',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.getExpansions('问道').length && event.player.isAlive();
                                    },
                                    content() {
                                        'step 0';
                                        var list = player.getExpansions('问道');
                                        player
                                            .chooseButton([get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',' + get.prompt('问道'), list, 'hidden'], function (button) {
                                                var card = button.link;
                                                var trigger = _status.event.getTrigger();
                                                var player = _status.event.player;
                                                var judging = _status.event.judging;
                                                var result = trigger.judge(card) - trigger.judge(judging);
                                                var attitude = get.attitude(player, trigger.player);
                                                return result * attitude;
                                            })
                                            .set('judging', trigger.player.judging[0])
                                            .set('filterButton', function (button) {
                                                var player = _status.event.player;
                                                var card = button.link;
                                                var mod2 = game.checkMod(card, player, 'unchanged', 'cardEnabled2', player);
                                                if (mod2 != 'unchanged') return mod2;
                                                var mod = game.checkMod(card, player, 'unchanged', 'cardRespondable', player);
                                                if (mod != 'unchanged') return mod;
                                                return true;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            event.forceDie = true;
                                            player.respond(result.links, '问道', 'highlight', 'noOrdering');
                                            result.cards = result.links;
                                            var card = result.cards[0];
                                            event.card = card;
                                        } else {
                                            event.finish();
                                        }
                                        ('step 2');
                                        if (result.bool) {
                                            if (trigger.player.judging[0].clone) {
                                                trigger.player.judging[0].clone.classList.remove('thrownhighlight');
                                                game.broadcast(function (card) {
                                                    if (card.clone) {
                                                        card.clone.classList.remove('thrownhighlight');
                                                    }
                                                }, trigger.player.judging[0]);
                                                game.addVideo('deletenode', player, get.cardsInfo([trigger.player.judging[0].clone]));
                                            }
                                            game.cardsDiscard(trigger.player.judging[0]);
                                            trigger.player.judging[0] = result.cards[0];
                                            trigger.orderingCards.addArray(result.cards);
                                            game.log(trigger.player, '的判定牌改为', card);
                                            event.getParent('arrangeTrigger').finish();
                                        }
                                    },
                                },
                            },
                        },
                        驱恶: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            content() {
                                'step 0';
                                if (game.roundNumber == 1) {
                                    result.index == 1;
                                } else player.chooseControl().set('choiceList', ['令一名角色回复为上个回合的武将牌状态.', '令一名角色弃置判定区内所有牌.']);
                                ('step 1');
                                if (result.index == 0) {
                                    event.num = 0;
                                    player.chooseTarget(true, '令一名角色回复为上个回合的武将牌状态', function (card, player, target) {
                                        return player != target;
                                    });
                                } else {
                                    player.chooseTarget(true, '令一名角色弃置判定区内所有牌', function (card, player, target) {
                                        event.num = 1;
                                        return player != target;
                                    });
                                }
                                ('step 2');
                                if (result.bool) {
                                    if (event.num == 0) {
                                        result.targets[0].link(result.targets[0].storage.linkmm);
                                        result.targets[0].turnOver(result.targets[0].storage.turnmm);
                                    }
                                    if (event.num == 1) result.targets[0].discard(result.targets[0].getCards('j'));
                                }
                            },
                            group: ['驱恶_mem'],
                            subSkill: {
                                mem: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    content() {
                                        for (var i of game.players) {
                                            if (i.isLinked()) {
                                                i.storage.linkmm = true;
                                            } else i.storage.linkmm = false;
                                            if (i.isTurnedOver()) {
                                                i.storage.turnmm = true;
                                            } else i.storage.turnmm = false;
                                        }
                                    },
                                    forced: true,
                                    charlotte: true,
                                    popup: false,
                                    lastDo: true,
                                },
                            },
                        },
                        狩境: {
                            mark: true,
                            marktext: '狩境',
                            intro: {
                                content: '点数:$',
                            },
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            async content(event, trigger, player) {//QQQ
                                const { result: { cards } } = await player.chooseCard('选择要展示的牌', 'h', true);
                                if (cards?.length) {
                                    player.showCards(cards);
                                    player.addTempSkill('狩境_use', { player: 'phaseBegin' });
                                    player.addTempSkill('狩境_tar', { player: 'phaseBegin' });
                                    player.storage.狩境 = cards[0].number;
                                }
                            },
                            subSkill: {
                                use: {
                                    trigger: {
                                        player: 'useCardToPlayered',
                                        target: 'useCardToTargeted',
                                    },
                                    filter(event, player) {
                                        if (typeof event.card.number != 'number') return false;
                                        return (event.card.number > player.storage.狩境 && player == event.target && player != event.player) || (event.card.number < player.storage.狩境 && player == event.player && player != event.target);
                                    },
                                    content() {
                                        if (trigger.card.number > player.storage.狩境 && player == trigger.target && player != trigger.player) player.discardPlayerCard(trigger.player, 'he', true);
                                        else player.draw();
                                    },
                                    forced: true,
                                },
                                tar: {
                                    forced: true,
                                },
                            },
                        },
                        战姬: {
                            trigger: {
                                player: 'useCardToPlayered',
                                target: 'useCardToTargeted',
                            },
                            forced: true,
                            logTarget(trigger, player) {
                                return player == trigger.player ? trigger.target : trigger.player;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'juedou' || (event.card.name == 'sha' && event.player == player);
                            },
                            content() {
                                var target = player == trigger.player ? trigger.target : trigger.player;
                                target.addTempSkill('战姬_block', 'useCardAfter');
                                target.storage.战姬_block.add(trigger.card.suit);
                                game.log(target.storage.战姬_block);
                            },
                            group: '战姬_exclude',
                            subSkill: {
                                exclude: {
                                },
                                block: {
                                    charlotte: true,
                                    mod: {
                                        cardEnabled(card, player) {
                                            if (!player.getStorage('战姬_block').includes(card.suit)) return false;
                                        },
                                        cardUsable(card, player) {
                                            if (!player.getStorage('战姬_block').includes(card.suit)) return false;
                                        },
                                        cardRespondable(card, player) {
                                            if (!player.getStorage('战姬_block').includes(card.suit)) return false;
                                        },
                                    },
                                    init(player, skill) {
                                        if (!player.storage[skill]) player.storage[skill] = [];
                                    },
                                    mark: true,
                                    intro: {
                                        content: '只能使用或打出$牌',
                                    },
                                },
                            },
                        },
                        武勇: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('武勇'), '视为对一名其他角色使用一张【杀】', function (card, player, target) {
                                    return player.canUse('sha', target, false);
                                });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    player.useCard({ name: 'sha' }, target, false);
                                } else event.finish();
                                ('step 2');
                                if (
                                    player.hasHistory('sourceDamage', function (evt) {
                                        var card = evt.card;
                                        if (!card || card.name != 'sha') return false;
                                        var evtx = evt.getParent('useCard');
                                        return evtx.card == card && evtx.parent == event;
                                    })
                                ) {
                                    player.storage.武勇_sha = player.hp;
                                    player.addTempSkill('武勇_sha');
                                }
                            },
                            subSkill: {
                                sha: {
                                    charlotte: true,
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return player.storage.武勇_sha;
                                        },
                                    },
                                    init(player, skill) {
                                        if (!player.storage[skill]) player.storage[skill] = [];
                                    },
                                    mark: true,
                                    intro: {
                                        content: '本回合使用杀的上限为$',
                                    },
                                },
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        止戈: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'zhige',
                            position: 'he',
                            selectTarget: 2,
                            multitarget: true,
                            targetprompt: ['出杀人', '出杀目标'],
                            filterTarget(card, player, target) {
                                if (ui.selected.targets.length == 0) {
                                    return target != player && target.inRange(player);
                                } else {
                                    return ui.selected.targets[0].inRange(target);
                                }
                            },
                            content() {
                                'step 0';
                                targets[0].chooseCard('交给' + get.translation(player) + '一张【杀】或武器牌,否则视为对' + get.translation(targets[1]) + '使用一张【杀】', 'he', function (card) {
                                    return card.name == 'sha' || get.subtype(card) == 'equip1';
                                }).ai = function (card) {
                                    var player = _status.event.player;
                                    var target = _status.event.getParent('止戈').targets[1];
                                    return get.effect(target, { name: 'sha' }, player, player) >= 0 ? -1 : 9 - get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    targets[0].give(result.cards, player, 'give');
                                    event.finish();
                                } else {
                                    var list = ['普通'];
                                    for (var j of lib.inpile_nature) {
                                        list.push(j);
                                    }
                                    player.chooseControl(list).set('prompt', '选择一种属性');
                                }
                                ('step 2');
                                if (result.index != 0) {
                                    if (targets[0].canUse('sha', targets[1])) targets[0].useCard({ name: 'sha', nature: result.control }, targets[1]);
                                } else {
                                    if (targets[0].canUse('sha', targets[1])) targets[0].useCard({ name: 'sha' }, targets[1]);
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        if (ui.selected.targets.length) {
                                            var from = ui.selected.targets[0];
                                            return get.effect(target, { name: 'sha' }, from, target);
                                        }
                                        var effs = [0, 0];
                                        game.countPlayer(function (current) {
                                            if (current != target && target.canUse('sha', current)) {
                                                var eff = get.effect(current, { name: 'sha' }, target, target);
                                                if (eff > effs[0]) effs[0] = eff;
                                                if (eff < effs[1]) effs[1] = eff;
                                            }
                                        });
                                        return effs[get.attitude(player, target) > 0 ? 0 : 1];
                                    },
                                },
                                order: 8.5,
                                expose: 0.2,
                            },
                        },
                        df_宗祚: {
                            trigger: {
                                global: 'gameDrawAfter',
                                player: 'enterGame',
                            },
                            forced: true,
                            _priority: 10,
                            audio: 'zongzuo',
                            content() {
                                'step 0';
                                var num = game.countGroup();
                                player.gainMaxHp(num);
                                player.draw(num);
                                event.num = num;
                                ('step 1');
                                event.players = get.players(player);
                                player.recover(event.num);
                            },
                            group: ['df_宗祚_lose', 'df_宗祚_turn'],
                            subSkill: {
                                turn: {
                                    trigger: {
                                        global: 'phaseBefore',
                                    },
                                    popup: false,
                                    forced: true,
                                    _priority: 10,
                                    audio: 'zongzuo',
                                    filter(event, player) {
                                        var ab = player.seatNum;
                                        return event.player != player;
                                    },
                                    content() {
                                        const evt = _status.event.getParent('phase');
                                        if (evt && evt.name) {
                                            evt.finish();
                                        }
                                    },
                                },
                                lose: {
                                    trigger: {
                                        global: 'dieAfter',
                                    },
                                    forced: true,
                                    audio: 'zongzuo',
                                    filter(event, player) {
                                        if (!lib.group.includes(event.player.group)) return false;
                                        if (
                                            game.hasPlayer(function (current) {
                                                return current.group == event.player.group;
                                            })
                                        ) {
                                            return false;
                                        }
                                        return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.loseMaxHp();
                                        ('step 1');
                                        player.draw(2);
                                    },
                                },
                            },
                        },
                        忠勇: {
                            init(player) {
                                player.storage.zy = 0;
                            },
                            audio: 'zhongyong',
                            forced: true,
                            trigger: {
                                global: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('是否发动【忠勇】,弃置一张牌？', 'he');
                                ('step 1');
                                if (result.bool) {
                                    player.storage.zy = 2;
                                    trigger.parent.baseDamage++;
                                }
                            },
                            group: ['忠勇_after'],
                            subSkill: {
                                after: {
                                    trigger: {
                                        global: 'useCardAfter',
                                    },
                                    audio: 2,
                                    forced: true,
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && player.storage.zy == 2;
                                    },
                                    content() {
                                        'step 0';
                                        player.storage.zy = 0;
                                        game.asyncDraw([trigger.player, player]);
                                        event.cards = trigger.cards.filterInD();
                                        if (!event.cards.length) event.finish();
                                        if (get.color(event.cards) == 'red') trigger.player.gain(event.cards, 'gain2');
                                    },
                                },
                            },
                        },
                        护彝: {
                            init(player) {
                                player.storage.hy = 0;
                            },
                            forced: true,
                            audio: 'ext:东方七宿/audio:2',
                            isHuyi(card) {
                                var info = lib.card[card.name];
                                if (!info || (info.type != 'trick' && info.type != 'delay')) return false;
                                if (info.notarget) return false;
                                if (info.selectTarget != undefined) {
                                    if (Array.isArray(info.selectTarget)) {
                                        if (info.selectTarget[0] < 0) return !info.toself;
                                        return info.selectTarget[0] != 1 || info.selectTarget[1] != 1;
                                    } else {
                                        if (info.selectTarget < 0) return !info.toself;
                                        return info.selectTarget != 1;
                                    }
                                }
                                return false;
                            },
                            trigger: {
                                global: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                if (event.player == player) return false;
                                if (!event.targets.includes(player)) return false;
                                return lib.skill.护彝.isHuyi(event.card) && event.target != player;
                            },
                            content() {
                                player.storage.hy = 2;
                                trigger.targets.remove(trigger.target);
                                trigger.parent.triggeredTargets1.remove(trigger.target);
                                trigger.untrigger();
                                trigger.targets.push(player);
                                trigger.player.line(player, 'green');
                                game.log(player, '代替', trigger.target, '成为了', trigger.card, '的目标');
                            },
                            group: ['护彝_after'],
                            subSkill: {
                                after: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    audio: '护彝',
                                    filter(event, player) {
                                        return event.card && lib.skill.护彝.isHuyi(event.card) && player.storage.hy == 2;
                                    },//QQQ
                                    content() {
                                        'step 0';
                                        player.storage.hy = 0;
                                        event.cards = trigger.cards.filterInD();
                                        if (!event.cards.length) event.finish();
                                        else player.gain(event.cards, 'gain2');
                                    },
                                },
                            },
                        },
                        血激: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                if (
                                    game.hasPlayer(function (current) {
                                        return player.canUse('sha', current, false) && current.maxHp <= player.maxHp - 1;
                                    })
                                ) {
                                    player.chooseTarget(true, '视为对一名体力上限不大于你的其他角色使用一张【杀】', function (card, player, target) {
                                        return player.canUse('sha', target, false) && target.maxHp <= player.maxHp;
                                    });
                                } else event.finish();
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    player.useCard({ name: 'sha' }, target, false);
                                } else event.finish();
                                ('step 2');
                                if (
                                    player.hasHistory('sourceDamage', function (evt) {
                                        var card = evt.card;
                                        if (!card || card.name != 'sha') return false;
                                        var evtx = evt.getParent('useCard');
                                        return evtx.card == card && evtx.parent == event;
                                    })
                                ) {
                                    var target = event.target;
                                    player.draw(2);
                                    if (target.maxHp == player.maxHp) player.gainMaxHp();
                                    if (target.hp >= player.hp) player.recover();
                                }
                            },
                        },
                        奔营: {
                            marktext: '奔',
                            trigger: {
                                player: 'phaseAfter',
                            },
                            filter(event, player) {
                                var count = 0;
                                if (player.getStat('damage') > 2) count++;
                                var list = [];
                                player.getHistory('useCard', function (evt) {
                                    evt.card.suit != 'none';
                                    list.add(evt.card.suit);
                                });
                                if (list.length > 3) count++;
                                if (player.getStat('kill')) count++;
                                return count > 1;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                            intro: {
                                content: '奔成#次.',
                            },
                            group: ['奔营_remove', '奔营_uc', '奔营_kill', '奔营_damage'],
                            subSkill: {
                                damage: {
                                    marktext: '伤',
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    filter(event, player) {
                                        return player == _status.currentPhase;
                                    },
                                    content() {
                                        player.addMark('奔营_damage', trigger.num);
                                    },
                                    intro: {
                                        content: '已造成的伤害数:$',
                                    },
                                },
                                kill: {
                                    marktext: '杀',
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    trigger: {
                                        source: 'dieAfter',
                                    },
                                    filter(event, player) {
                                        return player == _status.currentPhase;
                                    },
                                    content() {
                                        player.addMark('奔营_kill', 1);
                                    },
                                    intro: {
                                        content: '已击杀的角色数:$',
                                    },
                                },
                                uc: {
                                    marktext: '色',
                                    charlotte: true,
                                    popup: false,
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card.suit != 'none' && player == _status.currentPhase;
                                    },
                                    content() {
                                        player.markAuto('奔营_uc', [trigger.card.suit]);
                                    },
                                    intro: {
                                        content: '已使用的花色:$',
                                    },
                                },
                                remove: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    content() {
                                        player.unmarkSkill('奔营_uc');
                                        player.removeMark('奔营_kill', player.countMark('奔营_kill'));
                                        player.removeMark('奔营_damage', player.countMark('奔营_damage'));
                                    },
                                },
                            },
                        },
                        暴乱: {
                            marktext: '乱',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 5;
                            },
                            content() {
                                var num = player.countCards('h') - 5;
                                if (num > 0) player.chooseToDiscard('h', true, num);
                                if (num > player.hp) player.loseHp();
                                player.addMark('暴乱', num);
                            },
                            intro: {
                                content: '暴乱#次.',
                            },
                            group: ['暴乱_remove'],
                            subSkill: {
                                remove: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    content() {
                                        player.removeMark('暴乱', player.countMark('暴乱'));
                                    },
                                },
                            },
                        },
                        魔贱: {
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return player == _status.currentPhase && player.countMark('暴乱') > 0;
                            },
                            content() {
                                trigger.num = player.countMark('暴乱');
                                player.storage.moj = 2;
                            },
                            group: ['魔贱_after'],
                            subSkill: {
                                after: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    popup: false,
                                    filter(event, player) {
                                        return player.storage.moj && player.storage.moj == 2;
                                    },
                                    content() {
                                        var num = player.countMark('暴乱');
                                        player.storage.moj = 0;
                                        if (trigger.player.isAlive()) player.chooseToDiscard('he', true, num);
                                        else player.draw(num);
                                    },
                                },
                            },
                        },
                        国色: {
                            audio: 'guose',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('hes', { suit: 'diamond' }) > 0;
                            },
                            check(card) {
                                return 7 - get.value(card);
                            },
                            content() {
                                'step 0';
                                player.chooseCardTarget({
                                    prompt: '是否发动【国色】？请选择♦️️牌和目标',
                                    position: 'he',
                                    filterCard(card, player) {
                                        return card.suit == 'diamond';
                                    },
                                    selectCard: [1],
                                    filterTarget(card, player, target) {
                                        if (get.position(ui.selected.cards[0]) != 's' && lib.filter.cardDiscardable(ui.selected.cards[0], player, 'reguose') && target.hasJudge('lebu')) return true;
                                        if (player == target) return false;
                                        if (!game.checkMod(ui.selected.cards[0], player, 'unchanged', 'cardEnabled2', player)) return false;
                                        return player.canUse({ name: 'lebu', cards: ui.selected.cards }, target);
                                    },
                                });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    var cards = result.cards;
                                    if (target.hasJudge('lebu')) {
                                        player.discard(cards);
                                        target.discard(target.getJudge('lebu'));
                                    } else {
                                        player.useCard({ name: 'lebu' }, target, cards).audio = false;
                                    }
                                    player.draw();
                                    player.chooseBool('是否展示所有手牌？');
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.showHandcards(get.translation(player) + '发动了【国色】');
                                    var cards = player.getCards('h', { suit: 'diamond' });
                                    if (cards.length == 0) player.draw();
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        if (target.hasJudge('lebu')) return -get.effect(target, { name: 'lebu' }, player, target);
                                        return get.effect(target, { name: 'lebu' }, player, target);
                                    },
                                },
                                order: 9,
                            },
                        },
                        离间: {
                            audio: 'lijian',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return (
                                    game.countPlayer(function (current) {
                                        return current != player && current.hasSex('male');
                                    }) > 1
                                );
                            },
                            check(card) {
                                return 10 - get.value(card);
                            },
                            filterCard: true,
                            position: 'he',
                            filterTarget(card, player, target) {
                                if (player == target) return false;
                                if (!target.hasSex('male')) return false;
                                if (ui.selected.targets.length == 1) {
                                    return target.canUse({ name: 'juedou' }, ui.selected.targets[0]);
                                }
                                return true;
                            },
                            targetprompt: ['先出杀', '后出杀'],
                            selectTarget: 2,
                            multitarget: true,
                            content() {
                                'step 0';
                                targets[1].useCard({ name: 'juedou' }, 'nowuxie', targets[0], 'noai').animate = false;
                                ('step 1');
                                if (
                                    targets[0].hasHistory('sourceDamage', function (evt) {
                                        var card = evt.card;
                                        if (!card || card.name != 'juedou') return false;
                                        var evtx = evt.getParent('useCard');
                                        return evtx.card == card && evtx.parent == event;
                                    })
                                ) {
                                    event.damage = targets[1];
                                    event.source = targets[0];
                                } else {
                                    event.source = targets[1];
                                    event.damage = targets[0];
                                }
                                player.chooseBool('是否令获胜角色摸一张牌并弃置失败角色一张牌？');
                                ('step 2');
                                if (result.bool) {
                                    event.source.draw();
                                    player.discardPlayerCard(event.damage, 'he', true);
                                } else event.finish();
                            },
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target) {
                                        if (ui.selected.targets.length == 0) {
                                            return -3;
                                        } else {
                                            return get.effect(target, { name: 'juedou' }, ui.selected.targets[0], target);
                                        }
                                    },
                                },
                                expose: 0.4,
                                threaten: 3,
                            },
                        },
                        闭月: {
                            audio: 'biyue',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            preHidden: true,
                            content() {
                                if (player.isMinHandcard()) player.draw();
                                if (player.isMinEquip()) player.draw();
                                var count = 0;
                                var nh = player.countCards('j');
                                for (var i of game.players) {
                                    if (i.countCards('j') < nh) count++;
                                }
                                if (count == 0) player.draw();
                            },
                        },
                        燃伤: {
                            audio: 'ranshang',
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.nature == 'fire';
                            },
                            forced: true,
                            check() {
                                return false;
                            },
                            content() {
                                player.addMark('ranshang', trigger.num);
                            },
                            intro: {
                                name2: '燃',
                                content: 'mark',
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (card.name == 'sha') {
                                            if (card.nature == 'fire' || player.hasSkill('zhuque_skill')) return 2;
                                        }
                                        if (get.tag(card, 'fireDamage') && current < 0) return 2;
                                    },
                                },
                            },
                            group: '燃伤_ranshang2',
                            subSkill: {
                                ranshang2: {
                                    audio: 'ranshang',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('ranshang') > 0;
                                    },
                                    content() {
                                        player.loseHp(player.countMark('ranshang'));
                                        player.draw(player.countMark('ranshang'));
                                        if (player.countMark('ranshang') > 2) {
                                            player.loseMaxHp(2);
                                            player.draw(2);
                                        }
                                    },
                                },
                            },
                        },
                        神智: {
                            audio: 'ext:东方七宿/audio:1',
                            dutySkill: true,
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                'step 0';
                                player.discard(player.getCards('h'));
                                player.storage.sznum = player.getCards('h').length;
                            },
                            group: ['神智_achieve', '神智_fail'],
                            subSkill: {
                                achieve: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    lastDo: true,
                                    forced: true,
                                    filter(event, player) {
                                        return player.storage.sznum && player.storage.sznum >= player.hp;
                                    },
                                    content() {
                                        game.log(player, '成功完成使命');
                                        player.awakenSkill('神智');
                                        player.removeSkill('shushen');
                                        player.addSkillLog('淑慎改');
                                        player.gainMaxHp();
                                        player.recover();
                                    },
                                },
                                fail: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    lastDo: true,
                                    forced: true,
                                    filter(event, player) {
                                        return (player.storage.sznum && player.storage.sznum < player.hp) || player.storage.sznum == 0;
                                    },
                                    content() {
                                        game.log(player, '使命失败');
                                        player.awakenSkill('神智');
                                        player.addTempSkill('神智_f');
                                    },
                                },
                                f: {
                                    mark: true,
                                    mod: {
                                        maxHandcard(player, num) {
                                            return num - 1;
                                        },
                                    },
                                    intro: {
                                        content: '本回合手牌上限-1',
                                    },
                                },
                            },
                            derivation: '淑慎改',
                        },
                        淑慎改: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                player: 'recoverAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.count = Math.min(trigger.num, 9);
                                ('step 1');
                                player
                                    .chooseTarget(get.prompt('shushen'), '令一名其他角色选择摸四张牌并回复1点体力', function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(_status.event.player, target);
                                    });
                                ('step 2');
                                if (result.bool) {
                                    event.count--;
                                    result.targets[0].draw(4);
                                    result.targets[0].recover(1);
                                    if (event.count) event.goto(1);
                                }
                            },
                            ai: {
                                threaten: 0.8,
                                expose: 0.1,
                            },
                        },
                        踏虏: {
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            filter(event, player) {
                                if (event.player == event.target || event.targets.length != 1 || event.target.inRange(player) || event.target.countCards('h') < 1) return false;
                                var card = event.card;
                                if (card.name == 'sha') return true;
                                if (get.color(card) == 'black' && get.type(card, 'trick') == 'trick') return true;
                                return false;
                            },
                            content() {
                                player.gainPlayerCard(trigger.target, 'h', true);
                            },
                        },
                        囿驹: {
                            mod: {
                                cardSavable(card, player, target) {
                                    if (card.name == 'tao' && target != player) return false;
                                },
                                globalTo(from, to, distance) {
                                    return distance + 4;
                                },
                            },
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw(4);
                                ('step 1');
                                if (player.countCards('he', { type: 'equip' }) < 2) {
                                    player.loseHp(2);
                                    event.finish();
                                } else {
                                    var list = ['弃置装备', '失去体力'];
                                    player.chooseControl(list).set('prompt', '选择一项');
                                }
                                ('step 2');
                                if (result.index == 0) player.chooseToDiscard(true, 'he', { type: 'equip' }, 2);
                                else player.loseHp(2);
                            },
                        },
                        溃京: {
                            enable: 'chooseToUse',
                            mark: true,
                            limited: true,
                            init(player) {
                                player.storage.溃京 = false;
                            },
                            filter(event, player) {
                                if (player.storage.溃京) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('溃京');
                                player.storage.溃京 = true;
                                player.discard(player.getCards('hej'));
                                ('step 1');
                                player.link(false);
                                ('step 2');
                                player.turnOver(false);
                                ('step 3');
                                player.drawTo(player.maxHp);
                                ('step 4');
                                if (player.hp < player.maxHp) {
                                    player.hp = player.maxHp;
                                }
                                ('step 5');
                                while (!player.isEmpty(event.num)) {
                                    event.num++;
                                    if (event.num > 5) {
                                        event.finish();
                                        return;
                                    }
                                }
                                var card = get.cardPile(function (card) {
                                    return get.subtype(card) == 'equip' + event.num && player.canUse(card, player);
                                });
                                if (card) {
                                    player.chooseUseTarget(card, true, 'nopopup');
                                }
                                event.num++;
                                if (event.num <= 4) event.redo();
                                ('step 6');
                                player.clearSkills();
                                player.addSkill('囿驹');
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player, arg, target) {
                                    if (player != target || player.storage.溃京) return false;
                                },
                                save: true,
                                result: {
                                    player(player) {
                                        if (player.hp <= 0) return 10;
                                        if (player.hp <= 2 && player.countCards('he') <= 1) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.溃京) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        双雄: {
                            audio: 'shuangxiong',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            check(event, player) {
                                if (player.countCards('h') > player.hp) return true;
                                if (player.countCards('h') > 3) return true;
                                return false;
                            },
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            preHidden: true,
                            content() {
                                player.judge().set('callback', lib.skill.双雄.callback);
                            },
                            callback() {
                                player.gain(card, 'gain2');
                                player.addTempSkill('sx2');
                                player.storage.双雄 = event.judgeResult.color;
                            },
                        },
                        sx2: {
                            audio: 'shuangxiong',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                var player = _status.event.player;
                                var str = '将一张' + (player.storage.双雄 != 'red' ? '红' : '黑') + '色手牌当做【决斗】使用,将一张' + (player.storage.双雄 != 'red' ? '黑' : '红') + '色手牌当做【杀】使用';
                                return str;
                            },
                            viewAs(cards, player) {
                                var name = false;
                                switch (get.color(cards[0], player)) {
                                    case 'red': {
                                        name = player.storage.双雄 == 'red' ? 'sha' : 'juedou';
                                        break;
                                    }
                                    case 'black': {
                                        name = player.storage.双雄 == 'red' ? 'juedou' : 'sha';
                                        break;
                                    }
                                }
                                if (name) return { name: name };
                                return null;
                            },
                            position: 'hs',
                            filterCard(card, player, event) {
                                event = event || _status.event;
                                var filter = event._backup.filterCard;
                                var color = get.color(card, player);
                                var color1 = player.storage.双雄 == 'red' ? 'black' : 'red';
                                var color2 = player.storage.双雄 == 'red' ? 'red' : 'black';
                                if (color == color1 && filter({ name: 'juedou', cards: [card] }, player, event)) return true;
                                if (color == color2 && filter({ name: 'sha', cards: [card] }, player, event)) return true;
                                return false;
                            },
                            check(card) {
                                return 8 - get.value(card);
                            },
                            ai: {
                                basic: {
                                    order: 10,
                                    useful: 1,
                                    value: 5.5,
                                },
                                wuxie(target, card, player, viewer) {
                                    if (player == game.me && get.attitude(viewer, player) > 0) {
                                        return 0;
                                    }
                                },
                                result: {
                                    target: -1.5,
                                    player(player, target, card) {
                                        if (
                                            player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        ) {
                                            return 0;
                                        }
                                        if (get.damageEffect(target, player, target) > 0 && get.attitude(player, target) > 0 && get.attitude(target, player) > 0) {
                                            return 0;
                                        }
                                        var hs1 = target.getCards('h', 'sha');
                                        var hs2 = player.getCards('h', 'sha');
                                        if (hs1.length > hs2.length + 1) {
                                            return -2;
                                        }
                                        var hsx = target.getCards('h');
                                        if (hsx.length > 2 && hs2.length == 0 && hsx[0].number < 6) {
                                            return -2;
                                        }
                                        if (hsx.length > 3 && hs2.length == 0) {
                                            return -2;
                                        }
                                        if (hs1.length > hs2.length && (!hs2.length || hs1[0].number > hs2[0].number)) {
                                            return -2;
                                        }
                                        return -0.5;
                                    },
                                },
                                tag: {
                                    respond: 2,
                                    respondSha: 2,
                                    damage: 1,
                                },
                            },
                        },
                        义从: {
                            forced: true,
                            mod: {
                                globalFrom(from, to, current) {
                                    return current - 1;
                                },
                                globalTo(from, to, current) {
                                    return current + 1;
                                },
                            },
                            ai: {
                                threaten: 0.8,
                            },
                        },
                        咆哮: {
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            content() {
                                var cards = player.getCards('hej').filter((i) => get.type(i, 'trick') != 'basic');
                                player.discard(cards);
                                player.addTempSkill('咆哮_effect');
                            },
                            group: ['咆哮_effect'],
                            subSkill: {
                                effect: {
                                    mod: {
                                        targetInRange(card) {
                                            if (card.name == 'sha') return true;
                                        },
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return Infinity;
                                        },
                                    },
                                    forced: true,
                                    charlotte: true,
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha';
                                    },
                                    content() {
                                        player.draw();
                                    },
                                },
                            },
                        },
                        观星: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            content() {
                                'step 0';
                                var num = 3;
                                var cards = get.cards(num);
                                game.cardsGotoOrdering(cards);
                                var next = player.chooseToMove();
                                next.set('list', [['牌堆顶', cards], ['牌堆底']]);
                                next.set('prompt', '观星:点击将牌移动到牌堆顶或牌堆底');
                                next.processAI = function (list) {
                                    var cards = list[0][1],
                                        player = _status.event.player;
                                    const target = trigger.name == 'phaseZhunbei' ? player : player.next;
                                    const att = get.attitude(player, target);
                                    const top = [], bottom = cards;
                                    for (const i of target.getCards('j')) {
                                        const judge = get.judge(i);
                                        bottom.sort((a, b) => (judge(b) - judge(a)) * att); //态度大于0价值高的牌放前面
                                        if (bottom.length) {
                                            top.push(bottom.shift());
                                        }
                                    }
                                    bottom.sort((a, b) => (get.value(b) - get.value(a)) * att); //态度大于0价值高的牌放前面
                                    while (bottom.length) {
                                        top.push(bottom.shift());
                                    }
                                    return [top, bottom];
                                };
                                ('step 1');
                                var top = result.moved[0];
                                var bottom = result.moved[1];
                                top.reverse();
                                for (var i = 0; i < top.length; i++) {
                                    ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
                                }
                                for (var i = 0; i < bottom.length; i++) {
                                    ui.cardPile.appendChild(bottom[i]);
                                }
                                player.popup(get.cnNumber(top.length) + '上' + get.cnNumber(bottom.length) + '下');
                                game.log(player, '将' + get.cnNumber(top.length) + '张牌置于牌堆顶');
                                game.updateRoundNumber();
                            },
                            ai: {
                                threaten: 1.2,
                            },
                        },
                        空城: {
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (target.countCards('h') == 0) {
                                        if (card.name == 'sha' || card.name == 'juedou' || card.name == 'nanman') return false;
                                    }
                                },
                            },
                            group: 'kongcheng1',
                            audio: 'kongcheng1',
                            audioname: ['re_zhugeliang'],
                            ai: {
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh') {
                                        if (player.countCards('h') != 1) return false;
                                    }
                                },
                            },
                        },
                        承龙: {
                            enable: 'chooseToUse',
                            mark: true,
                            firstDo: true,
                            limited: true,
                            init(player) {
                                player.storage.承龙 = false;
                            },
                            filter(event, player) {
                                if (player.storage.承龙) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('承龙');
                                player.storage.承龙 = true;
                                ('step 1');
                                var cards = player.getCards('he');
                                if (cards.length) {
                                    player.loseToDiscardpile(cards);
                                    player.draw(cards.length);
                                }
                                ('step 2');
                                if (player.hp <= 0) {
                                    player.recover(1 - player.hp);
                                }
                                ('step 3');
                                player.reinit(player.name1, 'ol_jiangwei');
                                ('step 4');
                                player.addSkill('djs');
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player, arg, target) {
                                    if (player != target || player.storage.承龙) return false;
                                },
                                save: true,
                                result: {
                                    player(player) {
                                        if (player.hp <= 0) return 10;
                                        if (player.hp <= 2 && player.countCards('he') <= 1) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.承龙) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        djs: {
                            marktext: '寄',
                            init(player, skill) {
                                player.addMark('djs', 7);
                            },
                            forced: true,
                            charlotte: true,
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            content() {
                                'step 0';
                                player.removeMark('djs', 1);
                                ('step 1');
                                if (player.countMark('djs') < 1) player.die();
                            },
                            intro: {
                                name2: '寄',
                                content: '死亡倒数$个数!!!',
                            },
                        },
                        克己: {
                            trigger: {
                                player: 'phaseDiscardEnd',
                            },
                            filter(event, player) {
                                return event.cards && event.cards.length;
                            },
                            content() {
                                var cards = trigger.cards.filter((i) => i.name == 'sha');
                                player.draw(cards.length);
                            },
                        },
                        奠基: {
                            trigger: {
                                global: 'dying',
                            },
                            filter(event, player) {
                                return event.player != player;
                            },
                            content() {
                                player.loseHp();
                                trigger.player.recover();
                            },
                        },
                        涅槃: {
                            audio: 'ext:东方七宿/audio:2',
                            enable: 'chooseToUse',
                            mark: true,
                            limited: true,
                            init(player) {
                                player.storage.涅槃 = false;
                            },
                            filter(event, player) {
                                if (player.storage.涅槃) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('涅槃');
                                player.storage.涅槃 = true;
                                var cards = player.getCards('hej').filter((i) => i.suit == 'heart');
                                event.num = cards.length;
                                player.discard(player.getCards('hej'));
                                ('step 1');
                                player.link(false);
                                ('step 2');
                                player.turnOver(false);
                                ('step 3');
                                player.draw(3);
                                ('step 4');
                                if (player.hp < 3) {
                                    player.recover(3 - player.hp);
                                }
                                ('step 5');
                                var num = event.num;
                                if (num > 0) {
                                    player.chooseTarget(true, '选择' + num + '名角色', [0, num]);
                                }
                                ('step 6');
                                if (result.bool) {
                                    event.players = result.targets;
                                    if (event.players.length) {
                                        var current = event.players.shift();
                                        current.damage('fire');
                                        event.redo();
                                    }
                                }
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player, tag, target) {
                                    if (player != target || player.storage.涅槃) return false;
                                },
                                save: true,
                                result: {
                                    player(player) {
                                        if (player.hp <= 0) return 10;
                                        if (player.hp <= 2 && player.countCards('he') <= 1) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.涅槃) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        摧锋: {
                            trigger: {
                                player: ['phaseJudgeSkipped', 'phaseJudgeCancelled', 'phaseDrawSkipped', 'phaseDrawCancelled', 'phaseUseSkipped', 'phaseUseCancelled', 'phaseDiscardSkipped', 'phaseDiscardCancelled', 'phaseZhunbeiSkipped', 'phaseZhunbeiCancelled', 'phaseJieshuSkipped', 'phaseJieshuCancelled'],
                            },
                            content() {
                                'step 0';
                                player.judge('勤持', function (card) {
                                    return get.color(card) == 'black' ? 1.5 : -0.5;
                                }).judge2 = function (result) {
                                    return result.bool;
                                };
                                ('step 1');
                                if (result.judge > 0) {
                                    player.chooseUseTarget('请选择【杀】的目标', { name: 'sha' }, false, 'nodistance');
                                } else event.finish();
                            },
                        },
                        当先: {
                            usable: 1,
                            trigger: {
                                player: ['phaseDrawBefore'],
                            },
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                trigger.cancel(null, null, 'notrigger');
                                var next = player.phaseUse();
                                event.next.remove(next);
                                trigger.parent.next.unshift(next);
                                player.addTempSkill('当先_block', { player: 'phaseUseEnd' });
                                player.addTempSkill('当先_count');
                                player.addTempSkill('当先_draw');
                            },
                            subSkill: {
                                block: {
                                    forced: true,
                                    charlotte: true,
                                    popup: false,
                                    firstDo: true,
                                    _priority: null,
                                },
                                count: {
                                    marktext: '当先',
                                    charlotte: true,
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return true;
                                    },
                                    content() {
                                        player.markSkill('当先_count');
                                        player.addMark('当先_count', 1);
                                    },
                                    intro: {
                                        content: '使用了#张牌.',
                                    },
                                },
                                draw: {
                                    trigger: {
                                        player: ['phaseUseBefore'],
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return !player.hasSkill('当先_block');
                                    },
                                    content() {
                                        trigger.cancel(null, null, 'notrigger');
                                        var next = player.phaseDraw();
                                        event.next.remove(next);
                                        trigger.parent.next.unshift(next);
                                        player.addTempSkill('当先_d');
                                    },
                                },
                                d: {
                                    trigger: {
                                        player: 'phaseDrawBegin2',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return !event.numFixed;
                                    },
                                    content() {
                                        'step 0';
                                        trigger.num = player.countMark('当先_count');
                                    },
                                },
                            },
                        },
                        伏枥: {
                            audio: 'ext:东方七宿/audio:2',
                            limited: true,
                            enable: 'chooseToUse',
                            mark: true,
                            filter(event, player) {
                                if (event.type != 'dying') return false;
                                if (player != event.dying) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('伏枥');
                                event.num = game.countGroup();
                                player.recover(event.num - player.hp);
                                ('step 1');
                                player.draw(event.num);
                                ('step 2');
                                player.phase('nodelay');
                                player.addSkill('tuOr');
                                ('step 3');
                                const evt = _status.event.getParent('phase');
                                if (evt && evt.name) {
                                    evt.finish();
                                }
                            },
                            ai: {
                                save: true,
                                skillTagFilter(player, arg, target) {
                                    return player == target;
                                },
                                result: {
                                    player: 10,
                                },
                                threaten(player, target) {
                                    if (!target.storage.伏枥) return 0.9;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        tuOr: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                player.turnOver();
                                player.removeSkill('tuOr');
                            },
                        },
                        合身: {
                            mod: {
                                maxHandcardBase(player) {
                                    return Infinity;
                                },
                            },
                        },
                        离头: {
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('请选择弃置的牌', 'he', true);
                                ('step 1');
                                if (player.hp < player.maxHp) {
                                    player.hp = player.maxHp;
                                }
                            },
                        },
                        从一: {
                            trigger: {
                                source: 'damageBegin1',
                                player: ['drawBegin', 'recoverBefore', 'loseBefore', 'damageBegin1'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.name != 'lose' || (event.type == 'discard' && event.getParent(3).name != '从一');
                            },
                            content() {
                                if (trigger.name != 'lose') trigger.num = 1;
                                else if (trigger.type == 'discard') {
                                    trigger.cancel();
                                    game.log(trigger.getParent(3).name);
                                    player.chooseToDiscard('he');
                                }
                            },
                        },
                        纵兽: {
                            audio: 'ext:东方七宿/audio:2',
                            group: ['纵兽_she', '纵兽_ying', '纵兽_hu', '纵兽_xiang'],
                            subSkill: {
                                she: {
                                    audio: '纵兽',
                                    marktext: '🐍',
                                    trigger: {
                                        source: 'damageSource',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.source && event.source.hasMark('纵兽_she') && event.player.countCards('he') > 0;
                                    },
                                    content() {
                                        player.gainPlayerCard(trigger.player, 'he', true);
                                    },
                                    intro: {
                                        name: '蛇',
                                        content: '当你造成伤害后,你获得受伤角色一张牌.',
                                    },
                                },
                                ying: {
                                    audio: '纵兽',
                                    marktext: '🦅',
                                    mod: {
                                        targetInRange(card, player) {
                                            if (get.color(card) == 'red' && player.hasMark('纵兽_ying')) return true;
                                        },
                                    },
                                    intro: {
                                        name: '鹰',
                                        content: '你使用红色牌无距离限制.',
                                    },
                                },
                                hu: {
                                    audio: '纵兽',
                                    marktext: '🐅',
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.hasMark('纵兽_hu') && get.color(event.card) == 'black';
                                    },
                                    content() {
                                        trigger.num++;
                                    },
                                    intro: {
                                        name: '虎',
                                        content: '你使用黑色牌造成的伤害+1.',
                                    },
                                },
                                xiang: {
                                    audio: '纵兽',
                                    marktext: '🐘',
                                    trigger: {
                                        player: ['damageBegin4'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.hasMark('纵兽_xiang');
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                    intro: {
                                        name: '象',
                                        content: '当你受到伤害时,将伤害改为1点.',
                                    },
                                },
                            },
                            forced: true,
                            trigger: {
                                global: 'gameDrawAfter',
                                player: 'enterGame',
                            },
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                var list = ['she', 'ying', 'hu', 'xiang'];
                                for (var i = 0; i < list.length; i++) {
                                    if (!player.hasMark('纵兽_' + list[i])) player.addMark('纵兽_' + list[i]);
                                }
                            },
                            ai: {
                                threaten: 1.4,
                            },
                        },
                        兽踏: {
                            audio: 'ext:东方七宿/audio:2',
                            group: ['兽踏_die', '兽踏_gain'],
                            subSkill: {
                                die: {
                                    audio: '兽踏',
                                    forced: true,
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    filter(event, player) {
                                        var list = ['she', 'ying', 'hu', 'xiang'];
                                        var list1 = [];
                                        for (var i = 0; i < list.length; i++) {
                                            if (player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                        }
                                        return list1.length < 4;
                                    },
                                    content() {
                                        var list = ['she', 'ying', 'hu', 'xiang'];
                                        var list1 = [];
                                        for (var i = 0; i < list.length; i++) {
                                            if (player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                        }
                                        if (list1.length != 0) player.loseHp(4 - list1.length);
                                        else player.die();
                                    },
                                },
                                gain: {
                                    audio: '兽踏',
                                    forced: true,
                                    trigger: {
                                        global: 'dying',
                                    },
                                    filter(event, player) {
                                        var list = ['she', 'ying', 'hu', 'xiang'];
                                        var list1 = [];
                                        for (var i = 0; i < list.length; i++) {
                                            if (player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                        }
                                        return event.source == player && event.player != player;
                                    },
                                    content() {
                                        player.changeHujia(1);
                                        var list = ['she', 'ying', 'hu', 'xiang'];
                                        var list1 = [];
                                        var gain;
                                        for (var i = 0; i < list.length; i++) {
                                            if (!player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                        }
                                        if (list1.length) {
                                            gain = list1.randomGet();
                                            player.addMark('纵兽_' + gain, 1);
                                        }
                                    },
                                },
                            },
                            trigger: {
                                player: ['damageEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                var list = ['she', 'ying', 'hu', 'xiang'];
                                var list1 = [];
                                for (var i = 0; i < list.length; i++) {
                                    if (player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                }
                                return list1.length && event.nature == 'fire';
                            },
                            content() {
                                'step 0';
                                var list = ['she', 'ying', 'hu', 'xiang'];
                                var list1 = [];
                                var lose;
                                for (var i = 0; i < list.length; i++) {
                                    if (player.hasMark('纵兽_' + list[i])) list1.push(list[i]);
                                }
                                if (list1.length) {
                                    lose = list1.randomGet();
                                    player.removeMark('纵兽_' + lose, 1);
                                }
                            },
                        },
                        无双: {
                            shaRelated: true,
                            audio: 'wushuang',
                            forced: true,
                            group: ['rewushuang1', 'wushuang2'],
                            preHidden: ['rewushuang1', 'wushuang2'],
                        },
                        rewushuang1: {
                            audio: 'wushuang',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                trigger.parent.baseDamage++;
                                var id = trigger.target.playerid;
                                if (!trigger.parent.directHit.includes(trigger.target)) {
                                    var map = trigger.parent.customArgs;
                                    if (!map[id]) map[id] = {};
                                    if (typeof map[id].shanRequired == 'number') {
                                        map[id].shanRequired++;
                                    } else {
                                        map[id].shanRequired = 2;
                                    }
                                }
                            },
                            ai: {
                                directHit_ai: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.card.name != 'sha' || arg.target.countCards('h', 'shan') > 1) return false;
                                },
                            },
                        },
                        天音: {
                            mod: {
                                selectTarget(card, player, num) {
                                    if (card.name == 'sha' && _status.event.skill == '天音') num[1] = Infinity;
                                },
                                targetInRange(card, player, target) {
                                    if (_status.event.skill == '天音') return true;
                                },
                            },
                            mark: true,
                            init(player) {
                                player.markSkill('天音');
                            },
                            enable: ['chooseToUse', 'chooseToRespond'],
                            hiddenCard(player, name) {
                                return name == ui.cardPile.childNodes[0].name;
                            },
                            filter(event, player) {
                                if (event.filterCard && event.filterCard(ui.cardPile.childNodes[0], player, event)) return true;
                                return false;
                            },
                            precontent() {
                                var card = ui.cardPile.childNodes[0];
                                if (event.parent.name != 'chooseToRespond') player.$throw(card);
                            },
                            prompt() {
                                return '是否使用【' + get.translation(ui.cardPile.childNodes[0]) + '】？';
                            },
                            viewAs: () => ui.cardPile.childNodes[0],
                            filterCard() {
                                return false;
                            },
                            selectCard: -1,
                            intro: {
                                mark(dialog, content, player) {
                                    if (player.isUnderControl(true)) {
                                        var list = [];
                                        var num = Math.min(1, ui.cardPile.childElementCount);
                                        for (var i = 0; i < num; i++) {
                                            list.push(ui.cardPile.childNodes[i]);
                                        }
                                        dialog.addSmall(list);
                                    } else {
                                        var num = Math.min(1, ui.cardPile.childElementCount);
                                        dialog.addText('牌堆顶的' + num + '张牌');
                                    }
                                },
                                content(content, player) {
                                    if (player.isUnderControl(true)) {
                                        var list = [];
                                        var num = Math.min(1, ui.cardPile.childElementCount);
                                        for (var i = 0; i < num; i++) {
                                            list.push(ui.cardPile.childNodes[i]);
                                        }
                                        return get.translation(list);
                                    } else {
                                        var num = Math.min(1, ui.cardPile.childElementCount);
                                        return '牌堆顶的' + num + '张牌';
                                    }
                                },
                            },
                        },
                        轻盈: {
                            trigger: {
                                player: 'gainAfter',
                                global: 'loseAsyncAfter',
                            },
                            usable: 1,
                            check(event, player) {
                                return get.attitude(player, _status.currentPhase) > 0;
                            },
                            filter(event, player) {
                                if (event.getg(player).length == 0) return false;
                                return event.getParent(2).player == _status.currentPhase && event.getParent(2).player != player;
                            },
                            content() {
                                _status.currentPhase.draw();
                            },
                        },
                        仇涤: {
                            trigger: {
                                player: 'useCardAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && player.countUsed('sha') == player.countMark('砺刃');
                            },
                            content() {
                                player.drawTo(player.maxHp);
                            },
                        },
                        砺刃: {
                            marktext: '刃',
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return player.countMark('砺刃');
                                },
                            },
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('he') && !player.hasSkill('砺刃_sha');
                            },
                            filterCard: true,
                            position: 'he',
                            prepare(cards, player) {
                                player.$throw(cards, 1000);
                                game.log(player, '将', cards, '置入了弃牌堆');
                            },
                            discard: false,
                            loseTo: 'discardPile',
                            visible: true,
                            delay: 0.5,
                            content() {
                                'step 0';
                                player.draw();
                                player.addMark('砺刃', 1);
                                ('step 1');
                                var card = result[0];
                                if (card.name == 'sha' || get.subtype(card) == 'equip1') player.addTempSkill('砺刃_sha');
                            },
                            intro: {
                                name: '刃',
                                content: '本阶段你的出杀次数为#.',
                            },
                            group: '砺刃_remove',
                            subSkill: {
                                remove: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    content() {
                                        player.removeMark('砺刃', player.countMark('砺刃'));
                                    },
                                },
                                sha: {
                                    charlotte: true,
                                    popup: false,
                                },
                            },
                        },
                        狼威: {
                            trigger: {
                                player: ['eventNeutralized', 'shaMiss'],
                            },
                            filter(event, player) {
                                if (event.type != 'card') return false;
                                return event.getParent(2).name != '狼威';
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                var target = trigger.target;
                                player.useCard(trigger.card, false, target, '狼威');
                            },
                            group: '狼威_miss',
                            subSkill: {
                                miss: {
                                    trigger: {
                                        player: ['eventNeutralized', 'shaMiss'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.getParent(2).name == '狼威';
                                    },
                                    content() {
                                        player.draw(2);
                                        player.changeHujia(1);
                                    },
                                },
                            },
                        },
                        神子: {
                            trigger: {
                                player: 'dyingAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                player.gainMaxHp();
                                player.recover();
                            },
                        },
                        强袭: {
                            subSkill: {
                                off: {
                                },
                            },
                            audio: 'qiangxi',
                            enable: 'phaseUse',
                            filterCard(card, player) {
                                return get.subtype(card) == 'equip1';
                            },
                            selectCard() {
                                return [0, 1];
                            },
                            filterTarget(card, player, target) {
                                if (player == target) return false;
                                if (target.hasSkill('强袭_off')) return false;
                                return player.inRange(target);
                            },
                            content() {
                                'step 0';
                                if (cards.length == 0) {
                                    player.loseHp();
                                    event.one = 1;
                                } else event.one = 0;
                                ('step 1');
                                target.addTempSkill('强袭_off');
                                target.damage('nocard');
                                ('step 2');
                                if (event.one == 1 && player.hp == 1) {
                                    var t = target;
                                    player.chooseTarget('请选择' + get.translation(t) + '距离1以内的一名角色.', function (card, player, target) {
                                        return get.distance(t, target) <= 1;
                                    });
                                }
                                ('step 3');
                                if (result.bool) {
                                    if (result.targets[0] == player) player.changeHujia(1);
                                    else result.targets[0].damage('nocard');
                                }
                            },
                            check(card) {
                                return 10 - get.value(card);
                            },
                            position: 'he',
                            ai: {
                                order: 8.5,
                                result: {
                                    target(player, target) {
                                        if (!ui.selected.cards.length) {
                                            if (player.hp < 2) return 0;
                                            if (target.hp >= player.hp) return 0;
                                        }
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                            threaten: 1.5,
                        },
                        守邺: {
                            audio: 'shouye',
                            group: 'shouye_after',
                            trigger: {
                                target: 'useCardToTarget',
                            },
                            filter(event, player) {
                                return event.player != player && event.targets.length == 1;
                            },
                            check(event, player) {
                                if (event.player == game.me || event.player.isOnline()) return get.attitude(player, event.player) < 0;
                                return get.effect(player, event.card, event.player, player) < 0;
                            },
                            usable: 1,
                            logTarget: 'player',
                            content() {
                                'step 0';
                                player.line(trigger.player, 'green');
                                player.chooseToDuiben(trigger.player);
                                ('step 1');
                                if (result.bool) {
                                    trigger.targets.remove(player);
                                    player.changeHujia(1);
                                    trigger.parent.triggeredTargets2.remove(player);
                                    trigger.parent.shouyeer = player;
                                }
                            },
                            subSkill: {
                                after: {
                                    trigger: {
                                        global: 'useCardAfter',
                                    },
                                    forced: true,
                                    silent: true,
                                    popup: false,
                                    filter(event, player) {
                                        if (event.shouyeer != player) return false;
                                        if (event.cards) {
                                            if (Array.isArray(event.cards)) for (var i of event.cards) {
                                                if (i.isInPile()) return true;
                                            }
                                        }
                                        return false;
                                    },
                                    content() {
                                        var list = [];
                                        if (Array.isArray(trigger.cards)) for (var i of trigger.cards) {
                                            if (i.isInPile()) {
                                                list.push(i);
                                            }
                                        }
                                        player.gain(list, 'gain2', 'log');
                                    },
                                },
                            },
                        },
                        照月: {
                            mod: {
                                targetInRange(card, player, target, now) {
                                    var color = get.color(card);
                                    if (color == 'red' && player.hp <= 1) return true;
                                },
                            },
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player != player && get.color(event.card) == 'black' && player.hp <= 2;
                            },
                            content() {
                                trigger.cancel();
                            },
                            group: '照月_after',
                            subSkill: {
                                after: {
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    filter(event, player) {
                                        if (event.parent.name == '照月_after') return false;
                                        if (!event.targets || !event.card) return false;
                                        if (event.card && event.card.name == 'wuxie') return false;
                                        var suit = event.card.suit;
                                        if (suit != 'heart') return false;
                                        var card = game.createCard(event.card.name, event.card.suit, event.card.number, event.card.nature);
                                        var targets = event._targets || event.targets;
                                        for (var i = 0; i < targets.length; i++) {
                                            if (!targets[i].isIn()) return false;
                                            if (!player.canUse({ name: event.card.name }, targets[i], false, false)) {
                                                return false;
                                            }
                                        }
                                        return player.hp <= 1;
                                    },
                                    check(event, player) {
                                        if (event.card.name == 'tiesuo') return false;
                                        return true;
                                    },
                                    content() {
                                        var card = game.createCard(trigger.card.name, trigger.card.suit, trigger.card.number, trigger.card.nature);
                                        player.useCard(card, (trigger._targets || trigger.targets).slice(0));
                                    },
                                    ai: {
                                        threaten: 1.3,
                                    },
                                },
                            },
                        },
                        预政: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                global: 'useCardToTarget',
                            },
                            round: 1,
                            filter(event, player) {
                                if (player == event.target || player == event.player) return false;
                                if (event.targets.length > 1) return false;
                                if (!event.target) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                player.chooseControl('成为使用者', '成为目标').set('prompt', '预政:成为使用者或成为目标');
                                ('step 1');
                                if (result.control == '成为目标') {
                                    player.chooseControl();
                                    trigger.parent.targets.remove(trigger.target);
                                    trigger.parent.triggeredTargets2.remove(trigger.target);
                                    trigger.parent.targets.push(player);
                                    trigger.untrigger();
                                    trigger.player.line(player);
                                } else {
                                    trigger.parent.player = player;
                                    trigger.untrigger();
                                    player.line(trigger.target);
                                }
                            },
                            ai: {
                                threaten: 1.1,
                            },
                            group: ['预政_roundcount'],
                        },
                        托绶: {
                            trigger: {
                                player: 'phaseDrawBegin1',
                            },
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                'step 0';
                                trigger.changeToZero();
                                ('steo 1');
                                event.num = 0;
                                game.countPlayer(function (current) {
                                    if (current.countCards('h') > event.num) event.num = current.countCards('h');
                                });
                                player.drawTo(event.num);
                                player.addTempSkill('托绶_discard');
                            },
                            subSkill: {
                                discard: {
                                    trigger: {
                                        player: 'phaseDiscardBegin',
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        trigger.cancel();
                                        ('steo 1');
                                        event.num = 500;
                                        game.countPlayer(function (current) {
                                            if (current.countCards('h') < event.num) event.num = current.countCards('h');
                                        });
                                        var num = player.countCards('h');
                                        var num2 = event.num;
                                        if (num > num2) {
                                            player.chooseToDiscard(num - num2, true, 'h');
                                        }
                                    },
                                },
                            },
                        },
                        娇颜: {
                            trigger: {
                                global: 'chooseToCompareBegin',
                            },
                            filter(event, player) {
                                if (player == event.player) return true;
                                if (event.targets) return event.targets.includes(player);
                                return player == event.target;
                            },
                            logTarget(event, player) {
                                if (player != event.player) return event.player;
                                return event.targets || event.target;
                            },
                            prompt2(event, player) {
                                return '摸两张牌,用这两张牌的其中一张进行拼点.';
                            },
                            content() {
                                'step 0';
                                player.draw(2);
                                ('step 1');
                                player.chooseCard(true, (card) => result.includes(card));
                                ('step 2');
                                if (!trigger.fixedResult) trigger.fixedResult = {};
                                trigger.fixedResult[player.playerid] = result.cards[0];
                            },
                        },
                        明忌: {
                            trigger: {
                                global: 'useCardToBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.player != player && event.target != player) return false;
                                return event.player != event.target && event.player.countCards('h') > 0 && !event.player.hasSkillTag('noCompareTarget') && !player.hasSkillTag('noCompareSource');
                            },
                            content() {
                                'step 0';
                                if (trigger.player.canCompare(trigger.target)) trigger.player.chooseToCompare(trigger.target);
                                else event.finish();
                                ('step 1');
                                if (!result.bool) {
                                    game.log(trigger.player, '没赢.');
                                    game.log(trigger.card, '对', trigger.target, '失效.');
                                    trigger.cancel();
                                } else event.finish();
                            },
                        },
                        断流: {
                            trigger: {
                                source: 'damageBegin',
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            async content(event, trigger, player) {
                                const { result: { cards } } = player.chooseToDiscard('选择要弃置的牌', 'h', Math.max(Math.floor(player.countCards('h') / 2)))
                                    .set('ai', (c) => -get.attitude(player, trigger.player) - get.value(c));
                                if (cards?.length) {
                                    if (trigger.player == player) {
                                        trigger.num--;
                                    }
                                    else {
                                        trigger.num--;
                                    }
                                }
                            },
                        },
                        藏阴: {
                            marktext: '阴',
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            trigger: {
                                player: 'loseAfter',
                                global: 'loseAsyncAfter',
                            },
                            filter(event, player) {
                                //game.log(event.getParent(3));
                                return event.type == 'discard' && event.getParent(3).name != 'phaseDiscard' && event.getl(player).cards2.length;
                            },
                            content() {
                                'step 0';
                                player.addToExpansion(trigger.getl(player).cards2, 'gain2').gaintag.add('藏阴');
                                event.sex = player.sex;
                                ('step 1');
                                player.sex = event.sex == 'male' ? 'female' : 'male';
                                if (player.getExpansions('藏阴').length > player.countCards('h')) {
                                    event.cards = [player.getCards('h'), player.getExpansions('藏阴')];
                                    player.lose(event.cards[0], ui.ordering, 'visible');
                                    player.lose(event.cards[1], ui.ordering, 'visible');
                                    if (event.cards[1].length) player.gain(event.cards[1], 'gain2');
                                    if (event.cards[0].length) player.addToExpansion(event.cards[0], 'gain2').gaintag.add('藏阴');
                                    if (player.maxHp != 1) {
                                        player.loseMaxHp();
                                        player.changeHujia(1);
                                    } else if (player.hujia > 0) {
                                        player.changeHujia(-1);
                                        player.chooseTarget(true);
                                    } else event.finish();
                                }
                                ('step 2');
                                if (result.bool) result.targets[0].damage();
                                else event.finish();
                            },
                        },
                        斩龙: {},
                        垂乳: {
                            trigger: {
                                source: 'damageBegin',
                                player: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player && event.source && event.player.sex != event.source.sex && event.source.isDamaged();
                            },
                            content() {
                                trigger.source.recover();
                            },
                        },
                        斩鲸: {
                            mod: {
                                attackRange(player, num) {
                                    if (!player.getEquip(1)) return num + Infinity;
                                },
                            },
                        },
                        奔踏: {
                            marktext: '踏',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                var card = event.card;
                                if (card.name != 'sha') return false;
                                return game.hasPlayer(function (target) {
                                    return target.countCards('ej') > 0;
                                });
                            },
                            content() {
                                'step 0';
                                player.addMark('奔踏', 1);
                                player.chooseTarget(
                                    get.prompt2('奔踏'),
                                    function (card, player, target) {
                                        return target.countCards('ej') > 0;
                                    },
                                    true
                                );
                                ('step 1');
                                player.discardPlayerCard(result.targets[0], 'ej', true);
                                ('step 2');
                                if (result.cards[0].number == 13) {
                                    trigger.target.die().set('source', player);
                                    event.die = true;
                                }
                                if (result.cards[0].number == player.countMark('奔踏')) trigger.parent.directHit.push(trigger.target);
                                ('step 3');
                                if (event.die && event.die == true) {
                                    player.removeSkillLog('斩鲸');
                                    player.removeSkillLog('奔踏');
                                }
                            },
                            intro: {
                                content: '奔踏已发动次数:$.',
                            },
                        },
                        授道: {
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return event.player != player && event.player.countCards('h') < event.player.maxHp;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) >= 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                if (trigger.player != player) {
                                    player.chooseCard(true, 'he', '授道:交给' + get.translation(trigger.player) + '一张牌？').set('ai', function (card) {
                                        if (get.position(card) == 'e') return -1;
                                        if (card.name == 'shan' && get.attitude(player, trigger.player) > 0) return 1;
                                        if (get.type(card) == 'equip' && get.attitude(player, trigger.player) > 0) return 0.5;
                                        if (card.name == 'du' && get.attitude(player, trigger.player) < 0) return 5;
                                        return 0;
                                    });
                                }
                                ('step 1');
                                var cards = get.cards(ui.cardPile.childElementCount + 1);
                                if (Array.isArray(cards)) for (var i of cards) {
                                    ui.cardPile.insertBefore(i, ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
                                }
                                game.updateRoundNumber();
                                if (result.bool) {
                                    trigger.player.gain(result.cards, player, 'give');
                                    event.card = result.cards[0];
                                } else event.finish();
                                ('step 2');
                                if (trigger.player.getCards('h').includes(card) && get.type(card) == 'equip') trigger.player.chooseUseTarget(card);
                            },
                        },
                        神影: {
                            forceDie: true,
                            enable: 'phaseUse',
                            audio: 'ext:东方七宿/audio:2',
                            derivation: ['天音', '残梦'],
                            filterCard(card, player) {
                                if (ui.selected.cards.length == 0) return true;
                                var suit = card.suit;
                                if (Array.isArray(ui.selected.cards)) for (var i of ui.selected.cards) {
                                    if (i.suit == suit) return false;
                                }
                                return true;
                            },
                            position: 'h',
                            complexCard: true,
                            limited: true,
                            selectCard(player) {
                                var player = _status.event.player;
                                return Math.min(ui.selected.cards.length + 1, player.storage.shuffled);
                            },
                            line: 'fire',
                            check() {
                                return -1;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('神影');
                                player.changeHujia(2);
                                ('step 1');
                                if (player.hp < player.maxHp) {
                                    player.hp = player.maxHp;
                                }
                                ('step 2');
                                player.removeSkill('授道');
                                player.addSkillLog('天音');
                                player.addSkillLog('残梦');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage.shuffled = 4;
                                player.storage[skill] = false;
                            },
                            group: '神影_effect',
                            subSkill: {
                                effect: {
                                    trigger: {
                                        global: 'washCard',
                                    },
                                    forced: true,
                                    silent: true,
                                    charlotte: true,
                                    content() {
                                        player.storage.shuffled = 0;
                                        player.removeSkill('神影_effect');
                                    },
                                    popup: false,
                                },
                            },
                        },
                        残梦: {
                            forceDie: true,
                            trigger: {
                                global: 'washCard',
                            },
                            audio: 'ext:东方七宿/audio:2',
                            limited: true,
                            line: 'fire',
                            filterTarget: true,
                            check() {
                                return -1;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('残梦');
                                player.chooseTarget(true);
                                ('step 1');
                                target = result.targets[0];
                                event.target = target;
                                target.storage.sf = game.shuffleNumber;
                                ('step 2');
                                target.gainMaxHp();
                                target.addSkill('残梦_effect');
                                ('step 3');
                                if (target != player) target.addSkill('残梦_tianyin');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                            subSkill: {
                                tianyin: {
                                    forced: true,
                                    silent: true,
                                    charlotte: true,
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    content() {
                                        player.addTempSkill('天音', 'phaseUseEnd');
                                    },
                                    popup: false,
                                },
                                effect: {
                                    trigger: {
                                        global: 'washCard',
                                    },
                                    forced: true,
                                    silent: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return game.shuffleNumber != player.storage.sf;
                                    },
                                    content() {
                                        player.loseMaxHp();
                                        if (player.hasSkill('残梦_tianyin')) player.removeSkill('残梦_tianyin');
                                        player.removeSkill('残梦_effect');
                                        delete player.storage.sf;
                                    },
                                    popup: false,
                                },
                            },
                        },
                        离逝: {
                            trigger: {
                                global: 'phaseDrawBegin1',
                            },
                            round: 1,
                            filter(event, player) {
                                return event.player != player && !event.numFixed && player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                trigger.player.gainPlayerCard(player, 'he', true);
                                ('step 1');
                                trigger.changeToZero();
                                trigger.player.damage('nocard');
                                ('step 2');
                                if (!trigger.player.isAlive()) {
                                    player.unmarkSkill('离逝_roundcount');
                                    delete player.storage.离逝_roundcount;
                                } else {
                                    event.finish();
                                }
                            },
                            group: ['离逝_roundcount'],
                        },
                        突骑: {
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            filter(event, player) {
                                if (event.player == event.target || event.target.inRange(player)) return false;
                                var card = event.card;
                                if (card.name == 'sha') return true;
                                return false;
                            },
                            content() {
                                trigger.parent.directHit.push(trigger.target);
                            },
                        },
                        领威: {
                            enable: 'phaseUse',
                            audio: 'ext:东方七宿/audio:2',
                            limited: true,
                            line: 'fire',
                            filterTarget: true,
                            selectTarget() {
                                return [1, game.players.length];
                            },
                            multitarget: true,
                            multiline: true,
                            check() {
                                return -1;
                            },
                            content() {
                                event.players = targets;
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    current.draw();
                                    if (current.sex == 'female') current.addSkillLog('义从');
                                    event.redo();
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        血佑: {
                            trigger: {
                                global: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return game.hasPlayer((current) => player.inRange(current) && current.hp > event.player.hp);
                            },
                            content() {
                                'step 0';
                                player.addTempSkill('血佑_count');
                                player.loseMaxHp();
                                player.chooseTarget(function (card, player, target) {
                                    return player.inRange(target) && target.hp > trigger.player.hp;
                                }, true);
                                ('step 1');
                                var list = ['令' + get.translation(trigger.player) + '获得【无双】.', '弃置两张牌.'];
                                player.storage.xyt = result.targets[0];
                                event.target = result.targets[0];
                                result.targets[0].chooseControl(list).set('prompt', '选择一项').ai = function (event, player) {
                                    if (get.attitude(trigger.player, result.targets[0]) > 0) return 0;
                                    return 1;
                                };
                                ('step 2');
                                if (result.index == 0) {
                                    trigger.player.addTempSkill('wushuang');
                                } else event.target.chooseToDiscard('he', true, 2);
                            },
                            group: '血佑_gain',
                            subSkill: {
                                gain: {
                                    trigger: {
                                        global: 'phaseUseEnd',
                                    },
                                    filter(event, player) {
                                        return player.storage.marr && player.storage.marr > player.storage.xyt.hp;
                                    },
                                    content() {
                                        player.gainMaxHp();
                                        player.recover();
                                    },
                                    forced: true,
                                },
                                count: {
                                    trigger: {
                                        global: ['loseAfter', 'cardsDiscardAfter', 'loseAsyncAfter', 'equipAfter'],
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        var cards = event.getd();
                                        if (!cards.length) return false;
                                        return true;
                                    },
                                    content() {
                                        var cards = trigger.getd();
                                        var num = cards.length;
                                        if (!player.storage.marr) player.storage.marr = 0;
                                        player.storage.marr += num;
                                        player.markSkill('血佑_count');
                                    },
                                    onremove(player) {
                                        delete player.storage.marr;
                                    },
                                    intro: {
                                        content(s, p) {
                                            var str = '<br>本回合进入过弃牌堆的牌数:';
                                            str += p.storage.marr;
                                            return str;
                                        },
                                    },
                                },
                            },
                        },
                        孤煞: {
                            audio: 'ext:东方七宿/audio:2',
                            juexingji: true,
                            keepSkill: true,
                            derivation: ['崩坏'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isMinHp();
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('孤煞');
                                player.gainMaxHp();
                                player.addSkill('崩坏');
                            },
                        },
                        崩坏: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            check() {
                                return false;
                            },
                            filter(event, player) {
                                return !player.isMaxHp();
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseControl('回复体力', '增加上限', function (event, player) {
                                        if (player.hp == player.maxHp) return '增加上限';
                                        return '回复体力';
                                    })
                                    .set('prompt', '崩坏:回复1点体力或增加1点体力上限');
                                ('step 1');
                                if (result.control == '回复体力') {
                                    player.recover();
                                } else {
                                    player.gainMaxHp(true);
                                }
                            },
                            ai: {
                                threaten: 0.5,
                                neg: true,
                            },
                        },
                        连珠: {
                            audio: 'ext:东方七宿/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            position: 'he',
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            check(card) {
                                var num = get.value(card);
                                if (get.color(card) == 'black') {
                                    if (num >= 6) return 0;
                                    return 20 - num;
                                } else {
                                    if (_status.event.player.needsToDiscard()) {
                                        return 7 - num;
                                    }
                                }
                                return 0;
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            content() {
                                'step 0';
                                player.give(cards, target);
                                if (get.color(cards[0]) == 'black') {
                                    target
                                        .chooseToDiscard(2, 'he', '弃置两张牌,或令' + get.translation(player) + '摸两张牌')
                                        .set('ai', function (card) {
                                            if (_status.event.goon) return 7 - get.value(card);
                                            return 0;
                                        })
                                        .set('goon', get.attitude(target, player) < 0);
                                } else {
                                    player.draw();
                                }
                                ('step 1');
                                if (!result.bool) {
                                    player.draw(2);
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 0.2,
                                result: {
                                    target(player, target) {
                                        if (ui.selected.cards.length && get.color(ui.selected.cards[0]) == 'red') {
                                            if (target.countCards('h') < player.countCards('h')) return 1;
                                            return 0.5;
                                        }
                                        return -1;
                                    },
                                },
                            },
                        },
                        黠慧: {
                            mod: {
                                ignoredHandcard(card, player) {
                                    if (get.color(card) == 'black') {
                                        return true;
                                    }
                                },
                                cardDiscardable(card, player, name) {
                                    if (name == 'phaseDiscard' && get.color(card) == 'black') return false;
                                },
                            },
                            trigger: {
                                global: 'gainAfter',
                                player: 'loseAsyncAfter',
                            },
                            forced: true,
                            popup: false,
                            filter(event, player) {
                                if (event.name == 'loseAsync') {
                                    if (event.type != 'gain') return false;
                                    var hs = current.getCards('h'),
                                        cards = event.getl(player).cards2;
                                    return game.hasPlayer(function (current) {
                                        if (current == player) return false;
                                        var cardsx = event.getg(current);
                                        for (var i of cardsx) {
                                            if (cards.includes(i) && hs.includes(card) && cards.includes(card) && get.color(card, player) == 'black') return true;
                                        }
                                        return false;
                                    });
                                }
                                if (event.player != player) {
                                    var hs = event.player.getCards('h');
                                    var evt = event.getl(player);
                                    return (
                                        evt &&
                                        evt.cards2 &&
                                        evt.cards2.filter(function (card) {
                                            return hs.includes(card) && get.color(card, player) == 'black';
                                        }).length
                                    );
                                }
                                return false;
                            },
                            content() {
                                var cards = trigger.getl(player).cards2;
                                game.countPlayer(function (current) {
                                    if (current == player) return;
                                    var hs = current.getCards('h'),
                                        cardsx = trigger.getg(current).filter(function (card) {
                                            return hs.includes(card) && cards.includes(card) && get.color(card, player) == 'black';
                                        });
                                    if (cardsx.length) {
                                        current.addSkill('xiehui2');
                                        current.addGaintag(cards, 'xiehui');
                                    }
                                });
                            },
                            group: ['黠慧_gain', 'xiehuig'],
                            subSkill: {
                                gain: {
                                    trigger: {
                                        global: 'gameDrawAfter',
                                        player: 'enterGame',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        player.changeHujia(
                                            game.findPlayer(function (current) {
                                                return current.isMaxHp();
                                            }).hp
                                        );
                                    },
                                },
                            },
                        },
                        xiehuig: {
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            charlotte: true,
                            filter(event, player) {
                                return (
                                    event.player.getHistory('lose', function (evt) {
                                        for (var i in evt.gaintag_map) {
                                            if (evt.gaintag_map[i].includes('xiehui')) return true;
                                        }
                                    }).length &&
                                    event.player.getCards('h', function (card) {
                                        return card.hasGaintag('xiehui');
                                    }).length < 1
                                );
                            },
                            content() {
                                trigger.player.loseHp();
                            },
                        },
                        恶泉: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                global: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player == _status.currentPhase && event.player.isIn();
                            },
                            logTarget: 'player',
                            content() {
                                trigger.player.addMark('equan', trigger.num, false);
                            },
                            group: ['equan_block', '恶泉_lose'],
                            marktext: '毒',
                            intro: {
                                name: '恶泉(毒)',
                                name2: '毒',
                            },
                            subSkill: {
                                lose: {
                                    audio: 'equan',
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return game.hasPlayer(function (current) {
                                            return current.hasMark('equan');
                                        });
                                    },
                                    logTarget() {
                                        return game.filterPlayer(function (current) {
                                            return current.hasMark('equan');
                                        });
                                    },
                                    content() {
                                        game.countPlayer(function (current) {
                                            var num = current.countMark('equan');
                                            if (num > 0) {
                                                current.chooseToDiscard('he', true);
                                                current.loseHp(num);
                                                current.removeMark('equan', num);
                                            }
                                        });
                                    },
                                },
                                block: {
                                    trigger: {
                                        global: 'dyingBegin',
                                    },
                                    forced: true,
                                    logTarget: 'player',
                                    filter(event, player) {
                                        var evt = event.getParent(2);
                                        return evt.name == 'equan_lose' && evt.player == player;
                                    },
                                    content() {
                                        trigger.player.addTempSkill('baiban');
                                    },
                                },
                            },
                        },
                        蛮汲: {
                            audio: 'ext:东方七宿/audio:2',
                            trigger: {
                                global: 'loseHpAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != event.player && (player.hp >= event.player.hp || player.isDamaged());
                            },
                            logTarget: 'player',
                            content() {
                                if (player.hp <= trigger.player.hp) player.recover();
                                if (player.hp >= trigger.player.hp) player.draw();
                            },
                        },
                        真仪: {
                            group: ['zheyisp', 'zhenyi_club', 'zhenyi_heart'],
                            trigger: {
                                player: 'damageEnd',
                            },
                            audio: 'ext:东方七宿/audio:2',
                            filter(event, player) {
                                if (!event.nature) return false;
                                return player.hasMark('xinfu_falu_diamond');
                            },
                            prompt2: '弃置「勾陈♦️️」标记,从牌堆中获得每种类型的牌各一张.',
                            content() {
                                'step 0';
                                player.removeMark('xinfu_falu_diamond');
                                event.num = 0;
                                event.togain = [];
                                ('step 1');
                                var card = get.cardPile(function (card) {
                                    for (var i = 0; i < event.togain.length; i++) {
                                        if (get.type(card, 'trick') == get.type(event.togain[i], 'trick')) return false;
                                    }
                                    return true;
                                });
                                if (card) {
                                    event.togain.push(card);
                                    event.num++;
                                    if (event.num < 3) event.redo();
                                }
                                ('step 2');
                                if (event.togain.length) {
                                    player.gain(event.togain, 'gain2');
                                }
                            },
                        },
                        zheyisp: {
                            trigger: {
                                global: 'judge',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hasMark('xinfu_falu_spade');
                            },
                            content() {
                                'step 0';
                                var str = get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',是否发动【真仪】,弃置「紫薇♠️️」标记并修改判定结果？';
                                var card = trigger.player.judging[0];
                                var judge0 = trigger.judge(card);
                                var judge1 = 0;
                                var choice = 'cancel2';
                                event.suitchoice = 'cancel2';
                                var attitude = get.attitude(player, trigger.player);
                                var list = [];
                                event.suitx = ['heart', 'diamond', 'club', 'spade'];
                                var list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].map((i) => get.strNumber(i));
                                list.push('cancel2');
                                event.suitx.push('cancel2');
                                player
                                    .chooseControl(list)
                                    .set('prompt', str)
                                    .set('ai', function () {
                                        return _status.event.choice;
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    if (player.hasMark('xinfu_falu_spade')) player.removeMark('xinfu_falu_spade');
                                    game.log(trigger.player, '判定结果点数为', '#g' + result.control);
                                    player.popup(result.control, 'fire');
                                    if (!trigger.fixedResult) trigger.fixedResult = {};
                                    trigger.fixedResult.number = result.control;
                                }
                                var str = get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',是否发动【真仪】,弃置「紫薇♠️️」标记并修改判定结果？';
                                player
                                    .chooseControl(event.suitx)
                                    .set('ai', function () {
                                        return _status.event.choice;
                                    })
                                    .set('prompt', str);
                                ('step 2');
                                if (result.control != 'cancel2') {
                                    if (player.hasMark('xinfu_falu_spade')) player.removeMark('xinfu_falu_spade');
                                    game.log(trigger.player, '判定结果花色为', '#g' + result.control);
                                    player.popup(result.control, 'fire');
                                    if (!trigger.fixedResult) trigger.fixedResult = {};
                                    trigger.fixedResult.suit = result.control;
                                    if (result.control == 'club' || result.control == 'spade') {
                                        trigger.fixedResult.color = 'black';
                                    } else if (result.control == 'heart' || result.control == 'diamond') {
                                        trigger.fixedResult.color = 'red';
                                    }
                                }
                            },
                            ai: {
                                rejudge: true,
                                tag: {
                                    rejudge: 1,
                                },
                                expose: 0.5,
                            },
                        },
                        洗牌: {
                            enable: 'phaseUse',
                            content() {
                                var cards = get.cards(ui.cardPile.childElementCount + 1);
                                if (Array.isArray(cards)) for (var i of cards) {
                                    ui.cardPile.insertBefore(i, ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
                                }
                                game.updateRoundNumber();
                            },
                        },
                        qiangman: {
                            init(player) {
                                player.storage.count2 = 0;
                            },
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            filter(event, player) {
                                return player != _status.currentPhase && get.itemtype(event.cards) == 'cards' && player.storage.count2 == 1;
                            },
                            content() {
                                player.draw();
                                player.chooseUseTarget({ name: 'sha' }, true, false, 'nodistance');
                                player.loseHp();
                            },
                            group: ['qiangman_count', 'qiangman_chushihua'],
                            subSkill: {
                                count: {
                                    firstDo: true,
                                    charlotte: true,
                                    silent: true,
                                    popup: false,
                                    trigger: {
                                        player: ['useCard', 'respond'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player != _status.currentPhase && get.itemtype(event.cards) == 'cards';
                                    },
                                    content() {
                                        player.storage.count2++;
                                    },
                                },
                                chushihua: {
                                    charlotte: true,
                                    forced: true,
                                    silent: true,
                                    popup: false,
                                    trigger: {
                                        global: 'phaseBegin',
                                    },
                                    content() {
                                        player.storage.count2 = 0;
                                    },
                                },
                            },
                        },
                        juman: {
                            init(player) {
                                player.storage.count = 0;
                            },
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            forced: true,
                            filter(event, player) {
                                return get.itemtype(event.cards) == 'cards' && player.storage.count == 2;
                            },
                            content() {
                                if (get.type(trigger.card) == 'basic') player.draw();
                            },
                            group: ['juman_count', 'juman_chushihua'],
                            subSkill: {
                                count: {
                                    firstDo: true,
                                    charlotte: true,
                                    silent: true,
                                    popup: false,
                                    trigger: {
                                        player: ['useCard', 'respond'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return get.itemtype(event.cards) == 'cards';
                                    },
                                    content() {
                                        player.storage.count++;
                                    },
                                },
                                chushihua: {
                                    charlotte: true,
                                    forced: true,
                                    silent: true,
                                    popup: false,
                                    trigger: {
                                        global: 'phaseBegin',
                                    },
                                    content() {
                                        player.storage.count = 0;
                                    },
                                },
                            },
                        },
                        山影: {
                            group: ['shanying2'],
                            global: 'shanying',
                        },
                        缭影: {
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(
                                    get.prompt('缭影'),
                                    '视为对一名其他角色使用一张【杀】',
                                    function (card, player, target) {
                                        return player.canUse('sha', target, false);
                                    },
                                    [1, game.players.length - 1]
                                );
                                ('step 1');
                                if (result.bool) event.players = result.targets;
                                else event.finish();
                                ('step 2');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    player.useCard({ name: 'sha' }, current, false).oncard = function (card, player) { };
                                    event.redo();
                                }
                                ('step 3');
                                player.unmarkSkill('缭影_count');
                            },
                            group: '缭影_count',
                            subSkill: {
                                count: {
                                    marktext: '缭影',
                                    forced: true,
                                    popup: false,
                                    silent: true,
                                    trigger: {
                                        global: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        var evt = event.getParent(3);
                                        return evt && evt.name == '缭影' && evt.player == player;
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseToDiscard((card, player) => !player.getStorage('缭影_count').includes(card.suit));
                                        ('step 1');
                                        if (result.bool) {
                                            player.markAuto('缭影_count', [result.cards[0].suit]);
                                            game.log(player.storage.缭影_count);
                                        } else trigger.cancel();
                                    },
                                    intro: {
                                        content: '已弃置的花色:$',
                                    },
                                },
                            },
                        },
                        千激: {
                            enable: 'phaseUse',
                            audio: 'ext:东方七宿/audio:2',
                            limited: true,
                            filter(event, player, card) {
                                return player.countDisabled() > 0;
                            },
                            check() {
                                return -1;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('千激');
                                ('step 1');
                                var num = player.countDisabled();
                                if (num > 0) {
                                    for (var i = 1; i < 6; i++) {
                                        if (player.isDisabled(i)) player.enableEquip(i);
                                    }
                                }
                                player.draw(num);
                                event.players = get.players(player);
                                ('step 2');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    current.storage.qianji = true;
                                    event.redo();
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        shanying: {
                            filter(event, player, card) {
                                var name;
                                if (!player.storage.qianji) name = 'shan';
                                if (player.storage.qianji) name = 'sha';
                                var card = { name: name };
                                if (!event.filterCard || !event.filterCard(card, player, event)) return false;
                                return game.hasPlayer((current) => current.hasSkill('山影') && get.distance(player, current) > 1 && current.countDisabled() < 5) && !player.hasSkill('shanying2_count');
                            },
                            enable: ['chooseToUse', 'chooseToRespond'],
                            viewAs(cards, player) {
                                if (!player.storage.qianji) return { name: 'shan' };
                                else return { name: 'sha' };
                            },
                            filterCard() {
                                return false;
                            },
                            selectCard: -1,
                            ai: {
                                order() {
                                    return get.order({ name: 'sha' }) + 0.3;
                                },
                                respondSha: true,
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                        },
                        shanying2: {
                            trigger: {
                                global: ['useCardBegin', 'respondBegin'],
                            },
                            logTarget: 'targets',
                            filter(event, player) {
                                return event.skill == 'shanying';
                            },
                            forced: true,
                            content() {
                                'step 0';
                                delete trigger.skill;
                                trigger.parent.set('shanying', true);
                                ('step 1');
                                var list = game.filterPlayer(function (current) {
                                    return current.hasSkill('山影');
                                });
                                event.target = list[0];
                                var list = [];
                                var cards = player.getCards('e');
                                for (var i of cards) list.push(get.subtype(i));
                                event.list = list;
                                var list2 = [];
                                for (var i = 1; i < 6; i++) {
                                    if (player.isDisabled(i)) continue;
                                    list2.push('equip' + i);
                                }
                                list2.push('cancel2');
                                var name;
                                if (!player.storage.qianji) name = 'shan';
                                if (player.storage.qianji) name = 'sha';
                                player.chooseControl(list2).set('prompt', '是否废除一个装备栏,令' + get.translation(trigger.player) + '使用或打出【' + get.translation(name) + '】？');
                                ('step 2');
                                if (result.control != 'cancel2') {
                                    trigger.player.addTempSkill('shanying2_count');
                                    if (event.list.includes(result.control)) player.draw(2);
                                    player.disableEquip(result.control);
                                    event.finish();
                                    if (!player.storage.qianji) trigger.card.name = 'shan';
                                    else trigger.card.name = 'sha';
                                    trigger.throw = false;
                                } else {
                                    trigger.player.addTempSkill('shanying2_count');
                                    event.finish();
                                    trigger.cancel();
                                    trigger.parent.goto(0);
                                }
                            },
                            subSkill: {
                                count: {
                                    mark: true,
                                    firstDo: true,
                                    charlotte: true,
                                    intro: {
                                        content: '本回合已发动.',
                                    },
                                },
                            },
                        },
                        裸衣: {
                            audio: 'reluoyi',
                            trigger: {
                                player: 'phaseDrawEnd',
                            },
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                'step 0';
                                var cards = get.cards(player.getDamagedHp());
                                game.cardsGotoOrdering(cards);
                                player.showCards(cards, '裸衣');
                                var cardsx = [];
                                if (Array.isArray(cards)) for (var i of cards) {
                                    if (get.type(i) == 'basic' || i.name == 'juedou' || (get.type(i) == 'equip' && get.subtype(i) == 'equip1')) {
                                        cardsx.push(i);
                                    }
                                }
                                event.cards = cardsx;
                                ('step 1');
                                if (cards.length) player.gain(cards, 'gain2');
                                player.addTempSkill('reluoyi2', { player: 'phaseBefore' });
                            },
                        },
                        dfqx_shenzhi: {
                            audio: 'ext:东方七宿/audio:1',
                            dutySkill: true,
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                'step 0';
                                player.discard(player.getCards('h'));
                                player.storage.shznum = player.getCards('h').length;
                            },
                            derivation: ['dfqx_shenzhi_achieve', 'dfqx_shenzhi_fail'],
                            group: ['dfqx_shenzhi_achieve', 'dfqx_shenzhi_fail'],
                            subSkill: {
                                achieve: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    lastDo: true,
                                    forced: true,
                                    filter(event, player) {
                                        return player.storage.shznum && player.storage.shznum >= player.hp;
                                    },
                                    content() {
                                        game.log(player, '成功完成使命');
                                        player.awakenSkill('dfqx_shenzhi');
                                        player.removeSkill('shushen');
                                        player.addSkill('dfqx_sse'), player.addSkillLog('dfqx_shushen');
                                        player.recover();
                                    },
                                },
                                fail: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    lastDo: true,
                                    forced: true,
                                    filter(event, player) {
                                        return (player.storage.shznum && player.storage.shznum < player.hp) || player.storage.sznum == 0;
                                    },
                                    content() {
                                        game.log(player, '使命失败');
                                        player.awakenSkill('dfqx_shenzhi');
                                        player.removeSkill('shushen');
                                        player.addSkillLog('dfqx_yushen');
                                    },
                                },
                            },
                            derivation: ['dfqx_shushen', 'dfqx_yushen'],
                        },
                        dfqx_sse: {
                            mark: 'card',
                            marktext: '神智',
                            charlotte: true,
                            forced: true,
                            popup: false,
                            nopop: true,
                            mod: {
                                maxHandcard(player, num) {
                                    return num + 1;
                                },
                            },
                            intro: {
                                content(storage, player) {
                                    return '你的手牌上限+1';
                                },
                            },
                        },
                        dfqx_shushen: {
                            audio: 2,
                            trigger: {
                                player: 'recoverAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.count = Math.min(trigger.num, 9);
                                ('step 1');
                                player
                                    .chooseTarget(get.prompt('dfqx_shushen'), '令一名其他角色选择摸三张牌或回复1点体力并获得一点护甲', function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(_status.event.player, target);
                                    });
                                ('step 2');
                                if (result.bool) {
                                    event.count--;
                                    if (player.isHealthy() && event.forced) {
                                        player.draw(3);
                                        event.finish();
                                        return;
                                    }
                                    event.target = result.targets[0];
                                    var controls = ['draw_card'];
                                    if (event.target.isDamaged()) {
                                        controls.push('recover_hp');
                                    }
                                    var next = event.target.chooseControl(controls);
                                    next.set('prompt', '摸3张牌或回复1点体力并获得一点护甲');
                                    if (event.hsskill) next.setHiddenSkill(event.hsskill);
                                    if (event.ai) {
                                        next.set('ai', event.ai);
                                    } else {
                                        var choice;
                                        if (event.target.isDamaged() && get.recoverEffect(event.target) > 0 && (event.target.hp == 1 || event.target.needsToDiscard())) {
                                            choice = 'recover_hp';
                                        } else {
                                            choice = 'draw_card';
                                        }
                                        next.set('ai', function () {
                                            return _status.event.choice;
                                        });
                                        next.set('choice', choice);
                                    }
                                } else event.finish();
                                ('step 3');
                                if (result.control == 'draw_card') {
                                    event.target.draw(3);
                                } else {
                                    event.target.recover(1);
                                    event.target.changeHujia(1);
                                }
                                if (event.count) event.goto(1);
                            },
                            ai: {
                                threaten: 0.8,
                                expose: 0.1,
                            },
                        },
                        dfqx_yushen: {
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            forced: true,
                            preHidden: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' || event.card.name == 'juedou';
                            },
                            content() {
                                'step 0';
                                var eff = get.effect(player, trigger.card, trigger.player, trigger.player);
                                trigger.player
                                    .chooseCard('玉身:交给' + get.translation(player) + '一张' + get.color(trigger.card) + '牌,否则杀对' + get.translation(player) + '无效', function (card) {
                                        return get.color(card) == get.color(trigger.card);
                                    })
                                    .set('ai', function (card) {
                                        if (_status.event.eff > 0) {
                                            return 10 - get.value(card);
                                        }
                                        return 0;
                                    })
                                    .set('eff', eff);
                                ('step 1');
                                if (result.bool == false) {
                                    trigger.parent.excluded.add(player);
                                } else {
                                    var cards = result.cards;
                                    player.gain(cards, trigger.player, 'give');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (card.name == 'sha' && get.attitude(player, target) < 0) {
                                            if (_status.event.name == 'xiangle') return;
                                            var bs = player.getCards('h', { type: 'basic' });
                                            if (bs.length < 2) return 0;
                                            if (player.hasSkill('jiu') || player.hasSkill('tianxianjiu')) return;
                                            if (bs.length <= 3 && player.countCards('h', 'sha') <= 1) {
                                                for (var i = 0; i < bs.length; i++) {
                                                    if (bs[i].name != 'sha' && get.value(bs[i]) < 7) {
                                                        return [1, 0, 1, -0.5];
                                                    }
                                                }
                                                return 0;
                                            }
                                            return [1, 0, 1, -0.5];
                                        }
                                    },
                                },
                            },
                        },
                        dfqx_qiji: {
                            enable: 'phaseUse',
                            usable: 1000,
                            filterCard: true,
                            selectCard: -1,
                            position: 'h',
                            filter(event, player) {
                                if (player.getStat().skill.zhanjue_draw && player.getStat().skill.zhanjue_draw >= 2) return false;
                                var hs = player.getCards('h');
                                if (hs.length < player.hp) return false;
                                for (var i = 0; i < hs.length; i++) {
                                    var mod2 = game.checkMod(hs[i], player, 'unchanged', 'cardEnabled2', player);
                                    if (mod2 === false) return false;
                                }
                                return true;
                            },
                            precontent() {
                                var list = [];
                                player.countCards('h', function (card) {
                                    list.add(card.suit);
                                });
                                player.storage.dfqx_qiji = list.length - 1;
                                game.countPlayer(function (current) {
                                    if (current != player) current.addTempSkill('dfqx_qiji_respond');
                                });
                            },
                            viewAs: {
                                name: 'wanjian',
                            },
                            group: 'dfqx_qiji_effect',
                            subSkill: {
                                effect: {
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return event.skill == 'dfqx_qiji';
                                    },
                                    content() {
                                        'step 0';
                                        event.card = trigger.card;
                                        event.count = player.storage.dfqx_qiji;
                                        ('step 1');
                                        event.count--;
                                        var t = [];
                                        for (var i of trigger.targets) {
                                            if (i.isIn() && player.canUse(card, i, false)) t.push(i);
                                        }
                                        if (trigger.addedTarget && !trigger.addedTarget.isIn()) return;
                                        if (trigger.addedTargets && trigger.addedTargetfs.length) {
                                            for (var i of trigger.addedTargets) {
                                                if (!i.isIn()) return;
                                            }
                                        }
                                        var cards = trigger.cards.filterInD('od');
                                        var next = player.useCard(get.copy(event.card), cards, t, false);
                                        if (trigger.addedTarget) next.addedTarget = trigger.addedTarget;
                                        if (trigger.addedTargets && trigger.addedTargets.length) next.addedTargets = trigger.addedTargets.slice(0);
                                        if (event.count > 0) event.redo();
                                    },
                                },
                            },
                        },
                        dfqx_qiji_respond: {
                            enable: ['chooseToRespond'],
                            hiddenCard(player, name) {
                                if (lib.inpile.includes(name) && name != 'wuxie' && player.countCards('h') > 0) return true;
                            },
                            filter(event, player) {
                                if (!event.filterCard || !event.filterCard({ name: 'shan' }, player, event)) return false;
                                if (event.name != 'chooseToUse' && !lib.filter.cardRespondable({ name: 'shan' }, player, event)) return false;
                                //var a = Object.values(event.getParent(3));
                                return player.countCards('h') > 0 && game.hasPlayer((current) => current.hasSkill('dfqx_qiji')) && (event.getParent(2).skill == 'dfqx_qiji' || event.getParent(3).name == 'dfqx_qiji_effect');
                            },
                            delay: false,
                            filterCard: true,
                            discard: false,
                            lose: false,
                            position: 'he',
                            content() {
                                var target;
                                game.countPlayer(function (current) {
                                    if (current.hasSkill('dfqx_qiji')) target = current;
                                });
                                player.give(cards[0], target);
                                var evt = event.getParent(2);
                                evt.result = { bool: true, card: { name: 'shan' }, cards: [] };
                                evt.redo();
                            },
                            ai: {
                                order(item, player) {
                                    var target = game.findPlayer(function (current) {
                                        return current.hasSkill('dfqx_qiji');
                                    });
                                    if (target) {
                                        if (get.attitude(player, target) > 0 || player.hp == 1) return 8;
                                    }
                                    return 0;
                                },
                                threaten: 1.5,
                            },
                        },
                        dfqx_jiechi: {
                            init(player) {
                                player.storage.dfqx_jiechi = ['选项一:下回合摸牌阶段额外摸X张牌', '选项二:下回合出牌阶段额外使用X张[杀]', '选项三:本轮其他角色计算与你的距离+X', '选项四:防止你本轮受到的X次伤害'];
                                player.storage.jcrm = [];
                            },
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                if (!player.storage.jcnum) player.storage.jcnum = 4;
                                return player.storage.jcnum > 0 && player.storage.jcrm.length < 4;
                            },
                            content() {
                                'step 0';
                                event.videoId = lib.status.videoId++;
                                var func = function (player, id) {
                                    var list = player.getStorage('dfqx_jiechi');
                                    var choiceList = ui.create.dialog('戒饬:请选择一至' + get.cnNumber(player.storage.jcnum) + '项');
                                    choiceList.videoId = id;
                                    for (var i = 0; i < list.length; i++) {
                                        var str = '<div class="popup text" style="width:calc(100% - 10px);display:inline-block">';
                                        str += list[i];
                                        str += '</div>';
                                        var next = choiceList.add(str);
                                        next.firstChild.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', ui.click.button);
                                        next.firstChild.link = i;
                                        Object.setPrototypeOf(next, lib.element.Button.prototype);//QQQ
                                        choiceList.buttons.add(next.firstChild);
                                    }
                                    return choiceList;
                                };
                                if (player.isOnline2()) {
                                    player.send(func, player, event.videoId);
                                }
                                event.dialog = func(player, event.videoId);
                                if (player != game.me || _status.auto) {
                                    event.dialog.style.display = 'none';
                                }
                                var next = player.chooseButton();
                                next.set('dialog', event.videoId);
                                next.set('forced', true);
                                next.set('filterButton', function (button) {
                                    return !player.storage.jcrm.includes(button.link);
                                });
                                next.set('selectButton', [1, player.storage.jcnum]);
                                ('step 1');
                                delete player.storage.jcnum;
                                if (player.isOnline2()) {
                                    player.send('closeDialog', event.videoId);
                                }
                                event.dialog.close();
                                result.links.sort();
                                for (var i of result.links) game.log(player, '选择了', '#g【戒饬】', '的', '#y选项' + get.cnNumber(1 + i, true));
                                event.links = result.links;
                                event.num = result.links.length;
                                player.storage.jcnumx = result.links.length;
                                if (result.links.includes(0)) player.addTempSkill('dfqx_jiechi_e1', { player: 'phaseDrawAfter' });
                                if (result.links.includes(1)) player.addTempSkill('dfqx_jiechi_e2', { player: 'phaseUseAfter' });
                                if (result.links.includes(2)) player.addTempSkill('dfqx_jiechi_e3', 'roundStart');
                                if (result.links.includes(3)) player.addTempSkill('dfqx_jiechi_e4', 'roundStart');
                                if (event.num == 4 - player.storage.jcrm.length) {
                                    event.videoId = lib.status.videoId++;
                                    var func = function (player, id) {
                                        var list = player.getStorage('dfqx_jiechi');
                                        var choiceList = ui.create.dialog('请选择要移除的选项');
                                        choiceList.videoId = id;
                                        for (var i = 0; i < list.length; i++) {
                                            var str = '<div class="popup text" style="width:calc(100% - 10px);display:inline-block">';
                                            str += list[i];
                                            str += '</div>';
                                            var next = choiceList.add(str);
                                            next.firstChild.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', ui.click.button);
                                            next.firstChild.link = i;
                                            Object.setPrototypeOf(next, lib.element.Button.prototype);//QQQ
                                            choiceList.buttons.add(next.firstChild);
                                        }
                                        return choiceList;
                                    };
                                    if (player.isOnline2()) {
                                        player.send(func, player, event.videoId);
                                    }
                                    event.dialog = func(player, event.videoId);
                                    if (player != game.me || _status.auto) {
                                        event.dialog.style.display = 'none';
                                    }
                                    var next = player.chooseButton();
                                    next.set('dialog', event.videoId);
                                    next.set('filterButton', function (button) {
                                        return !player.storage.jcrm.includes(button.link);
                                    });
                                    next.set('forced', true);
                                    next.set('selectButton', [1]);
                                } else event.finish();
                                ('step 2');
                                if (player.isOnline2()) {
                                    player.send('closeDialog', event.videoId);
                                }
                                event.dialog.close();
                                result.links.sort();
                                for (var i of result.links) game.log(player, '移除了', '#g【戒饬】', '的', '#y选项' + get.cnNumber(1 + i, true));
                                player.storage.dfqx_jiechi[result.links[0]] = '已移除';
                                player.storage.jcrm.push(result.links[0]);
                                player.gainMaxHp();
                                player.recover();
                            },
                            group: ['dfqx_jiechi_uc', 'dfqx_jiechi_remove'],
                            subSkill: {
                                e1: {
                                    marktext: '摸牌',
                                    init(player) {
                                        player.storage.dfqx_jiechi_e1 = player.storage.jcnumx;
                                    },
                                    mark: true,
                                    charlotte: true,
                                    popup: false,
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    content() {
                                        player.removeSkill('juguan_draw');
                                        if (!trigger.numFixed) trigger.num += player.storage.jcnumx;
                                    },
                                    intro: {
                                        content: '下回合摸牌阶段额外摸#张牌',
                                        markcount: () => undefined,
                                    },
                                },
                                e2: {
                                    marktext: '多杀',
                                    init(player) {
                                        player.storage.dfqx_jiechi_e2 = player.storage.jcnumx;
                                    },
                                    mark: true,
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    charlotte: true,
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return num + player.storage.jcnumx;
                                        },
                                    },
                                    intro: {
                                        content: '下回合出牌阶段可额外使用#张杀',
                                        markcount: () => undefined,
                                    },
                                },
                                e3: {
                                    marktext: '距离',
                                    init(player) {
                                        player.storage.dfqx_jiechi_e3 = player.storage.jcnumx;
                                    },
                                    mark: true,
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    charlotte: true,
                                    mod: {
                                        globalTo(from, to, distance) {
                                            return distance + to.storage.jcnumx;
                                        },
                                    },
                                    intro: {
                                        content: '本轮其他角色与你的距离+#',
                                        markcount: () => undefined,
                                    },
                                },
                                e4: {
                                    marktext: '减伤',
                                    init(player) {
                                        player.storage.dfqx_jiechi_e4 = player.storage.jcnumx;
                                    },
                                    mark: true,
                                    charlotte: true,
                                    popup: false,
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.source && event.source != player;
                                    },
                                    content() {
                                        'step 0';
                                        player.storage.dfqx_jiechi_e4--;
                                        ('step 1');
                                        if (player.storage.dfqx_jiechi_e4 == 0) player.removeSkill('dfqx_jiechi_e4');
                                        trigger.cancel();
                                    },
                                    intro: {
                                        content: '防止下#次其他角色对你造成的伤害.',
                                        markcount: () => undefined,
                                    },
                                },
                                uc: {
                                    charlotte: true,
                                    popup: false,
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card.suit != 'none' && player == _status.currentPhase;
                                    },
                                    content() {
                                        player.markAuto('dfqx_jiechi_uc', [trigger.card.suit]);
                                        player.storage.jcnum = 4 - player.countMark('dfqx_jiechi_uc');
                                    },
                                    intro: {
                                        content: '已使用的花色:$',
                                    },
                                },
                                remove: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    charlotte: true,
                                    popup: false,
                                    forced: true,
                                    content() {
                                        player.unmarkSkill('dfqx_jiechi_uc');
                                    },
                                },
                            },
                        },
                        dfqx_chongxing: {
                            trigger: {
                                player: ['turnOverAfter'],
                            },
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(function (card, player, target) {
                                    return player != target && target.hasSex('male') && target.countCards('he') > 0;
                                });
                                ('step 1');
                                if (result.bool) player.gainPlayerCard(2, result.targets[0], true);
                            },
                        },
                        dfqx_boming: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            preHidden: true,
                            content() {
                                if (player.isDamaged()) {
                                    player.recover();
                                    player.turnOver();
                                } else {
                                    player.loseHp();
                                    player.draw(2);
                                }
                            },
                        },
                        dfqx_rugong: {
                            charlotte: true,
                            forced: true,
                            mark: true,
                            popup: false,
                            global: 'rugong2',
                            trigger: {
                                global: 'roundStart',
                            },
                            init(player) {
                                player.storage.rugongMax = [0, ''];
                            },//QQQ
                            content() {
                                player.storage.dfqx_rugong = '没人';
                                player.storage.rugongMax = [0, ''];
                            },
                            intro: {
                                content: '#给的最多.',
                                markcount: () => undefined,
                            },
                        },
                        rugong2: {
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.hasSkill('rugong3')) return false;
                                if (!player.hasSex('male')) return false;
                                return (
                                    player.countCards('he') &&
                                    game.hasPlayer(function (current) {
                                        return current.hasSkill('dfqx_rugong');
                                    })
                                );
                            },
                            forced: true,
                            delay: false,
                            filterCard: true,
                            discard: false,
                            lose: false,
                            position: 'h',
                            selectCard: [1, Infinity],
                            check(card) {
                                var targets = game.filterPlayer(function (current) {
                                    return current.hasSkill('dfqx_rugong');
                                });
                                var num;
                                num = targets[0].storage.rugongMax[0];
                                if (ui.selected.cards.length > num) return 0;
                                return 10 - get.value(card);
                            },
                            prompt() {
                                var player = _status.event.player;
                                var list = game.filterPlayer(function (current) {
                                    return current.hasSkill('dfqx_rugong');
                                });
                                if (list.length == 1) return '将任意张牌交给' + get.translation(list[0]);
                                var str = '将一张牌交给' + get.translation(list);
                                if (list.length > 1) str += '中的一人';
                                return str;
                            },
                            content() {
                                'step 0';
                                var targets = game.filterPlayer(function (current) {
                                    return current.hasSkill('dfqx_rugong');
                                });
                                if (targets.length == 1) {
                                    event.target = targets[0];
                                    event.goto(2);
                                } else if (targets.length) {
                                    player
                                        .chooseTarget(true, '选择【入宫】的目标', function (card, player, target) {
                                            return _status.event.list.includes(target);
                                        })
                                        .set('list', targets)
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.attitude(player, target);
                                        });
                                } else {
                                    event.finish();
                                }
                                ('step 1');
                                if (result.bool && result.targets.length) {
                                    event.target = result.targets[0];
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.target) {
                                    var num = cards.length;
                                    var target = event.target;
                                    if (!target.storage.rugongMax) {
                                        target.storage.rugongMax = [num, player];
                                        target.storage.dfqx_rugong = get.translation(target.storage.rugongMax[1]);
                                        player.addTempSkill('rezhiheng', 'roundStart');
                                    } else if (num > target.storage.rugongMax[0]) {
                                        if (target.storage.rugongMax[1] != '') target.storage.rugongMax[1].removeSkill('rezhiheng');
                                        target.storage.rugongMax = [num, player];
                                        target.storage.dfqx_rugong = get.translation(target.storage.rugongMax[1]);
                                        player.addTempSkill('rezhiheng', 'roundStart');
                                    }
                                    player.addTempSkill('rugong3', 'phaseUseEnd');
                                    event.card = cards;
                                    if (event.target != player) {
                                        player.give(cards, event.target);
                                    }
                                } else {
                                    event.finish();
                                }
                                delete _status.noclearcountdown;
                                game.stopCountChoose();
                            },
                            ai: {
                                order(item, player) {
                                    var targets = game.filterPlayer(function (current) {
                                        return current.hasSkill('dfqx_rugong');
                                    });
                                    var num;
                                    num = targets[0].storage.rugongMax[0];
                                    return 14 - num * 6;
                                },
                                threaten: 1.5,
                                result: {
                                    player(player, target) {
                                        var target = game.findPlayer(function (current) {
                                            return current.hasSkill('dfqx_rugong');
                                        });
                                        if (target) {
                                            return get.attitude(player, target);
                                        }
                                    },
                                },
                            },
                        },
                        rugong3: {
                            charlotte: true,
                        },
                        dfqx_youshang: {
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current.countCards('h') < player.countCards('h');
                                });
                            },
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(true, '选择一名手牌数小于你的其他角色.', function (card, player, target) {
                                    return player.countCards('h') > target.countCards('h');
                                });
                                ('step 1');
                                event.target = result.targets[0];
                                result.targets[0].loseHp();
                                ('step 2');
                                var target = event.target;
                                if (target.isAlive()) {
                                    var num = player.countCards('h') - target.countCards('h');
                                    if (num > 0) player.chooseToDiscard('h', true, num);
                                }
                            },
                        },
                        dfqx_tianhu: {
                            trigger: {
                                player: 'phaseDrawEnd',
                            },
                            content() {
                                'step 0';
                                var hs = player.getCards('h');
                                player.showCards(hs, get.translation(player) + '发动了【天葫】');
                                var suits = [],
                                    numbers = [];
                                for (var i = 0; i < hs.length; i++) {
                                    var suit = hs[i].suit;
                                    if (suits.includes(suit)) {
                                        suits = 0;
                                        break;
                                    } else {
                                        suits.push(suit);
                                    }
                                }
                                for (var i = 0; i < hs.length; i++) {
                                    var number = hs[i].number;
                                    if (numbers.includes(number)) {
                                        numbers = 0;
                                        break;
                                    } else {
                                        numbers.push(number);
                                    }
                                }
                                game.log(suits, numbers);
                                if (numbers != 0) player.addTempSkill('dfqx_tianhu_dist', 'phaseUseAfter');
                                if (suits != 0) player.draw(hs.length);
                            },
                            subSkill: {
                                dist: {
                                    mark: true,
                                    forced: true,
                                    charlotte: true,
                                    silent: true,
                                    popup: false,
                                    mod: {
                                        cardUsable(card) {
                                            if (get.info(card) && get.info(card).forceUsable) return;
                                            return Infinity;
                                        },
                                        targetInRange() {
                                            return true;
                                        },
                                        aiOrder(player, card, num) {
                                            var name = card.name;
                                            if (name == 'tao') return num + 7 + Math.pow(player.getDamagedHp(), 2);
                                            if (name == 'sha') return num + 6;
                                            if (get.subtype(card) == 'equip2') return num + get.value(card) / 3;
                                        },
                                    },
                                    intro: {
                                        content: '使用牌无次数和距离限制.',
                                        markcount: () => undefined,
                                    },
                                },
                            },
                        },
                        dfqx_jiangzi: {
                            trigger: {
                                global: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return event.player != player && player.countCards('he') > 0;
                            },
                            logTarget: 'player',
                            check(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('he');
                                ('step 1');
                                if (result.bool) {
                                    var card = result.cards[0];
                                    trigger.player.storage.dfqx_jiangzi = [card.suit, player];
                                    trigger.player.addTempSkill('dfqx_jiangzi_effect', 'phaseUseEnd');
                                } else event.finish();
                            },
                            subSkill: {
                                effect: {
                                    init(player) {
                                        player.storage.dfqx_jiangzi_effect = get.translation(player.storage.dfqx_jiangzi[0]);
                                    },
                                    mark: true,
                                    forced: true,
                                    charlotte: true,
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    filter(event, player) {
                                        return event.cards.suit == player.storage.dfqx_jiangzi[0] && player.storage.dfqx_jiangzi[1].isAlive;
                                    },
                                    content() {
                                        'step 0';
                                        var target = player.storage.dfqx_jiangzi[1];
                                        target.chooseControl('无效', '结算', 'cancel2');
                                        ('step 1');
                                        if (result.control == '无效') {
                                            trigger.targets.length = 0;
                                            trigger.all_excluded = true;
                                        } else if (result.control == '结算') {
                                            player.useCard(get.copy(trigger.card), trigger.targets, false);
                                        } else event.finish();
                                    },
                                    intro: {
                                        content: '花色:#',
                                        markcount: () => undefined,
                                    },
                                },
                            },
                        },
                        dfqx_jieyin: {
                            enable: 'phaseUse',
                            filterCard: true,
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (get.position(card) == 'e') {
                                    var subtype = get.subtype(card);
                                    if (
                                        !game.hasPlayer(function (current) {
                                            return current != player && get.attitude(player, current) > 0 && !current.countCards('e', { subtype: subtype });
                                        })
                                    ) {
                                        return 0;
                                    }
                                    if (player.countCards('h', { subtype: subtype })) return 20 - get.value(card);
                                    return 10 - get.value(card);
                                } else {
                                    if (player.countCards('e')) return 0;
                                    if (player.countCards('h', { type: 'equip' })) return 0;
                                    return 8 - get.value(card);
                                }
                            },
                            filterTarget(card, player, target) {
                                if (!target.hasSex('male')) return false;
                                var card = ui.selected.cards[0];
                                if (!card) return false;
                                if (get.position(card) == 'e' && !target.isEmpty(get.subtype(card))) return false;
                                return true;
                            },
                            discard: false,
                            delay: false,
                            lose: false,
                            content() {
                                'step 0';
                                if (get.position(cards[0]) == 'e') event._result = { index: 0 };
                                else if (get.type(cards[0]) != 'equip' || !target.isEmpty(get.subtype(cards[0]))) event._result = { index: 1 };
                                else
                                    player.chooseControl().set('choiceList', ['将' + get.translation(cards[0]) + '置入' + get.translation(target) + '的装备区', '弃置' + get.translation(cards[0])]).ai = function () {
                                        return 1;
                                    };
                                ('step 1');
                                if (result.index == 0) {
                                    player.$give(cards, target, false);
                                    target.equip(cards[0]);
                                } else {
                                    player.discard(cards);
                                }
                                ('step 2');
                                if (player.hp > target.hp) {
                                    player.draw();
                                    if (target.isDamaged()) target.recover();
                                } else if (player.hp < target.hp) {
                                    target.draw();
                                    if (player.isDamaged()) player.recover();
                                } else {
                                    game.asyncDraw([player, target]);
                                }
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    var es = player.getCards('e');
                                    for (var i = 0; i < es.length; i++) {
                                        if (player.countCards('h', { subtype: get.subtype(es[i]) })) return 10;
                                    }
                                    return 2;
                                },
                                result: {
                                    target(player, target) {
                                        var goon = function () {
                                            var es = player.getCards('e');
                                            for (var i = 0; i < es.length; i++) {
                                                if (player.countCards('h', { subtype: get.subtype(es[i]) })) return true;
                                            }
                                            return false;
                                        };
                                        if (player.hp < target.hp) {
                                            if (player.isHealthy()) {
                                                if (!player.needsToDiscard(1) || goon()) return 0.1;
                                                return 0;
                                            }
                                            return 1.5;
                                        }
                                        if (player.hp >= target.hp) {
                                            if (target.isHealthy()) {
                                                if (!player.needsToDiscard(1) || goon()) return 0.1;
                                                return 0;
                                            }
                                            return 1;
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        dfqx_yuyong: {
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.yy) {
                                        return Infinity;
                                    }
                                },
                            },
                            enable: 'chooseToUse',
                            usable: 1,
                            viewAs: {
                                name: 'sha',
                                yy: true,
                            },
                            filter(event, player) {
                                return true;
                            },
                            viewAsFilter(player) {
                                return player.countCards('hs') > 0;
                            },
                            selectCard() {
                                var player = game.me;
                                return [player.hp, Infinity];
                            },
                            complexCard: true,
                            filterCard(card, player) {
                                return get.type(card, 'trick') == 'trick';
                            },
                            precontent() {
                                game.log(event.result.cards);
                            },
                            check(card) {
                                var player = _status.event.player,
                                    card = { name: 'sha' };
                                if (
                                    game.countPlayer(function (current) {
                                        return get.effect_use(current, card, player, player) > 0;
                                    }) <= ui.selected.cards.length
                                )
                                    return 0;
                                return 5 - get.value(card);
                            },
                            position: 'hs',
                            onuse(links, player) {
                                player.addTempSkill('dfqx_yuyong_effect');
                            },
                            subSkill: {
                                effect: {
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return event.skill == 'dfqx_yuyong';
                                    },
                                    content() {
                                        'step 0';
                                        if (
                                            player.hasHistory('sourceDamage', function (evt) {
                                                return evt.card == trigger.card;
                                            })
                                        ) {
                                            var list = trigger.cards.filterInD('o');
                                            if (list.length) player.loseToSpecial(list, '愚勇').set('visible', true)._triggered = null;
                                            else event.finish();
                                        } else {
                                            player.turnOver();
                                            event.finish();
                                        }
                                        ('step 1');
                                        var hs = player.getCards('s', function (card, player, event) {
                                            return card.hasGaintag('愚勇');
                                        });
                                        player.chooseToUse('愚勇:请选择要使用的牌.', (card) => hs.includes(card) && _status.event.player.hasUseTarget(card, false, false)).set('addCount', false).oncard = function (card, player) {
                                            _status.event.nowuxie = true;
                                        };
                                        ('step 2');
                                        var hs = player.getCards('s', function (card, player, event) {
                                            return card.hasGaintag('愚勇');
                                        });
                                        if (hs.length) player.lose(hs)._triggered = null;
                                        event.finish();
                                    },
                                },
                            },
                        },
                        dfqx_linwei: {
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (!player.countCards('h')) return false;
                                var num;
                                return true;
                            },
                            usable: 2,
                            filterTarget(card, player, target) {
                                return player.canCompare(target);
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    var tricks = [];
                                    for (var name of lib.inpile) {
                                        var info = lib.card[name];
                                        if (!info || info.type != 'trick' || info.notarget || (info.selectTarget && info.selectTarget != 1 && (info.selectTarget != -1 || !info.toself))) continue;
                                        var card = { name: name, suit: '', number: '' };
                                        var fake = game.createCard(card);
                                        if (
                                            target.canUse(
                                                {
                                                    name: name,
                                                },
                                                player
                                            )
                                        )
                                            target.loseToSpecial([fake], '锦囊').set('visible', true)._triggered = null;
                                    }
                                } else {
                                    target.draw(2);
                                    event.finish();
                                }
                                ('step 2');
                                target.chooseCard('临危:请选择要使用的牌.', 's', (card) => card.hasGaintag('锦囊'));
                                ('step 3');
                                if (result.bool) {
                                    var hs = target.getCards('s', function (card, player, event) {
                                        return card.hasGaintag('锦囊');
                                    });
                                    if (hs.length) target.lose(hs)._triggered = null;
                                    target.useCard({ name: result.cards[0].name }, player);
                                } else event.goto(4);
                                ('step 4');
                                var hs = target.getCards('s', function (card, player, event) {
                                    return card.hasGaintag('锦囊');
                                });
                                if (hs.length) target.lose(hs)._triggered = null;
                                event.finish();
                            },
                        },
                        dfqx_fankui: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source && event.source.countGainableCards(player, 'he') && event.num > 0;
                            },
                            content() {
                                'step 0';
                                event.count = Math.min(trigger.num, 9);
                                ('step 1');
                                event.count--;
                                player.chooseControl('获得', '弃置', 'cancel2');
                                ('step 2');
                                if (result.control == '获得') {
                                    player.gainPlayerCard('反馈:选择要获得的牌.', trigger.source, get.buttonValue, 'he')
                                } else if (result.control == '弃置') {
                                    event.draw = 1;
                                    player.discardPlayerCard('反馈:选择要弃置的牌.', trigger.source, get.buttonValue, 'he')
                                } else event.finish();
                                ('step 3');
                                if (event.draw == 1) player.draw();
                                if (trigger.card && get.color(result.cards[0]) == get.color(trigger.card)) player.draw();
                                if (result.bool && event.count > 0 && trigger.source.countGainableCards(player, 'he') > 0) event.goto(1);
                            },
                            ai: {
                                maixie_defend: true,
                                effect: {
                                    target(card, player, target) {
                                        if (player.countCards('he') > 1 && get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -1.5];
                                            if (get.attitude(target, player) < 0) return [1, 1];
                                        }
                                    },
                                },
                            },
                        },
                        dfqx_guicai: {
                            trigger: {
                                global: 'judge',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('hes') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseControl('打出', '替换', 'cancel2');
                                ('step 1');
                                if (result.control == '打出') event.lx = 'res';
                                else if (result.control == '替换') event.lx = 'rep';
                                else event.finish();
                                event.suit = trigger.player.judging[0].suit;
                                player
                                    .chooseCard(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',' + get.prompt('dfqx_guicai'), 'hes', function (card) {
                                        var player = _status.event.player;
                                        var mod2 = game.checkMod(card, player, 'unchanged', 'cardEnabled2', player);
                                        if (mod2 != 'unchanged') return mod2;
                                        var mod = game.checkMod(card, player, 'unchanged', 'cardRespondable', player);
                                        if (mod != 'unchanged') return mod;
                                        return true;
                                    })
                                    .set('ai', function (card) {
                                        var trigger = _status.event.getTrigger();
                                        var player = _status.event.player;
                                        var judging = _status.event.judging;
                                        var result = trigger.judge(card) - trigger.judge(judging);
                                        var attitude = get.attitude(player, trigger.player);
                                        if (attitude == 0 || result == 0) return 0;
                                        if (attitude > 0) {
                                            return result - get.value(card) / 2;
                                        } else {
                                            return -result - get.value(card) / 2;
                                        }
                                    })
                                    .set('judging', trigger.player.judging[0]);
                                ('step 2');
                                if (result.bool) {
                                    player.respond(result.cards, 'dfqx_guicai', 'highlight', 'noOrdering');
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool) {
                                    if (result.cards[0].suit == event.suit) event.recover = 1;
                                    if (trigger.player.judging[0].clone) {
                                        trigger.player.judging[0].clone.classList.remove('thrownhighlight');
                                        game.broadcast(function (card) {
                                            if (card.clone) {
                                                card.clone.classList.remove('thrownhighlight');
                                            }
                                        }, trigger.player.judging[0]);
                                        game.addVideo('deletenode', player, get.cardsInfo([trigger.player.judging[0].clone]));
                                    }
                                    if ((event.lx = 'rep')) player.gain(trigger.player.judging[0], 'gain2');
                                    else game.cardsDiscard(trigger.player.judging[0]);
                                    trigger.player.judging[0] = result.cards[0];
                                    trigger.orderingCards.addArray(result.cards);
                                    game.log(trigger.player, '的判定牌改为', result.cards[0]);
                                }
                                ('step 4');
                                if ((event.lx = 'rep')) player.chooseTarget();
                                ('step 5');
                                if (result.bool) player.damage(result.targets[0]);
                                ('step 6');
                                if (event.recover == 1) player.recover();
                            },
                            ai: {
                                rejudge: true,
                                tag: {
                                    rejudge: 1,
                                },
                            },
                        },
                    },
                };
                for (var i in dfqx.character) {
                    dfqx.character[i][4].push('ext:东方七宿/image/' + i + '.jpg');
                }
                lib.config.all.characters.add('dfqx');
                lib.config.characters.add('dfqx');
                lib.translate.dfqx_character_config = '东方七宿';
                return dfqx;
            });
        },
        package: {
            intro: '<br><br><span style="color: gold">潜水的火修复版<br>『无名杀扩展大全群』:771901025</span><br><br>原创设计的武将.',
            author: '二点',
            version: '1.0',
        },
    };
});
