import { lib, game, ui, get, ai, _status } from '../../noname.js'
game.import('extension', function (lib, game, ui, get, ai, _status) {
	return {
		name: '幻颜风华',
		content(config, pack) {
			var style1 = document.createElement('style'); //次元
			style1.innerHTML += "div[data-nature='次元']{color: #DBB648 }";
			document.head.appendChild(style1);
			var style2 = document.createElement('style'); //起源
			style2.innerHTML += "div[data-nature='起源']{color: #9966CC }";
			document.head.appendChild(style2);
			lib.group.push('次元');
			lib.translate.次元 = '次元';
			lib.group.push('起源');
			lib.translate.起源 = '起源';
			lib.translate.mrfz = '明日方舟';
			lib.translate.fgo = '命运/冠位指定';
			lib.translate.yj = '梦幻联动';
			lib.translate.jy = '极夜之都';
			lib.translate.yz = '诸神黄昏';
			lib.translate.hd = '最初的混沌';
			lib.translate.sza = '时之岸的境界';
			lib.translate.hx = '东方Project';
			lib.translate.jl = '命运之夜';
			lib.translate.twt = '原神';
			lib.translate.js = '遗迹之始';
			lib.translate.gzlj = '公主连结';
			lib.translate.xnox = '虚拟偶像';
			lib.characterSort.幻颜风华 = {
				yz: ['lg_amier'],
				jy: ['lg_asilan', 'lg_weila'],
				hd: ['lg_guxing', 'lg_lalaiye', 'lg_weiouen', 'lg_nikesi', 'lg_nuoya', 'lg_luxueer', 'lg_tuang', 'lg_youlinuo'],
				mrfz: ['lg_fengdi', 'lg_helage', 'lg_chizui', 'lg_anjielina', 'lg_siye', 'lg_linglan', 'lg_jiawei', 'lg_haimo', 'lg_yike'],
				fgo: ['lg_chongtianzongsi', 'lg_fuermosi', 'lg_geshibeizhai', 'lg_kelinxide', 'lg_kuqiulin', 'lg_yujinjian', 'lg_gongbenwuzang', 'lg_paerwadi', 'lg_diesikuli', 'lg_hailunna', 'lg_masi', 'lg_adila'],
				jl: ['lg_jiantongying2', 'lg_jiantongying1', 'lg_jiantongying'],
				gzlj: ['lg_qiunai', 'lg_peikelimu', 'lg_huilizi', 'lg_youni', 'lg_zhenbu'],
				yj: ['lg_shixiang', 'lg_shiqikuangsan', 'lg_sixinai', 'lg_youxiaomeijiu', 'lg_xinggongliucan', 'lg_aimiliya', 'lg_leimu', 'lg_baijingheizi', 'lg_yubanmeiqin', 'lg_yileina'],
				hx: ['lg_bayunzi', 'lg_leimiliya', 'lg_shuiqiaopaluxi', 'lg_chunhu', 'lg_xiaoyezhongxiaoding', 'lg_bayunlan', 'lg_quanzouhua', 'lg_lumiya'],
				twt: ['lg_bachongshenzi', 'lg_naxida', 'lg_shenlilingren', 'lg_shenlilinghua', 'lg_zhongli', 'lg_luyeyuanpingzang', 'lg_hutao', 'lg_dadaliya', 'lg_ganyu', 'lg_feixieer', 'lg_keli'],
				sza: ['lg_zhelinai', 'lg_buyesishennai', 'lg_ketengcaixiang', 'lg_hanchuanhuili'],
				js: ['lg_jinbenshun', 'lg_jielika', 'lg_kailan', 'lg_juwuxing'],
				xnox: ['lg_nailin', 'lg_shinaikong', 'lg_shenleqinai', 'lg_lize', 'lg_jiaran', 'lg_xiangwan', 'lg_liannaiyewu', 'lg_qianyou'],
			};
		},
		precontent() {
			game.import('character', function (lib, game, ui, get, ai, _status) {
				const QQQ = {
					name: '幻颜风华',
					connect: true,
					character: {
						lg_haimo: ['female', '罗德岛', '4/5', ['lg_huishou', 'lg_paoying', 'lg_paoying0', 'lg_haimo_zhenwang'], ['des:— 简介 —<br/> 海沫,在某次针对伊比利亚地区的行动中受到波及,作为伤员被带回本舰施行救治.经考察并结合测试结果,批准其成为外勤干员,于伊比利亚地区周边支援各项任务.<br/><br/>  — 背景故事 —<br/> 我还记得,当海沫第一次出现在罗德岛本舰的时候,我们有多手忙脚乱.<br/><br/> 当时在场的同事应该也都还印象深刻吧.那会阿戈尔的几名猎人刚好前脚回了趟本舰报完信才走不久,郁金香和水月他们就给我们送这么个大礼来,凯尔希医生也还在跟伊比利亚协谈.<br/><br/> 虽说总不能放着伤员不管,但毕竟也得为其他人员的安全负责.要不是阿米娅出面使用她的能力担保海沫跟那些骇人的生物并不一样,我们可真不知道该怎么处置才妥当啦.我还听说,后来为她动手术处理伤口和增生组织的时候,在技术层面上也挺难为医疗部的？<br/><br/> 这都还不算完呢.术后,水月甚至提出我们是不是可以接纳海沫成为干员,让她有机会重新体验一下回到人群中的生活,别说把我们惊得下巴都快掉了,我打赌当时连阿米娅都一下没能掩饰住惊讶,旁边的郁金香也轻咳了一声,这场面可不多见.<br/><br/> 至于我？你看,后来给她安排和记录测试结果的人正是我……不,我认为那不算是什么值得去回忆跟讨论的场面,尤其是测试她对仿生义体的破坏力那段.我建议真感兴趣的话还是自己去查录像,放过我吧.<br/><br/> 海沫并不避讳她的个人信息,她很干脆地配合了我们的背调工作.<br/><br/> 当提到双亲时,尽管她的语调仍旧保持着平淡而冷漠,我们还是能从其措辞与细微的表情中明显地感受到她的情绪.<br/><br/> 和伊比利亚地区的许多阿戈尔人一样,发生在她身上的悲剧无需过多说明.无论是在她的童年时期就因阿戈尔人的身份被审判庭以调查之名带走,一去不回的父亲;还是在短暂的余生里因悲伤而逐渐失声,郁郁而终的母亲;他们的离去都在她的生命中刻下了不可弥合的创伤.<br/><br/> 但意外的是,她的悔意与恨意似乎并不指向审判庭.海沫向我们控诉的,是镇民为自保而作出指控她父亲的伪证,是邻里散播她母亲的歌声会蛊惑人心的谣言,是对这一切无能为力却又始终无法释怀的她自己.<br/><br/> 她将厌恨指向了人类的软弱而非仇恨,也正因如此,才会在如今陷入自责和失落吧.<br/><br/> 当镇民们试图撬开门,带走母亲的遗体,叫嚣着、咒骂着、声称这场旱灾是她的诅咒,要用焚烧净化余毒时……<br/><br/> 那时还是午后,太阳还没有落山.但透过窗户,我发誓,我看见了星光.星光构成了一副高大而神圣的人类身躯,而那些或湛蓝或皎洁的星星像是那位老人身上柔软的关节,又像舞动的孢子,而光芒联结成的线条就像他的血管.无数湿润而富有生机的细小个体和谐地聚集在一起,勾勒出人体的线条和轮廓.<br/><br/> 当老人挥动起手臂,就像把人群啃去了一块一样.拂过之处不再有喧嚣,也没有伤痕或血迹.蠕动的星光们将暴力蚕食殆尽,徒留一片宁静.<br/><br/> 当星光终于洒满了整个小镇的街道,这并没有花太多时间.主教爷爷就这么向我走来,他的身后蔓延着用星空与海洋共织成的活体地毯、或是披风、又或是别的什么.<br/><br/> 宁静,美好,灿烂.啊……原来这才是,人类本应该真正拥有的面目吗？<br/><br/> 我想要,加入这片星光.<br/><br/> 孩子,你渴望从对自己的称呼开始做出改变,我不否定这一想法.但我试着交付于你的这个名字却并不是为了让你盲目地追逐更高,更广阔的一切.<br/><br/> 人类是渺小的,渺小到甚至很难看清,自己只是无数浪花中的一粒微沫.<br/><br/> 在人们的想象中,能在大城市自给自足的普通人所拥有的生活或许就已经足以代表所有人类.但在这个想象中,<人类>一词并不包含感染者,不包含挣扎在生存线上的贫民,不包含荒野之上居无定所的流浪者,不包含被定义为邪异的萨卡兹,也不包含我们阿戈尔人.在这巨大而狭隘的理想图景中,甚至并不包含人们赖以生存的土地与海洋,视作资源的动物与植物,只有人类自己和他们引以为傲的造物.<br/><br/> 而所有的不合理之处皆是基于人类的软弱与贫瘠,不平等与不信任.只有在对进化的追求中,抛下一切怠惰与落后,粉碎所有隔阂与偏见,我们才能最终得见人类的价值.<br/><br/> 海沫啊,我多么希望你能站得更高,去发现联结起这一切的终极手段,与通往这种未来的多样道路,而不仅仅是沉迷于任何一名先驱者的微光.<br/><br/>']],
						lg_hailunna: ['female', '命运', 4, ['lg_molitongdiao', 'lg_xiehouweizhi', 'lg_huoyantianzhu', 'lg_hailunna_zhenwang'], ['des:— 简介 —<br/> 十九世纪的女性神秘学者,神智学的创始人. 年纪轻轻就与俄罗斯贵族结婚,但很快便离家,为魔术世界带来繁荣.俗称布拉瓦茨基夫人.<br/><br/> 据称其坚信雷姆利亚大陆的存在,投身于神秘主义,通过接触高次元的存在以及其集合体<Hierarchy>获得了大量的睿智.也就是说,也许她看到了抵达根源的可能性.<br/><br/>  — 背景故事 —<br/> 通过突然变异诞生的天才魔术师.<br/><br/> 她将抵达根源的先人们称为<Mahatma>和<Hierarchy>,将其规定为高次元的存在.海伦娜表示自己总能感受到他们的信息,但其他人若想要感受到这些,必须拥有与她相同的能力才行吧.<br/><br/>  雷姆利亚大陆和Mahatma实际都不存在, 她<只是个解释了自创的世界的天才>的可能性也很高.<br/><br/>  作为从者存在的她能操控以神智学为基干的,自古到近为数众多的魔术,是个全能型的Caster.她也尝试着操控过古代埃及魔术, 以及圣堂教会的洗礼咏唱,但貌似她还是不太擅长古代的魔术.<br/><br/>  她似乎有很多愿望希望圣杯能够实现.尽管她表示根本无法缩减到一个,但实际情况不明.<br/><br/> <您的不明要素还真多呢,布拉瓦茨基小姐.><br/><br/> <你难道不觉得神秘的女性比较好吗？　><br/><br/> <不,真理只有一个,人类虽可求而不可知, 但Mahatma能知晓一切!><br/><br/>']],
						lg_weila: ['female', '极夜', 5, ['lg_xiefengwuye', 'lg_zhugong_weila', 'lg_xiefengwuye0', 'lg_weila_zhenwang'], ['zhu', 'des:— 简介 —<br/> 恃强凌弱,会追求极致的<美味>.对弱者一视同仁,讨厌说她坏话的<蝼蚁>.提到这些<蝼蚁>相关的事情会格外严肃,无处不在彰显一种魅力.<br/><br/>  — 背景故事 —<br/> 我曾经想过,如果我的能力没有办法让我承认他的话,我会做什么？倒是某些<蝼蚁>,让我看起来特别兴奋.<br/><br/>  有些从骨子里透出的气质,笑容中傲然的自信,谈笑间对于凡人的吸引力,可以排队排到古堡外的追求者.<br/><br/>  这一切不是用她脖子上镶嵌着璀璨宝石的项链带来的,也不是身上华丽的礼服带来的.<br/><br/>  魔中的贵族,不仅仅有昂贵的衣服,奢侈的生活,就可以称之为贵族.<br/><br/>  若是没有骨子里的那些娇贵傲气,那种贵族不过是个用奢侈品堆砌出来的空洞玩具罢了.<br/><br/>  我看着眼前那个穿着品味极差,一点都没有礼仪可言,就连动作都十分粗鲁的<蝼蚁>,不由得皱紧了眉头.<br/><br/>  口是心非的<蝼蚁>啊.<br/><br/>   然而下一刻,一个令人生厌的身影就走过我的面前,向他们两人走去.我抬起手拦住了来人,他灰色的眼睛直直地盯着我.<br/><br/>  <让开!><br/><br/>  <你要去干什么？><br/><br/>  <古堡外又有闹事的了.><br/><br/>  <你没看到他们在修行吗？不是还有其他的侍卫吗？><br/><br/>  <让开!><br/><br/>   只见他缓缓抽出腰间的长剑立于眼前,虽然付诸武力并不是我所希望的,但是眼前的这个家伙,实在是太欠揍了些.<br/><br/>  这个叫做哈根的家伙,无论言行还是衣着,所有的一切都令人恼火,但唯独他的法术,倒是少有的精湛.<br/><br/>  最近的古堡中,已经有不少贵族少女失踪,负责这件案件调查的,正是她.<br/><br/>  她知道,失踪的女孩儿凶多吉少.<br/><br/>  她也知道,我们不愿意让她冒险.<br/><br/>  <我可以当诱饵,我相信你们可以保护好我的.拜托你们,我想要亲手抓住伤害她的人.><br/><br/>  <这件事,你是无关者,我不能让无关者被牵扯进这件事情.><br/><br/>  我看到了说着这话时,他衣袖下紧紧攥起的手,也知道这个家伙绝对不会放心.<br/><br/>  不过这个仇,就由我来报吧.<br/><br/>  也许是因为有很多人称我为魔王的缘故,我对于<蝼蚁>的味道格外的敏感.<br/><br/>  所以当那个雍容华贵的贵族,带着优雅知性的笑容来与我打招呼的时候,我便清晰地感觉到她身上那用多少香水都无法掩盖掉的臭味.出乎我意料的是,我进入那座在她名下的古堡意外的轻松.<br/><br/>   这位失去了配偶的魔王夫人为了排遣寂寞,总是会在自己的古堡中举行各种各样的宴会.我可以感觉到来自楼上灼热的视线,那位身上带着浓郁气息的夫人正在以一种足以称得上是狂热的眼神死死地看着我,就仿佛我身上有什么东西能够满足她的愿望.<br/><br/>  不知为何,我忽然想起了古堡中一个被当做怪谈的传说.<br/><br/>  难不成,她把我也当成了那种传说中的存在？<br/><br/>  我不需要担心一个手无缚鸡之力的,我们视线相交之时,我看见她的眼中闪烁着惊喜的光芒.<br/><br/>']],
						lg_masi: ['male', '命运', 4, ['lg_monibaozhu', 'lg_chirekuangbao', 'lg_fennuzhiyan', 'lg_masi_zhenwang'], ['des:— 简介 —<br/> 愤怒,战斗吧!在摩诃婆罗多中足以与迦尔纳并称的婆罗门最强战士,愤怒的化身,即为马嘶.<br/><br/>  — 背景故事 — <br/> 摩诃婆罗多中的英雄之一.<br/><br/> 父亲是婆罗门的英雄德罗纳,在叙事诗描写的大战争中,与父亲一起加入了难敌方,和迦尔纳一起与般度五子展开了激烈的战斗.期间,以迦尔纳为首的己方有力者陆续战死之后,怒火冲冠的他违背了身为战士的誓约,决定发动夜间偷袭.<br/><br/> 传说中,他将数千人全部杀光了.<br/><br/> 总之,就是一味地愤怒.对不合理感到愤怒,对悲伤感到愤怒,对傲慢感到愤怒.<br/><br/> 但是,他发誓绝对不憎恨,他总是希望自己能成为一个不断反对不合理世界的存在.<br/><br/>  甩开所有小聪明的道理,无论对方是谁,只要自己不能接受,就轻松打飞.是在圣杯战争中,十分注重与御主相性的那种类型.如果性格不合,甚至会考虑在首战就自寻毁灭.<br/><br/>  玷污了战士名誉的他受到了极为严厉的惩罚,他被要求转让出额头上与生俱来的宝石,并被流放去了森林.传说中,他在森林里流浪了长达三千年之久.<br/><br/>  作为从者被召唤的他决定这次一定要贯彻真正战士的作风.同时,假如御主是位值得尊敬的存在,那哪怕自己不得不再次回到森林继续那漫长的流浪生活,也在所不辞.<br/><br/>  他就是这么一位热情的战士.<br/><br/>']],
						lg_bayunlan: ['female', '幻想乡', '4/5', ['lg_pingyituji', 'lg_simianchuge', 'lg_bayunlan_zhenwang', 'lg_bayunlan0', 'lg_xianhusinian'], ['des:— 简介 —<br/> 八云紫的式神,在八云紫沉睡的期间代替其进行各种活动,主要拥有使役式神程度的能力.<br/><br/>  — 背景故事 —<br/> 据说妖兽的尾巴越多魔力越高,越长则越聪明.能到达这个最高峰的就有她,九尾之狐,八云蓝.有着九条巨大的尾巴的狐,其耀眼的毛色造就了一种神圣感.<br/><br/> 而招收这只最强妖兽作为从者,主要用于杂用的就是最强的妖怪,八云紫.<br/><br/> 蓝作为式神听从紫的吩咐行事,她本身也能驱使式神,那就是蓝的式神橙.不过似乎橙还不够成熟,工作还不会交给她做.<br/><br/> 智力相当高,尤其擅长数学.据说连人类所无法想象程度的计算都能够在瞬间完成.只不过,由于擅长计算,比起构思新的概念,她更倾向于分析求解现有的事物.<br/><br/> 平时和八云紫住在同一个家,会代替紫在幻想乡各处行动.<br/><br/> 据目击者报告,不久前有来我这买油炸豆腐,虽是动物,也会正经地来买呢.因为有一定的贤知,所以耻于偷盗行为.<br/><br/> 人类和妖怪都是一样的.<br/><br/> 不久前,有只九尾妖狐在人类村落周围测量着什么,我很不安妖怪们是不是在策划着什么.<br/><br/> 不需要担心.<br/><br/> 这狐只是定期来检查幻想乡是否有变化,结界是否有破绽而已.<br/><br/> 本来是八云紫的工作,因为她嫌麻烦,就派妖狐来了.<br/><br/> <尾巴好暖和><br/><br/> <当然暖和了,毕竟是最强妖兽.><br/><br/>  她智能高,力量强,速度快.除非有足够自信,否则最好不要与她为敌.<br/><br/>  幸好她性格温和,不会为了自己而争斗,一般情况下是不会被无理由袭击的.不过要是妨碍了她的工作的话,那就要作好觉悟了.<br/><br/> 虽说不上是弱点,不过她很喜欢吃油炸豆腐,给她油炸豆腐的话,就能回避战斗吧.在兽道行走时,为以防万一,记得带上几块油炸豆腐.虽然也会出现在人类村落,不过不需要害怕,她只是来买东西的.<br/><br/>']],
						lg_yike: ['male', '罗德岛', 4, ['lg_diannengzhichu', 'lg_jujiaozhiling', 'lg_zhuanjing', 'lg_huihuangliepian', 'lg_yike_zhenwang'], ['des:— 简介 —<br/> 哥伦比亚出身的干员异客,曾在十三岁时就以极其优异的成绩跳级毕业,随后被源石工程与应用学专家索恩教授相中提拔为研究助手,进入布莱恩创生科技的研究所学习.于近二十余年前随某项目深入萨尔贡,之后销声匿迹.<br/><br/> 之后以伊巴特地区黑市主要成员的身份与罗德岛接触,并在脱离黑市后,单纯以感染者身份来到罗德岛接受治疗,并以工程部干员的身份活跃在各项行动中.<br/><br/>  — 背景故事 —<br/> 工程部对异客携带的各种自行机械进行了逆向工程,结果令人大开眼界.<br/><br/> 出于各种客观因素,异客无法在萨尔贡获取到哥伦比亚实验室里提供的高新尖材料,采用的源石施术单元也极为原始.即使如此,异客依旧独立研发出了一套行之有效的机械结构,并依赖于其掌握的某项核心技术,成功实现了能量输出可观的多种自行兵器.<br/><br/> 当问及其核心技术来源时,干员异客并没有避讳.其技术原型来自哥伦比亚的某个发掘实验,当地研究者认为这与萨卡兹古老的巫术有关,他们以一种罕见的法术形式为源石赋能,并在周遭发现了数枚残存的赋能源石结晶体.哥伦比亚相关研究所认为这将是一种全新能源的可能性,并对此展开研究.之后的事情,异客并没有过多透露.<br/><br/> 不过值得额外留心的一点是,许多工程部干员都热衷于给自己的造物取名字,有的是倾注了个人情感,也有人是出于功能性考虑进行编号区分.但干员异客则对自己制造出的机械完全没有类似的想法,他使用那些机械的手段近乎浪费,仅一场模拟测试他就毫不犹豫地报废了数台自行机械.他就一点不感到心疼吗？<br/><br/> 干员异客在罗德岛的表现过于安分了.<br/><br/> 当然,我没说这是不好的事情,这当然是好事!不如说有些干员反而太闹腾了!<br/><br/> 但异客曾在萨尔贡被冠以<沙卒>之名,虽然明面上不过是一座小黑市的领头人,天知道萨尔贡有多少黑市.但他的手腕和财富确是实打实的,他能提供相当丰富稳定的供货渠道,能提供伊巴特地区几乎所有合法或不合法的雇佣兵、信使和商队的联络方式.<br/><br/> 是啊,这当然是也是好事,但他差不多等于无偿提供给了罗德岛,无偿!你懂我意思吗？这也太令人不安了吧？<br/><br/> 听工程部的干员说,他也不是什么狂热的机械爱好者,明明技术水准那么高.不仅如此,他对感染者这件事本身也不是很上心,好像也没有什么像样的兴趣.偶尔会把房间打理得一尘不染,整齐到让人怀疑他有洁癖,有时候又毫不顾忌地在房间里摆弄零件,弄得一地铁屑,让人完全摸不着头脑啊.<br/><br/> 对了,他唯一起了名字的设备是那个载有特殊充能源石装置的无人机,名字叫<索恩>.<br/><br/> 哦,说这么多,其实我就一个问题,可能有点失礼.<br/><br/> 他这个人还活着,到底还在乎什么？<br/><br/>  异客.<br/><br/> 仿佛讽刺般给自己取下这个名字,但事实上,连他自己都搞不清楚自己的<家乡>在哪里. 其本人大方承认了数起发生在萨尔贡的惊世骇俗的谋杀案与其有所牵连,在萨尔贡卧薪尝胆二十余年,也只为了复仇这一个简单的目的. 诚然,复仇是很多人的原动机,这并不稀奇.但为了达成这一目的,出身哥伦比亚,仅仅是个年轻研究助手的艾利奥特花了整整二十年时间,让自己变成了一个萨尔贡人.<br/><br/> 他在伊巴特地区拥有相当的人脉,财富,权力.黑市的特殊性质使得许多本地贵族与境外商人都与他密切来往,而在达成复仇目的之后,这一切,他花了二十几年建立起的这一切,都被他简简单单地抛弃了.<br/><br/> 一个在萨尔贡从学徒做起,隐忍无数,最后风生水起的黑市主人,轻描淡写地放弃了一切.他完全可以在复仇结束之后,在伊巴特享受着堪比王酋的生活.这令部分人事部干员十分担忧,担忧这样的艾利奥特改名换姓来到罗德岛,是否别有企图.<br/><br/> 当我们试图试探这点时,艾利奥特,干员异客本人轻易点破了我们的疑虑,那时他正缓缓盯着手里的黑咖啡,沉默片刻后给出了答案.<br/><br/> <我痛恨萨尔贡的黄沙和那里的一切,一直都是.><br/><br/> 博士,凯尔希,慑砂.<br/><br/> 似乎在干员异客抵达罗德岛之后,只有这三个人能提起他的兴趣.<br/><br/> 诚然,他礼貌待人,工作一丝不苟.但在他完成那些工程部指标,或是经历了险恶的任务凯旋归来的时候,他的眼里都没有半点情绪波动.<br/><br/> 他对自己的秘密毫不藏私,除了最关键的部分,任何人只要问起他,他就能像备好腹稿似的用简练的语句描述他的经历与当下的状况.并不是每个人都能以这种态度面对过去.在那场火灾击杀了他最后一个复仇对象之后,他解脱了,但他把人生中最黄金的岁月全部奉献给了他的复仇事业,等他从萨尔贡的黄沙中脱身之后,他还能做些什么？<br/><br/> 异客曾说,凯尔希医生是他的救命恩人.在他说这话的时候,我可从没能从他那标志性的微笑里看出哪怕一丝一毫的感激.但他的确在某些层面十分信任凯尔希医生,关于二人如何在萨尔贡相遇,异客坚持,如果凯尔希不多谈一字,他也绝不会透露任何关于她本人的信息. 至于慑砂,异客对于慑砂的关注十分危险.<br/><br/> 只有包括博士在内的极少数人知道慑砂在调查哥伦比亚某个军工企业的事实.而不幸的是,慑砂<未能进行的复仇>十分契合异客投以关注的全部要素,他甚至热衷于帮助慑砂拼凑真相,并暗示其真相的种种可能.若非受到罗德岛干员身份的限制,我们无法想象,慑砂与异客是否真的有可能对那家军工企业实施实质性的报复.<br/><br/> 而异客至今仍没有任何过激举措的重要原因则在于博士.无论异客对博士抱有怎样的感情,他仅对博士展露出了兴趣,也对博士参与的各项行动表露出了更高的积极性.也许,他出于某种角度把如今自己奇怪的生活状态与博士进行了重叠,又或者,他只是觉得有个人给自己发号施令,指引方向会是一件轻松些的事情.无论如何,我们都要更谨慎地观察他.<br/><br/> 如他所说,他离开哥伦比亚,离开萨尔贡,如今身在罗德岛.于这片大地之上,他无论身在何处,皆是异乡异客,只是局外人罢了.<br/><br/>']],
						lg_ganyu: ['female', '提瓦特', '2/4', ['lg_tiandijiaotai', 'lg_shanzelinji', 'lg_jiangzhongtianhua', 'lg_ganyu_zhenwang', 'lg_bingyuansu'], ['des:— 简介 —<br/> 璃月七星的秘书,体内流淌着人类与仙兽的血脉.天性优雅娴静,但仙兽<麒麟>温柔的性情与坚定毅重的工作态度毫无冲突.毕竟,甘雨坚信自己所做的一切工作都是为了践行与帝君的契约,谋求璃月众生的最大福祉.<br/><br/>  — 背景故事 —<br/> 在璃月,百姓们大多对<玉京台>的生活心驰神往,对其中的运转规则却知之甚少.人们知道<璃月七星>是人中翘楚,掌握着城市的命脉.但他们很难了解,每个决议背后的数据支撑,是如何建立起来的.<br/><br/> 人们知道每一年新颁布的条例都会给市场带来全新的变数,却不知道它们是怎样从繁杂的会议纪要中被摘录出来,逐渐整编成为晓畅的文字的.<br/><br/> 甘雨,<月海亭>的秘书,承担了诸多世人看不见的工作.纵然世人得知甘雨的地位,恐怕他们也很难将<月海亭>的秘书与破晓时分站在码头上、安静享用早点的少女联系起来.<br/><br/> 但在旭日东升之前,她一定会重新回到高踞玉京台之上的月海亭,继续完成她的<契约>. 那是远在三千年前,她与<岩王帝君>签订的契约.<br/><br/>  甘雨并非七星中<某一颗星>的秘书,而是辅助<璃月七星>这个整体的秘书.在文静温柔的表象下,甘雨具备着磐石一般地毅力.<br/><br/> 关于这点,统领仙人的岩王帝君早已察明.<br/><br/> 千百年前,当<璃月七星>之位最初显现于璃月时,甘雨就成为了初代七星的秘书.此后多年里,璃月七星不断更迭,唯有甘雨始终陪伴左右.<br/><br/> 这也意味着,璃月各司各部、方方面面的文书事务,在这些年间层层汇聚积压,最终落到了甘雨肩上.但即使面对着七倍、百倍、千倍的工作量,她的责任感依旧数年如一日,从未衰减.<br/><br/> 曾有人探究过甘雨动力的来源,得到的回答却稍稍对不上提问.<br/><br/> <我所做的,距离帝君的功绩……还差得远呢.><br/><br/>  <我的工作,是为璃月的多数生命,谋求最大的福祉.><br/><br/> 在绝大多数情况下,甘雨都是一名值得托付信任的秘书.<br/><br/> 很难想象在面对这样庞大工作量的情况下,还有谁能比她做得更出色.更不用提她对璃月所有的事物,都能作出独到而敏锐的见解.但甘雨的可靠性,只能维持在绝大多数情况之下.<br/><br/> 越是在关键的节点上,越是努力想要做到分毫不错,甘雨就越是紧张,往往会在巨大的心理压力之下忙中出错.<br/><br/> 例如<七星请仙典仪>,可谓璃月一年中最重要的仪式.<br/><br/> 甘雨却在某年的<七星请仙典仪>上迟到了三分钟,在众目睽睽之下,勉强挤入了人群. 事后,甘雨红着脸支支吾吾,说不出所以然来,只是在心里对<岩王帝君>道歉了一千遍.<br/><br/> 朝夕相处的同僚们,都猜想这次的疏忽应该是事出有因.关系淡漠些的,见帝君毫不在意,也就不再多舌.私交好一些的,则在私底下关心着她的状况,询问是否需要调整工作量,或者安排短期休假,甘雨却摇着头拒绝.<br/><br/> <今年出席典仪时的衣饰穿戴,和去年相比应该怎样调整？为此举棋不定了两小时……><br/><br/> 这种理由,甘雨是绝对说不出口的!<br/><br/> 千年有多长？<br/><br/> 长到开满荻花洲的琉璃百合,在洪水后绝迹;长到归离原人声鼎沸的集镇,在战后化为断壁残垣.<br/><br/> 千年有多短？<br/><br/> 对甘雨来说,正如白驹过隙间.<br/><br/> 在这凡人难以想象的漫长时光里,甘雨一直端坐玉京台,处理各种事务.亲手记录每一座楼阁的落成,亲眼见证每一个产业的繁荣.<br/><br/> 甘雨对于时间流逝的客观感受,来自于白纸上不断庞大的数字,来自于总是需要更多颜色才能区分内容的表格.时间几乎没能改变甘雨的心智,她的内心始终在<人>和<仙兽>之间摇摆.<br/><br/> 一方面,身为麒麟的她,难以理解人类世界的诸多纷争.而另一方面,人类的血脉却总是提醒她,要对融入社会抱有希望.<br/><br/> 一旦脱离了工作的范畴,甘雨就很容易显露出本性上的与众不同之处.<br/><br/> 她有睡午觉的习惯,同时仿佛内置了极其精准的生物钟.一旦到了午休时间,便不分地点不分场合,只要将身子蜷作一团就能立刻睡着,即使吵闹到有一群丘丘人围在她身边跳舞,也不会醒来.<br/><br/> 这种习性,最初也只是<璃月七星>内部流传的笑谈.<br/><br/> 然而,有次陪同某一代的<天璇星>,在午间外出就餐后,酒足饭饱的甘雨直接缩进了路边的干草堆,被一路运去了荻花洲,直到卸货时脑袋砸到了地面,才醒了过来.<br/><br/> 在这往返的三小时内,四处找不见甘雨、又深知甘雨不会不告而别的那位<天璇星>,险些填报了人口失踪信息.<br/><br/> 在那之后,面对<今后只能在安全之地午睡>的告诫,甘雨有些委屈地回应:<璃月全境……不都是安全的地方吗.><br/><br/> 究其原因,或许是身为仙兽的混血后裔,甘雨对世间事物的认知,与多数的人类原本就有所不同.<br/><br/>  甘雨有着仙兽<麒麟>血脉这件事情,在璃月港鲜为人知.<br/><br/> 每当路经绯云坡,有不明真相的路人问起她长发间显眼的突起时,她总谎称那是家传的头饰.<br/><br/>  <如果让大家知道真相的话,就会和大家更疏远了.><br/><br/>  虽然实际上也不曾跟市民们亲近过,但在甘雨心里,疏远总不是好事.当然,更重要的原因是,一旦老实告诉了大家<这是麒麟的角>,就无法保证不会有人怀着好奇的心情,伸手来摸.<br/><br/>  而角这种器官也是有感觉的,无论是心理上还是生理上. 同样被甘雨着重隐藏起来的秘密,还有<需要保持体型>一事. 尽管麒麟一族是严格的素食主义者,但璃月料理作为天下美食之集大成作,即使是素菜,也会令食客难以控制食欲.<br/><br/> 因此,习惯了城市生活的甘雨,会非常在意自己的体型与体重.不自觉地便会被美味吸引,又要严格控制好自己的进食.对甘雨来说,困难程度不亚于在龙脊雪山找到一朵烈焰花.但甘雨绝不会在半山腰放弃.她曾在数千年前的魔神战争中,因为体胖如球而卡住了巨兽的食道,最终轻松降伏了对手.<br/><br/>  这样令人啼笑皆非的过往,甘雨是无论如何也不想它再次重现的.<br/><br/>']],
						lg_adila: ['female', '命运', 5, ['lg_xingzhiwenzhang', 'lg_junshenzhijian', 'lg_junshenzhijian1', 'lg_adila_zhenwang'], ['des:— 简介 —<br/> 建立起巨大帝国的王,匈人之王阿提拉.匈奴的后裔,匈人族的战士和王.制霸了覆盖西亚至俄罗斯、东欧、高卢地区的辽阔版图的五世纪的大英雄,据说她导致了西罗马帝国的灭亡.<br/><br/> — 背景故事 —<br/> 直觉优秀,在面对各种事态时,都能维持理性直面困难.拥有极高自尊心的战士,总会令人感受到些许<空虚>的要素.战斗时能冷静而正确的把握状况,化为冷酷无情执行杀戮的战斗机械.<br/><br/>  纯粹的<战斗王>.<br/><br/> 相比战场上的武勋,其统治却并不成功,自己死后,帝国迅速瓦解消失.然而,代表着畏惧与恐怖的<阿提拉>之名,直到现代仍停留在人们的记忆中.<br/><br/> 如果能向圣杯许愿的话,想要过不是战士的人生.绝不是讨厌身为战士的自己,只是,对于如若不是战士,自己将如何生活很有兴趣.<br/><br/>']],
						lg_feixieer: ['female', '提瓦特', '3/4', ['lg_shixingmoya', 'lg_zhiyehuanxian1', 'lg_yexunyingyi1', 'lg_zhiyehuanxian', 'lg_yexunyingyi', 'lg_zhiyehuanxian0', 'lg_feixieer_zhenwang'], ['hiddenSkill', 'des:— 简介 —<br/> 自称<断罪之皇女>,与名为奥兹的漆黑夜鸦同行的神秘少女.目前正以调查员身份供职于冒险家协会.通过自己的特殊能力加上奇妙的个性,还有本人不愿意承认的努力,菲谢尔成为了冒险家协会调查员中的新星,且成功赢得了大家的认可.<br/><br/>  — 背景故事 —<br/> 菲谢尔是由异世界的<幽夜净土>流落至此的<断罪之皇女>.<br/><br/> 她与会说话的夜鸦眷属<奥兹>一同,<观测编织命运的因果之丝>.出于某些她说不清,而奥兹又不愿明说的原因,菲谢尔目前正以调查员身份供职于冒险家协会.<br/><br/>  身为冒险家协会的调查员,菲谢尔拥有奥兹这一得天独厚的优势.<br/><br/> <小姐,请不要再派我去窥探风魔龙的动向了.以我这副身板,恐怕连给那家伙塞牙缝都不够啊.><br/><br/> <哼哼.能有幸成为断罪之皇女眷属的你,为我献出包括视力与生命在内的一切,也是自然的吧？><br/><br/> 能看见奥兹所见一切的她,只要愿意,就能寄宿在夜鸦之中,振翅高飞,俯瞰大地.无论是望风山地的生态,还是奔狼领的骚动,都能透过奥兹的鸦眼,看得清清楚楚.这样的特殊能力加上一点点努力和奇妙的个性,让菲谢尔成为冒险家协会调查员中的新星,赢得了大家的认可.<br/><br/> 菲谢尔十四岁时作为调查员加入冒险家协会一事,据说是由她父母介绍的.不过,既然菲谢尔是断罪之皇女,那她的父母,难不成是断罪之皇帝与断罪之皇后陛下吗？<br/><br/> 据说在冒险家中,流通着一本<菲谢尔辞典>.<br/><br/> 那可是本奇书,能将菲谢尔用语转换为浅显易懂的词句.<br/><br/> 譬如,<我听见,在时间之渊中回响的往日烈风,吹彻在因果的洪流中被忘却的尖塔>代表着<风龙遗迹>; <负担断罪之名的侍者哟,就如你所愿,准备好承担皇女的伟大智慧>的意思是<我调查一下,马上给你结果.><br/><br/> <欢唱吧!贪求着皇女祝圣之仪的扈从们,请怀着猛虎之心,深入战场吧!>则表示,她已经将前期调查报告准备妥当.<br/><br/> 而<一切,都记载在这本漆黑的预言书中>,意味着她已经根据冒险家的报告,以自己的行文写好了冒险家日志.但其实,所谓的<菲谢尔辞典>并不是成文的书卷.<br/><br/> 熟悉她的人,会用心聆听她的每一句话,并理解话语的含义.这才是对她的尊重与认可.<br/><br/> <哼,果然你也能明白,不愧是与我命运相连之人.><br/><br/> 如果能顺着她的意思说上几句,她会害羞且高兴地夸奖你语言学习能力优异:<br/><br/> <皇女从不吝啬赞美……那,再陪我多说一会儿？咳咳,不要误会,这些是要化作新世界基石与薪柴的东西……><br/><br/>  奥兹与皇女菲谢尔不仅是挚友、主从,更是共享灵魂与命运的关系.他们的初遇发生在<菲谢尔皇女夜谭>的卷一:<末日解体概要>.<br/><br/> 孤独巡礼的皇女抵达永恒黄昏之国时,抗拒命运的黄昏王族在无可抗拒的绝望中选择了否定.<br/><br/> 他们的否定是如此彻底,不但否定了菲谢尔身为幽夜净土主宰皇女的尊贵身份与使命,否定了自己守望幽夜净土的职责,否定了自己身为皇家旁支传承一万三千年的血脉,还否定了身为人的高贵与矜持,进而退化成为愚钝凶暴的兽群.<br/><br/> 在黄昏的宫廷中,在野兽的撕扯中,皇女洁净的血如珍珠般洒落在古老纹章上.危机时刻,如夜幕般宽广的黑翼撕开了绝望,庇护着负伤被困的皇女.循着贵种之血的气息,夜鸦之王奥兹华尔多·赫芙那梵茵斯终于来到孤独的皇女身边,向她宣誓永远效忠.<br/><br/> 有这么一个故事.很久很久以前,在很远很远的地方,有一个很小很小的小女孩.小女孩的爸爸妈妈都是忙碌的冒险家.她自幼在图书馆中,跟随书页跨越了一千个宇宙,成了幽夜净土的主人,成了降下圣裁之雷的皇族之女,与漆黑的夜鸦成为共享命运的至交……<br/><br/>  <██,今天看了什么书呢？>难得从冒险中返回的爸爸妈妈,这么问她.<br/><br/> 她会告诉他们,从自己喜欢的系列小说中读到的故事:<br/><br/> 于是他说:<菲谢尔·冯·露弗施洛斯·那菲多特,你可是断罪的皇女,是我引以为豪的女儿,无论如何也不能放弃崇高与梦想.><br/><br/> <哦哦,是很好的故事呢.既然██这么喜欢,就叫你『小菲谢尔』吧.>爸爸笑着摸摸她的头.<br/><br/> <小菲谢尔你可是了不得的皇女,是我引以为豪的女儿.无论如何,也不要放弃崇高与梦想喔.>温柔的话语充满善意与嘉许,点亮了她的心.<br/><br/> 但与忙碌父母相伴的温暖时间总是如此短暂. 因沉醉幻想小说而与周遭格格不入的她,每当孤独,每当痛苦,总会告诉自己:<br/><br/> <我是菲谢尔,是了不得的皇女.这是连爸爸妈妈也认可的.><br/><br/> <无论如何都不能放弃崇高与梦想!因为这些都是,对皇女的考验.><br/><br/>  正如<菲谢尔皇女夜谭>的宇宙,最终因熵增而走向寂灭.那个沉醉幻想的小女孩,也无可避免地长大了一些.<br/><br/> 十四岁生日当天,不愿理解菲谢尔的孩子们再次嘲弄了她.这只是高贵皇女难免遭受的小小挫败罢了,爸爸妈妈一定能明白的.她心想. 身为皇女,无论如何也不能放弃崇高与梦想. 当她回到父母身边,期望寻得安慰时,迎接她的却是温柔而疲惫的话语:<br/><br/> <啊,██.你已经十四岁了,该从那些小孩子的幻想里走出来了……><br/><br/> 熟悉的声音就像烧红的细剑,刺穿了少女的胸口.那天午夜,躲在无比熟悉的图书馆里,少女感觉到异样的视线,听见了不应属于这个世界的振翅之声.<br/><br/> 透过哭得红肿的眼睛,她与不属于这个世界的漆黑夜鸦对上了目光.而那之后的事情,就是另一个故事了……<br/><br/> 菲谢尔不喜欢这个故事.每当想起这个故事,她就会感到窒息般的痛楚、噬咬般的孤独.或许有一天,这个故事会被谁写下来吧.但那只是██的故事罢了,和菲谢尔没有关系.<br/><br/> 皇女只有一个名字,那就是菲谢尔.菲谢尔只有一个身份,那就是皇女.简单又完美的逻辑.只要将其熟记于心,加上一点点皇女的崇高,和一点点他人的体贴,就没有什么能伤得了她.<br/><br/> 况且,如今的皇女菲谢尔不但拥有奥兹,还与那位同样来自另一个世界的旅人相识了……<br/><br/>']],
						lg_lumiya: ['female', '幻想乡', '1/4', ['lg_ziyezhiniao1', 'lg_ziyezhiniao0', 'lg_lumiya_zhenwang', 'lg_lumiya0', 'lg_yueliangguang', 'lg_jingjiexian', 'lg_jingjiexian0'], ['des:— 简介 —<br/> 拥有操纵黑暗程度的能力,听起来很厉害,实际上只是用通过魔法创造出的黑暗强行覆盖周围的事物,除了影响视觉以外并没有什么特别的作用.<br/><br/>  — 背景故事 —<br/> 在妖怪之中属于弱者,拥有让其周围无论昼夜都是一片黑暗这能力的,就是露米娅.<br/><br/> 这妖怪产生的黑暗,是让火把都失去作用的魔法之暗,闯入其中的人类的视野会降低得无异于失明.被趁着这种黑暗被袭击的话可能撑不了一时半刻,不过幸好她不会和别的妖怪一同行动.<br/><br/> 外表是年幼的少女,赤眼,头发是黄色的并系着一条红色缎带,据说是穿着黑色的衣服目的是为了融入黑暗之中,但是由于通常都处在黑暗之中所以很难确认.<br/><br/> 也许是作为黑暗的怪物,通常都会被人害怕,不过在看到她真实姿态的人都因为其年幼少女的外表会有点失望.可能将身形包裹在黑暗之中就是为了隐藏她的外貌.<br/><br/> 还有,黑暗的能力只是辅助性的,袭击人类的时候都是凭力量来进行.由于外表只是看起来的样子而已,究竟她有多强仍是疑问,在黑暗中又无法分出胜负.看不到退路的话是令人恐惧的.<br/><br/>  据目击者报告:<br/><br/> <那啥,有个大的黑块往森林的方向过去了,好可怕……><br/><br/> <那个大黑块可能就是这个妖怪的黑暗了, 绝不要靠近它><br/><br/> <就那样,大黑块撞到了树上停下了一会儿,向我这边过来了我就马上逃走了.><br/><br/> <我想一定是撞到树上了……可能,妖怪自己也看不到黑暗之外吧.><br/><br/>  <有次我逃离不及,撞入了黑暗之中,不过也没碰到妖怪,就这么穿过了黑暗.就算有人类进入了黑暗中,里面的妖怪也无法辨认吗？><br/><br/> <这么说,她发出的黑暗,连她自己也看不见吧？><br/><br/>  本来力量就与妖怪无法相比的人类,在火把也无法照亮的黑暗中根本毫无胜算吧.除非有一定对策和对自己的手段有相当的自信,可不要贸然冲入黑暗之中.<br/><br/> 还有,如果在夜晚有月光照不到的地方,最好不要过去.说不定露米娅就在那里.偶尔,也有遇见没有展开黑暗的露米娅本体这类的事发生.出现的条件就是,新月的夜晚.在这天,不知为什么露米娅常常不施展能力,目例报告案例络绎不绝.<br/><br/> 很少人和她直接交谈,估计对话也很难成立,和她说话是危险的.<br/><br/>']],
						lg_quanzouhua: ['female', '幻想乡', 5, ['lg_tiangoushijue', 'lg_tiangoushijue1', 'lg_kuangquanduanshi', 'lg_kuangquanduanshi1', 'lg_quanzouhua_zhenwang', 'lg_quanzouhua0', 'lg_jujuewanwei0', 'lg_jujuewanwei'], ['des:— 简介 —<br/> 在妖怪之山上巡逻着的天狗,有着看见千里之外程度的能力.视觉,嗅觉均很优秀,可以瞬间发现侵入者.<br/><br/>  — 背景故事 —<br/> 她的部队在一般情况下,都在瀑布的内侧待机.因为她的性格协调性很高,所以会忠实的执行任务.<br/><br/>  虽然这对妖怪来说是很稀罕的事情,不过在天狗的社会里还挺常见的.但是,因为妖怪之山基本是没什么侵入者的,所以她一般很闲.在待机的时候,经常去找附近同样闲的河童,一起玩一种被称为大将棋的出乎人们想象的耗时间的游戏.<br/><br/>  对寿命很长的妖怪们来说,打发时间的手段实在是有够难找的.<br/><br/> 从河童的所有物中发现了新的从没有见过的将棋的棋子,引起了轰动.<br/><br/> 人人皆知的将棋是由步兵跟两条龙来守护玉(翡翠),金,银,桂枝,香木的财宝的游戏,但只是这样的话分出胜负的时间太短了,所以白狼天狗们大幅度的增加了棋子,采用了追加了独自的规则的天狗大将棋.<br/><br/> 天狗大将棋增加了更多的财宝跟保护财宝(瞄准)的妖兽,妖怪.一场棋下上好几天也很正常.<br/><br/> 这次发现的将棋的棋子有大将、中将等步兵的强化版的棋子还有飞机、间谍等完全猜不透用处的棋子.全部都没有说明,就是说没法用来玩.<br/><br/> 至今为止积极地追加棋子扩张规则的白狼天狗犬走椛如此说道.<br/><br/> <我以为独自改变棋的规则的只有我们.没想到外面的世界也有在弄一样的事,有点不服气呀.><br/><br/> 她虽然这么说,但也在全力为新的棋子追加规则.<br/><br/> <我想亲眼看看将棋在外面的世界进化到了什么地步.但是,根据新找到的棋子判断在外面的世界将棋的规则有可能简易化了.那样的话让我们天狗玩或许会感觉缺点什么呐……><br/><br/> 现在,外面的世界已经完成了战后的复兴,进入了高度的成长期.原本需要花长时间玩的游戏都被简略化,变得能够轻松的玩的可能性很高.如果是那样的话啊,在将棋方面或许跟幻想乡进行着完全不同的进化.自隔离起刚刚经过半世纪,文化的差距看来是无法止住了.<br/><br/>']],
						lg_yileina: ['female', '异界', 4, ['lg_nizhuan', 'lg_yongdong', 'lg_bingzhuifengbao', 'lg_yileina_zhenwang', 'lg_bingzhuifengbao1'], ['des:— 简介 —<br/> 表面上有些自恋,说话辛辣毒舌,但实际上却是个温柔的老好人.无论是在自己还是他人的认知中都是活泼可爱的美少女,很受男女欢迎.<br/><br/>  — 背景故事 —<br/> 同时也是一个俏皮可爱的美少女,心地善良,富有爱心.留有一头灰白长发、深蓝紫色的眼瞳、身披黑色长袍、随身带着一把会飞的扫帚,头戴一顶魔女帽,胸口系着一个黄色蝴蝶结、戴着象征魔女的胸针.<br/><br/> 十四就已取得魔法使中的最高位<魔女>称号的天才少女,其魔女称号为<灰之魔女>,同时也是一名旅行者.<br/><br/> 虽然伊蕾娜对猫过敏,但是却十分善良.不喜欢吃菇类食物,面包最喜欢牛角面包.最擅长做炖菜,吃到可口的食物时呆毛会动.对于美味的食物和可爱的物品几乎无法拒绝.<br/><br/>']],
						lg_yubanmeiqin: ['female', '异界', '3/4', ['lg_diancichang', 'lg_leijizhiqiang', 'lg_chaodiancipao', 'lg_chaodiancipao1', 'lg_yubanmeiqin_zhenwang'], ['des:— 简介 —<br/> 学园都市中仅有的七名超能力者中排名第三位,学园都市最强<电击使>,代号<超电磁炮>.<br/><br/> 贵族女校常盘台中学二年级学生,有<常盘台的王牌>和<最强无敌的电击公主>之称.性格好胜、正义感强,有着男孩子般的爽朗性格,但是却没有耐心,非常不坦率.<br/><br/> — 背景故事 —<br/> 传言中<唯一正常的等级五超能力者>.平常总是豪放不羁的模样,有着男孩子般的爽朗性格,很没有耐心.同时又非常不坦率,有着容易害羞的另一面.外表虽然看不出来,美琴跟上条当麻一样拥有好管闲事的麻烦体质 .<br/><br/> 拥有高度的自尊.个性好胜且不服输,对于自己的能力抱持绝对的自信.仅仅因为<我不允许有人比我还要强>这种理由,经常向能够轻松消除其能力的上条当麻发起挑战.有着独断独行的性格,喜欢一个人独自解决问题,不愿将他人卷入其中.<br/><br/> 不属于常盘台的任何派阀,对任何人都以一视同仁的态度对待.在大家眼中是性格温柔、平易近人、没有大小姐气派的好人.在大小姐遍地的常盘台中学乃至整个学舍之园中有着极大人气,有着被学妹们所仰慕、令学姐们刮目相看的大小姐形象.<br/><br/> 实际上,美琴有着一旦开口说话就二十分钟也停不下来的嘴巴,一不高兴就会狂放电的个性 .<br/><br/> 经常会做出一般千金小姐不会有的举动,有时的行为更是相当粗鲁.明明是个会做出些破天荒事情的人,却都因为传言和媒体把美琴的形象美化过头了.<br/><br/> 随着御坂美琴的知名度的上升,美琴的不雅举止的目击情报也一个接着一个,因此面对大霸星祭运营委员会对其担任大霸星祭的选手宣誓工作的邀请也因此被校方辞退了 .<br/><br/>']],
						lg_baijingheizi: ['female', '异界', '2/4', ['lg_kongjianyidong', 'lg_kongjianzhangwo', 'lg_jianshichuansong', 'lg_baijingheizi_zhenwang'], ['des:— 简介 —<br/> 常盘台中学的大小姐,家是涉及超商和进口超市领域的白泉控股.御坂美琴的室友和学妹,也是常盘台中学唯一的空间移动能力者.<br/><br/>  — 背景故事 —<br/> 身为风纪委员,本来隶属于常盘台中学内的风纪委员活动第003支部,但是由于与初春饰利组合行动的情况比较多,所以频繁出入第177活动支部.<br/><br/> 以<风纪委员>的身份努力进行各种维持校园治安的活动,在她的眼中<生命的价值没有高低之分>.由于风纪委员的管理范围只有在自己的学校之内,所以黑子经常做的校外治安维持活动其实是越权行为,所以经常要写悔过书,简直是过着把写善后报告当兴趣的生活.<br/><br/> 拥有强烈的责任感和正义感.心中有着绝对不会屈挠的信念,并且深信不疑,体力行.虽然身材娇小,但是格斗技能非常强,加之其空间移动的能力,打击罪犯不遗余力.<br/><br/> 传闻中<风纪委员之中有个最邪恶的空间移动能力者>的正体,在男性风纪委员眼中则是<百合>、<变态>和<恶魔>的代名词.<br/><br/>']],
						lg_leimu: ['female', '异界', 5, ['lg_bingyun', 'lg_guizhu', 'lg_leimu_zhenwang'], ['des:— 简介 —<br/> 露格尼卡王国,处在边境伯罗兹瓦尔宅邸的双胞胎女仆中的妹妹,鬼族后裔.维持着宅邸的机能,与笨手笨脚的拉姆不同,在工作上全能.<br/><br/> — 背景故事 —<br/> 对姐姐拉姆有着绝对的信赖,是个十足的姐控,一直觉得姐姐是最优秀的.因小时候作为鬼的能力不如姐姐而感到自卑,在姐姐为了救自己而失去了角的力量后为了能保护姐姐,以姐姐为目标努力着.<br/><br/> 一开始由于昴身上<魔女的香味>以及因为轮回而行动诡异而对昴充满着敌意和怀疑,甚至在轮回中下了杀手,但是在经历了种种事件后开始对昴十分信任,将昴的一切都看在眼里.<br/><br/> 从此深深地爱上了昴,性格逐渐开始温和,也变得更加爱笑了.在王选篇的轮回中多次为了昴牺牲了自己,始终陪伴着一度鲁莽行事,不断犯错导致轮回.<br/><br/> 甚至精神崩溃的昴,如同昴精神支柱一般的存在,也正是因为有雷姆始终如一不离不弃的陪伴,昴才找回了寻找完美结局的动力,也对雷姆产生了感情 .罗兹瓦尔认为昴对雷姆的感情之强烈足以匹敌他对爱蜜莉雅的感情.<br/><br/>']],
						lg_aimiliya: ['female', '异界', 4, ['lg_jinglingqiyue', 'lg_bingdongjingdi', 'lg_yuedingdehuayuan', 'lg_aimiliya_zhenwang'], ['des:— 简介 —<br/> 露格尼卡王国第四十二代王位候选人,因其为混血的银发半精灵,和曾经险些毁灭大陆的嫉妒魔女莎缇拉相貌相同,故被许多人所厌恶.<br/><br/> 曾搭救了被小混混围殴的男主角菜月昴,性格格外善良温柔,由于昴的死亡轮回所以不记此事,有些天然呆.是菜月昴不断死亡所想要拯救的对象,也是菜月昴最喜欢的女孩.<br/><br/> — 背景故事 —<br/> 根据爱蜜莉雅的姑姑菲尔托娜所言,银发和紫绀色的眼眸遗传自亲生父亲的精灵家族,温柔的面容则继承自母亲.父亲的一族拥有的锐利凶恶的眼神,并没有继承.<br/><br/> 在精灵部落里并没有她的亲生父母,自懂事开始就一直都由姑姑福尔图娜养育,对爱蜜莉雅而言福尔图娜就是她的母亲,据第四章爱蜜莉雅的回忆中菲尔托娜的话,其生父母的死很有可能与<虚饰魔女>潘多拉有关.<br/><br/> 而因爱蜜莉雅与<嫉妒魔女>莎缇拉的外貌一模一样的关系,精灵族的大家对她也是另眼相看,但并没有讨厌她.每隔一段时间怠惰司教都会带来物质给予福尔图娜和精灵群落的大家.<br/><br/> 后来虚饰的魔女和强欲司教来袭,顺带引来了三大魔兽之一的黑蛇来袭击精灵群落.为了对抗强欲司教,怠惰司教强行融合了贤者交托给他的魔女因子觉醒了<不可视之手>,但依然不是强欲司教的对手,怠惰濒临死亡.<br/><br/> 在一旁观战的虚饰魔女使用权能<改写现实>改写了<让强欲司教与自己随行袭击精灵群落>的事实强制让强欲司教回去了.强欲司教所做成的一切对现实的干涉都被还原,怠惰身上的所有伤都被因<强欲司教不曾来过这里>而还原了.<br/><br/> 战斗的最后,因虚饰魔女再次使用权能<改写现实>,让怠惰误杀了他最珍视的福尔图娜而精神崩溃.目睹这一切的爱蜜莉雅暴走了,爆发出连气候都能改变的魔力,但依旧不敌虚饰魔女.<br/><br/> 虚饰魔女无法达成目的,就只好暂时撤退,临走前篡改了爱蜜莉雅的记忆,把精神崩溃的怠惰司教带走并对其洗脑.随后爱蜜莉雅因持续不可控的魔力暴走连同自己一起冰封了整片艾利奥尔大森林,直到百年后被帕克救出,开始了正篇的故事.<br/><br/>']],
						lg_xinggongliucan: ['female', '异界', 2, ['lg_kai', 'lg_kai0', 'lg_bi', 'lg_jie', 'lg_jie0', 'lg_fang', 'lg_xinggongliucan_zhenwang', 'lg_fang1'], ['hiddenSkill', 'des:— 简介 —<br/> 识别代号:Zodiac(星宫).<br/><br/> 是宇宙中的精灵,因为使用天使的能力封印了自己的心灵而感觉不到寂寞,对在地球生活毫无兴趣也因此拒绝了士道的好意.<br/><br/> — 背景故事 —<br/>自称因封闭了心灵而感受不到寂寞,即是说只要打开心灵就会感受到寂寞.被士道利用这一点进行攻略.<br/><br/> 根据二亚的描述推断出,六喰与琴里、美九、折纸(狂三属于自曝身份)一样是属于被<幻影>赋予灵结晶成为精灵后仍然保存人类时期的记忆并持续停留于人类世界的精灵.所以没有因为通常现界而遭受过AST的攻击,也没有去过邻界.<br/><br/> 六喰说话语气很古风.重视家人,渴望亲情.喜欢士道,称他<官人>,并将其视为姐姐一般的重要存在.<br/><br/>']],
						lg_hanchuanhuili: ['female', '时之岸', 5, ['lg_fuyao1', 'lg_fuyao', 'lg_suifengmotan'], ['des:— 简介 —<br/> 阴沉寡言的外表,加上有些俏皮可爱的少女.实际上很想融入集体,但实在是缺乏活跃气氛的能力.<br/><br/> — 背景故事 —<br/> 阴暗潮湿的房间,干硬粗粝的面包,还有一杯浑浊不堪的水.<br/><br/>  <好难受.><br/><br/> 妹妹蜷缩在墙角,用力地啃咬面包,嘴里发出含糊不清的呻吟.我爬了过去,手背覆在她的额头上.<br/><br/>  <你发烧了!>灼人的温度让我感到一阵惊慌,下意识地靠往门边.<br/><br/> <要坚持住,姐姐这就去叫泽光大人.><br/><br/>  <不要……姐姐不要!><br/><br/> 妹妹不知从哪来的力气,一把抓住了我的手腕,快要失去焦距的双眼里写满了恐慌.声音越发地微弱,直至不可听闻.<br/><br/>  随着妹妹的倒下,无边的黑暗淹没了我.<br/><br/>  我下意识猛地睁开眼睛,嘴巴微张,我发出了无意义的嗬嗬声.<br/><br/>  <姐姐？姐姐!姐姐……你怎么了？>熟悉的声音在耳旁响起,我呆滞了好几秒,才逐渐缓过神来.<br/><br/>  一张焦急的脸映入眼帘.<br/><br/>  <原来……是梦啊……><br/><br/>  <姐姐……没事,不用担心哦.>我没有再说话,空气突然安静了下来,只能听到一旁火堆不时响起的噼啪声.耳朵贴着妹妹的脸颊,好一会后,我轻声道:<br/><br/>  <心跳,慢下来了？><br/><br/>  <嗯？><br/><br/>  <没什么.><br/><br/>  <姐姐？><br/><br/>  但这只是一个噩梦的开始.<br/><br/>']],
						lg_diesikuli: ['none', '命运', 5, ['lg_tunshiguangye', 'lg_tunshiguangye1', 'lg_shuangshenzange', 'lg_xinsheng', 'lg_diesikuli_zhenwang', 'lg_chengshuang', 'lg_shuangshen01'], ['des:— 简介 —<br/> 某对双子(狄俄斯库里)升上天空,成为了闪耀的双子座,狄俄斯库里这个名字意味着<宙斯之子>.<br/><br/> 双子座被称为狄俄斯库雷斯,而他们被称为卡斯托耳和波鲁克斯.他们出现于拉科尼亚(伯罗奔尼撒半岛东南位置),随后升上天空,世间再也没有出现胜过这对兄妹间的爱.<br/><br/> 主神宙斯希望能永远铭记他们的感情,将他们起名为双子座,并将两个独立星座的星星统合为一.<br/><br/>  — 背景故事 —<br/> 狄俄斯库里的原型是年轻的骑手,或是形态为马的远古双子神,传说其为拯救在战争或航海中遭遇危难的人类的救星.<br/><br/> 双子神虽然被称作<二柱神>,但长期以来没有各自固有的名字,于吟游诗人荷马所在时代创作的诸神赞歌集中,才终于确认了卡斯托鲁(卡斯托耳)与波吕德乌刻斯(波鲁克斯)这两个名字.<br/><br/> 他们拥有<君侯(Anakes)>的称号, 随着时代的推进,他们甚至在<阿耳戈英雄纪>等故事中作为阿耳戈号的一员为人们所知,强化了水手守护神这一侧面.<br/><br/> 人们相信在暴风雨中,在桅杆顶端等处散发的光芒,也就是<圣艾尔摩之火>就是作为船只引导者显现的他们的身姿.<br/><br/> 本质属于古老神灵的他们在现界时,是带着特殊性质显现的.也就是身为同一存在却拥有两具肉体,以至于两者的肉体内分别包含着不同的职阶性质.换言之,因没有宙斯血脉,后世获得了身为<人类之子>传说的哥哥卡斯托耳将从神沦落为人的屈辱化为怨念,作为Avenger.<br/><br/> 因拥有宙斯血脉,后世获得了身为<不死之人>传说的妹妹波鲁克斯凭不会受伤的肉体与卓绝的剑术不断战斗,作为Saber.虽说登记的灵基是Saber,但准确地说,他们是某种双重职阶的从者.<br/><br/> 这种特殊性或许就是基于神灵从者才会出现的例外吧.<br/><br/>  在第五异闻带刚发生时,他们是作为现存神明成立的.在与基尔什塔利亚·沃戴姆战斗中败北的双神在失去过一次生命后,作为异闻带从者与基尔什塔利亚订立了契约.<br/><br/> 通过契约,得知了<泛人类史中自己>传说的哥哥卡斯托耳明知这只是泛人类史发生的事,却依然极度憎恨贬低自己的人类,而妹妹波鲁克斯也憎恨起了贬低哥哥的人类.<br/><br/>  结果,兄妹内心都燃起了炙热的憎恨之火, 并自始至终都残忍、暴力地对待迦勒底一行人以及奥林波斯市民.另一方面,被迦勒底召唤,作为泛人类史从者的双神不具备异闻带从者双神那样激烈的暴力性.<br/><br/> 哥哥卡斯托耳虽然拥有足以让Avenger灵基成立的精神与背景,但妹妹波鲁克斯的性格与异闻带从者的那位比起来显得格外温和.由于有妹妹的劝告,一定程度放任哥哥也无所谓.<br/><br/>']],
						lg_keli: ['female', '提瓦特', '2/4', ['lg_pengpengliwu', 'lg_bengbengzhadan', 'lg_honghonghuohua1', 'lg_keli_zhenwang', 'lg_bengbengzhadan1', 'lg_huoyuansu', 'lg_honghonghuohua'], ['des:— 简介 —<br/> 西风骑士团,火花骑士!永远伴随闪光与爆炸出现!在琴团长严厉的目光注视下默默消失.虽然新炸药的配方,很多都是在被关禁闭的时候想出来的.但如果不被关禁闭的话,就更好了.<br/><br/>  — 背景故事 —<br/> 如果向蒙德的酒客们说起西风骑士团战力最强的成员,恐怕大多数人会列举大名鼎鼎的代理团长琴、骑兵队长凯亚或神秘的贵公子迪卢克.<br/><br/> 但也有人在醉眼朦胧间,目睹了一位红色骑士将整座望风山夷为平地的壮举.若想寻访这位神秘的骑士,恐怕就要到西风骑士团的禁闭室一探究竟了.假如禁闭室空空如也,或许某些爆炸性的糟糕事件就快要发生了.<br/><br/> 可莉就是这样的危险人物.作为骑士团正式成员,她的能力不容小觑.而作为一个过于活泼的孩子,她的破坏力同样巨大.毕竟,与蒙德其他小孩子不同,爆炸物才是可莉最为喜欢的玩具.<br/><br/>  三年前,可莉被身为知名冒险家的父母托付给西风骑士团.年幼的可莉就这样和<那位白色的哥哥>一起,与蒙德的<家人们>结下了缘分.<br/><br/> 可莉对外界一切都抱有纯真的爱与好奇.对于会爆炸的物件,她更是始终投以极度的热忱. 在骑士团呵护之下,她得以远离恶意与中伤. 小小的少女与骑士团众人缔结了无法割舍的缘分.<br/><br/> 对可莉来说,被琴关禁闭室的日常、帮助安柏改进兔兔伯爵的日常,或偷偷研制新型炸弹的日常……所有这些,都是她珍贵的宝物.<br/><br/>  <那样的父母会培养出这样的孩子,也是理所当然吧.> 被成堆公物破坏报告搞得焦头烂额的代理团长琴,偶尔会扶额感叹.炸得七零八落的车辆、莫名起火的货棚、骑士们好不容易才扑灭的森林火灾……还有惨不忍睹的<星落湖鱼类大量非正常伤亡案件.><br/><br/> 造成这些的凶手只有一人,此人正出现在骑士团总部.<br/><br/> <可莉!> 面对代理团长严厉的目光,看似人畜无害的小小少女只好把身上藏得满满当当的爆炸物逐件上缴.随后在幸灾乐祸的骑兵队长护送下,哭唧唧地前往禁闭室.这样的故事,大概每周都会重演那么一两次.<br/><br/>  当然,每次闯完祸后,可莉也会努力帮忙收拾烂摊子.虽说有时又会因为她大剌剌的性子将事情搅得更加复杂.想要做烤鱼补偿骑士团的大家,却不小心把灶台炸上了天;焦急地想要借风灭火,又把火扩散到了更远的草原……<br/><br/> 可莉绝不是坏孩子,好奇与贪玩的本性却总驱使她做出不计后果的行为.而每次犯了错误,又总会愧疚地试图弥补.但凡可莉被满心郁闷的琴团长放出禁闭室,不出两天,蒙德城某处一定又会传来爆炸声.<br/><br/> 作为骑士团内大名鼎鼎的<火花骑士>,其威能总会在奇怪的地方频繁展现.<br/><br/>  虽说可莉为骑士团和蒙德城招惹了不少乱子,但她绝不是为骑士团拖后腿的见习新人.相反,一旦她的才能用对地方,也将爆发出可畏的实力.某次讨伐行动中,琴巧妙借助可莉的爆破天赋,一举消灭了所有进犯的丘丘人.<br/><br/> 只是可莉出于一贯不计后果的童心,布下了过多炸弹,造成巨大爆炸,永久改变了望风山地的地貌.<br/><br/> 大家都被吓得不轻,所幸骑士团无人受伤.<望风山地红衣骑士>的传说,就此在蒙德城流传开来.据说她身披一席神秘红衣,怀中抱着骑士团最隐秘的宝物.<br/><br/> 只有可莉本人知道,空穴来风的<宝物>究竟是什么东西.<br/><br/>  对可莉而言,骑士团是她不可或缺的家人,已踏上冒险征途的母亲则是<偶像>.<br/><br/> 著名大冒险家艾莉丝,<提瓦特游览指南>的作者.在可莉心中,妈妈非常厉害,无所不能.<br/><br/> 无论是从前手把手教她调配火药挑选引信,还是一步步引导她依照个人创意制造更壮观漂亮的烟花.教育她如何规划受力点,才能炸毁整座摘星崖……<br/><br/> 或是被骑士团抓到现行之后一起在面色发青的霍夫曼面前挨训,对彼此尴尬地吐舌头,这些都是可莉与妈妈珍藏的记忆.直到后来,妈妈和爸爸去了很遥远、很危险的地方,临行前,将可莉托付给阿贝多哥哥和骑士团.<br/><br/> 小小的可莉早就明白,自己总有一天也会长大,踏上妈妈的道路.总有一天,她的作品也会让妈妈为之骄傲.<br/><br/>']],
						lg_jiawei: ['male', '罗德岛', 7, ['lg_huoyanboli', 'lg_huoyanboli1', 'lg_jiawei_zhenwang'], ['des:— 简介 —<br/> 贾维,前叙拉古某小城修车厂员工,后成为其团伙首领.某次事件后带领手下两名加入罗德岛,现作为突击手,活跃在战场前线.<br/><br/>  — 背景 —<br/> 总是带着爽朗笑容的沃尔珀男性.目无尊长,无法无天,据说在第一次见到凯尔希医生时也贯彻了这样的态度,并在医务室里度过了来到罗德岛的第一天.<br/><br/> 想到什么就会去做,虽然内容往往令人啼笑皆非,但他身上似乎有股魔力让人愿意和他一起去干蠢事.<br/><br/> 相比布洛卡的敌意,奥斯塔的谨慎,作为他们领袖的贾维反而是最早融入罗德岛的,基本上在来到罗德岛的第二天他就已经适应了这里的氛围.<br/><br/> 而根据本人的描述,他从小辍学,在城里的修车厂当工人,当然,私下也会参与当地的一些帮派活动.<br/><br/> 他在帮派活动中认识了奥斯塔,两人因为意气相投而共同行动,并在之后救下了布洛卡,并吸纳他加入,而后三人一起行动,直到在一次失手被追杀途中被附近的罗德岛干员所救.<br/><br/> 由于在修车厂工作了很长一段时间,在三人中,贾维明显更善于改造.<br/><br/> 和给人的印象不同,他在自己的专业上有着相当的造诣,无论是现代的车辆本身,还是各种方向的改造,他都有着相当的水平.并且作为兴趣的延展,他对电器也有一定的理解.<br/><br/> 不过,不同于布洛卡,虽然贾维本人在干员中有相当的人气,但在这方面,他可谓是<恶评如潮>.<br/><br/> 这是因为,由于他本人破天荒的性格,很多时候他会加入一些拍脑袋的改造,即使是别人的东西他也毫不在意,并因此带来了许多让人啼笑皆非的后果,于是大家对于将东西交给他改造这件事,往往比较谨慎.<br/><br/> 奥斯塔对贾维的评价恰如其分.<br/><br/> <他这样活不久.><br/><br/> 必须要指出的是,贾维并不是什么拥有运筹帷幄的智慧,或者以一敌百的力量的强者,他很普通,他的综合战斗力只能算是普通干员的水准,他喜欢胡思乱想,他总是三心二意.平心而论,他哪天被发现死在路边的水沟里也是毫不奇怪的事.<br/><br/> 但这似乎又是一件奇怪的事.<br/><br/> 用一种较为夸张的说法来形容这种感觉吧,每个人都会说:<贾维？哦,那个自大狂啊.><br/><br/> 但大部分人又会笑着接上一句,<他就是那样的人.><br/><br/> 而在这些人中,又有一部分会在得知他有难的时候毫不犹豫地去帮他一把.贾维大约就是这种程度的受欢迎,他总是能在别人心中留下深刻的印象,并且让人无法真正去讨厌他.<br/><br/> 当然,换一个角度来说,即使突然传来他的死讯,大概许多人也会坦然接受吧,同样也是因为<他就是那样的人.><br/><br/> 他就是这样一个矛盾而又有趣的人.<br/><br/>']],
						lg_dadaliya: ['male', '提瓦特', '3/4', ['lg_anliu', 'lg_kuanglan', 'lg_zhuanjing', 'lg_dadaliya_zhenwang', 'lg_jinmieshan1', 'lg_jinmieshan'], ['des:— 简介 —<br/> 达达利亚是最年轻的愚人众执行官,也是最危险的愚人众执行官之一.然而,达达利亚似乎永远与他的同僚们不太合得来.作为最纯粹的战士,他在这个充满阴谋的集体中显得格格不入.<br/><br/>  — 背景故事 —<br/> 尽管已经进入愚人众最顶层的<执行官>之列,但<公子>达达利亚的外表,似乎还是一位稚气未脱的青年.<br/><br/> 就如天鹅绒包裹的白银利刃一般,在他开朗自信的外表之下,是锤炼到极致的剑客之躯.他是最年轻的愚人众执行官,也是最危险的愚人众执行官之一.<br/><br/> 然而,<公子>似乎永远与他的同僚们不太合得来.作为最纯粹的战士,他在这个充满阴谋的集体中显得格格不入.<br/><br/> 作为愚人众有史以来最年轻的执行官,达达利亚完全有资格我行我素、不受束缚.尽管这种特立独行令他在愚人众中并不太受人欢迎,也与其他执行官的风格不太合拍,但在他自行其是的气势之下,却有着对责任的坚持与滴水不漏的谨慎.<br/><br/> 出于骨子里的骄傲,他是言出必行的男人.即使时常立下离奇无比的承诺,也绝不可能食言.无论是单骑屠灭整个巢穴的龙嗣,或是深入凶险的秘境再全身而退,甚至只身一人颠覆某个大贵族的领地.<br/><br/> 不仅总能实现诺言,而且如手术刀一般漂亮精湛.作为愚人众执行官的先锋,<公子>达达利亚总会出现在至冬国之敌脆弱的腹地,在矛盾即将爆发的前一刻出击.<br/><br/> 在至冬国的诸多传说中,达达利亚自十四岁起便已涉足战场,怪异的是,似乎他天生便是武技大师,精通各种杀戮的技巧.<br/><br/> 更可怖的则是这位<公子>对于战斗的激情 艰险的战斗只会令他兴味盎然,可怖的敌手则会催生狂喜.<br/><br/> <公子>高傲而自负的姿态,正来源于千百次战斗的磨炼,以及对于争斗本身无人可及的体验.但另一方面,由于担忧他嗜好冲突的本性会惹来不必要的麻烦,愚人众的其他执行官总是打发他前往远离至冬国的土地执行任务,以免自身遭到波及.<br/><br/> 令人琢磨不透的是,似乎这个男人永远处于动乱的漩涡中心,不凡的经历令他格外张扬,也格外沉浸于他人的夸赞.<br/><br/> 与愚人众其他低调的成员不同,达达利亚时常前去观看公开的演艺活动,甚至偶尔自己也会参与其中.<br/><br/> 冰钓是达达利亚自童年维持至今的爱好之一. 那时的他也还不叫达达利亚,或愚人众口中的<公子>,而是阿贾克斯,这名字来自于父亲最迷恋的冒险英雄故事.他与父亲一起在结冻的冰湖上凿出水洞,坐在一旁垂钓.<br/><br/> 这不是轻松的活计,有时会占用一整个上午的时间.但无论是在厚厚的冰层上开凿,还是用漫长的时间等待鱼儿上钩,都伴随着父亲无尽的故事.<br/><br/> 那是父亲年轻时的冒险,也是达达利亚心中暗自许诺的未来.因此每次他都会认真倾听,把父亲故事中的主角当成自己,等待鱼儿上钩的时间里迷醉在故事中.<br/><br/> 待离开家庭之后,阿贾克斯,或者说后来的<公子>达达利亚,依旧保持着冰钓的爱好. 不再有旧日故事的陪伴,垂钓也变成了磨炼战士毅力、反省战斗方式的修炼课程.<br/><br/> 在这样仅以修炼武艺为目的的漫长冥想结束后,是否钓得到鱼反而不再重要了.<br/><br/> 与世人所想不同,达达利亚的战技绝非生而知之.但至关重要的那次经历,达达利亚绝不会对他人提起.十四岁那年,为了逃离一成不变的家庭,少年携着小小的短剑和一小袋面包出走.<br/><br/> 十四岁那年,轻狂的少年迷失在雪林之间.被巨熊与群狼追逐,他失足落入了深不见底的黑色裂隙.在那里,他见识到了另一个古旧世界的无限可能;在那里,他偶遇了一位神秘剑客.或者不如说,黑暗的国度注意到了野心勃勃的少年.<br/><br/> 那是日后成为愚人众执行官的<公子>,也无法再次探知底细的黑暗.在三个月的时间里,剑客把畅行深渊的得意之术一并教授给他.<br/><br/> 而更重要的是,在这三个月间,从他嗜好动荡的本性中,生长出了挑起无尽斗争的能力.没人知道那三个月的黑暗中究竟发生了什么,阿贾克斯后来也对这段经历闭口不提.但当心急如焚的母亲与姐妹终于在树林中寻到他时,<世间的时间>才不过流逝了三天.<br/><br/> 手握着已然锈迹斑斑的短剑,少年就这样完成了他的第一次冒险.这是少年生涯的结束,也是武者之路的开始.<br/><br/> 回归家乡之后,少年变了一番模样.他不在胆怯、犹豫,而是变得轻狂、自信.仿佛这个世界本应围绕着他旋转,仿佛战斗是为了他而出现的.<br/><br/> 争斗往往带来改变,莫测的变化正如旋转的万花筒一般吸引着阿贾克斯.在父亲眼中,本就不安分的三子变得顽劣异常,为平和的海屑镇带来了诸多无妄的纷争.或者不如说,他就此成为了斗争的中心,无论他去向何处,打斗与争执如影随形--而他也乐在其中.<br/><br/> 终于,在一次险些闹出人命的大斗殴被勉强平息后,无奈的父亲将爱子交给了愚人众征兵团.父亲希望愚人众的严明军纪能够磨练爱子的性格,却目睹全副武装的征兵团被一个毛头小子打得落荒而逃.<br/><br/> 尽管这令父亲大失所望,愚人众第五执行官<公鸡>的视线却被意外吸引.<br/><br/> 惊讶于阿贾克斯的战力,又好奇于他乐于将自己置身于斗争的漩涡中心的个性.<br/><br/> <公鸡>以惩治为由,将阿贾克斯纳入愚人众,命他从底层开始,承担为<冰之女皇>而战的责任.<br/><br/> 就这样愚人众的战斗经历饲喂了少年不知餍足的征服欲望,他愈发膨胀的自我又被战胜强敌的快感渐渐填充.终于,阿贾克斯被提拔为愚人众的<执行官>,获得了<公子>达达利亚的名号,成为了至冬国最具权势的人物之一.<br/><br/> 但成为达达利亚,并不是他所追求的终点.对于征服世界的无尽野心而言,这只是一个小小的节点.<br/><br/>']],
						lg_youxiaomeijiu: ['female', '异界', 2, ['lg_duzou', 'lg_lunwuqu', 'lg_zhenhunqu', 'lg_jinxingqu0', 'lg_jinxingqu', 'lg_youxiaomeijiu_zhenwang'], ['des:— 简介 —<br/> 识别名为Diva(歌姬).<br/><br/> 平时生活中是一名学生,有着紫银的头发和浅紫色的瞳,以及说话不紧不慢的特点.非常喜欢女性,即百合的精灵.<br/><br/>  — 背景故事 —<br/> 有着只是搭话的程度好感度就会降到蟑螂之下的极度厌恶男性的性格,非常喜欢女性即百合的精灵.对自己的声音能力有很强的依赖,担心失去之后便会一无是处.<br/><br/> 真实身份是与琴里相同被赋予精灵之力的人类,原是一个除了唱歌以外一无是处的女孩,十五岁时成功以艺名<宵代月乃>出道成为歌手,歌迷之中男性占九成.<br/><br/> 演艺仕途原本顺遂,直到她拒绝了某电视台制作人的<交易>后,突然出现的抹黑丑闻使美九名声一落千丈,尤其是歌迷态度的180°转变更使她十分痛苦而心力憔悴,最后更因此得了心因性失声症而失去声音.<br/><br/> 就在美九绝望的想结束生命时〈Phantom〉现身将精灵之力交给她.因为这个经历使她变的不再信任人类,尤其是对男人更是厌恶至极,以精灵之力操弄他人而为所欲为,演变成现在这样视男性为奴隶、视女孩子为可爱玩偶的任性孩子.<br/><br/> 直到五河士道的出现才改变了她的想法,她称呼五河士道为<Darling>,但是百合性格仍然没有变!<br/><br/>']],
						lg_asilan: ['female', '极夜', 2, ['lg_yeyanshiling', 'lg_wujianduoluo', 'lg_asilanzuzhou1', 'lg_asilan_zhenwang', 'lg_chenmoji'], ['des:— 简介 —<br/> 反叛者的始祖,外表是小女孩,实际上内心特别的成熟,有异于常人的思维能力,发怒时瞳孔就像着火了一样冒出诡异的邪气.本身并没有实体,其他反叛者也从未认知她的存在,在她眼里,只不过是一群不自量力的蝼蚁.<br/><br/>  — 背景故事 —<br/> 我在黑色的梦中,又看到了那滴血.缓缓地,从她那已经冰冷的脸颊上,滑落的血滴.<br/><br/> 我伸出手,用掌心接下它,再将脸庞埋入其中.<br/><br/>  梦醒了.<br/><br/> 肉体的延续,无法作为个人存亡与否的评判标准.正因深知这个道理,在我无数次坠入死亡和新生的狭缝,只能在记忆构成的幻象中苟活之时,也曾期待自己的意识能彻底消散,至少不是被困在这不灭躯体内的一缕怨念.<br/><br/> 然而,期望总会落空.<br/><br/> 时至今日,我依然活着.<br/><br/> 那些为了不再重蹈覆辙而付出的努力,都会化为乌有,由我人为加入的变数,无法阻止这个世界步入终局.<br/><br/> 但随着时光流逝,我却不再是曾经的模样.<br/><br/> 即使每一次轮回都会带走部分记忆,我仍未忘记第一次面对她死去的脸庞时,心中惶恐自责的情感,那曾是推着我反抗历史洪流的力量.<br/><br/> 如今,我却能够无动于衷地看着她一次次死在自己面前.<br/><br/> 她的笑容？记不清了.<br/><br/>她的名字？早就忘记.<br/><br/> 她的坚守？并不重要.<br/><br/> 原来,在无尽轮回中一点点被消耗殆尽的不止是这个世界,还有我自己.那么,坚持至今的意义,还剩多少呢？<br/><br/> <真可怜啊,费心费力却一无所获,劝你还是趁早放弃吧!><br/><br/>这声询问仿佛来自我的灵魂深处.<br/><br/> 我身边的一个由恶念汇聚成的怪物,是她送给我的<惊喜>,最会蛊惑人心.<br/><br/> 而它的外形,也由初次轮回时一缕淡到看不出颜色的恶念,到现在能够凝成强大而难加约束的实体.正是它的存在,才让我清晰意识到在每一次轮回中,由自己亲手造就的败局.<br/><br/> <挣扎也是徒劳,再过一两次,你就能完全掌控我的身体.><br/><br/> 你啊,是想这么说吧？><br/><br/><到了萎凋这一步呢,最重要的是耐心和关注.><br/><br/> 我扬起笑容,慢悠悠地说起似乎毫不相干的话题.<br/><br/> <太过心急,成不了大事呢.><br/><br/> <我才不在乎什么萎不萎凋,你早点放弃挣扎,让我大开杀戒才是要紧!><br/><br/> 看来,该布局了.<br/><br/> <当你的力量衰弱到再也无法约束我的时候,你就成了我的提线木偶,助我大开杀戒.哈哈哈哈!光是想到你那副不快但又无可奈何的模样,就足够逗乐我了!><br/><br/> 我摇了摇头,在它猖狂的笑声中抓住了某个转瞬即逝的想法.或许,这是唯一的解决之法.<br/><br/> <你这些可笑的幻想,怕是无处生根了.><br/><br/>曾经的我过度依靠它的力量,试图通过杀戮来改变世界的进程.如今,不可辨驳的事实已经告诉我答案,杀戮并非拯救,而仅仅是杀戮本身.<br/><br/> <别妄想了,这不是你第一次尝试困住我.><br/><br/> <我与你不同,我没有实体.><br/><br/> 我不屑地提醒道.却没有意识到它的话,正中我下怀.<br/><br/> <所以,需要被困住的人……是我.><br/><br/> <这样,寄宿在我身上的你,就无处可逃了.><br/><br/> 我为手脚系上能够禁锢力量的红丝带,以确保自己即使在失去理智、完全被它控制的情况下,也无法伤害其他人,这是我最后的退路.<br/><br/> <你在做什么蠢事!这样只能削弱自身的力量啊!><br/><br/> 它着急地在原地直跳脚,却无力改变我的决定.<br/><br/> <你不是想改变世界吗？失去力量,你什么都做不了,给我松开!><br/><br/> <只凭借蛮力就能改变的现实,是相当有限的吧？><br/><br/> 手中红丝带轻晃,在它略带畏惧的眼神中,我露出了危险的笑.<br/><br/> <我决定,要用自己的方式,完成这一次……><br/><br/>']],
						lg_liannaiyewu: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_lianzhimonv0', 'lg_jinjimishu', 'lg_liannaiyewu_zhenwang', 'lg_lianzhimonv'], ['des:— 简介 —<br/> 恋乃夜舞,从2021年3月21日开始正式活动的VTuber,ProPro Production二期生.直播内容涵盖了游戏、ASMR、唱歌和中文学习,除此之外也会在直播中经常和观众聊天,甚至开专门的杂谈回在油管的会限中甚至通过聊天透露了自身的大量秘密情报.<br/><br/>']],
						lg_qianyou: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_xuezhikewang', 'lg_linghunshouge', 'lg_qianyou_zhenwang'], ['des:— 简介 —<br/> 由幽灵父母生下的幽灵,经历了一千八百年从团子变成了美少女.后来作为最受欢迎的鬼从阴间被派到阳间拉客,在用头上的彼岸花所赋予的瞬间移动的能力来到阳间时,由于坐标失误和阳间的信号不好,而被困在阳间.因认识到物种多样的VirtuaReal遂加入.<br/><br/>  — 背景故事 —<br/> 千幽对人类世界充满困惑.她一不仇恨人类,二不愤世嫉俗,三不谋财害命,安安分分做鬼,单单想要正常和人说说话,分享一下自己想出来的鬼点子,多交朋友,这有什么错？<br/><br/> 她走过的地方总是闹出极度惊悚可怕的传闻,诸如<镜子里的颜艺鬼女><会嘤嘤叫的玩偶小熊><自动弹出难听到掉牙曲子的钢琴>,这些传闻让努力的千幽在有些许奇怪快感的同时也十分失望,面容日益扭曲的她愈发担心自己的未来.<br/><br/>  在千方百计寻觅方法之后,千幽从某个黑发双马尾女人手中得到了一台手机,一台能够让她和外界正常沟通的手机,但也因此签订下了一份成为VirtuaReal旗下主播的契约.<br/><br/>  虽然要做的事情似乎很麻烦,但至少现在的她能够与抵近的万物相接触了,对一无所有的她来说,这就够了.<br/><br/>']],
						lg_linglan: ['female', '罗德岛', '4/5', ['lg_ershidewuyue', 'lg_huhuomiaoran', 'lg_linglan_zhenwang'], ['des:— 简介 —<br/> 本名丽萨,姓氏应监护人要求隐去.铃兰小姐年纪尚小,但血统使她拥有了优秀的源石技艺天赋.在罗德岛接受治疗的同时,也在接受凯尔希医生的指导.在铃兰小姐主动提出申请后,被批准在有其他干员随行的情况下参与一些低难度任务.<br/><br/> — 背景故事 —<br/> 丽萨是个了不起的好孩子!<br/><br/> 咳咳,照顾过这么多怪胎之后居然会遇到这么彬彬有礼的懂事孩子实在是很难得的事情.当然这是私情.丽萨在这个年纪就成为了感染者,这是一件非常不幸的事情,可她依然有着如此坚强纯洁的一面,无法想象她的父母究竟有什么样的手段,才能在那种环境里保护住她.<br/><br/> 不过也正因如此,丽萨缺乏对感染者处境的一些基础认知.也许我们该认真地教育丽萨,即使这会让我们的小丽萨感到困惑和难过,但也是为了避免以后的某个时刻感染者身份可能对她带来不可避免的创伤.<br/><br/> 哪怕我们稍微夸大其词一些.如果罗德岛无法让这些感染者孩子们正确认识到自己的命运,并选择正确的生活方式,只靠医疗手段,当真能改变感染者的现状吗？<br/><br/> 当然,丽萨可以展示给我们一个光明的未来.这才是我喜欢丽萨的理由.不是因为她在华法琳医生的讲座上靠在我肩上打盹,不是.<br/><br/> 丽萨被保护得很好,但也正因如此,她没有看到的东西太多太多.丽萨并不知道这片土地之外的感染者是如何生存的,也不知道更多和她同龄的感染者正遭遇着怎样的痛苦.须知父母对她的保护绝不是溺爱,否则就绝不会把丽萨托付给罗德岛.<br/><br/> 我们应该给丽萨一个普通的生活空间吗？还是应该教会丽萨反抗的手段？我们应该让丽萨自己选择,在此之前,我们应当先教她如何认识周围的一切.<br/><br/> 希望各位干员在享受<为人父母>的欣慰感的同时,也好好考虑一下<为人父母>的责任. 无论如何,当丽萨离开罗德岛的那一天来临的时候,我们都希望她已经做好了完全的准备,迎接这片不太美好但是尚且值得奋斗的大地.<br/><br/> 铃兰小姐的母亲来自叙拉古,是叙拉古某核心家族的成员之一,而铃兰的父亲则是一位在东国某座城邦内小有名声的神职人员.<br/><br/>  考虑到东国与叙拉古两国的近况和距离,我们很难想象铃兰的双亲是在什么情况下相遇、相恋,并共同孕育了他们的女儿,丽萨.铃兰继承了母亲的发色和五官,却也继承了其父神民的血统,拥有了九条尾巴.<br/><br/>  这使得铃兰一度被认定为其父在神职地位上的继承人,然而她的父亲并不打算让女儿重新被束缚在神社无止境的神职工作中.他虽然坚信自己的所作所为能为民众带来宽慰,但他也自私地希望女儿能够有一个更天高地广的未来.<br/><br/> 于是,铃兰暗中被母亲带往叙拉古,然而好景不长,其母所在的家族被卷入了一场针对某个家族的而掀起的城邦内乱,亦是在这场叛乱中,身为其母软肋所在的铃兰也被阴谋伤害,藏在玩偶中的源石结晶准确地刺入了她的左臂.可以想象铃兰的母亲有多么懊悔,在将铃兰托付给罗德岛后,她主导了一场针对行凶家族的刺杀,从此销声匿迹.<br/><br/> 至于我们是如何得到这些叙拉古各城邦内部都极少知晓的内幕的,必须对丽萨保密.<br/><br/>']],
						lg_xiaoyezhongxiaoding: ['female', '幻想乡', '2/4', ['lg_wujianzhixiajian', 'lg_wujianzhixiajian1', 'lg_yumingwujixu', 'lg_mingtulvzhongyu1', 'lg_mingtulvzhongyu', 'lg_xiaoyezhongxiaoding_zhenwang', 'lg_xiaoyezhongxiaoding1', 'lg_shenghunliuli', 'lg_shenghunliuli1'], ['des:— 简介 —<br/> 小町是担任三途之川的领航人的死神,与她一样担任领航员的死神为数不少.而她主要负责引渡幻想乡人类的灵魂,不过有空的话也会载外界人类的灵魂,因此经常能在幻想乡中看到她.<br/><br/>  — 背景故事 —<br/> 负责幻想乡和其对岸间的河流的摆渡的妖怪. 拥有操纵距离程度的能力.<br/><br/> 人死后就得渡过三途河.她负责把渡河的方法告诉死者们.<br/><br/> 根据她心情的变化,河的宽度和深度也会发生相应的变化.如果生前做的坏事太多,也有不能渡河的时候.<br/><br/>  死神判断善人和恶人的标准不是按罪的分量,而是<钱>.<br/><br/> 虽说是按<钱>来判断善人和恶人,但所谓的<钱>不是指人死前拥有的财产,而是有多少人衷心地去悼念死者.至于裁定罪行,那是渡河之后的事了,不在她的工作范围内.<br/><br/>  死后,想请她摆渡必须给她<钱>,而死者手中的<钱>不是自己生前的财产,而是在人间衷心悼念死者的人的财产总合,死者都会为这个而惊讶吧.<br/><br/>  据说有钱人生前被很多人讨厌,而死后,摆渡人问他们要钱,总会惊讶自己手边的钱为什么这么少.<br/><br/>  当然必须把手中全部的<钱>给她,来请求其摆渡,不舍得拿出全部的<钱>的话,会被她扔到河里.河会变得无边无际,游泳游得疲倦后,会被在河中栖息的被认为已经灭绝的大型鱼和水龙吃掉.<br/><br/>   这次,幻想乡之所以会被花的海洋淹没,是因为她的工作量一下变得太大.死者的魂一下出现太多,不能渡过冥河的魂都留在了幻想乡, 走投无路的灵魂们都选择寄宿在它们附近的花中.<br/><br/>  不过小町看到这些后,还是像往常一样不紧不慢地做着自己的工作.这一切都被她的上司,四季映姫看在眼里,映姫当然被小町的做法激怒了.<br/><br/>']],
						lg_paerwadi: ['female', '命运', 5, ['lg_xushuzhihuan', 'lg_nisi', 'lg_zhilianbuwei', 'lg_zhilianbuwei0', 'lg_paerwadi_zhenwang'], ['des:— 简介 —<br/> 印度神话中至高神湿婆的伴侣,本人却是个与战斗无缘的心地善良女神.身为神灵,这次借波长相符的少女身体作为自己的躯壳现界.贞淑、温和,擅长所有家务,简直就是理想的年轻妻系女主角,但她的真实身份究竟是？<br/><br/> — 背景故事 —<br/> 帕尔瓦蒂在印度神话中,是破坏与创造之神湿婆之妻.帕尔瓦蒂没有身为神的权威,通常只会被视为湿婆妻子的女神来对待.但是,湿婆的妻子中也有被誉为<战神>的存在.<br/><br/> 比如杜尔伽与迦梨.这些女神与帕尔瓦蒂灵基不同,但神核被视为是相同的存在.也可作为Rider职阶现界,但在这种情况下,就要从湿婆处借用圣牛南迪了.而由于这头牛司掌丰收等要素,因此作为神兽的攻击力会难以置信地低.<br/><br/>  仅由<凭依之躯少女>的善性构成的拟似从者.<br/><br/> 但是,虽说是光,并不代表没有<恶性>.就如同正义中存在浑浊一样,<凭依之躯少女>拥有的病娇感,一不小心,就会变得非常危险的方面依然留存了一点下来了.<br/><br/> 话虽如此,若只是稍微惹怒她,是绝对不会如此轻易堕落的.唯有深陷烦恼却依然不违背秩序,才是所谓的<光之属性>啊.<br/><br/> 女神接受了成为自己凭依之躯的少女性质中光的部分,性格温和且有包容力.不会自我主张,贞淑、在御主身边默默支持的才女.<br/><br/> 理想女主角力的素质极高,但由于不喜欢夸张,总是选择坚实朴素的道路,所以多少有些迟钝.另外虽然她性格温和,但并不代表她十分软弱,内心十分坚强.<br/><br/> 无论面对什么样的痛苦,内心都不会屈服,从这个角度来说,她简直就是倔强与毅力的凝聚体.因此,如果真的惹她生气,可是会有些可怕的哦.这帕尔瓦蒂在怨恨彻底消散之前,也是决不会忘记的.<br/><br/>  帕尔瓦蒂是<自己无错>的神格,因此没有了畏缩不前、怕生的性格,社交性得以提升.是个会为些许小事就发火或是闹别扭,但只要是误会或是误解,就会认真思考问题,主动原谅对方的道歉丽人.<br/><br/>']],
						lg_ketengcaixiang: ['female', '时之岸', '4/5', ['lg_caiyi', 'lg_paomozhimeng', 'lg_ketengcaixiang_zhenwang'], ['des:— 简介 —<br/> 冒失是她的常态,不过关键时刻还是能歪打正着的,她不会因为失败而轻易气馁,也希望能有机会去活跃表现.<br/><br/>  — 背景故事 —<br/> 不远处的小屋里闪烁着微弱的灯光,天色已晚,横竖也是不能再往前走了.这么想着,我向着小屋的方向走去.<br/><br/> 我靠着外墙在窗边坐了下来.<br/><br/> 今晚天气很好,正值碧空时节,连夜晚的天空都是晴朗的.繁星缀在夜幕之上,湿润的风略带凉意地掠过树叶,带起一片沙沙的轻响.有人烟的地方会让我比较安心,只希望我不会因此打扰到屋里的人.<br/><br/> 就在我刚想闭上眼休息的时候,原本半掩着的窗户却唰地一下打开了,天使模样的她与我四目相对.<br/><br/> <那个,对不起!我现在就离开.><br/><br/> 我连忙捡起自己的包裹起身打算离开, 她却叫住了我.<br/><br/> <如果需要的话,请进屋吧,夜风还是有些凉的.><br/><br/> <欸,可以吗？><br/><br/> <这里原本就是个废弃的旧屋,我也只是借住一晚罢了.><br/><br/> 我放下心来,从正门走进小屋.这似乎是哪个猎人空置已久的屋子,只有靠近南侧的地面上铺着一张脏兮兮的动物皮毛做地毯,连一张床铺都没有.<br/><br/> 脚下的地面有些凹凸不平,墙壁也泛黄得厉害,屋顶上更是破了个脸盆大的窟窿.好在还算没有什么奇怪的气味,又比野外暖和些,也难怪会选择在这儿落脚休息了.<br/><br/> 这也将成为我今晚的容身之地,房间中央有一盏油灯,烛光忽明忽暗.她坐在灯边,正用笔写着什么.<br/><br/> <啊,抱歉……如果点着灯会影响你休息的话,我再过一会儿就熄灭它.><br/><br/> 似乎感觉到了我的视线,她放下笔,有些不好意思地抬起头.<br/><br/> <不,没这回事.><br/><br/> 我连忙摆手.<br/><br/> <只是有些好奇你在写什么.><br/><br/> <我在写,今天发生的事情.><br/><br/>  <是日记吗？<br/><br/>   她突然默不作声,呆滞了许久……<br/><br/>']],
						lg_hutao: ['female', '提瓦特', '2/4', ['lg_xiezhizaohuo', 'lg_dieyinlaisheng', 'lg_dieyinlaisheng1', 'lg_anshenmifa', 'lg_hutao_zhenwang'], ['des:— 简介 —<br/> 璃月<往生堂>第七十七代堂主,掌控着璃月葬仪事务的重要人物.胡桃尽心尽力地为人们完成送别之仪,维护着世间阴阳平衡之道.除此以外还是个神奇打油诗人,诸多<杰作>被璃月人口口相传.<br/><br/>  — 背景故事 —<br/> 身居堂主之位,却没有半分架子.她的鬼点子,比瑶光滩上的海砂都多.她的脑袋里装着无数奇思妙想,叫旁人惊讶不已.<br/><br/> 平日里,胡桃俨然是个贪玩孩子,一有闲功夫便四处乱逛,被邻里看作甩手掌柜.唯有葬礼上亲自带领仪倌队伍走过繁灯落尽的街道时,她才会表现出凝重、肃穆的一面.<br/><br/> 丧葬白事,乃是凡人最后的体面.而璃月<往生堂>,堪称人生画卷的终笔者.传统葬仪门道繁多,停灵守灵,落葬之法,牌位器具……以上种种环节都有着严苛的规矩.<br/><br/> 无论逝者出身贵贱,财富多寡,都要给他们置办一场合乎身份的葬礼.这便是往生堂的待客之道.如此重要的机构,它的执掌者理应学识渊博、行事慎重.然而,七十七代堂主的重任,却落到了胡桃这个小姑娘肩上.<br/><br/> 胡桃此人在璃月颇有些名气.谈起她来,邻里街坊总是一言难尽.人们盛赞她聪明伶俐,却也忌惮她满腔奇思.她的鬼点子,已经到了异想天开的地步.三岁倒立背书,通读卷藏名篇,六岁择日逃学,潜进棺材酣睡,八岁常驻堂中,研习丧葬礼数……<br/><br/> 无论怎么看,胡桃都与<稳重>一词不沾边. 十多岁时,胡桃初次执掌大仪,操办葬礼. 堂下各位仪信与客卿的心,全都悬在了绝云间的峭壁上.<br/><br/> 好在胡桃对生意尤为重视,从不轻慢.<br/><br/> <咱们往生堂啊,收活人的钱,送死人上路,肩负双倍的责任,须让阴阳两界的人满意.><br/><br/> 说起堂里规矩,胡桃总是头头是道.每到白天闭门停业,胡桃便邀请各路博学客卿来为年轻仪倌们说书讲学.<br/><br/> <葬仪传统是一门大学问,不可依赖印象和习惯.><br/><br/> 诸位讲师中,钟离先生最受敬仰.他的讲学成效显著,大大提升了往生堂仪倌的素养.即使胡桃常常调侃钟离的古板作风,他仍是最受胡桃信赖之人.此外,胡桃也要求仪倌们重视客户需求,不应拘泥于某种特定丧葬形式.<br/><br/> <客人们各有要求,有些想让逝者走得清净,有些追求热闹喜丧,还有些富贵人家,下葬只讲求一个排场.我们做什么、如何做,理应取决于他们要什么.><br/><br/> 胡桃主掌事务后,往生堂经营稳定,施礼得当,甚至令不少忌讳白事的璃月居民对丧葬一事有所改观.话虽如此,仪倌们受训时,胡桃倒是另有去处,一溜烟便跑得没影.<br/><br/> 这位堂主的兴趣爱好极富个人特色,又很难说是否太有闲情.月下码头,山间危楼,最高处那个背手而立出口成诗的身影必定是胡桃.她酷爱在夜晚闲逛,只要兴致来了,无论身处何处,总会情不自禁地赋诗一首.<br/><br/> 而途经华光林山间歇脚亭的商贾,或许会有幸见到一位独坐桌边自娱自乐的神秘少女.四个人才能组成的牌局,胡桃自己和自己都能玩得停不下来.至于其中乐趣……唯有她自己知道.<br/><br/> 总务司门口立着两尊栩栩如生的石狮子,此乃威严之象征.路过的胡桃却不这么想.她仔细端详了石狮子好一会儿,显示若有所思,随即开怀大笑,用力拍打它们的前爪.<br/><br/> 之后,胡桃便不时前来,摸着石狮子的脑袋念念有词.她不光跟它们聊天,还给它们起了名字,左边的叫大咪,右边的叫二咪.甚至左手拎一桶温水,右手提着大毛刷,跑来给石狮子洗澡.动作细致,态度认真,完全是将石狮子当成了宠物.<br/><br/> 新月轩门前有只三花猫,吃的是璃月百家饭.这天恰好有附近居民来逗猫,与不远外的胡桃相映成趣.面对旁人困惑的目光,胡桃理直气壮:<br/><br/><你家花猫可爱, 我的大咪二咪怎么就不可爱了？大咪二咪的毛随说硬了些,不也是毛茸茸的嘛!让人快活的小动物,自然就是宠物.若论威风,什么猫都不是大咪二咪的对手!><br/><br/> 一番解释,愈发令人不解.<br/><br/> 总务司的卫兵更是多次被胡桃惊吓.午夜,门前总有轻轻的脚步声.本以为是窃贼偷上了官家,却不料门后是个与石狮子玩耍的年轻少女.<br/><br/> 而等到大家好不容易习惯了这件怪事,胡桃反倒没了影子.卫兵们有些苦恼,没了胡桃,就得轮到他们来清扫石狮子了.<br/><br/> 为此他们蹲守多日,总算等到胡桃路过.问及为何不在来访,得到的答案更是匪夷所思:<br/><br/><大咪二咪长大独立,不再需要我的照顾啦!现在我啊,忙着与神像谈论人生呢!><br/><br/> 相识不久后,胡桃就单方面将七七视为挚友,要亲手埋葬七七.胡桃多次作案,算准阴时阴刻将七七掳走,企图将她按流程火化后塞进城郊预置的墓冢.<br/><br/> 若非不卜卢的白术及时截停,她真能得手.每次白术赶到,七七都已被套在袋中,只剩一颗小脑袋露在外面,疑惑地看着胡桃奋力挖掘焚烧用的坑.事后,胡桃更是给七七写下赔罪信,信中多次感慨自己下手太慢,没能让七七入土为安,为此深表歉意.<br/><br/> 在胡桃看来,七七早已逝去,被囚浮世不得解脱,是至苦的受难者.而白术结识七七后,追求长生不老的念头愈发强烈.对此等忤逆生死戒律的观念,胡桃实难苟同.<br/><br/> 送七七入土,不只是替她个人着想,更要平衡阴阳秩序.但七七决不答应.七七害怕死亡,讨厌胡桃.周旋过程实在漫长,期间七七甚至能灵光一现,回忆起自己应在哪些时段隐蔽,以免被胡桃逮住.<br/><br/> 或许是这份求生的努力触动了胡桃,她一反常态,认真调查了七七的往事.意外的事故、仙家的玄机……种种巧合,让胡桃举棋不定.<br/><br/> 七七那么想要活着,自然不能硬埋.既然如此,便只能将她当成千载难逢的例外.自那以后,胡桃对七七的态度大有转变.从拎起便走,改成了嘘寒问暖.只可惜,胡桃早已成了七七心中一大瘟神.想请七七既往不咎,怕是还得耗上好多些年.<br/><br/> 胡桃最出名的并非她的堂主身份,而是她的另一大成就:<br/><br/>诗歌创作.<br/><br/> 她自称<小巷派暗黑诗人>,每当上街闲逛,打油诗便脱口而出,拦都拦不住.<丘丘谣>是胡桃最为出名的作品.不只得港口居民喜爱,远至轻策庄都有孩子传唱.<br/><br/> 爱好者与评书人为<丘丘谣>简单而深邃的创作风格所震惊,奔赴万文集舍寻觅这位大诗人的作品,但很可惜,胡桃的诗集<瑞月闲话>与<柴米油盐>均尚未发行.<br/><br/> 日日泡在书店的行秋也想一睹奇人尊容,特意择良辰吉日携礼登门拜访.<br/><br/> 二人一拍即合,到往生堂中庭即兴赋诗,切磋技艺.对上行秋对仗工整的传统诗句,胡桃总能用巧思与怪词还以颜色.<br/><br/> 胡来中自有深意,嘿,古怪里还透着韵律,易懂易读,比寻常诗词还要朗朗上口.真可谓乱拳打死老师傅,直叫行秋哭笑不得.<br/><br/> 最终,赛诗会在友好的氛围中落幕.自此,两人便成了诗友,一有闲暇便相约吟诗.次数多了,甚至连重云也被拉来担当评委.三人的欢声笑语如秋叶一般,洒满街头巷尾.<br/><br/> 这些切磋的诗句,也被旁听者记录下来.若在街头听见上句严肃下句俏皮的怪异顺口溜,八成是胡桃与行秋对出的奇诗.<br/><br/>']],
						lg_chunhu: ['female', '幻想乡', 2, ['lg_chuncuidefengkuang1', 'lg_chuncuidefengkuang', 'lg_mihuanmantuoluo1', 'lg_mihuanmantuoluo', 'lg_mihuanmantuoluo0', 'lg_yingyierchu1', 'lg_yingyierchu', 'lg_chunhu_zhenwang', 'lg_chunhu1', 'lg_yuanshishenling', 'lg_xiandaishenling'], ['des:— 简介 —<br/> 对于月人抱有怨恨的存在,自身也是被怨恨纯化的灵.她对月人嫦娥有着强烈的怨恨,由此而来她也憎恨起了拥戴嫦娥的月人们,是一个每次袭击月都,最终都被贤者平息了其愤怒的存在.<br/><br/>  — 背景故事 —<br/> 丈夫击杀了自己的儿子,这是最初的怨恨,但怨恨早已纯化,失去了控制.<br/><br/> 其存在只有一部分月之民知道,因为月之民不需要有畏惧敌人的生活.嫦娥是否知晓她的存在还尚不明确,但应该不会毫不知情吧.嫦娥,虽然在本作中并未登场,是被幽禁在月都的月之女神.<br/><br/> 她是月兔的支配者,也有着强大的力量,但并不会出现在外界面前,嫦娥是使用了蓬莱之药的罪人.<br/><br/> 这次的月都袭击计划的概要如下:<br/><br/> <使月的正面,充满纯化了生命力的妖精,将月球本身,化为生命之星.><br/><br/> <这样一来,月都就只好逃窜了.趁其不备,讨伐藏匿其中的嫦娥.><br/><br/>  厌恶地面充斥污秽(生命)而移居月球,是月都的开端.她想让相同的事情,发生在月球,计划十分顺利.静海开始被生命填满.<br/><br/> 地狱的妖精们,将月球当作了乐园.<br/><br/> 地狱的环境便是如此严苛.<br/><br/> 月之民,对于她的生命之星计划束手无策.<br/><br/> 然而,纯狐却已经知道.月之民不会就这样居住在污秽附近,他们一定会逃往梦境之类的地方.所以,预测到这一切的她,将朋友送到了那边.不知该说是正如所料,还是说预料之外,月之民超过半年都没什么动静.<br/><br/> 纯狐也攻击月都感到厌倦了.双方都无法出手,陷入了胶着状态.逐渐,她的愤怒有所舒缓,开始考虑今后该如何行动.就在此时,想不到人类居然出现了.<br/><br/> 而且是污秽被净化的人类.是某种药物的影响吗.不厌恶生命,又感受不到生命.虽然想不到会打出如此这般牺牲人类的奇计,但是她却放心了.<br/><br/> 月之贤者所做之事超乎所料.<br/><br/> 这是她的乐趣所在.<br/><br/> 终于,这次的复仇大戏,将要落下帷幕了.<br/><br/>']],
						lg_xiangwan: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_jingzhungaoguang', 'lg_shanyao', 'lg_damowangshike', 'lg_damowangshike1', 'lg_xiangwan_zhenwang'], ['des:— 简介 —<br/> A-SOUL的Gamer担当,自称是Cool girl,具有强大的游戏时间管理能力时间管理大师.氪金狂魔,认为游戏中的财富比现实更重要,以清空商城皮肤与抽干卡池为乐.<br/><br/>']],
						lg_zhenbu: ['female', '异界', 4, ['lg_tonghuatingyuan', 'lg_tonghuawangguo', 'lg_xushi', 'lg_wangziyugongzhu', 'lg_jigongzhenbu_zhenwang'], ['des:— 简介 —<br/> 狐之兽人,公会<自卫团>的领导者.说话带着京都腔,在和自卫团的成员追捕盗窃博物馆的小偷时不幸连同前来参观的骑士一起被绑架进了马车.<br/><br/>  — 背景故事 —<br/> 不能很好地掌握使用魔法的技巧,若魔法使用失败会造成爆炸,在使用魔法逃脱时自己的魔法把马车吹飞到了气候寒冷的水晶山脉,并且使用魔法后就会睡着.<br/><br/>  喜欢妄想的少女,活在绘本的世界里,认为自己是真步真步王国的公主而骑士君是自己的王子殿下,但是能分清楚幻想与现实的区别,只是她喜欢用更加开心的视角去看待这个世界.<br/><br/>  某次上街购物时遇到骑士君,骑士君主动帮忙提东西,还顺便帮一个迷路的小女孩找到了妈妈,回到公会小屋还不闲着,便被真步邀请体验改造过的大浴场,最后还被真步膝枕柠檬 我 柠檬,而当之前被帮助的小女孩说出自己想要跟王子殿下(就是骑士君)结婚时,真步又对小女孩表现出了嫉妒之情.<br/><br/>']],
						lg_youni: ['female', '异界', 4, ['lg_tanqiuhuanchong', 'lg_tanqiuhuanchong0', 'lg_haojiedansheng', 'lg_xueshi', 'lg_youni_zhenwang', 'lg_zhexue0', 'lg_zhexue'], ['des:— 简介 —<br/> 在圣特蕾莎女子学院的入学考试中获得了第一名,被学校授予了名誉博士的称号,并且给她特例安排到由旧图书馆改造的<象牙塔>内学习.知识渊博,爱好读书,尤其是学术方面的书.<br/><br/>  — 背景故事 —<br/> 称自己为<才媛>,常常孤身一人在<象牙塔>内学习.<br/><br/>  虽然年龄是十八岁,但仍保持着幼儿体型,因此总是被别人当小孩,但优妮却对此毫不在意.甚至有时还会跑到咲恋育幼院装小孩,或者跟小小甜心的成员一起玩过家家,正因为如此仙贝会成为小小甜心荣誉成员.<br/><br/>  常常忘事,如自己要写的论文的课题,而优妮对此的解释是才媛也是人.<br/><br/>  现实中的真行寺由仁是一名老教授的孙女,和星野静流是同班同学,同时也是个家里蹲,没有什么朋友,也几乎不与他人交流.互动最多的对象是偶遇到的正在读自己的爷爷写的书的骑士君,而一旦找到机会跟人交流就会说个不停.<br/><br/>']],
						lg_gongbenwuzang: ['female', '命运', 5, ['lg_ertianyiliu', 'lg_julijialuo', 'lg_gongbenwuzang_zhenwang', 'lg_zhuanjing'], ['des:— 简介 —<br/> 以日本历史上最强剑豪著称,江户时代初期的剑术家.精通号称由武藏创始的流派<二天一流>,运用大刀与小刀的<二刀流>达人.本应如此,但与正确历史上的武藏,情况似乎有些不一样.<br/><br/>  — 背景故事 —<br/> 在正确的史实中,出生于作州(现冈山县美作市).1584年生.父亲是侍奉竹山城主新免家的武术指导师,被主家赐予了新免之名,被誉为新免无二斋的武艺高手.<br/><br/> 新免无二斋在吉野乡宫本村建立了十手术道场,武藏也将此地视为故乡,因此之后以宫本为姓.成人后留下了众多传说故事,尤其是在二十来岁的这十年间,与众多武艺高手战斗,这些著名的战斗也成了如今娱乐节目的热门题材之一.<br/><br/> 然而这十年间的战斗的真正内容几乎全都成谜,被人们深深怀疑乃是杜撰的.<br/><br/> 开朗活泼,凛然而又娇艳的女性剑士.<br/><br/> 总是春风得意,泰然自若,但并不会看不起对手.<br/><br/> 只是很享受人生罢了.<br/><br/> 感情表现略有些夸张.常会笑,常会惊讶,对大多问题都会一笑而过,性格豁达大方,但本质却是<钻研剑道之人>,在事关人命的问题上,是非常冷漠＆严厉的.<br/><br/>  话虽如此,却很容易着迷,最喜欢被人依靠. 也最喜欢被人夸奖.禁不住赞辞.喜欢打架的大姐气质.虽然是正义之士,但自己不会主张正义.<br/><br/> 基本是个飘浮不定无忧无虑的流浪者,但遭遇<单方面虐杀>、<为了娱乐,践踏人的尊严与信念>、<在人饿肚子的时候抢走食物>这类情况时,就会修罗化.<br/><br/>']],
						lg_juwuxing: ['female', '旧始', '1/4', ['lg_zuimeng', 'lg_kuwei', 'lg_kuwei0', 'lg_qingyanranran', 'lg_qingyanranran1', 'lg_linghunsangzhong', 'lg_juwuxing_zhenwang', 'lg_tiaozhi', 'lg_tiaozhi00'], []],
						lg_luyeyuanpingzang: ['male', '提瓦特', '3/4', ['lg_yinyoukanpo', 'lg_luxinquan', 'lg_jufengcu'], ['des:— 简介 —<br/> 天领奉行的天才少年侦探,直觉敏锐,心思巧妙.无论面对何种悬案,都能用出人意料的方式揭开真相.<br/><br/>  — 背景故事 —<br/> 鹿野院平藏,一个不凡的少年侦探.<br/><br/> 虽然任职于天领奉行,给人的感觉却和<威严>、<肃穆>、<庄重>这种公权印象格格不入.<br/><br/> 看起来他比每个新人都更加乖巧礼貌,实际上却从不循规蹈矩.既不像其他同僚那样每日在所里报道,也几乎不会参加日常巡逻.有时甚至十天半月都找不着人影,只有在一些罪案现场才会见到他,可那副笑嘻嘻的模样总让人怀疑他是否在认真工作.<br/><br/> 但有趣的是,这种<公职人员的离经叛道>却似乎是被各方默许了的.<br/><br/> 同僚心甘情愿配合他的工作,上司也很少对他的自由行动指手画脚,甚至连上司的上司都会不时送来<平藏最近过的好不好？>之类的关心.<br/><br/> 如此独树一帜的作风与地位,全部源自他无人能及的办案本领.每当奉行所面对罕见难解的大案要案、疑案悬案时,平藏都会是那个肩负众望的最后破局者.连奉行所的一把手也对他丰富的探案经验赞叹有加,只不过平藏本人对此有不同意见.<br/><br/> <经验,是人们对曾经犯下的错误的别称,我的杀手锏可不是这个啊.><br/><br/> <我生来如此.><br/><br/> 加入天领奉行并不是件轻松的事,不仅要通过能力考察,还需要经历严格的背景审核.因此新人通常被要求进行一些重点信息的申报,譬如贵重财产情况.据曾负责审核的大和田与力回忆,最初平藏申请加入时,他的申报表格上填的却是一片空白.<br/><br/> 那是一个风和日丽的上午,已是老江湖的大和田审视着这张空白的表格和坐在对面满脸好奇东张西望的平藏,他意有所指道:<br/><br/> <我见过很多心思活络的年轻人,可惜最后,他们没有一个成功加入奉行所.><br/><br/> 听闻此话,那个多动症似的少年突然收起四处观察的目光,小小的身板一正,直勾勾地盯住大和田:<br/><br/> <那,我这样的年轻人又怎么样呢？><br/><br/> 少年的转变快得惊人,大和田与力突然被鹰觑鹘望般的眼神盯住,显得有些恍惚.他没由来地生出一股错觉,仿佛在那一刻,自己才是那个被审查的人.他玩笑似的开口,好像这样可以缓解自己的紧张:<br/><br/> <天领奉行不拒绝穷人,但是申报表上一穷二白的家伙,我们是会格外谨慎审查的.><br/><br/> 一阵意料外的沉默,对方没有说话,还是原先那样直直地瞧着自己.大和田感觉有点不舒服,额头有些发紧发痒,也许是天气太热了,他抬起手背想要把汗滴擦去.可这一擦擦了个空,额头上什么也没有,大和田愣愣地看着干燥的手背,擦也不是,放也不是.<br/><br/> 忽然,对面的少年笑了出来,爽朗的笑声一下让大和田从不知所措中解脱出来.只见平藏身体斜靠着桌沿,一只手托起下巴,另一只手轻轻点了点脑袋,轻笑地看着大和田说:<br/><br/> <除了我的天才外,我没有别的要申报的东西了.><br/><br/> 天领奉行并不是平藏侦探生涯的起点.<br/><br/> 在此之前,平藏曾拥有一间自己的侦探事务所,名为:万端珊瑚平藏侦探社.<br/><br/> 也正是如今稻妻城中万端珊瑚侦探社的前身,最初其实是由平藏与珊瑚二人合作创办的.二人的故事由惺惺相惜的初遇为开端,最后却由遗憾的分道扬镳为结局.平藏在侦探社招牌上的名头,也因为合作破裂而理所当然地消失.<br/><br/> 至于一切的原因,大概只能用一句<理念之差>来总结.<br/><br/> 在珊瑚眼中,侦探的全部使命就是揭开真相,真相高于一切,或许这也是大多数的代表.而平藏的观点却不止于此,真相之上,或许还有更重要的东西.<br/><br/> 多年的查案经历让他清楚,当侦探接下罪案委托的那一刻,便意味着不好的事已经发生了. 无论事后如何惩治犯下恶行的家伙,都无法改变已经有人受到伤害这件事.就像无论医术多么高超的医生,都无法将伤者治愈后假装没事地告诉他:<br/><br/> <你看,你的伤口已经愈合了,就和没有受过伤一样.><br/><br/> 往后的每一天,伤者看到医生,看到医馆,看到身上手术留下的疤痕,想到的都是自己曾经受过那次伤.<br/><br/> 暴行因何而起？这是医生的无力.罪案因何而起？这是侦探的无力.平藏希望能够突破这种无力.<br/><br/> <若无法斩断本源之恶,我便成为恶之天敌吧.><br/><br/> <鹿野院平藏>之名会传遍提瓦特,震慑四方宵小.<br/><br/> <我要他们明白,委身黑暗者,永无宁日.><br/><br/> 意识到这一点后,他离开了侦探社,来到了天领奉行,这才是他成为自己所追求的<侦探>的起点.<br/><br/>  <我看小说里面写,每一位大侦探都有助手,就像每一份炸猪排饭都有猪排.><br/><br/> 奉行所里,新人上杉堆着满脸的笑容凑近平藏.<br/><br/> <所以,平藏前辈,你看我怎么样？我做你的助手好不好？我很机灵的.><br/><br/> 平藏笑嘻嘻地打量这位开朗的新人,摸摸下巴回答:<br/><br/> <直觉告诉我,你好像不太机灵.><br/><br/> <啊？会不会是平藏前辈的直觉出错了.><br/><br/> 上杉的这句话好像有魔力,就像喜剧最终幕的结束词那样,话音一落,四下几位老资历的同僚便捧场似地噗嗤出来.机灵的上杉立刻明白自己说错话了,赶紧找补道:<br/><br/> <我是说…干我们这一行,当然不能光看直觉嘛!><br/><br/> 没想到这次大家笑得更欢了,上杉不明白笑点在哪,只是忽然觉得自己也许真该去当喜剧演员.这时平藏伸手掸了掸他的肩膀,像是把灰尘和尴尬一同掸去了.<br/><br/> <刚才是开玩笑的啦,直觉告诉我,我们的新人上杉会成为一名优秀的同心呢!><br/><br/> <所以,有时间不如给自己找一位助手吧!><br/><br/> 话音没落下,平藏就像风一样地跑远了,光留下摸不着头脑的上杉和哄笑着的同僚们.<br/><br/> <你小子就这水平,还想当鹿野院同心的助手.><br/><br/> <我是看平藏前辈没有助手,想帮帮忙嘛.><br/><br/> <当然有助手了,明明他都说了很多次了.><br/><br/> <欸？有吗？><br/><br/> <不是说了很多次,直觉告诉我吗？><br/><br/> <哈？难道说……他的助手是…直觉？><br/><br/> <没错,那家伙是依靠直觉就能破案的可怕角色啊.><br/><br/>  从工作成果出发,平藏的功绩其实足够他升职几个来回了.但就实际而言,从加入天领奉行至今,平藏的职位一直是同心,从未变动过. 反倒是他的同僚和上司中,因为沾了平藏的光而加官进禄的大有人在.平藏的表姐鹿野奈奈听说后特意找到平藏,要为他打抱不平:<br/><br/> <你这小子虽然混蛋,但奉行所这种不公的做法更加混蛋.><br/><br/> <这下真是小混蛋遇见大混蛋,混蛋一箩筐了.我要去找他们说说理!><br/><br/> 因为清楚表姐的性格,为了避免她惹上什么麻烦,平藏罕见地耐起性子解释起了缘由.<br/><br/> <老姐可不要觉得我这同心不如上面的大人呀.><br/><br/> <如今去奉行所大牢里问问,你猜能说出那些与力名号的有几人？><br/><br/> 平藏伸出一只手,五指打开,手心朝向鹿野奈奈.<br/><br/> <最多这个数.><br/><br/> 鹿野奈奈不知道自己的小老弟在卖什么关子,狐疑着回答:<br/><br/> <五个？><br/><br/> <那能说出我这位天才侦探名号的呢？><br/><br/> 平藏再次伸出一只手,依然是五指打开,这次是手背朝向鹿野奈奈.<br/><br/> <最少这个数.><br/><br/> <又是五个？那有什么区别吗？><br/><br/> 平藏开怀大笑道:<br/><br/> <老姐,我说的是汗毛的数量啦!><br/><br/> <能说出几位与力名号的犯人,就像手心的汗毛一样,一位都没有.><br/><br/> <但能说出老弟我的名头的犯人,多如手背上的汗毛哦!><br/><br/> <连堂堂与力大人的名望都远不及我,我要来那一官半职的有什么用.><br/><br/> <反倒是留在离罪案更近的一线,才能让更多恶徒都畏于鹿野院平藏的威名吧？这才是我要完成的目标.><br/><br/> <所以放心吧老姐,我可是从没有……也绝不会偏离自己要走的路!><br/><br/>  就和平藏自己说的那样,奉行所大牢中名头最响亮的既不是哪位与力,也不是天领奉行的大将……反倒是小小同心<鹿野院平藏>.<br/><br/> 在这里,甚至就连雷电将军的名头,恐怕也要弱他三分.<br/><br/> 毕竟上至大盗,下至小贼,没有谁是被雷电将军亲手抓进来的,却多跟那个<鹿野院平藏>脱不开关系.<br/><br/> 事情是这样演变的:<br/><br/> 最开始时,一些狂妄的犯人会在放风时吹嘘自己的犯罪手法是如何精妙,如何将官兵耍得团团转,似乎这样就能获得别人的高看.但在被问到如此精妙的犯罪又为何被抓住时,他们只好咬牙切齿地将责任怪到抓住自己的那个<侦探>身上.<br/><br/> <不是咱家不努力,都怪敌人太狡猾!><br/><br/> 于是渐渐的,<侦探>的名头在大牢中流传起来.<br/><br/> 再后来,一个偶然的机会,犯人交流到抓住彼此的<侦探>居然是同一个名叫<鹿野院平藏>的家伙时,局势就发生了变化.<br/><br/> 如果说一个侦探能够抓住几个高明的犯罪者,或许能证明他是个相当出色的侦探.但如果无数个高明的犯罪者都是被这位侦探击败,那就已经不能用普通的出色来形容他了.<br/><br/> 那一刻,所有人脑海中几乎浮现了同一个形象.<br/><br/> 那是一位伪装成凡人的狡诈之神,阴险多谋,诡计多端,能够轻易看穿每个人的内心.如果换一身衣服,那家伙一定会成为史上最强的完美犯罪者!<br/><br/> 不愿再惹是非的人选择了噤声,不再参与讨论;穷凶极恶之辈嘴上不服,心里也暗暗打鼓.<br/><br/> <要不还是别与他为敌吧,坏话也不能再说了.><br/><br/> 就连最争强好强的狱霸们,非要吹嘘自己在那位侦探手上走过几招时,也不再直呼其名,而是用别称<风暴>代替.<br/><br/> 负责看守的同心听着这词新鲜,但又不明就里,便询问<风暴>是什么意思.<br/><br/> 有犯人小声回答:<br/><br/> <是天灾啊!犯人的天灾!><br/><br/>']],
						lg_siye: ['male', '罗德岛', 2, ['lg_shoulie', 'lg_shoulie1', 'lg_lingxiuhuhuan', 'lg_lingxiukuizeng', 'lg_zhicai', 'lg_lingxiuzunyan', 'lg_siye_zhenwang', 'lg_zhongyan', 'lg_shoulie2'], ['hiddenSkill', 'des:— 简介 —<br/> 叙拉古贝洛内家族最后一任领袖,叙拉古特别行政城市新沃尔西尼市长候补之一,通过干员德克萨斯,代表所属城市与罗德岛建立合作关系.擅长中距离战斗,并且在种种任务上展现出了相当的谋略与领导力.<br/><br/>  — 背景故事 —<br/> 寡言少语的鲁珀青年.<br/><br/> 虽然没有公开身份,但是来自叙拉古,加上那一身并不遮掩的穿着打扮,大部分人都能隐约猜到伺夜的背景,以至于他第一次造访罗德岛时,所到之处总会突然被沉默笼罩.<br/><br/> 不过这种情况在引起麻烦之前,迅速被化解了.午餐时,同样出身自叙拉古的贾维以一贯开朗的态度接近了他,跟在贾维身边的奥斯塔与布洛卡,显然面露难色.然而,周围人预想中一触即发的形势并没有出现,伺夜以非常平和的态度和贾维团伙展开了交流.<br/><br/> 而这场交流的结果,竟是贾维勾着伺夜的肩膀,向周围干员表示,贾维团伙将欢迎伺夜的到来.<br/><br/> 据当时在场的某个干员回忆:<br/><br/> <要不是大家知道贾维的性格,我当时差点都要相信贾维才是地位比较高的那个了.><br/><br/>  与新沃尔西尼建立联系对于罗德岛来说是一个意外,同时也是一件颇具风险的事.<br/><br/> 原因无他,这座城市实在是过于独特.被西西里夫人承认的特别行政城市,一座不允许家族入驻以及介入的城市.纵观整片大地,或许也只有叙拉古这样的国家,能够凭空出现这样独立于既有权力之外的城市,却不会引起恐慌以及反弹.<br/><br/> 这座城市无疑代表着一种被西西里夫人承认的未来,一种可以发生在叙拉古的对其权威的挑战,然而,它也注定成为其他家族觊觎的对象.<br/><br/> 伺夜是以寻求医药方面的合作为理由而找到罗德岛的.原则上,罗德岛是希望避免与如此敏感的政治实体产生联系.然而,当干员德克萨斯带领他和斥罪出现在凯尔希医生的办公室时,事情就变得没有那么简单了.<br/><br/> 伺夜对发生在旧沃尔西尼的故事毫无隐瞒,他对未来的愿景也最终打动了罗德岛,使得这项合作得以实现.而他选择成为干员,则是一个或许注定的意外.因为他的理由是,他发现罗德岛上聚集了来自各个国家,各个阶层的人,他想要花更多的时间与罗德岛上的人进行交流和学习.<br/><br/> 他毫不遮掩对于叙拉古外的事物的求知欲,而他谦卑的姿态也得到了大多数干员的认可.于是,他和许多干员成了朋友,并且在他们之中的风评很好.<br/><br/> 甚至可以说,伺夜的到来,一改贾维曾经给诸多干员带来的叙拉古人的印象.当然,这也导致他在罗德岛的逗留时间远比他的身份允许他逗留的时间要长,经常因此而被斥罪批评.<br/><br/>  只要伺夜与斥罪同时在舰内,就一定能看到他们共同用餐的场景.<br/><br/> 伺夜在斥罪加入罗德岛后,毫不避讳地将她向其他干员介绍为如同姐姐一般的存在,而斥罪虽然从来没有正面承认过这一点,却也并没有过多否定.<br/><br/> 毫无疑问,对于伺夜来说,斥罪的存在以及斥罪所追求的理想是特殊的.<br/><br/> <我是被当作家族继承人培养长大的,对我来说,一开始,我只是在追求着能够更好地让家族发展下去的方法,以及更有效率地完成我应做之事的方法,我可没那么高尚.><br/><br/> 在与博士的一次闲聊中,提到自己的起点,他笑着解释道,<现在想来,那个时候,虽然还没有开始对德克萨斯家族的清算,但是,由于哥伦比亚家族的势力日渐庞大,他们的一些想法和做法实际上在那时就已经逐渐开始影响叙拉古了,叙拉古的家族们或多或少都开始变得‘文明’了起来,而我也或多或少受到了一些影响.><br/><br/> <原本,我也会变成一个为了家族利益而无所不用其极的人吧.但是,拉维妮娅......好吧,在这里要叫她斥罪,她好像对这个代号还挺满意的.总之,斥罪被父亲带入家族后,事情就发生了变化.><br/><br/> 伺夜说到这里,沉默了一会儿,似乎是在组织语言,<这中间发生了很多事,包括她和父亲的争执,她最后决定接受父亲为她安排的法官职位等等,这些就不该由我来告诉你了,你感兴趣的话,自己去问她比较好.总而言之,我现在回头看去,在为了成为家族领袖而不断学习各种知识的过程中,我不仅学到了叙拉古的规则,哥伦比亚的狡诈,我也学到了她从来没有放弃过的公平.><br/><br/> <可惜,德米特很早就被安排了收集情报的职责,经常要到处跑,所以和斥罪的接触很少.如果他也和我一样的话,我们也不会那样了吧.>他叹了口气,<算了,不说这个.><br/><br/> <总之,对我来说,博士,斥罪是一个值得尊敬的人,她在叙拉古这样的环境下,能够坚持自己的信念,这是十分难能可贵的事.而且,我的母亲去世得很早,而父亲么……虽然我和他关系不差,但绝不是能轻松分享一些什么的关系,所以……><br/><br/> 他说到这里忽然又犹豫了一下,但终于还是开口,<在我还比较年幼的时候,她在我的生命中,扮演了既像是姐姐,又像是……><br/><br/> <伺夜,我要和你聊一聊新城区规划的事.还有,我听说你最近执行任务的状态不是很好,你是不是又熬夜了？>不远处,忽然传来一个清丽的女声,毫无疑问,那是斥罪的声音.<br/><br/> <呃,博士,那我就先失陪了.><br/><br/> 伺夜站起身,向着声音的方向小跑而去,一边跑,他一边为自己辩解,<我可没有影响任务的进度.><br/><br/> 他的身影,难得看起来像是一个有恃无恐的少年.<br/><br/> 伺夜是忐忑的.<br/><br/> 他并不认为自己已经准备好了.<br/><br/> 事实上,如果不是卢比奥的死以及丹布朗的指责让他在关键时刻得以觉悟,他毫不怀疑自己会死在父亲掀起的滔天巨浪中.<br/><br/> 但当他站在那座教堂之中,他终究没有问父亲,为什么不惜以他,以整个家族为代价,都要如此行事,他知道,他得到的回答,和他对德米特里说的话不会有什么不同.无论如何,他最终还是背弃了曾经的兄弟,选择了一条甚至尚未看到曙光的荆棘之路.<br/><br/> 伺夜是害怕的.<br/><br/> 他并没有十足的把握自己能够成功.<br/><br/> 当他坐在西西里夫人对面时,他甚至已经做好了玉石俱焚的准备,毕竟,他从一开始就没有想过在此时直面西西里夫人.面对西西里夫人随意却致命的问题,他只能将自己最真实的想法和盘托出,并且,他诚实地告诉西西里夫人,他的方法也绝非万世不变之法.<br/><br/> 无论如何,即使某种念头早已在他心中生根发芽,稚嫩的,始终是稚嫩的.<br/><br/> 伺夜是惶恐的.<br/><br/> 他觉得自己还要学习太多的东西.<br/><br/> 他过去只是作为卡拉奇的秘书而处理一些并不繁杂的事务,当他需要直面影响一整座城市运行的公务时,他立刻发现了自己的不足.这种落差让他十分痛苦,因为他知道,这是只能用时间来弥补的东西,而他缺少的,恰好是时间.<br/><br/> 无论如何,他也只能硬着头皮去做眼下能做的事,别无他法.然而,伺夜同样知道,自己已经足够幸运.<br/><br/> 西西里夫人接受了他的挑战,他的身边有德克萨斯与斥罪这样的帮手,而且,新沃尔西尼中,也有诸多为了建设城市而铆足了干劲的人存在.<br/><br/> 他正走在自己为自己开辟的道路上.<br/><br/> 他无法断言叙拉古将因自己而改变,但他知道,自己将要做的事,会在叙拉古的土地上,留下浓墨重彩的一笔.<br/><br/> 而他将为之付出一切.<br/><br/>']],
						lg_jiaran: ['female', '次元', '3/4', ['lg_xuniouxiang', 'lg_yuanqi', 'lg_tangguobinfen', 'lg_tianmijiaxin', 'lg_tianmijiaxin1', 'lg_jiaran_zhenwang'], ['des:— 简介 —<br/> 一名从2020年11月26日开始,在哔哩哔哩及抖音活动的虚拟UP主,所属团体为虚拟偶像女团A-SOUL.于2020年12月12日开始首次个人直播,目前个人直播仅在哔哩哔哩配信.<br/><br/>']],
						lg_yujinjian: ['female', '命运', 5, ['lg_wuxielingmei', 'lg_weizhuang', 'lg_tiansumao', 'lg_tiansumao1', 'lg_yujinjian_zhenwang'], ['des:— 简介 —<br/> 近未来圣杯战争终结后的日本,十四岁少女在马赛克市<秋叶原>担任守夜人.由于她猎杀从者时的残酷风格,被人们疏远、恐惧地称作<死神>.<br/><br/>  — 背景故事 —<br/> 在与迦勒底走向不同的未来史中,与世界上最后被召唤的从者<旅行者>一起投身圣杯战争.其结果本人也未可知.<br/><br/>  幼年时被名为<邪灵>的恶灵附体.而灵障则以渗出体表的黑色粘液状疑似物质显现.灵障逐渐变得严重,但她也开始适应如何应对,并将这命名为<魔王>进行自由操控.<br/><br/> 作为感知死亡气息与杀气的超感觉来说非常有用,但反之,邪灵们则一直在寻求活祭,若无法满足它们,就会侵蚀绘里濑自身的肉体.<br/><br/>  重视效率.喜欢功能性而实用的工具与服装,以及质朴稳健的东西.食物方面喜欢辛辣与营养价值较高的东西.至于味道方面倒不是很在意.厌恶魔术师,本人虽自命<魔术使>,但实际上嘛……<br/><br/>  相当了解古今东西各种英灵.闲暇时间会全部用在查看英灵相关书籍与影像资料方面.灵活运用这些知识的她不仅会作为<死神>冷酷应对,更会尊重从者的生前,并表以深深的敬意.<br/><br/> 尤其敬爱发现未知世界的航海家与冒险者的英灵.表面上从容地表示<没什么,这在马赛克市很普通.><br/><br/> 实际则在迦勒底每天都偷偷兴奋到忍不住流鼻血.<br/><br/>']],
						lg_buyesishennai: ['female', '时之岸', 2, ['lg_xinyan', 'lg_chanazhige', 'lg_yongheng', 'lg_shenlingyongcan', 'lg_yinjiuzhike', 'lg_yinjiuzhike0', 'lg_buyesishennai_zhenwang', 'lg_yinjiuzhike1'], ['des:— 简介 —<br/> 认真严谨,同时是个严苛的节约主义者.因为和其他同伴不算熟悉,所以做事不喜欢麻烦别人,但帮助他人时会十分积极.<br/><br/>  — 背景故事 —<br/> 女孩子是由什么东西组成的呢？<br/><br/> 大概是由糖果,小熊玩偶……这些安静又美丽的事物组成的吧.<br/><br/> 那我呢？<br/><br/> <神奈大人真是越来越漂亮了,就和精致的洋娃娃一样.><br/><br/> <你们看,她的皮肤就和雪一样洁白,她的嘴唇犹如绽放的玫瑰……><br/><br/> <她简直就是淑女的典范!><br/><br/> 我的身边好像从来不缺诸如此类的夸奖,从我被转生之时起,就有人告诉我,我会成为人群中最美丽最优雅的公主.<br/><br/> 我的美丽和娇贵就象征着繁荣和昌盛,就好像我是这个世界的吉祥物一样.也正因如此,我的生活中有着各种各样的规矩.在雨天里踩水？不行,那样会把裙边弄脏的.吃饭的时候用手拿烤肉饼？不行,那样会让蕾丝领结沾上油渍的.<br/><br/> 听到开心的笑话放声大笑？也不行,那样会被认为没有淑女的样子的.<br/><br/> <你是代表着高贵形象的公主,不可以不守规矩.><br/><br/> <女孩子要有女孩子的样子,尤其是像你这样有身份的女孩子.><br/><br/> 总是有人这样和我说.<br/><br/> 女孩子的样子吗……<br/><br/> 其实我并不是很理解,她们口中<女孩子的样子>到底是什么样的.或许,就像我现在这样？<br/><br/> 每天早上,等待女仆为我准备带着玫瑰香气的泡泡浴.沐浴完毕后,她们会为我梳理长长的卷发,为它涂抹好闻又不知名的精油,好让它看起来顺滑又有光泽.<br/><br/> 我的衣柜里装满了各种点缀着珍珠,玫瑰和水钻的蓬蓬裙,每天早上都会有专门的人为我整理好一天的搭配.结束了漫长的梳妆,我会被安排上礼仪课,或者去会见边界的使节,又或许是重大的游行活动.<br/><br/> 美丽,高雅,文静.<br/><br/> 似乎便是他们对于女孩子的所有要求了.<br/><br/> 可是……<br/><br/> 那和橱窗里的洋娃娃又有什么区别呢？<br/><br/> 前几日,王城下了一场大雪.晶莹的雪花逐渐覆盖皇城,将眼前的世界包裹成无尽的银白色.<br/><br/> 我很喜欢雪.<br/><br/> 我喜欢雪的纯洁,雪的柔软,更喜欢雪花的轻盈.它们纷纷扬扬地飘落,仿佛是上帝放飞了无数只白色的蝴蝶.而说到雪,更有意思的自然是:<br/><br/> <嘿嘿,看招!><br/><br/> <好诶,我也不会认输的!><br/><br/> 楼下的花园里传来孩子们嬉戏打闹的声音,我忍不住低头望去,看到有几个和自己年龄相仿的孩子在打雪仗.她们用力地挥动着手臂,甩出刚刚捏好的雪球,一会儿她的雪球砸到你的头上,一会儿你的雪球又砸到她的后背,你追我赶,发出清脆的笑声.<br/><br/> 真好啊……<br/><br/> <神奈大人,您在看什么？><br/><br/> 似乎是察觉到了我的走神,礼仪课的老师轻轻挥动了一下手中的教棒.<br/><br/> <对不起,老师,没有什么……><br/><br/> 我有些依依不舍地转移开视线,回归书本上的文字.<br/><br/> <只有保持完美美丽的形象才能给国度带来幸福.><br/><br/> <只要是大家能够幸福,那我这样就好.><br/><br/> 一直以来,我都是这样想的.可是,如果可以的话,我也想和她们一样,在雪地里肆意地奔跑啊.<br/><br/> 雪依旧在下.<br/><br/> 我已经很久没有看到过如此大的雪了.它们无穷无尽地从天穹深处飘落下来,仿佛要将整座城市吞没一般.望着窗外纷飞的大雪,我的脑海中突然浮现出一个大胆的想法……<br/><br/> 对不起,但是我真的很想任性这一次……就一次.<br/><br/> 我在心里默念着.<br/><br/> 趁着夜深人静,我换上了出行的衣裙和斗篷,带着一盏小小的煤油灯,悄悄逃了出去.因为冬夜寒冷,大家都躲进了屋子,街上几乎无人.就算有,大概也不会把裹着朴素衣物的行人和<神奈大人>联想到一起吧.<br/><br/> 于是我非常成功地离开了王城,并且一路向北走,直至到达城镇外.人烟远去,夜晚显得更加的幽静.飘雪渐渐停止,世界只剩下了一片安谧的白.<br/><br/> 我蹲下身,小心翼翼地捧起一把雪,生怕自己的温度会把它们融化.<br/><br/> <下雪了……>我轻声低喃.<br/><br/> 没有礼仪老师问我在说什么,我突然意识到自己此刻已经不在那里了,便又壮着胆子放开了声音.<br/><br/> <下雪了.><br/><br/> 我的声音依然没有得到任何的回应,远方只留下寂静的沉默.<br/><br/> <哇!下雪喽!><br/><br/> 于是,我干脆放声对着天空大喊,那是我的礼仪老师绝对不允许我做的事情.我把手中的雪猛得抛向空中,任凭它们成片地散落在我的头发上,肩上,裙摆上.<br/><br/> 接着,我又脱下厚厚的斗篷在纯白的大地上奔跑了几步,回首望去,我的脚印也成为了雪地上唯一的痕迹.<br/><br/> <就像,我破坏了这张地毯一样.><br/><br/> 我笑嘻嘻地自言自语,却丝毫没有悔过的心情.反而得寸进尺地脱下了漆皮高跟鞋,踏在雪地里,那种感觉就如同踩在柔软的地毯上一般.我并不畏惧雪的严寒,相反,我沉溺于冬天的冰冷.<br/><br/> <呼!><br/><br/> 最后,我干脆张开双手和双腿,直直地倒在厚厚的白雪中,摆成了一个<大>字形.<br/><br/> <好舒服……><br/><br/> 在这一刻,在这一瞬间,我突然感觉自己褪去了身上所有的枷锁和桎梏.我不是高贵的<神奈大人>,也不是世界的吉祥物.<br/><br/> 我只是我,只是名为<不夜寺神奈>的普通人.<br/><br/> <如果这样的时间可以再多一点就好了……><br/><br/> 只可惜,我最后还是要回去的.<br/><br/><救……救命……><br/><br/> 恍然间,我听到一道虚弱的求救声.<br/><br/> 好像,有人？<br/><br/> 我警觉地坐起身,试图确认刚刚的呼救是不是真实的.<br/><br/> <有没有人,救救我……><br/><br/> 真的有人!而且还是个小女孩!<br/><br/> 我赶紧四处张望,企图找到声音的来源.突然,我在悬崖边看到了一朵绽放的花,那娇弱的粉红在一片虚无的白色中特别显眼.它在这样的酷寒中显得是那样的格格不入,仿佛随时都会被风雪打散.<br/><br/> 但又确实坚韧地生存着.<br/><br/> 而在那朵花的旁边,我看到了一只死死扒住山石边缘的手.纤细而脆弱,就如同那朵花一般……<br/><br/> 原来,是她啊.<br/><br/>']],
						lg_zhongli: ['male', '提瓦特', '2/4', ['lg_chuijinzhuanyu', 'lg_yanyuansu', 'lg_dixin', 'lg_tianxing', 'lg_tianxing1', 'lg_zhongli_zhenwang', 'lg_xushi'], ['des:— 简介 —<br/> 钟离样貌俊美,举止高雅,拥有远超常人的学识.虽说来历不明,却知礼数、晓规矩.坐镇<往生堂>,能行天地万物之典仪.<br/><br/>  — 背景故事 —<br/> 在璃月的传统中,<请仙>与<送仙>是同样重要的事.最擅长<送别>一道的,莫过于胡家传承七十七代的<往生堂>.但<往生堂>的堂主胡桃本人,主要还是专注于送别凡人的技艺.<br/><br/> 送别仙人的诸般仪式,则交由一位<道上的朋友>—钟离打理.仙人与璃月一同度过漫长岁月,三千多年来升天者寥寥无几,这就意味着一切相关传统都只能以纸面形式存在,时间跨度实在太长了,这可不是那种你小时候咬着糖葫芦参加过一回,老了还能躺在竹椅上再次亲眼目睹的事件.<br/><br/> 但即便是眼光最为挑剔、沉迷旧纸堆的老学究,也无法对<往生堂>操办的送仙典仪挑出任何毛病.不仅仪式中人的服饰合规,仪式举行的吉时、地点、用具,乃至当天天气、仪式时长、允许观礼人数、观礼者身份职业年龄,哪怕将以上所有全都纳入计量范畴,也无一不合礼节.<br/><br/> 若人们以<通古晓今>来形容钟离,他只会无奈地一笑,叹道: <我只是……记性很好.><br/><br/>  在璃月,如果一个人对细节特别在意,对某些事物心中始终有不可逾越的评判基准,那就可以用一个词来形容,<讲究>.<br/><br/> 其实每个人都多少有些讲究.例如不能吃辣, 不能吃鱼, 豆腐必须要甜口,钟离却事事都很讲究.<br/><br/> 他的生活,就是那种听戏要点最红的名伶,遛鸟要买最名贵的画眉、品尝正宗<明月蛋>要跑去后厨亲自指导厨师调配蛋液中虾仁与鱼肉比例的生活.<br/><br/> 钟离精通衣冠日用、珠玉瓷器、酒食点心、茶叶香料、花卉虫鸟,也完全可以接上贸易、政治与七国关系的话题.不过平日里,他只会对你说些无用的知识,因为他非常乐意把这些趣事分享给你.<br/><br/> 买东西是要砍价的.这是璃月人的共识,无论老板把手里的商品吹得如何天花乱坠,是上引经典还是下据史料,价总是不能不砍的,一般以见面砍一半为宜.<br/><br/> 但钟离付账时,从来不看价格.只要是他看上眼的东西,老板喊多少,他就付多少,偶尔还会报出更高价格,一口拿下.然而不知为何,钟离总是忘记带钱.小钱有朋友帮他垫付,大钱则会想办法找借口报销.<br/><br/> 在口中奉承,心中暗爽的商人们看来,钟离似乎有一种奇怪的特质:他分明懂得金钱的价值与金融的意义,也很明白人间疾苦,却似乎不能理解<穷>也是一种可能出现在自己生活中的境况.<br/><br/> 换句话说,他只是根本不能想象一个没有钱的自己.真是绝了,这种人怎么还没饿死.<br/><br/>  钟离是饿不死的.财富的盈亏并不是钟离需要操心的事.七国与世界才是他费心费力的领域.至于财富,他就是财富本身.<br/><br/> 统御璃月的<岩王帝君>,七神中的岩之神,摩拉克斯.通行提瓦特大陆的货币<摩拉>,其源流,正是他的神名.<br/><br/> 当深夜到来,喧嚣的璃月港陷入沉睡,他偶尔会登上岩山之巅,俯瞰这座由他亲手缔造的城市.在璃月人心中,<岩王帝君>神职众多.以神力为璃月港制订律法时,他是<契约之神>.<br/><br/> 他亲手铸造了最初的一枚<摩拉>,令璃月港以商业立本,商人们尊崇他为<商业之神>.他经历了漫长岁月,是七神中最古老的长者,历史学家们称他<历史之神>.<br/><br/> 数千年前,璃月港的先民们垦荒时,常以石头摩擦生火,再用岩石垒起炉灶.这些来自于<岩>的恩赐,也让岩之神在人们口中成为了<炉火之神>.<br/><br/> 外国人倾向于叫他<摩拉克斯>,璃月人则更喜欢<岩王爷>这一俗称.而在戏曲爱好者和孩子们心里,摩拉克斯诸多神职中,还数戏台上横扫魔神千军、开创并守卫璃月的<武神>最为有趣.<br/><br/> <岩王爷>迷路时发掘的美味小吃、<岩王爷>亲笔题字的牌匾、<岩王爷>倾情出演过一次龙套的著名戏曲,璃月的诸多风土人情,细究起来,全都在某一时期受到过神明本人的直接关怀.璃月人对这种与神同行的历史,也十分引以为荣.<br/><br/> 身为璃月港的缔造者,摩拉克斯在这座商业之城里最为看重的就是<契约>.从最简单的<以钱易物>、商人之间签订的合同,到建城时摩拉克斯亲立的古老律法,<契约>无处不在.<br/><br/> <契约>之于商人,也是最为重要的准则:交货日期、交货款目、交货地点,唯有保持良好严格的秩序,才能让商业活动具有旺盛的活力,而商业,恰好是璃月港的立城之本.<br/><br/> 所以,不仅仅是遵守摩拉克斯的神谕,更是为了让璃月港时刻保持活力,<璃月七星>对所有违反律法的人绝不姑息.数千年来,历代<璃月七星>均投身于古老律法的释义工作,以各类微妙的<补充条款>填充着律法内已知的漏洞.那些尚未发现的,则被商家们默认为<法不禁而可为>,以此大捞一笔摩拉,直到被<璃月七星>发现,将新出现的法律漏洞迅速补上.<br/><br/> 在这追来补去的拉锯战中,专门用来统计解读璃月港律法<补充条款>的律法释义书籍,已经达到了庞大的两百七十九页之巨.<br/><br/> 而负责修订这本书的当代<天权>凝光,更是被人们悄悄地戏称为<璃月的裁缝师>,以形容她为璃月港律法打补丁的速度之快,眼光之准……<br/><br/> 但无论凡人律法如何繁复难解,在<岩王帝君>本人心中,只有一条律法地位高于一切,<契约既成,食言者当受食岩之罚.><br/><br/>  作为七神中最古老的一位,<岩王帝君>已经度过了太长的时光.<岩王帝君>还记得,在魔神战争的战火刚刚熄灭时,最后七位魔神各自登上<神>之座,自此终结了<魔神战争>时代.他们虽然性格迥异又相隔万里,却都肩负着<引导人类>的神圣职责.<br/><br/> 时代变迁,七神多有更替.时至今日,最初的七神之中,唯留下两位<岩王帝君>,与那位自由而快活的风神.七神中第二古老的,是那位自由而快活的风神,巴巴托斯.<br/><br/> 两千年前巴巴托斯初临璃月,<岩王帝君>的第一反应是这位同僚在履行职责时遇到了困难,需要自己的帮助.所以还没等巴巴托斯从风中落下,岩之神已经做好准备迎接这位邻国神明,只等他开口,自己就将倾尽所能.然而,风之神却将一瓶酒递到了他面前.<br/><br/> <这是蒙德城的酒,你要尝尝吗？>为了送一瓶酒而弃职责于不顾,实在荒唐.<br/><br/> 即使如此,那位风神依然不断前来造访,到璃月港四处游玩,还总向岩之神问出各种奇怪问题.这位风神的好奇心,就和他手中的酒一样无穷无尽.<br/><br/> 自那时起,那个时代的七神往往会在璃月相聚.到现在,<岩王帝君>仍能回忆起那些酒的味道.此后,世界不断变迁,他曾熟悉的一切都在逐渐消逝.<br/><br/> 七神之位更迭再更迭,酒会上的七人已逝五人.最初七神<引导人类>的古老职责,终于也开始被一些新任神明视为无物了.亲历三千多年风霜,最坚固的岩石也能被磨损.而且,风也没有再来到他身旁.<br/><br/> 某个微雨的清晨,古老的帝君漫步于璃月港,听见一个商人对属下如此夸奖道<你很好地完成了你的职责.现在,去休息吧.><br/><br/> <岩王帝君>在熙攘的人群中驻足良久.<我的职责……又是否已经完成？>神灵如此自问.<br/><br/>']],
						lg_shenlilinghua: ['female', '提瓦特', '3/4', ['lg_qingying', 'lg_zhujing', 'lg_binghua', 'lg_shuangmie', 'lg_shenlilinghua_zhenwang'], ['des:— 简介 —<br/> 稻妻<社奉行>神里家的大小姐,容姿端丽,品行高洁.平日主理家族内外事宜,绫华常出现在社交场合,与民间交集也较多.因此,更被人们熟悉的她反而获得了高于兄长的名望,被雅称为<白鹭公主>.<br/><br/>  — 背景故事 —<br/> 继承稻妻城中至为尊崇的三家名门之一,神里家族的,是一对兄妹.<br/><br/> 哥哥绫人出任<家主>一职,掌管政务,妹妹绫华贵为<公主>,平日主理家族内外事宜. 绫华常出现在社交场合,与民间交集也较多.因此,更被人们所熟悉的她反而获得了高于兄长的名望,被雅称为<白鹭公主>.<br/><br/> 众所周知,神里家的女儿绫华小姐容姿端丽、品行高洁,是深受民众钦慕的人物.<br/><br/>  放眼稻妻领土,未上至雷电将军视听的事务大多由<评定所>处理.<br/><br/> <评定所>的议事权分属三家,人称三奉行,即<社奉行>、<天领奉行>与 <勘定奉行>.<br/><br/> 拥有此三项奉行权利的家族,其姓氏为:神里、九条与柊,乃是稻妻无人不知无人不晓的御三家.<br/><br/> 而神里绫华,正是社奉行神里家的大小姐,远近闻名的<白鹭公主>.问及她为何被称为<白鹭公主>,稻妻人各有说辞.<br/><br/> <因为绫华大人如白鹭般优雅高洁,您请看,她清丽秀美的外表,她聪敏得体的谈吐,难道当不起一声公主吗？><br/><br/> <绫华大人她呀,虽说身份高贵,对我们却是礼貌中透着亲切.她个性善良仁厚,很愿意对他人伸出援手.您知道吗？就是她力排众议帮着收容了庶人托马.><br/><br/> 众说纷纭,却无人说得出<白鹭公主>之名的确切来由.<br/><br/> 不过,绫华受民众爱戴的事,倒是可见一斑.<br/><br/>  身为社奉行神里家的女儿,绫华常提防着贵胄门庭之间的权力争斗.她年纪尚轻却已名望隆盛,不免遇到嫉妒神里家兄妹的名门子弟暗中挑衅.营造公众形象一事本是形式主义,但对神里家而言,地位使然,再无意义的惯例也有其社交意义.<br/><br/> 不在稻妻关系网中转圜腾挪,便会坐不稳社奉行之位.因此,兄妹俩达成了一致.兄长绫人政务繁忙且不喜抛头露面,到公众场合现身以树立神里家形象一事,便交给了举止优美、擅长与人打交道的妹妹绫华来办.<br/><br/> 凭借端庄娴静、风雅有礼的姿态,绫华在各种社交场合都占据了一席之地.无论是跟潜在的合作伙伴交涉,还是与难缠的贵族周旋,她都进退有据,无可挑剔.此外,家族内部诸多事物也由绫华掌理.如果没有她,内宅恐怕早已陷入混乱.<br/><br/>  秋季的一个午后,绫华办完琐事走在回程路上,偶然听见一间老宅中传来苍老的歌声.<br/><br/> 屋内住着一位双目失明的老妇人,干瘦的手指拨动琴弦,木琴便发出流水般的声响.兴许是耳朵灵敏的关系,老人听见脚步声,询问门外的人是谁.绫华不想她感到困扰,便说自己是迷路误入此地的附近居民.<br/><br/> 身为社奉行,绫华对民生十分熟悉,很快认出这位膝下无子的孤寡老人正是天气晴朗时在街边弹唱卖艺的那位.<br/><br/> 曲是过时的老调,歌亦如此.目不能视的老人,早已落后他人太多.即便在追寻永恒的国度之中,也会有活得如此艰辛的人.<br/><br/> 出于好意,隐瞒身份的绫华陪老人聊了好一会儿.老人当她是普通少女,给她讲木琴的做法和弹法,还将自己收藏的茶叶分了一些给她. 与神里家常备的极品茶叶相比,这些粗茶几乎算是草根.但绫华珍重地收下,并再三向她道谢.<br/><br/> 这一天,她屡次想起双亲.父母若是还在,想必也会有像这样老去的一日.回到家中,绫华将这个故事告诉兄长绫人,兄妹俩一同享用了老人赠予的粗茶.<br/><br/> 此后每隔一段时日,绫华都亲自前去探望老妇人,依然用着附近居民的名义,每次都为她带去一些平民爱用的生活必需品.<br/><br/> <街口的绯樱树又开花了.>绫华笑着告诉老人,<如您的琴声一般美丽.><br/><br/>  在民众的想象中,贵族世家吃穿用度规格远超常人,那高贵如神里绫华,一定也过着极其奢侈、极其肆意的生活吧.<br/><br/> 然而,这样的想法只对了一半.<br/><br/> 单从形式而言,绫华的生活确实较寻常百姓讲究得多.<br/><br/> 平日里钻研花道、茶道,品名茶、赏奇花的开销也着实不小.不过,这些都是身为贵族大小姐的她必须掌握的技能,并无<肆意>一说. 真正能让绫华露出笑容的,反而是那些寻常百姓也能享受的小事.<br/><br/> 譬如制作点心,譬如在池塘边捞金鱼,又譬如躲起来阅读八重堂新出的小说,无一不是小事.<br/><br/> 这种时刻的她,不是受人景仰的白鹭公主,不是掌管神里大宅的绫华大人,而是普普通通的<少女绫华>.<br/><br/> 卸下端庄持重的对外形象,绽放出随性自在的真我.唯有作为<少女绫华>时,她才能放下重担,做普通女孩也能做的事.<br/><br/> 深夜肚子饿了,避开佣人偷偷溜到厨房,哼着歌为自己做一碗茶泡饭;茶道课时,偷偷根据茶叶的形状占卜恋爱运势……等等.虽然从未向他人说明,但绫华无比珍惜自己作为普通少女的时间.因为,这样的自由时刻实在很少.<br/><br/>  指导绫华诸门技艺的老师们曾欣慰地表示:无论茶道、剑道或棋道,诸般风雅,绫华都已完全掌握.<br/><br/> 她俨然是一位文武双全、风姿超绝的贵族小姐了.能教导这样一位学生,身为老师也感到非常愉快.<br/><br/> <但遗憾之情,当真完全没有吗？>绫华默默想道.<br/><br/> 茶心,和敬清寂的正心.<br/><br/> 剑心,锐不可当的武心.<br/><br/> 棋心,审时度势的慧心.<br/><br/> 茶心、剑心、棋心,俱是她心,此外,却也有着一颗对友人的真心.<br/><br/> 绫华始终等待着世上能出现一个与她平等相对、并肩而立的友人.如此,才能成为她绫华的好友.<br/><br/> <也并不是那么难的事吧……可这样的人,究竟在哪里呢？><br/><br/>']],
						lg_sixinai: ['female', '异界', 5, ['lg_bingjiekuilei', 'lg_bingjiekuilei0', 'lg_chenmoji', 'lg_dongkai', 'lg_dongkai1', 'lg_dongjie', 'lg_sixinai_zhenwang'], ['des:— 简介 —<br/> 识别名为隐居者(Hermit).<br/><br/> 生性温驯而胆小怕生,几乎不敢与人直接对话.左手拿着的兔子型的手偶四糸奈是独立的人格,也是她最好的朋友.喜欢和士道在一起.<br/><br/>  — 背景故事 —<br/> 左手拿着兔子型的手偶四糸奈.手偶<四糸奈>起初被认为是腹语术,事实上是因为四糸乃灵力链接上的手偶而存在的独立人格.由于对外皆由<四糸奈>对应,使四糸乃本身的精神处于封闭状态,在手偶脱离之后,四糸乃的本人格才浮现.<br/><br/> 一旦失去<四糸奈>的支持,四糸乃就会变得极度容易恐慌,任何刺激都会让她反射性的发动攻击,但心中仍是希望不要伤害任何人,士道为此做出承诺说会成为保护她远离痛苦与伤害的英雄.<br/><br/> 非常害怕人类,与士道第二次见面时因为不小心摔倒而和士道造成扑倒性亲吻被十香撞见,因十香醋性大发抢走了四糸奈导致灵力失控.<br/><br/> 暴走后几乎毁灭城市,后与士道一起找到玩偶,与士道亲吻并被封印力量,灵力被士道封印后暂时住在佛拉克西纳斯中,学习着能够融入人类社会的相关知识,并开始练习由自己主动开口说话,处于两个人格一同显现的状态.很喜欢和士道在一起.<br/><br/>']],
						lg_lize: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_youyazhiyi', 'lg_mengsebianzhi', 'lg_lize_zhenwang'], ['hiddenSkill', 'des:— 简介 —<br/> 莉泽·赫露艾斯塔,是一名从2019年3月23日在YouTube开始活动的VTuber,业界团体彩虹社所属的成员.<br/><br/>  — 背景故事 —<br/> 赫露艾斯塔王国的第二皇女,文武两全学园主席、认真又温柔待人因而有着相当的人望.作为王位继承的资格者日夜锻炼、重视着与人的交流.<br/><br/> 自称文武双全的清楚派,内里挡不住的脱线气息透出来,有着<脱线皇女>的称号.<br/><br/>直播主要杂谈、游戏实况为主,对任天堂系游戏有钟爱,尤其是宝可梦系列.与同期出道的成员也有密切的联动.<br/><br/>']],
						lg_shenleqinai: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_liuyun', 'lg_chunzhenzhufu', 'lg_shenleqinai_zhenwang'], ['des:— 简介 —<br/> 神乐七奈是画师ななかぐら的虚拟YouTuber形象,于2018年12月28日开始在YouTube上作为个人势活动,并从2019年3月24日开始亦在bilibili直播并活动.<br/><br/>']],
						lg_anjielina: ['female', '罗德岛', '3/4', ['lg_suchong', 'lg_weili', 'lg_fanzhongli', 'lg_anjielina_zhenwang'], ['des:— 简介 —<br/> 安洁莉娜,本名安心院安洁莉娜.于叙拉古从事情报递送、货物运输等公开活动,推测身份为信使.现作为实习术师干员,为罗德岛提供后勤保障、战场辅助与战术协同等服务.<br/><br/>  — 背景故事 —<br/> 虽然安洁莉娜她自己没意识到,不过她可是有着相当独特的法术天赋的哦!好像,是能让各种物品,变重或者是变轻的样子.如果能得到进一步的引导和开发的话,我觉得,总有一天她会变得很了不起的!<br/><br/> 刚成为信使不久的少女.安洁莉娜就像其他的高中生一样,对未来充满希望,但也花了很多时间在学业与打扮上.喜欢小饰品和流行小说,意外的喜欢稍显复古的音乐,安洁莉娜的人生本应平常而快乐.<br/><br/>  而当罗德岛寻访她时,安洁莉娜却正穿梭在城市的黑夜中,于大楼间轻巧地滑翔而过.<br/><br/> 这片大地是不公的,意外成为感染者的安洁莉娜,悄悄地从自己的生活中消失了.<br/><br/> 没有告别,没有徘徊,安洁莉娜离开了家庭,默默地告别了学校中的朋友和自己热爱的故乡.然而,即便已经知晓了感染者的结局,安洁莉娜却并不甘心.<br/><br/> 每个夜晚,她奔跑着,跳跃着,在建筑间穿梭着,操纵着还不那么熟练的法术,将货物从一个秘密的地方运送到另一个秘密的地方.<br/><br/> 作为信使,作为感染者,也作为一个普通的高中生,安洁莉娜正在努力地生活下去,无论未来会变成什么模样.<br/><br/> 在遇见罗德岛与博士之前,安洁莉娜将这些秘密都藏在自己心里.<br/><br/> 直到罗德岛发掘了安洁莉娜,她才看见了另一种属于感染者的生活.而她,也给罗德岛带来了不同的色彩.如今成为了罗德岛干员的她,兴许也能重新找回自己作为一个高中生应有的生活.<br/><br/> 大概.<br/><br/> 安洁莉娜选择的道路,究竟会通向哪里？<br/><br/> 可能连她自己都没法想象吧.<br/><br/>']],
						lg_shenlilingren: ['male', '提瓦特', '2/4', ['lg_poyuejianying', 'lg_jinghua', 'lg_jingying', 'lg_jingying1', 'lg_shuiyou', 'lg_shuiyou0', 'lg_shenlilingren_zhenwang', 'lg_shuiyuansu'], ['des:— 简介 —<br/> 社奉行神里家现任家主.总有办法以周全的手段实现自身目的.不过,很少有人知道他如今最在意的<目标>是什么.<br/><br/>   — 背景故事 —<br/> 身为三奉行之一,社奉行神里家的家主,神里绫人的名号在稻妻可谓无人不知、无人不晓.但不同于优雅善良的<白鹭公主>绫华,人们对她的兄长绫人的认知并不清晰.<br/><br/>  人们只知道他是幕府的大人物,是贵族名门的家主,一旦问及细节,却都支支吾吾说不明白.<br/><br/>  有人说:<社奉行办起祭典和活动向来一丝不苟,又对邻里乡亲多有关照,其中一定少不了奉行大人的辛苦劳作.><br/><br/>  但也有人肆意评论:<嘁,官场上见不得人的事情多的是.若不是懂些暗度陈仓的伎俩,怎么能当得上大官呢.><br/><br/>  对上述种种说法,神里绫人本人似乎不甚在意.<br/><br/>  <我……只是将军大人麾下一名认真工作、履行职责的公务人员罢了.><br/><br/>  神里绫人身为稻妻贵族世家的长子,自出生起便备受爱护.父母虽因事务繁忙不能时刻陪伴,仍对他呵护有加,平日里围在<少爷>身边嘘寒问暖的人也从未少过.<br/><br/>  年纪稍长后,绫人遵从父亲要求,以家族<继承人>的标准开始了复杂又严苛的学习.然而天有不测,繁重政务与重振家族的压力导致父亲疲劳病重,早早辞世.<br/><br/>  年纪尚轻的绫人,不得不在家族地位危在旦夕时投身权斗纷争.那时,没有人看好这名初出茅庐的青涩少年.神里绫人一下从养尊处优的贵公子,变成了民间闲话里<神里家可怜的小少爷>,和政敌嗤笑声中那个<不成气候的小子>.<br/><br/>  但时间证明这些人都错了.<br/><br/>  凭借过人胆识与一流手段,最终继任家主的神里绫人不仅没有放任神里家家道中落,还令家族地位变得更加稳固.<br/><br/>  繁重的工作、恶意的欺瞒、无处不在的构陷,都被他一一化解,甚至转化成了能为己所用的优势.时光流转,社奉行神里家在幕府与百姓之中声誉大振.<br/><br/>  如今的神里绫人,是稻妻名门笔头之位神里一族当之无愧的<家主>,是人们口中身居要职的<社奉行大人>.<br/><br/>  社奉行司掌鸣神祭礼事宜,又要管理文化娱乐活动,可谓上达神明,下通民众,无愧笔头之格.但相对的,涉足的领域越多,工作也就越繁重.<br/><br/>  幸好妹妹绫华为兄长分担了不少家族事务,社奉行与民间的大部分交流也都交由她,神里绫人因而能将精力更多地放在政务上.<br/><br/>  与幕府官员交涉并不容易.大家分属于不同的奉行、家族,立场各有不同.一件事务,牵扯的人员越多,就越难办成.绫人的优势正在于,他很擅长处理这类事情.在他看来,人的行为都受利益驱使,只要抓住痛点,就能令对方妥协.<br/><br/>  狙准一个目标,将对方带进自己的逻辑,再说几句场面话,卖些小小人情给对方,问题多半就能迎刃而解.<br/><br/>  万一遇上顽固不化的人,也只需搬出更高层面的势力来压制即可——毕竟,无论地位如何之高、态度如何狂妄,也没有人能撼动天光的威严,不是吗？久而久之,知书达理的神里家主在幕府中混出了相当不错的名声.<br/><br/>  <此事颇为难办,要不要问问社奉行大人怎么看？><br/><br/>  人们常这么说.<br/><br/>  不过,绫人虽然有许多办法,却也不是随时都愿意出手的.<br/><br/>  一来,并非所有事务都与社奉行有关;二来,只为其他势力的蝇头小利就令神里家卷入其中,实在不值得.大多数时间,绫人只是捧一盏热茶,把自己当作一名小辈,微笑敬陪罢了.<br/><br/>  <哎呀,长冈大人,先不必动气.大家都是为将军大人办事,别无二心.只需把话说开,肯定能协力解决.><br/><br/>  受身份与工作限制,神里绫人不常露面,也没有什么时间用于闲逛.不过,这点阻碍无法影响他了解新鲜事物.<br/><br/>  晨起练剑有时会看到八重堂的工作人员在门外探头探脑,似乎是又来社奉行<报告工作>.不如假装没看到,听听她这次又想了什么新的翘班理由,以后有机会可以<不经意>地说给八重宫司.<br/><br/>  去天守阁跟那群老古董开会,不必急于发言.看着这些人一把年纪仍在为小利小益争得面红耳赤,实在有趣.走至町街一带,忽然想起有家另辟蹊径的小吃摊.前去询问摊主是不是又有新食谱,生意是否还过得去,顺道买杯饮料尝尝.要是有意思,也给家人捎几杯回去.<br/><br/>  最近常在花见坂一带出没的鬼族青年,斗虫技术似乎不佳.出于好心,应当稍加鼓励,重振他的气势.闲聊之间发现这名赤鬼并不知道<绫人>这个名字代表着什么……如此甚好,不必特意解释.<br/><br/>  回家途经镇守之森,恰好撞见又有行人被妖狸捉弄,忍不住顺手指出幻象.妖狸们若是从此发奋修炼出了更精湛的化形术,可得好好谢谢自己才行.<br/><br/>  即便是托马这样能干的人,也会有想不出晚饭吃什么的时候.此刻正是提出玩火锅游戏的大好时机!绫华每次都能放进最出人意料的食材,真不愧是自家妹妹.<br/><br/>  如此种种,便是社奉行大人的闲趣所在.<br/><br/> 靠着管家与家政官的双重努力,神里屋敷由内而外干净整洁,只是,除了一处.<br/><br/>  神里绫人那张书桌,每次使用过后总是很凌乱.<br/><br/>  书本随意摊开或者倒扣在桌上,大小不一的文件胡乱叠放在一起.用过的砚台墨汁也从不收好,桌下偶尔还散落着棋子或纸牌.每当家主大人办公结束,家仆们都要花点时间来整理书桌书房.<br/><br/>  他们发现,凌乱的纸张之间往往夹杂着一种小片的便签.细看可知,这些便签上的笔迹均不相同,内容也各异.<br/><br/>  <家主大人,家仆又送来了新鲜花卉.我稍微整理了书桌的一角用来摆放花瓶.您可要小心些,别再碰倒了哦.><br/><br/>  <家主大人,今日鸣神大社巫女来访,宫司大人有事找您.据说很是重要,涉及离岛部分地区的征用,邀您前往神社详谈.><br/><br/>  <奉行大人,百代未凋.枝叶仍在生长,还请放心.><br/><br/>  <兄长大人,之前我与旅行者前往祭典游玩,学到了一份新食谱.考虑到旅行者出身异国,你觉得…我需要对菜谱做些改进吗？><br/><br/>  <家主大人,有件事家仆们都不敢跟您提,所以还是让我这个老婆子来说吧.您若想吃什么,交给家政官就好,还请不要随意动用后厨的食材……怎么能让您亲自下厨呢？大家会为难的.><br/><br/>  神里绫人工作繁忙,经常早出晚归.神里屋敷的大家无法见到他时,便会用这种方式与他沟通.这是绫人想出的办法.神里家正是靠着一张张小小的便签,维持整座宅邸的运转.<br/><br/>  可惜,这种办法会搞得家主大人本就不整洁的桌面更加混乱……不过没关系,只是微不足道的牺牲罢了.<br/><br/> 在稻妻,人们有时会向神明供奉某种柏木的叶子以示祈祷.但稻妻大大小小的祭神仪式太多,这种仪式因缺乏规模,常常被人忽略.<br/><br/>  虽已时隔许久,绫人仍记得,按照母亲所说,这种柏木虽是常绿的乔木,树叶却不是针形.它的叶片较大,脉络清晰.即便长出新叶,旧叶也不会凋落.<br/><br/>  因而有了<繁荣>的寓意,在古时常被用来当作供奉食物的食器.时至今日,人们不再用树叶盛放食物,供奉柏叶的习惯却留存了下来.<br/><br/>  不知是兴趣使然,抑或本就见多识广.总之,母亲一讲起有关祭礼的事情就滔滔不绝.<br/><br/>  <神里家世代管理社奉行,可能天生就是为了守护神明而存在的吧.><br/><br/>  对此,年幼的绫人并不完全赞同.<br/><br/>  他认为,神里家就是神里家,是属于家人的地方.家族是因为家人才得以存在,侍奉神明不过是顺势为之的工作罢了.但这种话是不能说出口的,想法过于僭越.而且母亲讲解时兴致十分高昂,令人不忍打断.<br/><br/>  无论母亲一口气讲上多久,绫人都会端坐在母亲面前,哪怕腿都坐麻了,也要静静听完.岁月如梭,绫人渐渐长大,每天的时间都被剑术和书本占用.<讲课>的人从母亲变成了父亲,内容也从祭礼知识换成了家族继承人必学的课程.<br/><br/>  家族责任在绫人生活中的占比再次增大.<雷电将军>也不再是幼童心中虚幻的象征,而是成为了真实存在的神明,成为了维护稻妻永恒安宁的大御所大人.<br/><br/>  <从前,神里家曾受过鸣神恩惠,才得以延续至今.因此无论如何,神里家定要恪守永恒之道,追随将军大人直到永远.><br/><br/> <这是既成的约定,是不可违抗的族规,你要牢记在心.><br/><br/>  个中缘由,绫人在阅读祖训时早已得知一些.由于神里祖辈失职,导致国之重器<雷电五传>严重折损.若非八重宫司进言使将军大人降下宽大饶恕,神里家或许早已随其他落魄权贵一同消散.<br/><br/>  这是大御所大人的恩赐,也是神明眷属的警示.<br/><br/>  因此,对于父亲的教诲,神里绫人自然不会怠慢.尽管守护家族的信念高于一切,但他也明白一个道理:稻妻因雷神的守护而存续;唯有稻妻安定,才能保证家族长久繁荣.不论今后稻妻局势如何发展,唯独神里家不可向御建鸣神主尊举起叛旗.<br/><br/>  即使心有异向,也只能隐入深藏在表象之下的暗河.<br/><br/>  正如母亲从前所说的那样:<br/><br/>  <神守之柏,古枝犹在,已焕新材.><br/><br/>  <在庭之椿,勿为冬困,寒中清芬.><br/><br/>']],
						lg_shuiqiaopaluxi: ['female', '幻想乡', 4, ['lg_jiyuanfan', 'lg_duyiyinbaozhe', 'lg_shuiqiaopaluxi_zhenwang', 'lg_duoluo', 'lg_shuiqiaopaluxi0', 'lg_choushicanbai'], ['des:— 简介 —<br/> 具有操纵嫉妒心程度的能力,将此世与彼世用依恋连接起来的妖怪,日日守护着那座连接地上与地底世界的桥.同时也是操纵嫉妒心的妖怪,本身的嫉妒心也很强,与之相处必须万分小心.<br/><br/>  — 背景故事 —<br/> 居住在地底的妖怪,桥姬.<br/><br/> 现在的旧地狱成了受人厌恶者的栖息地,她也是其中的一位.总之是个嫉妒心很强的妖怪. 煽动人们心中的嫉妒.<br/><br/> 看着他们因嫉妒而疯狂,生活逐渐崩溃的样子,并以此做为粮食.在她看来被嫉妒所驱使的人类是不可或缺的.<br/><br/> 她的嫉妒是没有情理可言的.只要一觉得别人过得比自己幸福就会发作起来.如果别人和自己一样的话,就会夸耀说自己更加不幸一些.就算对方比自己更加不幸,只要对方不来嫉妒自己,也会因为对方的这份宽容而嫉妒.如果对方来嫉妒自己的话,这份嫉妒就会成为自己的粮食.走火入魔到这种程度.<br/><br/> 但这并不意味着她本身也很不幸.只要有人心生嫉妒,她的力量便会无穷无尽,也没人会想去要她的命.她听说旧地狱聚集了不少被人厌恶的同伴.嫉妒者也并非全是不幸者吧.正相反,因为这这份嫉妒,所以才会看起来是不幸的样子吧.<br/><br/> 她是个妖怪,却有着人类的性格.称之为嫉妒心本身也丝毫不为过.跟她进行直接对话的时候会给人一种很普通的开朗的感觉,但心中却已是波澜万丈.之后会在背地里使劲说你坏话,并对你怨恨起来.让人感觉十分的不好.<br/><br/>']],
						lg_kuqiulin: ['male', '命运', 5, ['lg_tuzhan', 'lg_luenzhijian', 'lg_kuqiulin_zhenwang'], ['des:— 简介 —<br/> 凯尔特、阿尔斯特传说中无双的大英雄, 继承了太阳神鲁格之血的<光之皇子>. 外号是库林的猎犬.虽说与以相同真名被召唤的Lancer是同一人物但无论是肉体面还是精神面,都比<那边>略显年轻.<br/><br/>  — 背景故事 —<br/> 相比于<那位>Lancer,对师父斯卡哈的感情与憧憬.在其内心中占据了更大的比重,只是不知道是因为年轻还是因为时期的缘故.那么究竟他是否真的无法认同,这世间的不合理,以及善恶的平衡呢.<br/><br/> 与同样以真名召唤而出的Lancer相比,装备了重装的铠甲.即便如此,敏捷的数值依然优于<那位>,达到了优等.这并非身体的性能差距,估计是因为年轻气盛,只知一心往前冲的缘故吧.<br/><br/> 性格暴躁直率的男人,不会断言正义或者邪恶哪个更高一筹,但本质上是偏向正义一方的.尚未成熟到可以理解世间所有不合理以及善恶的平衡,同时是名驯兽师,尤其和狗特别合得来.<br/><br/>']],
						lg_luxueer: ['female', '混沌', 4, ['lg_hundun1', 'lg_hundun', 'lg_jing', 'lg_luo', 'lg_shewu', 'lg_luxueer_zhenwang', 'lg_jiren'], ['des:— 简介 —<br/> 行事认真严格的武者,忠于使命但行事死板,还有轻微的洁癖,让人误以为不好相处.日常中其实十分温和友善,私下里也在反省自己的处世之道.']],
						lg_nuoya: ['male', '混沌', 4, ['lg_zhuiling', 'lg_cuican', 'lg_anyouxinsheng', 'lg_hundun_nuoya', 'lg_nuoya_zhenwang'], ['zhu', 'des:— 简介 —<br/> 混沌之初的诞生主,受到混沌之毒的影响持续恶化,将在恶化之前消灭自己的任务交给了三位手下.可是他们没有遵守命令,而是用混沌之初的法器将其封印了混沌谷.']],
						lg_nikesi: ['female', '混沌', 1, ['lg_huanxiangdiesheng', 'lg_niuqu', 'lg_hundun1', 'lg_hundun', 'lg_hundunchuyong', 'lg_baiqiangweizhifa', 'lg_cuixue', 'lg_baiqiangweizhilei', 'lg_nikesi_zhenwang', 'lg_baiqiangweizhilei1'], ['des:— 简介 —<br/> 混沌之初诞生的吸血鬼,在安静的外表下有着强烈的欲望.虽然为人热情主动,但是能感到其话语中<危险>的气息,不知情的总是需要判断她到底是<天使>还是<恶魔>.她的意愿,也许只是单纯想玩弄眼中的<食物>,以此为乐罢了.']],
						lg_weiouen: ['male', '混沌', 5, ['lg_liangzizhongquan', 'lg_weiouen_zhenwang', 'lg_hundun1', 'lg_hundun', 'lg_yunsui', 'lg_yunsui1'], ['des:— 简介 —<br/> 奥古手下的一名刺客,对气味非常敏感,只愿意亲近自己认为好闻的对象.存在感比较低,值得注意的是,他会在执行任务的时候,突然拆卸装备进行秘密改造.']],
						lg_kelinxide: ['female', '命运', '3/5', ['lg_shalubaochang', 'lg_shengfeishizhui', 'lg_kelinxide_zhenwang', 'lg_xinyan', 'lg_shengfeishizhui1'], ['des:— 简介 —<br/> 克琳希德是尼伯龙根之歌,也即齐格飞传说中的齐格飞的妻子,她在他被暗杀之后立誓复仇,耗尽了一切手段与执念,最终完成了复仇.既是位疯狂的复仇者,也是兼有着冰冷的残忍性质的高贵而惹人怜爱的王妃.<br/><br/> — 背景故事 —<br/> 只要问起尼伯龙根之歌的主人公,举出齐格飞 可谓是理所当然,而在他身死后成为了故事主轴的,却是复仇公主克琳希德.<br/><br/>  极端狡猾而执念深重,一旦结下仇怨就绝不忘记,即使将身边事物一并卷入其中也一定会完成复仇.克琳希德为了丈夫而展开的复仇,尽管实际上花费了二十年有余的时间,但她却从未有一丝一毫放弃的想法.<br/><br/> 被迦勒底召唤的克琳希德,与通常的圣杯战争中的形态相异,因此极为稳健.但一旦面对齐格飞,就会采取古典传统的温文尔雅而又夹枪带棍的态度.<br/><br/>  无视他的存在,列举出的讨厌的东西明显是以他为原型的人格,满怀怨恨地瞪视深爱过的丈夫.<br/><br/> 这是因为,复仇对象哈根在死前,将齐格飞的死正是他自己所期望的一事揭露了出来.为丈夫而发起复仇,但原因正是丈夫,她知晓了这一点,虽说如此却不能自相残杀,只能每日咬牙切齿.<br/><br/>  对御主的认识基本只到魔力供给的罐子这种程度.不过,牵绊加深到一定程度后,会将其认定为加入复仇计划的同志.但是,关系进一步加深后,会突然采取冷眼相待的态度.这似乎是由对把诚实的亲弟弟吉赛尔海尔卷入复仇一事的悔恨之情造成的.<br/><br/>  因为在所爱之人死后才达到全盛期,基本上 处于一种极端的病态之中.<br/><br/>  在特劳姆得到了<反叛人理>这一绝佳的动机的克琳希德使役着一众从者,最早成立了界域.或许是因为这个缘故,获得了复权或是王道都不曾拥有的名为赤空之侵蚀的特殊支援.<br/><br/>  虽然疯狂却又极端理智,绝不原谅叛徒和弱者,成为她的处分对象者都会被她丈夫的魔剑处刑.<br/><br/>  之所以会和迦勒底敌对,当然有御主的原因,但最主要还是因为齐格飞显然是站在守护人理的一边的.虽然成立了界域,却没有发动一气呵成的攻势其原因有二.<br/><br/> 其一是考虑到己方士兵的质量和数量,无论进攻哪一个界域都可以说是一场赌博,而她非常讨厌这种行为.<br/><br/> 她也是一位冷静而思维透彻的指挥官.<br/><br/> 而其二,则是为了完成过去未竟的复仇.毕竟,要保证泛人类史的正常的话,他一定会被召唤来对抗自己.她就是有着这样奇妙的确信.最终,愿望实现了,传说中的复仇公主 与传说中的屠龙者展开了对峙.<br/><br/>  在那无比惨烈的战斗之后,究竟发生了什么？ 已无须赘述.<br/><br/>  她有生以来第一次,后悔着自己的复仇 就此消灭了.<br/><br/>']],
						lg_amier: ['female', '永昼', 4, ['lg_shouhufangzhen', 'lg_shuoguang', 'lg_jinshu', 'lg_amier_zhenwang', 'lg_lunhui'], ['des:— 简介 —<br/> 冷静礼貌的顾问形象,以自己是至高权限而充满自信.无论是处理事件,还是与他人相处都十分精明,精打细算到有点不近人情.']],
						lg_shiqikuangsan: ['female', '异界', 1, ['lg_shiqikuangsan0', 'lg_shiqikuangsan00', 'lg_xuwu', 'lg_shiqikuangsan000', 'lg_yizhidan', 'lg_yizhidan0', 'lg_erzhidan', 'lg_erzhidan1', 'lg_sanzhidan', 'lg_sanzhidan1', 'lg_sizhidan', 'lg_sizhidan1', 'lg_wuzhidan', 'lg_wuzhidan1', 'lg_liuzhidan', 'lg_liuzhidan1', 'lg_qizhidan', 'lg_zhicai', 'lg_qizhidan1', 'lg_bazhidan', 'lg_bazhidan1', 'lg_jiuzhidan', 'lg_jiuzhidan1', 'lg_shizhidan', 'lg_shizhidan1', 'lg_shiyizhidan', 'lg_shiyizhidan1', 'lg_shierzhidan', 'lg_shierzhidan0', 'lg_shiqikuangsan_zhenwang', 'lg_xuwu1', 'lg_jiuzhidan11', 'lg_kekedi', 'lg_shishizhicheng', 'lg_shishizhicheng00'], ['des:— 简介 —<br/> 识别名为(Nightmare)梦魇.<br/><br/> 在偶然现身于人间的众多精灵当中,是能够从邻界以自己的意志现身的特异存在,甚至会有意地去杀人.<br/><br/>  — 背景故事 —<br/> 为了有足够的灵力能让<十二之弹>发动,回到三十年前始源精灵的出现并亲自解决她,而不停地杀人和吸收别人的时间.<br/><br/> 一般会把人类看作是食物,被她击杀的仅是知道的就有一万人以上,可以说是最邪恶的精灵.而且她能将人类拖进自己的影子里,不留形迹地吞噬殆尽,如果把被吞噬者包含在内,恐怕牺牲者的数量还会增加.<br/><br/> 同时,她还能凭自身的意愿引发空间震.虽然崇宫真那曾经成功击杀她,但过了一阵子后又会毫发无伤再度出现,而她就一直在杀人与被杀的轮回中徘徊.自称喜欢杀人也喜欢被杀,但过去的自己曾因士道的话而产生动摇.<br/><br/>']],
						lg_kailan: ['male', '旧始', 5, ['lg_buxiunuhuo', 'lg_xushi', 'lg_zengeqishi', 'lg_kailan_zhenwang'], []],
						lg_huilizi: ['female', '异界', 5, ['lg_chimizhinian', 'lg_zhimingchengfa', 'lg_huilizi_zhenwang'], ['des:— 简介 —<br/> 隶属于暮光流星群,外号破坏狂,眼神阴暗,爱做实验.因不小心闻到自己制作的毒药昏倒在路边被骑士君救起,而把骑士君认为是自己命中注定的人.<br/><br/> — 背景故事 —<br/> 占有欲极强,自称知晓骑士君的一切.比如喜欢的偶像是谁、骑士君犯傻的年纪等……给骑士君织了所有的衣服,还给做给骑士君的食物里下了药.<br/><br/> 不允许任何人,尤其是女人接近骑士君,不然会起杀心.为了霸占骑士君的心,甚至从银行的金库里直接抢钱或者超稀有物品,骑士君不得不把钱全部退回去,而这个超稀有物品则是被骑士君埋藏起来了.<br/><br/> 虽然是个病娇,但其内心也有温柔的一面,比如在遇到迷路的小孩时,如果骑士君采取主动行动的话,惠理子也会展露出纯情娇羞的一面.']],
						lg_leimiliya: ['female', '幻想乡', 4, ['lg_xixueguizhiye1', 'lg_xixueguizhiye', 'lg_mingyun', 'lg_mingyun2', 'lg_feisemingyun', 'lg_leimiliya_zhenwang', 'lg_leimiliya0', 'lg_wuxinposui', 'lg_feisemingjie', 'lg_feisemingjie1', 'lg_feisemingjie2'], ['des:— 简介 —<br/> 拥有操纵命运程度的能力,虽被大部分的妖怪仰慕,但这并不是因为她有着领袖般的魅力,而是对吸血鬼这个种族的畏惧.有一个妹妹,除了这以外,家族的一切都是谜.<br/><br/>  — 背景故事 —<br/> 她像小孩子一样幼稚任性,并且拥有旺盛的好奇心.同时也十分的高傲、傲慢,自认为没有比她更厉害的存在.<br/><br/> 说起在幻想乡已经确认的吸血鬼,那就是住在红魔馆的斯卡蕾特一家.那里的主人就是绯红恶魔.虽然外表年幼,想法幼稚,但实际上她已活了超过五百年,拥有吸血鬼一族令人惊异的身体能力.<br/><br/> 她身高较低,外表看来不满十岁,背后有对比身高还要大的羽翼,光看外型的话显得十分巨大.还有就是态度傲慢.行动小孩子气,拥有惊异的身体能力和无尽的好奇心,是只什么时候爆发也不奇怪的恐怖恶魔.<br/><br/> 她白天在红魔馆睡觉,夜晚则会散步和开宴会,满足累了后就去睡觉.操纵命运的能力就是,她本人有意无意间,际遇周围的不幸命运.搭上一句话,就能令对方生活发生重大变化,似乎有很高概率会遇上珍奇的事情.<br/><br/> 在红魔异变之后,导致了人类之间广为得知红魔馆的存在.幻想乡被深红色的雾所包围,日光无法照到地上,虽是夏天,气温却升不上去的异变.光吸几口这种雾就觉得不舒服,经过数日后,人类们几乎都足不出户.<br/><br/> 结果原来这是蕾米莉亚为了在白天也能活动而夺走日光,动机十分自我而引起的异变.<br/><br/>最后由博丽神社的巫女惩罚了她并解决了这事件.<br/><br/>  好奇心旺盛的她有时会叫人类来参加宴会,有时又会到人类村落里去玩.不过因为她性格幼小,不顺着她的意的话,会有惨事发生的.只能一切听从她的任性吧.<br/><br/> 不光是对人类,对妖怪她也是<无人能比我更优秀>.常常保持着高压态度,对谁都是友好度很低.<br/><br/>']],
						lg_chizui: ['female', '罗德岛', 5, ['lg_jianxinkuxiu1', 'lg_pijingzhanji', 'lg_lvfa1', 'lg_lvfa', 'lg_chizui_zhenwang'], ['des:— 简介 —<br/> 原为叙拉古城邦法官,通过干员德克萨斯与罗德岛建立联系.于后勤部工作,担任罗德岛法律顾问一职.<br/><br/>  — 背景故事 —<br/> 一位很严肃的法官.<br/><br/> 干员斥罪在报到时说自己是为了弥补自己曾经的过失而来,这份过失的具体内容,她描述为自己曾身不由己地做了很多背叛法律正义的事.<br/><br/> 根据我们对叙拉古事件的调查了解,斥罪原本为叙拉古的城邦法官,背后有着贝洛内家族的支持.但与其他有着家族支持的法官不同的是,斥罪并不完全以贝洛内家族的意志判决案件,她也会宣判贝洛内家族成员的罪行.<br/><br/> 这在叙拉古几乎是一件不可能的事,从与干员伺夜并非上下属,更像是姐弟的相处状态来看,贝洛内家或许并不是一个常规意义上的叙拉古家族.不过我们目前对贝洛内家的上任家主并没有过多的认知,只能留待日后与斥罪或是伺夜交流时再多了解一二.<br/><br/> 在斥罪加入罗德岛,进入法务部后,人事部干员有些担心她是否能良好地适应罗德岛的工作内容.毕竟斥罪曾明确展示出法律正义不可侵犯的态度,而罗德岛由于与多个国家和地区有交易往来,时常会涉及一些现有法律的灰色地带.但据人事部干员一段时间的观察,斥罪并没有对罗德岛的一部分业务产生误解,反而能很快地理解我们的真实目的,她也并没有与一些和自己处理业务手段不同的干员产生冲突,而是很有默契地互相帮助.<br/><br/> 或许对于这些从事法律工作的人来说,不论就职后曾不得已地做过什么,现在使用着什么样的手段,他们一开始的理想总是相同的:捍卫法律应存的正义.<br/><br/>  斥罪为我们详细介绍了叙拉古的法律体系.<br/><br/> 在叙拉古,各个家族掌握着分属于他们的移动城市,以此延伸出特殊的司法体系:在这里并没有警察系统,法官作为西西里夫人的意志代言者,负责维护叙拉古的社会治安.<br/><br/> 但实际上,家族总是会处理好很多事情:基于案件中涉及人员所属家族的不同,家族会以不同程度介入法官对于一起案件的宣判.更普遍的情况则是案件其实根本不会被递到法官面前,法官们只会得知一些事件已经被摆平,或是需要他们私下摆平.<br/><br/> 在过去,很多认识她的人在提到拉维妮娅法官,也就是斥罪时,会说她<公正>.这在叙拉古是一个少见的词.<公正>对于一位叙拉古的法官来说,代表这位法官可能会在某一天突然消失,或者失去自己的某一部分肢体,成为提醒其他法官的一个警告.<br/><br/> 斥罪没有这样的结局,不过,她也并不认同自己是<公正的>这一点.<br/><br/> 她告诉我们,自己在贝洛内家的帮助下成为一名法官,在她成为法官之初,贝洛内家的上任家主曾向她许诺过一个理想化的未来,<在那时,我可以真正地推行法律的正义.>贝洛内家族的背景让斥罪似乎有了更多的自由,但她也因此更加痛苦,因为这种来自家族的正义,在斥罪看来,从根本上就是不对的.<br/><br/> 不过,斥罪并不是一个因为沉浸在这类命题中,就让自己和周围人的生活都变得沉闷的人.虽然严以律己,但她从不以自己的标准要求他人,比如伺夜.当然,这主要是因为,他们来自同一个地方,同时,伺夜本人的生活习惯也实在称不上健康,因此,大多数干员对此都表示理解.<br/><br/>  <我们刚刚结束,你不来祝贺一下我吗,拉维妮娅？><br/><br/> <怎么了？><br/><br/> <我一直都很羡慕你有贝洛内家的背景,现在我也有家族支持了.能像你一样得到一个家族的庇护,我处理事情都会变得简单许多.><br/><br/> <最重要的是,有一个靠山的感觉,可真好啊.><br/><br/> <拉维妮娅,我要是你,肯定混不成你现在这个落魄的样子.><br/><br/> <你当法官有几年了？><br/><br/> <你怎么突然问这个？<br/><br/> <两年多吧.><br/><br/> <我今天见到了博尔托洛蒂.><br/><br/> <那是谁？><br/><br/> <一个法官.<br/><br/> <现在是杀手了.他今天被一支箭射穿,死在我面前.><br/><br/> <我只是侥幸活着.><br/><br/> <我可以当作没听见你刚才和我说的这些话><br/><br/> <你觉得这是幸运的吗？有了家族作为靠山真好？作为一个法官,你现在最值得庆祝并炫耀的是,自己有了一个家族的支持？><br/><br/> <不对,我没有资格责怪你.因为博尔托洛蒂死了,他死之前抛弃了自己的理想,却还揣着自己的法官证.而人人都知道拉维妮娅法官背后是贝洛内家族,所以我到现在还安然无恙.><br/><br/> <可是为什么在叙拉古,司法会变成这样？我每天和那些家族的成员们坐在一起,听他们告诉我要做什么,我也绞尽脑汁地想应该怎样去帮助他们把这件事做好,这样对每个人都是好的,因为我这样做了,第二天一切看起来都是无事发生.><br/><br/> <但是我能看到那些普通人看我的眼神越来越恐惧,站得越来越远,他们甚至不敢在宣判过后光明正大地哭,光明正大地来找法官控诉.><br/><br/> <那我到底是在做什么？是在维护法律的公平正义吗？是在维护叙拉古的稳定治安吗？我都没有.所有法官,所有法院,整个叙拉古的司法体系,都在做家族的帮凶.><br/><br/> <曾经怀有理想的人都死了,但我活着,你也活着,我什么都没做到,你在炫耀有了家族作为靠山.><br/><br/> <这就是叙拉古的法律,叙拉古的家族,叙拉古的法官.><br/><br/> <拉维妮娅,你喝醉了.><br/><br/> <我没有喝酒.><br/><br/> <你在说胡话.我要先走了.><br/><br/>  斥罪对新城市怀有很多期待.<br/><br/> 这是她或许能真正意义上地践行正义的一个开端.新城市对很多人有着不同的意义,家族以此为利益争夺的目标,平民似乎无权去在乎自己究竟要活在何处.身为一个法官,她得到了西西里夫人的某种认可,这可能仍然算是站在某种权力的肩膀上推行正义,但这一次她也算是真正地拥有了足够多的自由,也不得不面对更多她之前没来得及去想的事:<br/><br/> 当叙拉古的所有人都习惯于法院服务家族时,她身为一名法官,应该做什么？<br/><br/> 从出生到学习再到成为一名法官,即便她认为这一套司法体系有着太多不合理的地方,但在叙拉古长大的她也并没有亲身体会、接受过其他国家的法律系统,她希望叙拉古不再受家族限制,但离开了家族的叙拉古司法系统,还剩下什么？<br/><br/> 而面对这样一座新的城市,即使她与伺夜他们有着志同道合的人一起努力,事情也并非如理想那般轻易.相比于摧毁一套系统,新建一套总是难得多,更何况,他们也并没能做到真正地让叙拉古脱离开家族的控制,那么,他们怎样建立新的秩序？<br/><br/> 仅仅是一名法官,斥罪明白自己并没有那么大的能力,新秩序的建立也并非一件简单的事,她这几年所学和所经历的完全不足以支撑她去建立出一套新的、能让人们接受的司法体系.在这个时候,斥罪忽然觉得自己好像理解了老贝纳尔多一直以来的行为:一个没有家族的叙拉古对于老贝纳尔多来说是一个疯狂的理想,一座拥有真正正义的新城市对自己来说也是一个疯狂的理想,老贝纳尔多为此献出了生命,她能做到哪一步呢？<br/><br/> 在一次醉酒之后,斥罪少见地和博士主动提起了贝洛内家的上任家主——老贝纳尔多.在斥罪的描述里,那是一个她好像很了解,但又好像从来没了解过的男人,明明给了她希望,却在最后也没选择信任她,她现在只能看着他留下来的那个希望,并为此付出自己的下半生将它实现,却不能有和他一起看到这个希望成真的那一天.<br/><br/> <我恨他,但是,我有多恨他,我就有多>在一些含糊不清的话语中,斥罪最终这么说,博士把她送回了宿舍.<br/><br/>']],
						lg_naxida: ['female', '提瓦特', '2/4', ['lg_xingxiang', 'lg_caoyuansu', 'lg_xueshi', 'lg_suowenbianji', 'lg_xinjinghuancheng', 'lg_naxida_zhenwang'], ['des:— 简介 —<br/> <尘世七执政>中的草神,被须弥人给予<小吉祥草王>的爱称.现今七神中最年轻的一位,自诞生起已五百年.深居于净善宫内,向来不受重视,也很少被人提及.她身负重任,哪怕目睹漆黑,经历孤独,也不曾停下脚步.<br/><br/>  — 背景故事 —<br/> <大慈树王>创造了须弥雨林,又通过教令院将智慧赐予国民.即便她与世长辞,其美名也仍在家喻户晓的故事中传唱.<br/><br/> 而在神陨之后被贤者们迎回净善宫的<小吉祥草王>,更像是一种符号化的象征,以此昭示神明的庇佑并未从这片土地上消失.可她究竟是谁,如何降生,又具备怎样的权能,知晓答案之人少之又少.<br/><br/> 城中至贤对<小吉祥草王>闪烁其词,民众逐渐从回避的态度中读出了答案,不再奢望神明的智慧凭空降下.<br/><br/> <虚空>一如既往高效又便捷,那也是<大慈树王>遗留的神迹,可人们不知道的是,如今<虚空>也成为了新诞神明的耳与目.她利用<虚空>遍历了人们的喜怒哀乐,当然也知晓他们对旧神的崇拜与新神的失望,与诸如<智慧之神已经不复存在>的评价.<br/><br/> 她深知自己必须不断学习,尽快成长,才能面对来自世界最深处的威胁,这是她无法回避的使命.不被理解也好,不被重视也好,纳西妲对此并无意见.<br/><br/>  学习与成长的过程是快乐的,有关这个世界的知识总能满足纳西妲旺盛的好奇心.她逐渐掌握了自然与元素的法则,也理解了天空与大海的生态,她甚至可以融会贯通,创造出情理之中又意料之外的美丽梦境.<br/><br/> 这种梦境本质上和她擅长的奇妙比喻是相同的,都会令人恍然大悟,理解两件原本毫不相关的事之间的相似点.不过她也会有冥思苦想不得其解的时候,这种情况往往出现在和人类与社会有关的事件上.<br/><br/> 比如在坦白真相就能免除惩罚的时候,有人会选择沉默与谎言;在与真爱之人相处的时候,有人却常常吐出刀刃般的暴言.仿佛整个世界的矛盾都聚焦并展现在人类这种生物身上,他们的感情变化令纳西妲捉摸不透.<br/><br/> 奇妙比喻在此时也失效了,就算放眼世界也无法找到另一个能作为参照的混沌系统.她只能解释为每个人的特殊性各不相同,这种特殊性令他们在面对相似情感时也会有千差万别的反应.<br/><br/> 但这并不能让她满意.想要了解人类,只借助冰冷的知识与教条是不够的.<br/><br/> 也许就是从此刻起,纳西妲理解了<她>为何要坚定不移地站在人类一方,哪怕做出莫大的牺牲.<br/><br/> <他们>每个人都是这世上独一无二的存在.<br/><br/>  纳西妲的生活或许有点千篇一律,可她拥有整个须弥最梦幻与活泼的梦境.<br/><br/> 白天利用<虚空>掌握的知识,都会在夜晚的梦中被活灵活现地演绎出来.随着她掌握的知识量不断增加,梦境也变得越来越精致热闹. 这不仅能够让她精神放松,也让她有机会检查刚刚学到的知识是否符合常识,又是否还有所遗漏.<br/><br/> 第一次梦到瞑彩鸟的时候,它们保持着站在树桩上的姿势翱翔天际,而且并不张开翅膀. 这幅光景怎么看都有些怪异,确实很快引起了纳西妲的注意.她借此理解了翅膀的作用,随后不久,瞑彩鸟就自然地在梦境中展翅飞舞了.<br/><br/> 接下来,她又用相似的方法修复了在水底睡觉的蕈猪,长在苹果树上的白萝卜,以及翅膀颜色不一致的晶蝶.<br/><br/> 知识不只被用于合理化世间万物,也可以用来满足极富童趣的玩乐需求.按理来说,蕈猪只能行走在地面上,但既然知道了翅膀的作用,那长了翅膀的蕈猪不就也能在天上飞翔吗？<br/><br/> 既然蕈猪能飞,那鳄鱼也可以双足行走,香辛果也能和人交流.纳西妲构建知识体系的方式,间接为她架构起了一座不被打扰的小小乐园.在梦中,她无比幸福.<br/><br/>  孩童们见识尚不充分,又容易被情绪左右,但这不意味着他们可以不被尊重,或是被肆意嘲笑愚弄.<br/><br/> 挫折与失落固然能让他们品尝到现实的滋味,却也会让他们失去纯真的想法与炽热的情感. 不幸遭遇到这类事情的孩子,往往会在某个平常的夜里听到一缕温柔之声.<br/><br/> 她认真倾听孩子的倾诉,也会用奇妙比喻为孩子阐明道理,还会陪他们做游戏,聊喜欢的游戏与点心,直到天明.<br/><br/> 一夜的陪伴虽然短暂,但孩子们会因此相信世上仍存在着可以理解他们的人.仇恨与对抗心在暖流中融化.他们变得有机会邂逅生活的转机,变得自信与快乐.<br/><br/> 然而,没有一个孩子说得出梦中的声音是谁.即便人们知晓<大慈树王>之威名,无比伟大的她毕竟也已与世长辞.<br/><br/> 几个小孩子悄悄聚在一起,讨论这神奇的现象.突然,某位看上去懂得很多的孩子提到了<小吉祥草王>这个有些生僻的名字.<br/><br/> 大家很快就接受了这样的说法,当然,没有哪位家长相信他们.<br/><br/> 可那有什么关系？<小吉祥草王>已经是他们的朋友了.<br/><br/>  负责须弥城绿植规划的工作人员,曾经收到过一封神秘信件,署名是<热心而且很闲的普通须弥城市民>.<br/><br/> 信里写满了详实的建议,规划也十分周全,既考虑到风雨日照等各类影响,又兼顾了实用需求.从信件的专业程度就可判断,这是出自某位不愿透露姓名的生论派著名学者之手.<br/><br/> 虽然不知道他为何匿名,但工作人员就像是收到了上级命令那样,完全按照信中规划将设计在须弥城复现出来.<br/><br/> 这次设计收获了很高的评价.后来某一天,当纳西妲借凯瑟琳的身体来到街道上,她欣喜地发现,绿植的摆放跟她预想的一模一样.信是纳西妲写的,她觉得知识固然重要,但实践也不可或缺.<br/><br/> 可是贤者的管理实在太过严格,在纳西妲软磨硬泡之下,他们才答应纳西妲匿名发出这封看上去并没有什么用的信件.但对纳西妲来说,初次实践大获成功,她备受鼓舞,走起路来都充满自信,仿佛随时都要飘到天上.<br/><br/> 然而在走到下一个拐角时,纳西妲就注意到意料之外的几朵颜色完全不搭的花被栽到一起. 她仔细确认,发现是自己没有考虑到其中一种花变色的可能性,也没有严格规定栽培的环境.<br/><br/> 又想到这盆植物可能已经在这里放了好几十天,人人都目睹了她<毫无美感>的布置.那天,有好多人都自称看到了平时总是自信微笑地站在柜台后的凯瑟琳小姐,蹲在一盆花旁边双手捂脸,害羞到满脸通红.<br/><br/>  要怎么样才能完全消除<禁忌知识>对世界树的威胁呢？<br/><br/> 纳西妲曾以为自己是这个问题的解答者,却没想到她同时也是<答案>本身.<br/><br/> 由一个人做出的事,必定会留下那个人的痕迹.而当那个人想要消除自己的时候,一切就会连接成悖论.所以,就算要达成这个目标,也必须经他人之手.<br/><br/> 当纳西妲完全理解这一切,时间已经所剩无几,她来不及思考,常年累积的学识竟也丝毫未能支撑她想出解决眼前困境的办法.<br/><br/> 但就像<████>说的那样,作为智者,应该为探寻到答案而高兴.<br/><br/> 她并不只是为了做残酷的事情而诞生.唯有<禁忌知识>被彻底解决,她才能放眼须弥的未来,真正去展望独属于这片国度的美好图景.<br/><br/> 一个即将走向未来的国度是否能记得一个不复存在的名字？已经不重要了.<br/><br/> <已经不重要了吗？><br/><br/> 纳西妲一定会提出不同的意见.只可惜时间过于短暂,在那擦肩的一瞬,<████>连反驳的机会都没有留给她.<br/><br/>']],
						lg_bachongshenzi: ['female', '提瓦特', '2/4', ['lg_shenlizhiyuyin', 'lg_shashengying', 'lg_lunhui', 'lg_tianhuxianzhen', 'lg_mifa', 'lg_bachongshenzi_zhenwang'], ['des:— 简介 —<br/> 有着多重身份的神秘宫司,凡人们或许永远无法了解她的真面目与真心.<br/><br/>  — 背景故事 —<br/> 掌管鸣神大社的大巫女、白辰血脉的继承者、<永恒>的眷属与友人.以及,轻小说出版社<八重堂>的恐怖总编……<br/><br/>  细究起来,八重神子的头衔竟与她的性情同样难测多变.<br/><br/>  出于各种目的试图搞清神子<真面目>的人,可以从天领奉行府一路排到<八重堂>门口,然而迄今为止,成功者依旧寥寥.<br/><br/>  毕竟神子从未刻意掩饰什么.千面百变,不过是兴之所至,随心所欲罢了.没有谜面的谜语,本就不成立.<br/><br/>  只需记得,她永远是那位<兼具智慧与美貌的八重神子大人>就好.<br/><br/>  八重堂的几位编辑曾向总编大人推荐过一份原稿.该作品文笔瑰丽,构思精巧,选题也恰是时下流行的恋爱轻喜剧.<br/><br/>  如此璞玉,只需稍加打磨,配上精致插画,一定能大卖特卖吧？编辑们没想到的是,八重神子看过后并未露出欣喜之色,而是深深叹气,将各大责编都叫了过来.<br/><br/>  责编犹豫地问:<八重大人,虽说是我建议他写这个题材的,可这不是现在最热门的类型吗？><br/><br/>  面对责编疑惑的眼神,神子直接说出了自己的意见:一本本该新奇却被题材处处束缚了的轻小说,一言以蔽之,<不够自由>.<br/><br/>  所谓的畅销题材、类型化作品……不过是每十年轮换一次的潮流罢了.投时代所好是种捷径,但如果一部作品本就有不被时潮淹没的素质,又何必随波逐流？<br/><br/>  <替我传话给这位新人作者,就说无需顾虑题材类型,只要认真对待笔下的故事就好.><br/><br/>  投稿作者听闻此事,若有所悟,便停笔闭门苦思.数月后,一份崭新的原稿送到了神子与责编面前.责编一时哑然,就连向来百无禁忌的八重神子也难得微蹙起了眉头:<br/><br/>  <嗯……怎么办呢……确实不太妙.><br/><br/>  <是啊!就算再怎么不用顾虑题材,转生成为雷电将军也太离谱了吧!><br/><br/>  <题材？题材当然没有问题了.但是……他的笔名太普通,怎么看都配不上这本书吧.><br/><br/>  <关注点原来在这里吗……不……不过您开心就好.><br/><br/>  不久后,本书作者便以总编提议的超长笔名<勘解由小路健三郎>堂堂出道.至于总编大人灵机一动开展<转生成为八重宫司>的征文活动,又是后话了.<br/><br/>  身为宫司最大的不便之处,在于每次神社祭典都必须盛装出席,坐守社殿.夜幕中烟花璀璨绽放,神社内外人声鼎沸,如此大会,自己却要全程带着庄重的笑容端坐在神社内.<br/><br/>  这种灾难,比油豆腐从世上彻底消失还要可怕.雷神的眷属寿命较长,转眼便是百年.漫长岁月里,无聊才是最难抵御的敌人.如果哪天连自己也习惯了枯坐终日,顽固如朽木,世间岂不是少了一个善于发现乐趣与机会的聪明人？<br/><br/>  所以,隔三岔五为自己寻些乐子,绝对是极为合理又有必要的事.哪怕为此小小利用一下宫司的职权,也是无可厚非的吧？<br/><br/>  祭典当夜,看着面前社奉行特意送来的长野原特制烟花,八重宫司满意地点头.那晚的祭典仪式一如既往,礼制周全,规行矩步.<br/><br/>  <宫司大人>彻夜正襟危坐的端丽身影,令无数巫女心生敬仰.<br/><br/>  她静静坐在流星般美丽的光之雨下,观察着祭典上往来的人们.被烟花响声掩盖住的,是一句从嚼着苹果糖的牙缝中挤出来的低语.<br/><br/>  <要我当宫司的时候,你可从没说过以后祭典只能溜出来看啊.><br/><br/>  追求趣味,寻找快乐,是神子的日常原则.<br/><br/>  对爱研究人类的她而言,<立场>与<德行>之类的评判指标,都要远远排在<有趣>后面.<br/><br/>  无论是信仰有别的大巫女,还是阵营敌对的大将,都能成为神子青眼相加的对象.虽然,这份欣赏有时也会化作一些无伤大雅的麻烦.<br/><br/>  比起兢兢业业的下属和葵藿倾阳的晚辈,神子在神社中最感兴趣的,是一位名叫鹿野奈奈的巫女.神子的小说同好,鹿野奈奈,每天都为照顾好早柚苦恼万分.<br/><br/>  神子躺在屋内,时而看见早柚从窗口一闪而过,不用多久,鹿野奈奈匆忙又愤怒的脚步声就会跟着到来.这种关系就像闪电和雷雨,令神子倍感趣味,偶尔还会特意指条错路,让热闹的场面多持续一会儿.<br/><br/>  更有一次,早柚特意为神子帮自己争取午睡时间向她致谢,并告诉神子,午后的阳光最为惬意.或许是受此鼓舞,不久后一个阳光大好的日子,神子摇身一变,化形为普通稻妻女子下山过了一整天.<br/><br/>  町街的<秋沙钱汤>、花见坂的<木南料亭>、街边的<小仓屋>……每一家都未错过,每一次体验都让她高兴.<br/><br/>  到了傍晚,更是去<万端珊瑚侦探社>委托了一起路上听说的小动物失踪案.<br/><br/>  <哎呀呀,您是没见过,那些失主呜呜哭得好可怜哪.两位侦探还请想想办法,帮帮他们吧!><br/><br/>  做完这些,女子走在街上,忍不住愉快地微笑起来.以这种身份参与到稻妻的日常生活中,实在是一件乐事.如果擦肩而过的九条裟罗面上能不露出怀疑之色,就更好了.<br/><br/>  只是有些对不起<秋沙钱汤>的老板.异国风情的温泉虽好,泡完却不小心掉了些狐狸毛.<br/><br/>  很久很久以前,人类在讲起妖怪们的故事时,还不需要用<很久很久以前>来作前缀.<br/><br/>  天狗横越长空,鬼众驰骋沙场;狸妖见于阡陌,狐仙行走人间.在鸣神的大纛之下,妖众以不思议的力量,助人类度过刀耕火种,筚路蓝缕的时期.依山作险,傍海筑城,至此稻妻始成.<br/><br/>  妖中尤以<白辰狐王一脉>最为尊贵,代有大妖出世,在人间留下无数逸话.众妖偶尔聚坐对饮之时,也少不了各自吹嘘,最近自己又成就了一段新的传说.<br/><br/>  酒后所言,难免与真相有出入,却也无妖计较,只求个有趣好听.久而久之,即成<百物语大会>.<br/><br/>  其时常见有乐斋举杯高谈,引得众妖无不侧耳神往,连设宴的狐斋宫也不禁阖眸微笑.尚是幼狐身形的神子,却总是攀在狐斋宫肩头,不依不饶地挑拣着有乐斋故事中的漏洞.<br/><br/>  有乐斋毕竟是冰雪聪明的雅士,一捻胡子便圆好了说辞.不过神子也总能抓出新的纰漏,如此往复,直到斋宫大人笑着劝二位打住:听众们都急着要听下一段了.<br/><br/>  酒过三巡,故事也讲过数轮.席间已醉得无妖能组织出完整的章句.众妖便干脆免了言语争锋,各使妖力腾空而起,看谁能遮天蔽月,拔得头筹.<br/><br/>  是为<无月之夜,百鬼夜行>.<br/><br/>  尔来五百岁,当年的小狐狸也已修成通天彻地的大妖.昔年曾与之共饮的妖众,则匿迹于战争与历史之中,存世的血脉也日渐稀薄.<br/><br/>  从此<百鬼夜行>,终于成了<很久很久以前>的传说.<br/><br/>  稻妻刀剑自古闻名天下,<雷电五传>的杰作更是国之重器.<br/><br/>  然而,仅过去短短数年,五支传承竟已折损大半.汹涌暗流牵扯了无数权贵,涉事世家大族均遭到问责贬谪.就连执掌社奉行的神里家,也因督导下属不力而备受牵连.将军降下最终裁决之前,久未涉足政事的宫司大人突然向将军进言,赶在风雨飘摇之际保下了神里家.<br/><br/>  由此,神里家虽元气大伤,却终是免去罢黜之虞.随后数年,外界对宫司此举多有猜测:<br/><br/>  一说社奉行与鸣神大社关系密切,此行是为了在扶植忠诚于自身的代言者.<br/><br/>  然而,鸣神大社本就自成一派,更未见宫司平日有意涉政.帮助社奉行,收益小于付出,未必是明智之举.<br/><br/>  一说宫司怀疑事有蹊跷,如今受牵连者甚广,社奉行若再生变故,恐令稻妻大局不稳.<br/><br/>  此话乍看有理,细想却站不住脚.需知,豪门起落只是人间再平常不过的戏码.即便神里失势,社奉行也会有新当家.<br/><br/>  又有一说,神子在风波初定之后,曾与当时的神里家家主进行过密谈.<br/><br/>  但年迈重伤的神里家主已如风中残烛,又有什么能力左右大局？<br/><br/>  至此,坊间种种猜测均无结果.神子所想所为,皆没有答案.人们不知道的是,神子当日给出的嘱咐,如同家族规章一般留在了神里府中.<br/><br/>  <神里家能从此次事件中幸存,还是将军宽容.从今往后,切莫忘了将军的恩典.><br/><br/>  这句话成为了因缘之种,预示着社奉行未来的位置.他日,若风暴降临稻妻,即便与另两家奉行针锋相对,社奉行神里家也要牢记恩惠,恪守<将军>的永恒之道.<br/><br/>  棋盘上,宫司走出了无憾的一着.<br/><br/>']],
						lg_geshibeizhai: ['female', '命运', 5, ['lg_pomochenghua', 'lg_pomochenghua1', 'lg_fuyue', 'lg_fuyue0', 'lg_geshibeizhai_zhenwang', 'lg_weizhuang'], ['hiddenSkill', 'des:— 简介 —<br/> 你说我看上去实在不像北斋？很抱歉我长得那么娇小可爱,如果你想了解个中缘由,就来加入我的故事吧!<br/><br/>  — 背景故事 —<br/> 江户时代后期的浮世绘画师.<br/><br/> 除了<葛饰北斋>以外,还拥有<画狂老人>、<宗理>等三十多个雅号.是日本的代表性画家,对梵高与德彪西等海外画家、音乐家也产生了深远的影响.<br/><br/> 以绘画速度超群而著称,其一生留下了三万件作品.内容涵盖了浮世绘的版画、肉笔画、漫画、春画等多种类型.<br/><br/> 晚年以三女儿<葛饰应为>为助手,并与她一起生活.代表作是连作<富岳三十六景>、<北斋漫画>、妖怪绘<百物语>、春画<蛸与海女>等.<br/><br/> 一生一共搬家了九十三次,丝毫不在意钱财, 以至于一贫如洗,举止怪异引人注目,是个出了名的怪人.据说外出时口中常常念着咒语.<br/><br/> 性格与众不同的北斋.不局限于一种流派, 热心学习各种画师技法的同时,也充满了进取心.吸收了西洋画的透视,将可以说是现代漫画原点的截取动态瞬间的表现运用在风景画之中.<br/><br/> 如果北斋显现于这个现代,脱离幕府严格的监管,获得自由的话,一定会欣喜若狂地学习各种技巧,并充满干劲地发起挑战吧.无论对象是春画、抽象画、还是数码画或行为艺术.<br/><br/>  只要锲而不舍地坚持绘画,终有一日能成就真正的画工.<br/><br/> 那便是北斋毕生的夙愿.<br/><br/> 然而,自虚空而来的观测者、伪神,那梦中得见的深渊中的邪神,盯上了这样的北斋,与之发生了通信.甚至企图藉由那份罕有的感知性实现降临.<br/><br/> 但北斋拒绝了邪神的诱惑,他通过将雅号转让给女儿<应为>,从而总算是避免了被单方面利用的劫难.残留有为人的感性的<葛饰应为>的人格.<br/><br/> 以及,身为<以此身供邪神降临,进而踏及神之领域>的降临者的<北斋>.从者<葛饰北斋>,就是同时持有这两个人格的,与疯狂只有一线之隔的暧昧存在.<br/><br/>']],
						lg_jiantongying: ['female', '降临', '4/5', ['lg_xushuhuan', 'lg_xushu', 'lg_xushumoshu', 'lg_xushumoshu1', 'lg_moshuxishou2', 'lg_zhenwang_jiantongying'], ['des:— 简介 —<br/> 穗群原学园一年级学生,在同年级之中是出名的美人.由于一些难忘的经历对前辈卫宫士郎抱有好感,名义上为间桐慎二之妹,实则是远坂家远坂时臣的女儿,远坂凛的妹妹.<br/><br/>第五次圣杯战争Rider美杜莎的真正召唤者,间桐家魔术的继承者.象征平稳的日常的女主角,但是在她身上也有着不为人知的秘密.<br/><br/>  — 背景故事 —<br/> 为了能更接近地观察士郎开始学习弓道,射箭的水平在同年级之中无人能及.四年前作为慎二的妹妹与士郎初次相识时,性格阴暗沉闷,有用头发遮住脸的习惯.<br/><br/>  樱在教室里里非常阴沉,无论长得多漂亮,体型多危险意味深长,也是被男孩子疏远、被女孩子敬而远之吧.<br/><br/> 士郎因慎二的缘故而辞掉社团活动,以向他道歉为契机,开始帮卫宫家做家事,并向士郎学习烹饪.由原本甚至不知道什么是色拉油的人成长为烹饪高手,制作西式菜肴的水平超过了身为师傅的士郎,制作日式菜肴的水平和士郎不相上下.同时由于藤村大河的影响,性格变得开朗起来,但只会在亲近的人面前露出笑容.<br/><br/> 其实从中学生的时候起就认识士郎,抱着显浅易懂的好意,不过士郎并没有察觉.在士郎面前总是充满笑容.身材原本十分瘦弱,最近则变得成熟性感.在士郎的伤好得连伤疤都没有的时候,依然每日早晚来到卫宫家,很勤快地为他打扫房间和做饭.<br/><br/>  间桐樱的本名是远坂樱,是远坂凛的亲妹妹,比凛小一岁.和凛一样拥有很高的魔术资质和很少见的架空元素,虚数的属性,因魔术师家族的魔术刻印一般只能传给一个继承者所继承,所以较年长的凛便成为远坂家的继承人.<br/><br/> 另一方面,间桐家由于水土不服,血统之中的魔术回路逐渐断绝,间桐脏砚向远坂家家主远坂时臣要求过继一个拥有魔术回路的人当继承人以延续后代.为了不浪费樱的魔术回路,同时也为了履行间桐和远坂两家的盟约,第四次圣杯战争之前一年,樱和凛的父亲远坂时臣将樱过继给了间桐家成为义女.<br/><br/>  但樱的虚数属性和间桐家的魔术并不相合,因此在樱五岁时过继给间桐家的第一天开始,间桐脏砚就强行对樱的身体进行改造,在其体内植入大量的刻印虫.那一种可以向术者传送寄主生命力的下级使魔,开始了对樱的凌辱与虐待.<br/><br/> 间桐脏砚这样说道:<br/><br/> <头三天还能不时地哭和叫唤,第四天开始已经连声都发出不来了.今天早上把她放进了虫仓里,本来只想试试她能呆多久,没想到被虫子蹂躏了半天,现在还有气在,看来远坂家这块料子真是令人爱不释手.><br/><br/> 最终<现在改姓间桐的小樱也已经完全变成了和雁夜所认识的小樱完全不同的少女.像人偶一样空虚昏暗的目光.那双眼睛里喜怒哀乐的感情,在这一年来从来没有见过.曾经跟在姐姐凛后面像小狗一样嬉戏的天真无邪的少女面容,早已经荡然无存.><br/><br/>  由于技术的不成熟和脏砚刻意的安排,樱不得不忍受从肉体到精神的巨大的痛苦,同时被没有魔术回路的义兄慎二投以近乎嫉妒的感情,受到了大大小小的讥诮、长达多年的暴行,甚至遭其性侵.<br/><br/> 虽然间桐樱体内有刻印虫的存在,但由刻印虫变化出来的魔术刻印在普通时候是停止的,对间桐樱毫无影响.只有当刻印虫被人为激发后,间桐樱才会变的渴求魔力.慎二的精液并不包含魔力,因此他对樱的暴行单纯只是虐待罢了.<br/><br/> 初中和士郎也是同一所学校,升上初中的第一年,在操场上看到跳高的士郎,被其那种明知跳不过去却依然一遍又一遍地挑战的执着所感动,产生了好感.在士郎受伤之后,被脏砚以道歉为名派去监视士郎,得以接近憧憬的学长.在卫宫家度过的日常对间桐樱来说就像一场迟早会醒的梦,即使心动,也不敢奢望能开花结果.<br/><br/>  士郎得知慎二是御主之后,为了保护樱,让樱搬入了卫宫家.在两人相处的过程之中,士郎慢慢发现了自己对樱的感情,樱也对士郎说出了自己的爱意.<br/><br/> 一面喜欢着士郎,另一面害怕自己不光彩的过去被其所知,同时隐约嫉妒着自己的姐姐凛,受到现实和理想巨大的反差的折磨,成为内心的弱点.<br/><br/>  对士郎又嫉又恨的慎二挟持了樱,命令士郎一个人赶去学校,HF线之中,被慎二劫持时,被强迫戴上藏有媚药的耳饰,由于媚药的效果会使感觉变敏感 ,使用的话会惊醒处于睡眠状态的刻印虫,令身体产生过度反应而失控.在那里慎二命令Rider和士郎对打,试图将士郎置于死地.<br/><br/> Rider在战斗之中放水,士郎和赶来的凛、Archer也因此救出了樱,慎二逃跑时,让樱的耳环洒出了媚药,刺激了她体内的刻印虫,众人也因此得知了樱才是间桐家真正的Master,以及樱的身体在过去十一年之中所遭受到的凌辱和性虐待.<br/><br/> 樱通过用魔术攻击自己来停止暴走,被送去教会治疗.当士郎跟凛为是否要杀掉樱争执时,在后堂听到一切的樱打碎窗户逃跑,后来被士郎找到,士郎向樱许诺只当她一人的正义伙伴.<br/><br/>  因为身体被改造为伪圣杯,在吸收英灵的过程之中,樱做为人的机能逐渐丧失,同时污染圣杯的<此世全部之恶(安哥拉曼纽)>也影响着樱,让她在夜晚睡着之后以梦游的形式,出外袭击路人.<br/><br/> 因为身为黑圣杯的缘故,和身为正统圣杯的伊莉雅就本质上来说是相克的,因而双方关系极差,但伊莉雅也亲口说过,樱无论从哪个方面来说都是她喜欢的类型.<br/><br/> 樱在樱路线以外都不会以<黑圣杯>的身份完全成长.被士郎这个<不想失去的人>所选上时,郁积至今的负面感情决堤,促使了<此世全部之恶(安哥拉曼纽)的成长.><br/><br/>  梦游时将来杀她的吉尔伽美什吞噬.<br/><br/> 因无法控制吉尔伽美什,同时害怕如果不赶快把他消化的话会被咬破,所以马上把他变换成了魔力.由于吞进了这设想之外的巨大魔力,一直勉强地保住自我的樱就像决堤一样坏掉了.<br/><br/> 樱决定回到间桐宅了结一切,可刚回家就遇到慎二.在慎二再次侵犯她并威胁要将两人之间的肉体关系告知卫宫士郎的时候,失手击杀了慎二,之后在脏砚的挑动和圣杯之内的黑泥污染之下黑化.对杀人一事樱的内心毫无波动,只觉得很开心,与梦中的杀人魔形象重合,于是认为自己从一开始就是疯狂的,不再压抑,接受<此世全部之恶(安哥拉曼纽)>的力量彻底黑化.<br/><br/> 黑化后受脏砚命令到卫宫宅抓走伊莉雅,在士郎跟言峰绮礼合作救出伊莉雅后出现并破坏绮礼的黑泥心脏,但由于士郎刚好击杀黑Berserker,绮礼趁黑樱回收Berserker灵魂痛苦之际逃脱.<br/><br/> 晚上又出现在卫宫宅,告诉凛只要士郎在冬木市她就会忍耐不让<此世全部之恶(安哥拉曼纽)>出生,但不知还能撑多久,所以要凛带士郎远远离开,这样她才能安心跟<此世全部之恶(安哥拉曼纽)>厮杀,但被凛拒绝.<br/><br/> 在柳洞寺地下的大圣杯前,黑樱突然背叛脏砚,将哈桑·萨巴赫(真Assassin)击杀,并将寄生在心脏的脏砚本体挖出捏死.<br/><br/> 圣杯已接近完成,<此世全部之恶(安哥拉曼纽)>快要降临.<br/><br/> 随后士郎和凛、Rider赶往柳洞寺地下,最终在士郎的努力下成功救出了樱.<br/><br/>']],
						lg_jiantongying1: ['female', '降临', 5, ['lg_beicanmingyun', 'lg_cishizhie', 'lg_cishizhie1', 'lg_jiantongying1_zhenwang'], ['des:— 简介 —<br/> 穗群原学园一年级学生,在同年级之中是出名的美人.由于一些难忘的经历对前辈卫宫士郎抱有好感,名义上为间桐慎二之妹,实则是远坂家远坂时臣的女儿,远坂凛的妹妹.<br/><br/>第五次圣杯战争Rider美杜莎的真正召唤者,间桐家魔术的继承者.象征平稳的日常的女主角,但是在她身上也有着不为人知的秘密.<br/><br/>  — 背景故事 —<br/> 为了能更接近地观察士郎开始学习弓道,射箭的水平在同年级之中无人能及.四年前作为慎二的妹妹与士郎初次相识时,性格阴暗沉闷,有用头发遮住脸的习惯.<br/><br/>  樱在教室里里非常阴沉,无论长得多漂亮,体型多危险意味深长,也是被男孩子疏远、被女孩子敬而远之吧.<br/><br/> 士郎因慎二的缘故而辞掉社团活动,以向他道歉为契机,开始帮卫宫家做家事,并向士郎学习烹饪.由原本甚至不知道什么是色拉油的人成长为烹饪高手,制作西式菜肴的水平超过了身为师傅的士郎,制作日式菜肴的水平和士郎不相上下.同时由于藤村大河的影响,性格变得开朗起来,但只会在亲近的人面前露出笑容.<br/><br/> 其实从中学生的时候起就认识士郎,抱着显浅易懂的好意,不过士郎并没有察觉.在士郎面前总是充满笑容.身材原本十分瘦弱,最近则变得成熟性感.在士郎的伤好得连伤疤都没有的时候,依然每日早晚来到卫宫家,很勤快地为他打扫房间和做饭.<br/><br/>  间桐樱的本名是远坂樱,是远坂凛的亲妹妹,比凛小一岁.和凛一样拥有很高的魔术资质和很少见的架空元素,虚数的属性,因魔术师家族的魔术刻印一般只能传给一个继承者所继承,所以较年长的凛便成为远坂家的继承人.<br/><br/> 另一方面,间桐家由于水土不服,血统之中的魔术回路逐渐断绝,间桐脏砚向远坂家家主远坂时臣要求过继一个拥有魔术回路的人当继承人以延续后代.为了不浪费樱的魔术回路,同时也为了履行间桐和远坂两家的盟约,第四次圣杯战争之前一年,樱和凛的父亲远坂时臣将樱过继给了间桐家成为义女.<br/><br/>  但樱的虚数属性和间桐家的魔术并不相合,因此在樱五岁时过继给间桐家的第一天开始,间桐脏砚就强行对樱的身体进行改造,在其体内植入大量的刻印虫.那一种可以向术者传送寄主生命力的下级使魔,开始了对樱的凌辱与虐待.<br/><br/> 间桐脏砚这样说道:<br/><br/> <头三天还能不时地哭和叫唤,第四天开始已经连声都发出不来了.今天早上把她放进了虫仓里,本来只想试试她能呆多久,没想到被虫子蹂躏了半天,现在还有气在,看来远坂家这块料子真是令人爱不释手.><br/><br/> 最终<现在改姓间桐的小樱也已经完全变成了和雁夜所认识的小樱完全不同的少女.像人偶一样空虚昏暗的目光.那双眼睛里喜怒哀乐的感情,在这一年来从来没有见过.曾经跟在姐姐凛后面像小狗一样嬉戏的天真无邪的少女面容,早已经荡然无存.><br/><br/>  由于技术的不成熟和脏砚刻意的安排,樱不得不忍受从肉体到精神的巨大的痛苦,同时被没有魔术回路的义兄慎二投以近乎嫉妒的感情,受到了大大小小的讥诮、长达多年的暴行,甚至遭其性侵.<br/><br/> 虽然间桐樱体内有刻印虫的存在,但由刻印虫变化出来的魔术刻印在普通时候是停止的,对间桐樱毫无影响.只有当刻印虫被人为激发后,间桐樱才会变的渴求魔力.慎二的精液并不包含魔力,因此他对樱的暴行单纯只是虐待罢了.<br/><br/> 初中和士郎也是同一所学校,升上初中的第一年,在操场上看到跳高的士郎,被其那种明知跳不过去却依然一遍又一遍地挑战的执着所感动,产生了好感.在士郎受伤之后,被脏砚以道歉为名派去监视士郎,得以接近憧憬的学长.在卫宫家度过的日常对间桐樱来说就像一场迟早会醒的梦,即使心动,也不敢奢望能开花结果.<br/><br/>  士郎得知慎二是御主之后,为了保护樱,让樱搬入了卫宫家.在两人相处的过程之中,士郎慢慢发现了自己对樱的感情,樱也对士郎说出了自己的爱意.<br/><br/> 一面喜欢着士郎,另一面害怕自己不光彩的过去被其所知,同时隐约嫉妒着自己的姐姐凛,受到现实和理想巨大的反差的折磨,成为内心的弱点.<br/><br/>  对士郎又嫉又恨的慎二挟持了樱,命令士郎一个人赶去学校,HF线之中,被慎二劫持时,被强迫戴上藏有媚药的耳饰,由于媚药的效果会使感觉变敏感 ,使用的话会惊醒处于睡眠状态的刻印虫,令身体产生过度反应而失控.在那里慎二命令Rider和士郎对打,试图将士郎置于死地.<br/><br/> Rider在战斗之中放水,士郎和赶来的凛、Archer也因此救出了樱,慎二逃跑时,让樱的耳环洒出了媚药,刺激了她体内的刻印虫,众人也因此得知了樱才是间桐家真正的Master,以及樱的身体在过去十一年之中所遭受到的凌辱和性虐待.<br/><br/> 樱通过用魔术攻击自己来停止暴走,被送去教会治疗.当士郎跟凛为是否要杀掉樱争执时,在后堂听到一切的樱打碎窗户逃跑,后来被士郎找到,士郎向樱许诺只当她一人的正义伙伴.<br/><br/>  因为身体被改造为伪圣杯,在吸收英灵的过程之中,樱做为人的机能逐渐丧失,同时污染圣杯的<此世全部之恶(安哥拉曼纽)>也影响着樱,让她在夜晚睡着之后以梦游的形式,出外袭击路人.<br/><br/> 因为身为黑圣杯的缘故,和身为正统圣杯的伊莉雅就本质上来说是相克的,因而双方关系极差,但伊莉雅也亲口说过,樱无论从哪个方面来说都是她喜欢的类型.<br/><br/> 樱在樱路线以外都不会以<黑圣杯>的身份完全成长.被士郎这个<不想失去的人>所选上时,郁积至今的负面感情决堤,促使了<此世全部之恶(安哥拉曼纽)的成长.><br/><br/>  梦游时将来杀她的吉尔伽美什吞噬.<br/><br/> 因无法控制吉尔伽美什,同时害怕如果不赶快把他消化的话会被咬破,所以马上把他变换成了魔力.由于吞进了这设想之外的巨大魔力,一直勉强地保住自我的樱就像决堤一样坏掉了.<br/><br/> 樱决定回到间桐宅了结一切,可刚回家就遇到慎二.在慎二再次侵犯她并威胁要将两人之间的肉体关系告知卫宫士郎的时候,失手击杀了慎二,之后在脏砚的挑动和圣杯之内的黑泥污染之下黑化.对杀人一事樱的内心毫无波动,只觉得很开心,与梦中的杀人魔形象重合,于是认为自己从一开始就是疯狂的,不再压抑,接受<此世全部之恶(安哥拉曼纽)>的力量彻底黑化.<br/><br/> 黑化后受脏砚命令到卫宫宅抓走伊莉雅,在士郎跟言峰绮礼合作救出伊莉雅后出现并破坏绮礼的黑泥心脏,但由于士郎刚好击杀黑Berserker,绮礼趁黑樱回收Berserker灵魂痛苦之际逃脱.<br/><br/> 晚上又出现在卫宫宅,告诉凛只要士郎在冬木市她就会忍耐不让<此世全部之恶(安哥拉曼纽)>出生,但不知还能撑多久,所以要凛带士郎远远离开,这样她才能安心跟<此世全部之恶(安哥拉曼纽)>厮杀,但被凛拒绝.<br/><br/> 在柳洞寺地下的大圣杯前,黑樱突然背叛脏砚,将哈桑·萨巴赫(真Assassin)击杀,并将寄生在心脏的脏砚本体挖出捏死.<br/><br/> 圣杯已接近完成,<此世全部之恶(安哥拉曼纽)>快要降临.<br/><br/> 随后士郎和凛、Rider赶往柳洞寺地下,最终在士郎的努力下成功救出了樱.<br/><br/>']],
						lg_shinaikong: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_jinxingqu0', 'lg_xuancaizhixu', 'lg_shensuitiankong', 'lg_shinaikong_zhenwang'], ['des:— 简介 —<br/> 时乃空,以虚拟偶像的身份开始YouTuber活动的17岁高中生.所属事务所是cover旗下的hololive,所属专辑公司是Victor Entertainment.2017年9月7日开始活动,2017年12月12日正式作为VTuber出道.']],
						lg_lalaiye: ['female', '混沌', 4, ['lg_shimeng', 'lg_zuimian', 'lg_canhuncaozong', 'lg_lalaiye_zhenwang', 'lg_hundun1', 'lg_hundun'], ['des:— 简介 —<br/> 平日神出鬼没,难以捉摸,对任何事物都保持着充足的好奇心.虽然总是挂着温和的笑容,但是言行很少在乎他人的感受,或许本质是个很狂妄的家伙.<br/><br/>']],
						lg_guxing: ['male', '混沌', '4/7', ['lg_xiemozhizhui', 'lg_nixi', 'lg_pannizhe', 'lg_guxing_zhenwang', 'lg_hundun1', 'lg_hundun'], ['des:— 简介 —<br/> 很少有败绩,对于自己的君王身份十分自豪,如果有人触犯会动怒,在长久的胜利之后必将加冕为王.<br/><br/>']],
						lg_peikelimu: ['female', '异界', 4, ['lg_huangshi', 'lg_huangshizhanji', 'lg_fantuanshijian', 'lg_gongzhutuxi', 'lg_zhuanjing', 'lg_peikelimu_zhenwang'], ['des:— 简介 —<br/> 公会<美食殿堂>的创建者,是个肚子非常容易饿,充满活力的少女.<br/><br/> — 背景故事 —<br/> 本名尤丝蒂亚娜·冯·阿斯特莱亚.<br/><br/> 大胃王,兴趣是做饭吃饭,可以把一盘堆得像小山似的炒饭全部吃完并且还能继续吃其他食物.只要是能吃的东西,就算是魔兽也能吃给你看.<br/><br/> 故事最初,其公主的身份被霸瞳皇帝用技术手段夺走,同时遭到了霸瞳皇帝在阿斯特莱亚全国通缉以灭口.<br/><br/> 为了避免自己被霸瞳皇帝抓到后牵连他人隐瞒了自己的真实姓名四处流浪,流浪途中饿昏.之后被骑士与可可萝遇到,惊叹于其食量的可可萝为其起了<肚子空空的佩可莉姆>这一外号.后为了能吃到东西创建了<美食殿堂>公会,但登记的时候需要委派骑士代为登记而不是亲自去.<br/><br/> 由于喜欢四处旅行事实是为了躲避霸瞳皇帝的追捕所以很缺钱,只能在餐饮店打工,实际上还是为了能方便地吃到东西.<br/><br/> 不过最终还是打败了霸瞳皇帝,夺回了名字与王国,现以夺回的兰德索尔王女身份居住于兰德索尔王宫.<br/><br/>']],
						lg_jiantongying2: ['female', '降临', 2, ['lg_heiying', 'lg_heiying1', 'lg_xushi', 'lg_molitunshi', 'lg_duoluo', 'lg_jiantongying2_nei', 'lg_jiantongying2_zhenwang'], ['des:— 简介 —<br/> 穗群原学园一年级学生,在同年级之中是出名的美人.由于一些难忘的经历对前辈卫宫士郎抱有好感,名义上为间桐慎二之妹,实则是远坂家远坂时臣的女儿,远坂凛的妹妹.<br/><br/>第五次圣杯战争Rider美杜莎的真正召唤者,间桐家魔术的继承者.象征平稳的日常的女主角,但是在她身上也有着不为人知的秘密.<br/><br/>  — 背景故事 —<br/> 为了能更接近地观察士郎开始学习弓道,射箭的水平在同年级之中无人能及.四年前作为慎二的妹妹与士郎初次相识时,性格阴暗沉闷,有用头发遮住脸的习惯.<br/><br/>  樱在教室里里非常阴沉,无论长得多漂亮,体型多危险意味深长,也是被男孩子疏远、被女孩子敬而远之吧.<br/><br/> 士郎因慎二的缘故而辞掉社团活动,以向他道歉为契机,开始帮卫宫家做家事,并向士郎学习烹饪.由原本甚至不知道什么是色拉油的人成长为烹饪高手,制作西式菜肴的水平超过了身为师傅的士郎,制作日式菜肴的水平和士郎不相上下.同时由于藤村大河的影响,性格变得开朗起来,但只会在亲近的人面前露出笑容.<br/><br/> 其实从中学生的时候起就认识士郎,抱着显浅易懂的好意,不过士郎并没有察觉.在士郎面前总是充满笑容.身材原本十分瘦弱,最近则变得成熟性感.在士郎的伤好得连伤疤都没有的时候,依然每日早晚来到卫宫家,很勤快地为他打扫房间和做饭.<br/><br/>  间桐樱的本名是远坂樱,是远坂凛的亲妹妹,比凛小一岁.和凛一样拥有很高的魔术资质和很少见的架空元素,虚数的属性,因魔术师家族的魔术刻印一般只能传给一个继承者所继承,所以较年长的凛便成为远坂家的继承人.<br/><br/> 另一方面,间桐家由于水土不服,血统之中的魔术回路逐渐断绝,间桐脏砚向远坂家家主远坂时臣要求过继一个拥有魔术回路的人当继承人以延续后代.为了不浪费樱的魔术回路,同时也为了履行间桐和远坂两家的盟约,第四次圣杯战争之前一年,樱和凛的父亲远坂时臣将樱过继给了间桐家成为义女.<br/><br/>  但樱的虚数属性和间桐家的魔术并不相合,因此在樱五岁时过继给间桐家的第一天开始,间桐脏砚就强行对樱的身体进行改造,在其体内植入大量的刻印虫.那一种可以向术者传送寄主生命力的下级使魔,开始了对樱的凌辱与虐待.<br/><br/> 间桐脏砚这样说道:<br/><br/> <头三天还能不时地哭和叫唤,第四天开始已经连声都发出不来了.今天早上把她放进了虫仓里,本来只想试试她能呆多久,没想到被虫子蹂躏了半天,现在还有气在,看来远坂家这块料子真是令人爱不释手.><br/><br/> 最终<现在改姓间桐的小樱也已经完全变成了和雁夜所认识的小樱完全不同的少女.像人偶一样空虚昏暗的目光.那双眼睛里喜怒哀乐的感情,在这一年来从来没有见过.曾经跟在姐姐凛后面像小狗一样嬉戏的天真无邪的少女面容,早已经荡然无存.><br/><br/>  由于技术的不成熟和脏砚刻意的安排,樱不得不忍受从肉体到精神的巨大的痛苦,同时被没有魔术回路的义兄慎二投以近乎嫉妒的感情,受到了大大小小的讥诮、长达多年的暴行,甚至遭其性侵.<br/><br/> 虽然间桐樱体内有刻印虫的存在,但由刻印虫变化出来的魔术刻印在普通时候是停止的,对间桐樱毫无影响.只有当刻印虫被人为激发后,间桐樱才会变的渴求魔力.慎二的精液并不包含魔力,因此他对樱的暴行单纯只是虐待罢了.<br/><br/> 初中和士郎也是同一所学校,升上初中的第一年,在操场上看到跳高的士郎,被其那种明知跳不过去却依然一遍又一遍地挑战的执着所感动,产生了好感.在士郎受伤之后,被脏砚以道歉为名派去监视士郎,得以接近憧憬的学长.在卫宫家度过的日常对间桐樱来说就像一场迟早会醒的梦,即使心动,也不敢奢望能开花结果.<br/><br/>  士郎得知慎二是御主之后,为了保护樱,让樱搬入了卫宫家.在两人相处的过程之中,士郎慢慢发现了自己对樱的感情,樱也对士郎说出了自己的爱意.<br/><br/> 一面喜欢着士郎,另一面害怕自己不光彩的过去被其所知,同时隐约嫉妒着自己的姐姐凛,受到现实和理想巨大的反差的折磨,成为内心的弱点.<br/><br/>  对士郎又嫉又恨的慎二挟持了樱,命令士郎一个人赶去学校,HF线之中,被慎二劫持时,被强迫戴上藏有媚药的耳饰,由于媚药的效果会使感觉变敏感 ,使用的话会惊醒处于睡眠状态的刻印虫,令身体产生过度反应而失控.在那里慎二命令Rider和士郎对打,试图将士郎置于死地.<br/><br/> Rider在战斗之中放水,士郎和赶来的凛、Archer也因此救出了樱,慎二逃跑时,让樱的耳环洒出了媚药,刺激了她体内的刻印虫,众人也因此得知了樱才是间桐家真正的Master,以及樱的身体在过去十一年之中所遭受到的凌辱和性虐待.<br/><br/> 樱通过用魔术攻击自己来停止暴走,被送去教会治疗.当士郎跟凛为是否要杀掉樱争执时,在后堂听到一切的樱打碎窗户逃跑,后来被士郎找到,士郎向樱许诺只当她一人的正义伙伴.<br/><br/>  因为身体被改造为伪圣杯,在吸收英灵的过程之中,樱做为人的机能逐渐丧失,同时污染圣杯的<此世全部之恶(安哥拉曼纽)>也影响着樱,让她在夜晚睡着之后以梦游的形式,出外袭击路人.<br/><br/> 因为身为黑圣杯的缘故,和身为正统圣杯的伊莉雅就本质上来说是相克的,因而双方关系极差,但伊莉雅也亲口说过,樱无论从哪个方面来说都是她喜欢的类型.<br/><br/> 樱在樱路线以外都不会以<黑圣杯>的身份完全成长.被士郎这个<不想失去的人>所选上时,郁积至今的负面感情决堤,促使了<此世全部之恶(安哥拉曼纽)的成长.><br/><br/>  梦游时将来杀她的吉尔伽美什吞噬.<br/><br/> 因无法控制吉尔伽美什,同时害怕如果不赶快把他消化的话会被咬破,所以马上把他变换成了魔力.由于吞进了这设想之外的巨大魔力,一直勉强地保住自我的樱就像决堤一样坏掉了.<br/><br/> 樱决定回到间桐宅了结一切,可刚回家就遇到慎二.在慎二再次侵犯她并威胁要将两人之间的肉体关系告知卫宫士郎的时候,失手击杀了慎二,之后在脏砚的挑动和圣杯之内的黑泥污染之下黑化.对杀人一事樱的内心毫无波动,只觉得很开心,与梦中的杀人魔形象重合,于是认为自己从一开始就是疯狂的,不再压抑,接受<此世全部之恶(安哥拉曼纽)>的力量彻底黑化.<br/><br/> 黑化后受脏砚命令到卫宫宅抓走伊莉雅,在士郎跟言峰绮礼合作救出伊莉雅后出现并破坏绮礼的黑泥心脏,但由于士郎刚好击杀黑Berserker,绮礼趁黑樱回收Berserker灵魂痛苦之际逃脱.<br/><br/> 晚上又出现在卫宫宅,告诉凛只要士郎在冬木市她就会忍耐不让<此世全部之恶(安哥拉曼纽)>出生,但不知还能撑多久,所以要凛带士郎远远离开,这样她才能安心跟<此世全部之恶(安哥拉曼纽)>厮杀,但被凛拒绝.<br/><br/> 在柳洞寺地下的大圣杯前,黑樱突然背叛脏砚,将哈桑·萨巴赫(真Assassin)击杀,并将寄生在心脏的脏砚本体挖出捏死.<br/><br/> 圣杯已接近完成,<此世全部之恶(安哥拉曼纽)>快要降临.<br/><br/> 随后士郎和凛、Rider赶往柳洞寺地下,最终在士郎的努力下成功救出了樱.<br/><br/>']],
						lg_jielika: ['female', '旧始', '4/5', ['lg_yuwen', 'lg_menghuanzhiyu', 'lg_jielika_zhenwang'], []],
						lg_shixiang: ['female', '异界', 5, ['lg_aoshagong', 'lg_cuican', 'lg_zuihouzhijian', 'lg_shixiang_zhenwang'], ['des:— 简介 —<br/> 识别名为(Princess)公主.<br/><br/>  与迷团般的大爆炸一并现身在士道面前的精灵少女,拥有一头及膝的黑色长发与水晶般不可思议色彩的眼睛.士道对她的第一印象,就是那可以被称为暴力一般的美丽.<br/><br/>  没有包含名字在内和自己相关的一切记忆,在第二次与士道相遇后,希望士道为她命名,士道基于两人第一次见面的日子而命名为<十香> .<br/><br/>  — 背景故事 —<br/> 由于每次出现都遭到人类攻击,使她对人类充满恐惧与敌意,一见到人就会攻击,但在与士道相遇后逐渐改变她对人的观感,变得非常喜爱人类的世界.<br/><br/> 个性纯真可爱,天然呆,食量惊人,缺乏日常生活知识,如孩童般的对所有事物都充满好奇.<br/><br/> 在精灵力量被士道封印后经过拉塔托斯克假造户口后以转校生的身份转入他的班级,并暂时住进五河家中,之后搬进拉塔托斯克建于五河家旁的特殊公寓.与折纸因各种缘由非常不和,对她总以全名称呼,每天都跟她围绕着士道争吵.<br/><br/> 说话为古风且较为独特,其次被封印后,依旧能够通过自身意识召唤出灵装和天使.在士道和其他女孩子亲密时会吃醋暴走,得知士道行动的真意后会宣布支持士道.<br/><br/> 经常会说出一些令别人误解的话,使得士道遭到别人异样的目光.']],
						lg_fuermosi: ['male', '命运', 2, ['lg_xiansuo', 'lg_baliushu', 'lg_jiashetuilun', 'lg_zhenxiangjielu', 'lg_shushouwuce', 'lg_fuermosi_zhenwang', 'lg_xushi'], ['des:— 简介 —<br/> 世界上最优秀,也是唯一的顾问侦探.<br/><br/> 侦探这个概念的结晶,<揭露者>的代表. 十九至二十世纪亚瑟·柯南·道尔爵士所著小说的主人公,是能解开各种谜题的侦探,也是后世众多推理小说中登场的<侦探>的始祖之一.<br/><br/> 他受到了如此评价,而实际究竟如何呢？<br/><br/>  — 背景故事 —<br/> 说起英灵福尔摩斯的形象,并非模仿了他传说中的原型约瑟夫·贝尔、道尔博士或是世界上第一个侦探维多克,而是作为一系列小说作品中的主人公现界.<br/><br/>  夏洛克·福尔摩斯的故事究竟是柯南·道尔爵士创作的虚构作品,是约翰·H·华生医生将实际存在的福尔摩斯经历记录下来的传记故事,还是两者折中的产物呢？<br/><br/> 至少福尔摩斯本人很清楚才对,但他本人闭口不言,一旦提及这个话题,每次都被他轻描淡写地蒙混过关.<br/><br/>  哪怕面对的谜题是真正无法究明的存在,也必定会<产生>抵达真实的线索或途径.<br/><br/> 比如说,哪怕有个失去了钥匙的宝箱,也能让钥匙变得<没有失去>,钥匙会变得必然能在世界的某地被找到.<br/><br/> 假如他真的是从故事中产生的存在,那可能不仅限于道尔的小说,还包括了其他模仿作品.<br/><br/> 既深思熟虑,又有行动力,大胆而缜密,同时又是个冷静沉着的男人.<br/><br/> 无论什么谜题、犯罪、还是阴谋,都无法逃脱福尔摩斯的眼睛.不管是什么可怕的杀人犯、古老的诅咒、暗夜中的怪物、还是超国家规模的组织,他都能揭开真相.有必要则打倒,用名为真实的锋利之剑.<br/><br/> 他的生活方式已然超越了人的领域,甚至可以说是<贤明之人>、<揭露者>的具现化.<br/><br/>']],
						lg_chongtianzongsi: ['female', '命运', 4, ['lg_bingruo', 'lg_juedao', 'lg_xinyan', 'lg_wumingsanduantu', 'lg_chongtianzongsi_zhenwang'], ['des:— 简介 —<br/> 以幕末的京都为中心活动的治安组织,新选组的一番队队长,冲田总司.作为剑客集团也同样为人所恐惧的新选组中,冲田是被誉为最强的天才剑士.<br/><br/>  — 背景故事 —<br/> 身穿时髦和服,十五岁左右,惹人怜爱的少女.由于原来的衣服过于醒目,所以平时都穿这套和服.<br/><br/> 同时具备冷酷杀人者的一面,以及开朗而喜欢小孩子的一面.<br/><br/> 她是具备超绝妙技巧与天赋之才的真正天才剑士,但作为Saber职阶而言,耐久力、对魔力之低显得十分突兀.这是生前的疾病加上后世民众对她的印象所致,结果在某种意义上她也受到了和无辜的怪物相近的诅咒.<br/><br/> 三段突的瞬间,壹之突、贰之突、叁之突<同时存在>于<相同的位置>.就算防住了壹之突,还是会被处于相同位置的,贰之突、叁之突所刺穿,这种矛盾使剑尖产生事象饱和.<br/><br/> 因此三段突在事实上成了无法防御的剑技. 而作为应用,由结果而生的事象饱和也很擅长对物破坏.<br/><br/> 向圣杯许下的愿望是<能战斗到最后一刻>.<br/><br/> 这是她生前想要实现却未能实现的悲愿.<br/><br/> 成为英灵之后也对未能与同伴们一起战斗感到懊悔,觉得自己不配当一名新选组的队员.<br/><br/>']],
						lg_bayunzi: ['female', '幻想乡', 1, ['lg_yuxia', 'lg_mengjingyuxianshi', 'lg_guangmingyuheian', 'lg_xushi', 'lg_jiejie', 'lg_zhiqiuyuquqiu', 'lg_zhiqiuyuquqiu1', 'lg_huanxiang', 'lg_bayunzi_zhenwang', 'lg_bayunzi0', 'lg_boyuli', 'lg_boyuli2', 'lg_boyuli1'], ['hiddenSkill', 'des:— 简介 —<br/> 拥有操纵界线的能力,和历代博丽巫女一同维护着博丽大结界.性格一言以蔽之就是非常可疑,虽然看上去与人类相貌无异,但是行动原理却完全不同,常人很难理解她在想什么.<br/><br/>  — 背景故事 —<br/> 幻想乡的贤者之一,是在幻想乡中,静静栖息在最边境的妖怪.从这里,边看着博丽大结界边生活着.她那与起源相关的能力十分危险,此外,她的行踪神出鬼没,个性缺乏人情,行为原理也和人类大相径庭,因此根本没有人敢对付她.<br/><br/> 要说最像妖怪的妖怪,就必须要提到八云紫的名字.这个妖怪,由于其危险的与根源相关的能力、神出鬼没而性格不近人情、行为原理与人类完全相异等等的原因,是一个没人愿意与她为敌的妖怪.<br/><br/> 外表和人类没有区别.喜欢华丽的衣服、撑着一把大阳伞.<br/><br/> 主要活动时间是夜晚、白天睡觉.是个典型的妖怪.另外,尽管都说冬天一直在冬眠,因为只是其本人所谈及而且实际在何处居住无法确认,所以真伪的程度无法确定.<br/><br/> 古时候,幻想乡缘起阿一所著的妖怪录中也有着这种相似的妖怪登场,据说以与那个时代相符合的装束举止出现.<br/><br/> 幻想乡本身透过一个巨大结界与外界隔离,这个结界就是区分内部与外部的界线.<br/><br/> 不过外面的世界和幻想乡,在物理上依然具有地缘相连的关系,因此可以说,这个结界所区隔的境界从理论上创造了幻想乡这个场所.换句话说,单是境界妖怪的存在,就有可能创造类似幻想乡的场所,甚至也能破坏.她的存在对于幻想乡的形成,有极为重要的关系.<br/><br/> 操纵境界的能力是能够从根源开始颠覆一切事物的恐怖的能力.众所周知,物的存在是建立在境界的存在之上的.没有水面的话,湖是不存在的.没有山脊的话,山和天空也是不存在的吧.没有幻想乡的大结界的话,幻想乡也不会存在.如果全部物的境界都不存在的话,那世界将会是一个巨大的整体吧.<br/><br/> 也就是说,操纵境界的能力是逻辑的创造与破坏的能力.从本质上创造新的存在,从本质上否定已有的存在.妖怪所持有的能力中能够与神之力相匹敌的、最危险的能力之一.<br/><br/> 还有,也能通过空间的裂缝从任何地方瞬间移动,或身体的一部分移动到别的场所.据说不仅仅是物理的空间,也能够在画中和梦中、故事中等移动.<br/><br/> 另外,还拥有超人的头脑,尤其是数学很强.而且,因为活了很久的缘故,知识和经验都很丰富.<br/><br/> 她本人意外地健谈,告诉别人各种各样的关于自己和幻想乡相关的事情.只是,哪一个都没有被确认过,实际上都是没有办法去确认,所以真假无从判断.<br/><br/> 住所是和博丽神社一样,据说是建在幻想乡和外边的世界的境界之处,但没有人见过那个建筑物.因为利用空间的断开处,从不知何处出现并从消失去了无法得知的地方.没法从后面追赶,真伪的程度无从判定.<br/><br/> 另外,平时自己行动地很少,而是操纵妖兽作为式神,杂事全部都由这匹妖兽来做.特别是在白天和冬天,睡觉的时候这个式神会代替紫来行动.<br/><br/> 还有就是,同样寿命很长的妖怪朋友也有很多.住在冥界的西行寺幽幽子、鬼族的伊吹萃香等,大部分的朋友都是最强一类的妖怪.<br/><br/> 再次证实了幻想乡自身,是依靠大结界与外界相隔离.这个结界也是分开内外境界线.<br/><br/> 只是,外面的世界和幻想乡在地理上是接续的,所以可以说是结界的境界从逻辑上面创造了幻想乡这个地方.<br/><br/> 也就是说,只要境界之妖怪还存在,要创造或破坏幻想乡这样的地方都是可能的.被境界所环绕的幻想乡里,有着不知道居住在何处的境界之妖怪的存在,可以说是和幻想乡的成立有极重要的关系.<br/><br/> 不可思议的是,这个妖怪很少袭击人类.因为不袭击人的妖怪不算是妖怪,可能还是在某个地方有袭击过人的吧.<br/><br/> 由于能够自由地前往外面的世界,那个地方说不定就是外面的世界了吧.有传言说是外面的世界的妖怪会到幻想乡来游玩,冬季与昼间等、据说是在睡觉的时候,可能就是在外面的世界度过的也说不定,也有的说法是紫的梦中世界就是外面的世界.<br/><br/>']],
						lg_nailin: ['female', '次元', 4, ['lg_xuniouxiang', 'lg_zuishengzhimeng', 'lg_shehua', 'lg_nailin_zhenwang'], []],
						lg_zhelinai: ['female', '时之岸', 4, ['lg_qiangzhiqingjie', 'lg_chenmoji', 'lg_wuyu', 'lg_miyu', 'lg_zhelinai_zhenwang', 'lg_miyu1'], []],
						lg_qiunai: ['female', '异界', 5, ['lg_zhuorelinghun', 'lg_gaoguihongyan', 'lg_qiunai_zhenwang'], ['des:— 简介 —<br/> 出身于阿斯特雷亚大陆最有名的商人世家,因受到父亲的话语的影响而想要成为一个独当一面的商人.<br/><br/> — 背景故事 —<br/> 平常习惯了大小姐的生活,为了能成为独当一面的商人而以庶民购物的方式进行社会实践,但每次都因为太过兴奋,以及脱离常识的金钱观,搞得店里的其他人很困扰.<br/><br/> 比如买桌布时因为忘了家中的桌子尺寸,而打算买下店中所有布匹;亦或是不知道哪种水果更好吃,而打算每个都尝一遍.<br/><br/>  路痴,毫无方向感,为了克服这个缺陷特意来到森林里进行特训,结果直到太阳下山也没走出森林.然而两人实际上是在一个公园的树林里打转了半天,而这个公园从一边走到另一边只需要十五分钟<br/><br/>  现实中的秋乃也是家里的大小姐,不过却意外地很擅长打棒球.同时也是个想到什么就做什么,行动力出色的<行动派>.但是也会做出一些乱来的行为,比如请骑士做她的观光向导,而骑士当天刚好有课,便搭乘直升机来到椿丘高校上空迎接骑士,并且动用家族权力,让学校停了下午的课,最后骑士君把她打发走才平息下来.<br/><br/> 拜其所赐,骑士君在放学后被校长叫去校长室了.之后还是担任学生会长的好友咲恋把事情压下来的……<br/><br/>']],
						lg_helage: ['male', '罗德岛', '3/4', ['lg_xinyue', 'lg_xianyue', 'lg_manyue', 'lg_helage_zhenwang'], ['des:— 简介 —<br/> 赫拉格,曾隶属于乌萨斯帝国近卫军,切尔诺伯格感染者地下诊所<阿撒兹勒>的现任管理者,其他相关履历缺失.拥有成熟的军事理论体系知识,战斗技巧几乎能满足绝大部分类型作战的需求.现正依合作协议长驻罗德岛,为罗德岛提供战术指挥支援.<br/><br/>  — 背景故事 —<br/> 不知道从什么时候开始,罗德岛的干员们开始用<将军>称呼赫拉格.虽然赫拉格本人从未向他人透露过身份,但乌萨斯的感染者地下社群向来将他奉为传奇,这令所有干员都对那些传闻或多或少地感兴趣.<br/><br/> 当然,作为阿撒兹勒的感染者,就像赫拉格本人所说,他更擅长的是让诊所得以延续,而不是发展它的医疗技术、影响力和规模.<br/><br/> 事实上,赫拉格确实保证了阿撒兹勒的地位.在许多年里,阿撒兹勒一直是切尔诺伯格感染者的重要支柱,本地的感染者大多对阿撒兹勒的付出心怀感激.<br/><br/> 但独善其身的准则并不能在时局最激荡的时刻保护这个诊所,毕竟他们实在是太有影响力了,无论是继续保持中立还是倒向另外一边,阿撒兹勒都将会对任何一方势力造成或有形或无形的压力.<br/><br/> 倒不如说,能够从切尔诺伯格事件中全身而退,这本身就证明了赫拉格的高瞻远瞩.只是赫拉格对诊所被摧毁一事的来龙去脉似乎有着自己的看法,但他声称在找到决定性的证据之前,不会透露更多内容.<br/><br/> 至少现在赫拉格依然对阿撒兹勒的一切守口如瓶,如果真想问些阿撒兹勒的情报,问其他成员可能会来得快些.<br/><br/>  赫拉格对乌萨斯当局抱有强烈的敌意.这种敌意一部分来自他对诊所的保护欲,另一部分则无从可知.<br/><br/> 只是,虽然赫拉格不是一个失败主义者,也多次对在乌萨斯地区的行动展现出了相当强硬的态度.<br/><br/> 但当他分析乌萨斯的军事实力时,他却表示,<任何一个政治实体都不应该和乌萨斯发生正面冲突.即使它的腐败和狂怒一定会摧毁它,它依然是这片大地上最恐怖的东西.><br/><br/> 从这个角度来说,赫拉格作为感染者,对于许多情势的考虑也许远比其他感染者来的沉重. 决策层干员都对局势有自己的考量,也都对罗德岛在整个事件中的实际境遇心知肚明.赫拉格与乌萨斯的关系也许会令少数人感到疑惑,但与会干员们已经在战略会议中了解了赫拉格的真实用意.<br/><br/>  赫拉格的言语间并无矛盾,他认为,只要身为感染者,就已经是站在乌萨斯的对立面.<br/><br/>  <只是,一旦乌萨斯真的注视你,你才会知道与乌萨斯为敌和乌萨斯与你为敌的区别.><br/><br/>  虽然将军没有明说他的姓名,但我也一样猜得到他以前的身份.<br/><br/> 青年时在四皇会战中崭露头角,壮年时在第十次乌卡战争里声名远扬,之后的数次大战里同样屡立战功,这样的乌萨斯军人并不多见.而在血峰战役里明明立下军功却销声匿迹,综上所述,也就只有一位乌萨斯将领符合这种条件.<br/><br/> 至于是怎么推断的,那当然是猜的!乌萨斯数十年里至少处决了上百个将领,活下来的屈指可数,点点名册就知道了吧!<br/><br/> 如果是过去,我和凯尔希都会非常反对这次合作.但时局不同了,就连■■■■都觉得事情在慢慢变得棘手.<br/><br/> 凯尔希认为在切尔诺伯格事件后,乌萨斯当局一定会作出疯狂的反扑,这理当通过乌萨斯的感染者社群来妥善处理.<br/><br/> 我的想法就比较简单,阿撒兹勒埋得那么深,罗德岛挖走他们乌萨斯也不会有什么意见的,反正他们又不很熟.手上的牌当然是越多越好了,这又不是比谁先把手牌打完.华法琳也很馋阿撒兹勒的技术,哎,就当我做个人情好了.<br/><br/> 但博士完全不肯给我看赫拉格给他的著述,可恶,看一眼有什么问题,这个仇我记下了!<br/><br/>  不过将军他究竟在想什么呢？或者说,究竟是什么还在支撑着他？<br/><br/> 自血峰战役之后,贵族和新政客不断借机削除军方势力,赫拉格能活过审判已经非常幸运,当然,这可能是他从不参政的好处,但想想看,无论是议会还是军队都不会满足现状,他们肯定会有下一步的动作.<br/><br/> 阿撒兹勒的事情他也从来不肯过多透露,其中秘密也许和他实际的经历一样骇人.凯尔希是知道的,赫拉格可不是阿撒兹勒的首任管理者.<br/><br/> 这事儿还没完.他的经历,他的国家,他在乎的事情,总会抓着他往下拖.到时候究竟要不要拉他一把,也许已经不是我们能决定的事情了.<br/><br/>']],
						lg_fengdi: ['female', '罗德岛', 5, ['lg_gaoxiaochongji', 'lg_bitanglianfa', 'lg_fengdi_zhenwang'], ['des:— 简介 —<br/> 维多利亚皇家近卫学校毕业,在维多利亚军队中服役满三年后,退役并经由陈警司介绍加入罗德岛.<br/><br/> 接受过系统训练的职业军人,经过一段时间的磨合,在罗德岛的各类任务中体现出了专业的战斗技巧与战术素养.<br/><br/>  — 背景故事 —<br/> 来自维多利亚的活泼女孩.<br/><br/> 被干员评价为相当自来熟,几乎会下意识地关心别人的好邻家女孩,在进入罗德岛后迅速和大部分干员形成了良好的关系.<br/><br/> 在生活态度方面,往好听说是不拘小节,往不好听说就是粗枝大叶,第一眼很难将她与军人那种严肃的形象联系起来.至少在生活上,她军人的那一面并没有很多地展现出来.<br/><br/> 曾与陈警司一同就读维多利亚皇家近卫学校,据本人描述,在学生时代两人就结下了深厚友谊.陈警司听到风笛的名字就会叹气,不过从她愿意担保风笛小姐的身份来看,两人私交是不会差到哪里去的.<br/><br/>  当然,虽然给人的感觉是邻居家的阳光女孩,但风笛小姐确实是在维多利亚服役过的正规军人,并且还是十分优秀的军人.<br/><br/> 皇家近卫学校对学生的培养是多方向的.不同于其它体制的军事训练,维多利亚皇家近卫学校有着自己的教育方针:三种培养方向中,卫官大多在毕业后担任王室、贵族与各类要人的侍卫,军官则一般会出任军队的高级指挥,士官则一般担任军队的中坚战地领袖和突破发起人.<br/><br/> 作为毕业士官,风笛小姐无疑具备优秀的军事才能.<br/><br/> 事实上,干员与普通军人的培养,在实施层面上是有差异的.<br/><br/> 干员更强调个体以及小队作战,在干员的培养中,重要的是因材施教,是最大化个人的特长.正如罗德岛上充满个性的干员们一样,干员需要最大程度发挥自己的特殊性,依靠少数精锐力量去配合完成针对性目标.<br/><br/> 军人则更强调集体,在军人的培养中,需要的是全面发展、标准化和可替代性,军队会依照职能而非个人做出决策,保证队伍的稳定与高效.<br/><br/> 一名合格的军人在综合作战能力的全面性,必然要高于一个合格的干员.但事实上,两者其实并不构成比较,因为从一开始,干员这份职业就并不适用于战争,更应当极力避免战争. 所以,风笛小姐并不能直接成为干员榜样来指导普通干员进行学习,事实上,早在杜宾教官、职业士兵坚雷和耀骑士临光等人加入罗德岛的时候,虽然她们很快适应了情况,但在最开始,她们所受的军事化训练依然令他们表现出不少与罗德岛作战方针相悖的部分.<br/><br/> 但是,完美的成绩通过军事训练测试,作为前线部队的一员参与过战争的风笛,切实地向罗德岛展现了一名现役优秀军人应有的样貌,这对一些认为自己能够抗衡军队,或者单纯对军队缺乏认识的干员来说,应当会是一记小小的警钟.<br/><br/> 虽然她的破城矛已经去除了射弹功能,也依然是恐怖的战争军械,请别用生命去尝试.<br/><br/> 另外,值得一提的是,或许是天性开朗的原因,又或者是皇家近卫学校的杰出教育名副其实,风笛小姐并没有经历从军人到干员的适应期,她迅速进入了干员的角色.<br/><br/> 作为干员,她具备士兵的韧性和纪律;作为士兵,她具备干员的机动与应变.就连杜宾教官都在私下里做出过这样的评价,<维多利亚远胜于其他国家的,就在于他们士兵的职业素质.><br/><br/> 即使经过了皇家近卫学校以及在毕业后的现代生活的洗礼,出身维多利亚一座游牧村庄的风笛小姐身上依然带着浓厚的乡土气息.<br/><br/> 这一方面是来自乡村生活本身的熏陶,另一方面似乎是因为其母从小的教育所致.众所周知,瓦伊凡的女性通常都十分强大.<br/><br/> 从小就开始帮家里种田和畜牧的她,在加入罗德岛后,立刻与负责相关事务的后勤干员们打成了一片,并为罗德岛的种植与畜牧事业贡献了宝贵的经验与力量,其热心程度甚至一度让人以为她转岗到了后勤部门.<br/><br/> 另外,有关她对于各种农用大型器械的熟悉,很遗憾的是,由于空间有限,罗德岛的种植规模只允许使用小型拖拉机,令她无法大展拳脚.毕竟,总不能把罗德岛本舰给她开吧.<br/><br/> 当然,这些并不意味着风笛小姐对现代生活毫无认知,她只是尝试过,并且失败了.这点可以从她相对其他干员来说有些频繁的设备维修申请中看出.<br/><br/> 并且,据她所说,她在学生时代也向贵族同学学习过妆扮,但结果实在是令人难堪,久而久之她也放弃了在这方面的努力,但明显风笛小姐还是很在乎自己的穿着容貌之类的表现.作为军人时的装束无可挑剔,但一旦和她谈到平常的穿着和扮相,她却总是表现得忧心忡忡. 不必呀风笛小姐.许多干员觉得你本身就已经足够可爱了.<br/><br/> 正如上面提到的,事实上,如果风笛小姐想的话,她完全可以在维多利亚第二集团军中获得一个令人羡艳的地位.维多利亚作为这片大地上最繁荣的帝国,它的疆土与它强大的军力密不可分,作为士官,风笛小姐也能够享受完全不同于普通士兵的待遇,加上她个人的能力与亲和力……从优秀军人做到城市新贵,完全是一条坦荡的道途.<br/><br/> 但她没有,风笛小姐选择了离开军队,离开自己的战友,离开维多利亚,在这片危险的大地上漫游.<br/><br/> 离开文明走进荒野,这是城邦居民无法想象的事情,毕竟离开了城市和聚落,基本就等于自寻死路.风笛一路上风尘仆仆,与信使同行,与雇佣兵合作,蹭车,蹭城,因为护照和国籍被人赶出城市,被仇视,被卷入危险的阴谋,据她所说,<什么都遭遇过啦.><br/><br/>  现在,她来到了罗德岛.友好的罗德岛干员们愿意和风笛一起奋斗,也愿意向这个了不起的战士伸出援手,然而,她却在这个时候退缩了.<br/><br/> 越深入了解罗德岛,她就越显得有些迷茫.在通过一系列测试和信息交换、了解到干员苇草的存在之后,一向开朗的她竟然变得郁郁寡欢了起来.<br/><br/> 压在她身上的,究竟是什么事呢？有什么样的难题是维多利亚的军力不能解决的呢？维多利亚究竟发生了什么,她和她的队伍又遭遇了什么？<br/><br/> <我曾经是一个维多利亚的士兵,这好像……好像不是罗德岛该负责的事情.尽管我已经不在军队了,但是对不起,我……我其实还是得负责.这是维多利亚军人的职责,也是我们出走的原因.><br/><br/> 也许还不是时候.<br/><br/> 风笛小姐,要什么时候才能告诉我们究竟发生了什么呢？<br/><br/> 而且,虽然大家很喜欢作为优秀军人的风笛小姐,但在农地挥洒汗水,端着三个炖锅走上桌子,穿着长裙边唱边旋转,说起故乡会发呆的风笛小姐……<br/><br/> 大家也一样喜欢.<br/><br/>']],
						lg_jinbenshun: ['male', '旧始', 5, ['lg_pozhanbaichu', 'lg_xunci', 'lg_jinbenshun_zhenwang', 'lg_zhuanjing'], ['des:— 简介 —<br/> 自由的流浪刺客,曾经热衷于某个神秘的传教组织,后来通过深入交流而发现不为人知的秘密.<br/><br/>']],
					},
					translate: {
						lg_haimo: '海沫',
						lg_hailunna: '海伦娜',
						lg_weila: '维拉',
						lg_masi: '马嘶',
						lg_bayunlan: '八云蓝',
						lg_yike: '异客',
						lg_ganyu: '甘雨',
						lg_adila: '阿蒂拉',
						lg_feixieer: '菲谢尔',
						lg_lumiya: '露米娅',
						lg_quanzouhua: '犬走椛',
						lg_yileina: '伊蕾娜',
						lg_yubanmeiqin: '御坂美琴',
						lg_baijingheizi: '白井黑子',
						lg_leimu: '蕾姆',
						lg_aimiliya: '艾米莉亚',
						lg_xinggongliucan: '星宫六喰',
						lg_hanchuanhuili: '寒川绘里',
						lg_diesikuli: '狄俄斯库里',
						lg_keli: '可莉',
						lg_jiawei: '贾维',
						lg_dadaliya: '达达利亚',
						lg_youxiaomeijiu: '诱宵美九',
						lg_asilan: '阿斯兰',
						lg_liannaiyewu: '恋乃夜舞',
						lg_qianyou: '千幽',
						lg_linglan: '铃兰',
						lg_xiaoyezhongxiaoding: '小野冢小町',
						lg_paerwadi: '帕尔瓦蒂',
						lg_ketengcaixiang: '可藤彩香',
						lg_hutao: '胡桃',
						lg_chunhu: '纯狐',
						lg_xiangwan: '向晚',
						lg_zhenbu: '真步',
						lg_youni: '优妮',
						lg_gongbenwuzang: '宫本武藏',
						lg_juwuxing: '橘屋幸',
						lg_luyeyuanpingzang: '鹿野院平藏',
						lg_siye: '伺夜',
						lg_jiaran: '嘉然',
						lg_yujinjian: '宇津见绘里濑',
						lg_buyesishennai: '不夜寺神奈',
						lg_zhongli: '钟离',
						lg_shenlilinghua: '神里绫华',
						lg_sixinai: '四系乃',
						lg_lize: '莉泽',
						lg_shenleqinai: '神乐七奈',
						lg_anjielina: '安洁莉娜',
						lg_shenlilingren: '神里绫人',
						lg_shuiqiaopaluxi: '水桥帕露西',
						lg_kuqiulin: '库丘林',
						lg_luxueer: '露雪儿',
						lg_nuoya: '诺亚',
						lg_nikesi: '倪克斯',
						lg_weiouen: '维欧恩',
						lg_kelinxide: '克琳希德',
						lg_amier: '阿米尔',
						lg_shiqikuangsan: '时崎狂三',
						lg_kailan: '凯兰',
						lg_huilizi: '惠理子',
						lg_leimiliya: '蕾米莉亚',
						lg_chizui: '斥罪',
						lg_naxida: '纳西妲',
						lg_bachongshenzi: '八重神子',
						lg_geshibeizhai: '葛饰北斋',
						lg_jiantongying: '间桐樱',
						lg_jiantongying1: '间桐樱',
						lg_shinaikong: '时乃空',
						lg_lalaiye: '拉莱耶',
						lg_guxing: '孤星',
						lg_peikelimu: '佩可莉姆',
						lg_jiantongying2: '间桐樱',
						lg_jielika: '捷莉卡',
						lg_shixiang: '夜刀神十香',
						lg_fuermosi: '福尔摩斯',
						lg_chongtianzongsi: '冲田总司',
						lg_bayunzi: '八云紫',
						lg_nailin: '乃琳',
						lg_zhelinai: '折笠奈',
						lg_qiunai: '秋乃',
						lg_helage: '赫拉格',
						lg_fengdi: '风笛',
						lg_jinbenshun: '金本瞬',
						lg_huishou: '回首·断舍',
						lg_huishou_info: '出牌阶段限一次,若你的装备区内有牌,你可以将手牌中的一张装备牌置于一名其他角色的装备区(不能替换原有的装备),令其回复1点体力.若其的体力值等于X,你可以对一名其他角色视为使用一张【断舍】(X为其装备区内的牌数).',
						lg_duanshe1: ' ',
						lg_duanshe1_info: '',
						lg_paoying: '泡影·殆尽',
						lg_paoying_info: '当你受到伤害后,你可以令一名其他角色选择是否交给你一张牌.若其选择是,你视为使用一张普通锦囊牌.此牌结算后,若你的手牌数小于体力值,你可以对一名其他角色视为使用一张【泡影】.',
						lg_paoying0: ' ',
						lg_paoying0_info: '',
						lg_haimo_zhenwang: '阵亡',
						lg_haimo_zhenwang_info: '',
						lg_paoying1: ' ',
						lg_paoying1_info: '',
						lg_molitongdiao: '魔力同调',
						lg_molitongdiao_info: '每回合限一次,当你使用装备牌时,若你没有记录过此牌,你可以将手牌数补至X,记录之(X为你装备区内的牌数).',
						lg_xiehouweizhi: '邂逅未知',
						lg_xiehouweizhi_info: '觉醒技,当你使用【杀】造成伤害后,若你以<魔力同调>记录过的牌数不小于5,你摸两张牌.失去技能<魔力同调>,获得技能<探求未知>.',
						lg_tanqiuweizhi: '探求未知',
						lg_tanqiuweizhi_info: '出牌阶段开始时,你可以展示牌堆顶的一张牌且获得之.你可以重复此流程,直到以此法获得基本牌为止.若你未受伤,你摸X张牌(X为你以此法获得的装备牌数).',
						lg_huoyantianzhu: '金星神·火炎天主',
						lg_huoyantianzhu_info: '当你使用【杀】指定目标时,若你的手牌数为全场最多或之一,你可以交给一名其他角色至少两张牌(可以重复此流程).若如此做,此【杀】额外指定至多X名其他角色为目标(X为其以此法获得的牌数).',
						lg_hailunna_zhenwang: '阵亡',
						lg_hailunna_zhenwang_info: '',
						lg_xiefengwuye: '邪风无夜',
						lg_xiefengwuye_info: '封印技,出牌阶段,你可以选择一名其他角色.获得其装备区内的一张牌,令其本回合不能再成为此技能的目标.若如此做,其可以对你视为使用一张【杀】.',
						lg_xiefengwuye1: ' ',
						lg_xiefengwuye1_info: '',
						lg_zhugong_weila: ' ',
						lg_zhugong_weila_info: '',
						lg_xiefengwuye0: '邪风无夜',
						lg_xiefengwuye0_info: '',
						lg_mozhixuetong: '魔之血统',
						lg_mozhixuetong_info: '主公技,每轮游戏开始时,若你的手牌数不为全场最多或之一,你可以将手牌数补至全场最多或之一.',
						lg_weila_zhenwang: '阵亡',
						lg_weila_zhenwang_info: '',
						lg_monibaozhu: '摩尼宝珠',
						lg_monibaozhu_info: '锁定技,一名其他角色使用♦️️【杀】指定你为目标时,若你装备区内的牌数不等于体力值,此【杀】对你无效.',
						lg_chirekuangbao: '炽热狂暴',
						lg_chirekuangbao_info: '当你使用的【杀】被【闪】响应后,你可以对此【杀】目标造成1点火焰伤害.',
						lg_fennuzhiyan: '卷起的愤怒之炎',
						lg_fennuzhiyan_info: '当你使用【杀】造成伤害时,你可以令伤害值改为X.此【杀】伤害结算后,若你本回合有未使用过的牌类别,你随机获得这些类别的各一张牌;且你不能再发动此技能,直到使用的【杀】被【闪】响应为止(X为你已损失的体力值).',
						lg_masi_zhenwang: '阵亡 ',
						lg_masi_zhenwang_info: '',
						lg_fennuzhiyan1: '卷起的愤怒之炎',
						lg_fennuzhiyan1_info: '',
						lg_pingyituji: '凭依荼吉尼天',
						lg_pingyituji_info: '一名其他角色对你造成伤害时,令其将手牌数补至X.若如此做,你可以弃置Y张手牌,其随机废除两个装备栏(X为你的攻击范围;Y为你场上的牌数,且至少为2).',
						lg_simianchuge: '迷人的四面楚歌',
						lg_simianchuge_info: '判定阶段开始时,你可以选择一项:①从牌堆底摸一张牌;②从牌堆底摸两张牌.若你选择的为:①,每当你回复体力时,你可以令至多三名角色各摸一张牌,直到下回合开始;②,每当你打出一张手牌后,弃置一张牌(若你没有牌,回复1点体力),直到下回合开始.',
						lg_bayunlan_zhenwang: '阵亡',
						lg_bayunlan_zhenwang_info: '',
						lg_simianchuge1: '迷人的四面楚歌',
						lg_simianchuge1_info: '',
						lg_simianchuge2: '迷人的四面楚歌',
						lg_simianchuge2_info: '',
						lg_bayunlan0: ' ',
						lg_bayunlan0_info: '',
						lg_xianhusinian: '仙狐思念',
						lg_xianhusinian_info: '',
						lg_diannengzhichu: '电能之触',
						lg_diannengzhichu_info: '出牌阶段限一次,你可以弃置一张♠️️牌,令一名其他角色摸一张牌.若如此做,其展示并弃置其中的黑色手牌.若其没有黑色手牌,你对其依次造成2点雷电伤害.',
						lg_jujiaozhiling: '聚焦指令',
						lg_jujiaozhiling_info: '专精技,一名角色因弃置而失去牌后,你可以令其获得你的两张手牌,将弃置的其中至多两张牌置于牌堆顶.若如此做,你随机获得一张点数与这些均不同的牌.',
						lg_zhuanjing: '专精',
						lg_zhuanjing_info: '',
						lg_huihuangliepian: '辉煌裂片',
						lg_huihuangliepian_info: '一名其他角色对你造成伤害后,若其本回合未使用过【杀】,你可以弃置其一张手牌.若如此做,对其视为使用一张【杀】;且若你的手牌数大于体力值,你对其造成1点雷电伤害.',
						lg_yike_zhenwang: '阵亡',
						lg_yike_zhenwang_info: '',
						lg_tiandijiaotai: '天地交泰',
						lg_tiandijiaotai_info: '元素技,你的手牌上限+X(X为场上的提瓦特势力数).',
						lg_shanzelinji: '山泽麟迹',
						lg_shanzelinji_info: '出牌阶段限一次,若你没有能使用的手牌,你可以展示并弃置其中的♠️️手牌.若如此做,你回复等量的体力,防止你受到的伤害,直到回合结束.',
						lg_shanzelinji1: '山泽麟迹',
						lg_shanzelinji1_info: '',
						lg_jiangzhongtianhua: '降众天华',
						lg_jiangzhongtianhua_info: '一名其他角色的出牌阶段开始时,你可以交给其所有手牌.若如此做,其此阶段造成伤害后,若你的牌数不等于其.你可以回复1点体力(若你未受伤,重铸装备区内的牌),对距离为1以内的其他角色各造成1点冰属性伤害.',
						lg_ganyu_zhenwang: '阵亡',
						lg_ganyu_zhenwang_info: '',
						lg_bingyuansu: '冰',
						lg_bingyuansu_info: '',
						lg_xingzhiwenzhang: '星之纹章',
						lg_xingzhiwenzhang_info: '每回合限一次,当你获得♦️️牌后,你可以展示之.若你区域内的♦️️牌数大于X,你弃置两张♦️️牌,使用♦️️【杀】造成的伤害值+1,直到下回合开始.若如此做,你摸Y张牌(X为你的攻击范围与体力值之和;Y为你此次获得的♦️️牌数).',
						lg_xingzhiwenzhang1: '星之纹章',
						lg_xingzhiwenzhang1_info: '',
						lg_junshenzhijian1: '军神之剑',
						lg_junshenzhijian1_info: '',
						lg_junshenzhijian: '军神之剑',
						lg_junshenzhijian_info: '出牌阶段开始时,你可以选择攻击范围内的任意名其他角色,这些角色各弃置一张手牌.若如此做,你对以此法失去最后手牌的角色造成1点真实伤害;当你使用牌指定其他角色为目标时,若其在你的攻击范围,其不能打出牌响应之.',
						lg_adila_zhenwang: '阵亡',
						lg_adila_zhenwang_info: '',
						lg_junshenzhijian2: '军神之剑',
						lg_junshenzhijian2_info: '',
						lg_chenmoji: '沉默',
						lg_chenmoji_info: '',
						lg_shixingmoya: '噬星魔鸦',
						lg_shixingmoya_info: '元素技,一名角色打出手牌时,若你的判定区内有黑色牌;且手牌数为全场最少或之一,你可以选择并废除一个装备栏.若如此做,你对攻击范围内的其他角色依次视为使用两张雷【杀】.',
						lg_zhiyehuanxian: '至夜幻现',
						lg_zhiyehuanxian_info: '一名其他角色使用【杀】指定目标时,你可以与其进行拼点.若你没赢,其可以获得你的一张牌,你可以重复此流程.若你的手牌数为全场最少或之一,你可以弃置两张牌,对攻击范围内的一名其他角色造成2点雷电伤害.',
						lg_feixieer_zhenwang: '阵亡',
						lg_feixieer_zhenwang_info: '',
						lg_leiyuansu: '雷',
						lg_leiyuansu_info: '',
						lg_zhiyehuanxian0: '至夜幻现',
						lg_zhiyehuanxian0_info: '',
						lg_zhiyehuanxian1: ' ',
						lg_zhiyehuanxian1_info: '',
						lg_ziyezhiniao1: '子夜之鸟',
						lg_ziyezhiniao1_info: '转换技:<br/> ❶一名敌方角色的回合开始时,你令其翻面,对其视为使用一张【杀】.若你的装备区内没有牌,你移出两轮游戏.<br/> ❷一名角色使用【杀】指定目标时,你可以获得此【杀】目标的一张手牌.若其手牌中的花色数未因此变化,此【杀】不能被【闪】响应.',
						lg_ziyezhiniao: '子夜之鸟',
						lg_ziyezhiniao_info: '转换技:<br/> ❶一名敌方角色的回合开始时,你令其翻面,对其视为使用一张【杀】.若你的装备区内没有牌,你移出两轮游戏.<br/> ❷一名角色使用【杀】指定目标时,你可以获得此【杀】目标的一张手牌.若其手牌中的花色数未因此变化,此【杀】不能被【闪】响应.',
						lg_ziyezhiniao0: ' ',
						lg_ziyezhiniao0_info: '',
						lg_lumiya_zhenwang: '阵亡',
						lg_lumiya_zhenwang_info: '',
						lg_yexunyingyi1: '夜巡影翼',
						lg_yexunyingyi1_info: '潜伏技,一名其他角色在你的回合内失去牌后,你判定一次.若为♠️️,其弃置装备区内的两张牌.',
						lg_yexunyingyi: ' ',
						lg_yexunyingyi_info: '',
						lg_lumiya0: ' ',
						lg_lumiya0_info: '',
						lg_yueliangguang: '月亮光',
						lg_yueliangguang_info: '',
						lg_jingjiexian: '境界线',
						lg_jingjiexian_info: '',
						lg_jingjiexian0: ' ',
						lg_jingjiexian0_info: '',
						lg_jingjiexian1: ' ',
						lg_jingjiexian1_info: '',
						lg_tiangoushijue: '天狗视觉',
						lg_tiangoushijue_info: '出牌阶段限一次,若你已受伤,你可以选择攻击范围内的一名其他角色,随机展示其的X张手牌.若你有♦️️牌且体力值为全场最少或之一,你可以观看牌堆顶的Y张牌(X为你已损失的体力值;Y为你的体力值).',
						lg_tiangoushijue1: '天狗视觉',
						lg_tiangoushijue1_info: '',
						lg_kuangquanduanshi: '狂犬断噬',
						lg_kuangquanduanshi_info: '镜界技,当你使用【杀】造成伤害时,你可以令一名其他角色选择一项:①交给你一张手牌;②令你摸一张牌.若其选择的为①,你使用【杀】的次数上限+1,直到当前回合结束(不能重复此流程).',
						lg_kuangquanduanshi1: '狂犬断噬',
						lg_kuangquanduanshi1_info: '',
						lg_quanzouhua_zhenwang: '阵亡',
						lg_quanzouhua_zhenwang_info: '',
						lg_quanzouhua0: ' ',
						lg_quanzouhua0_info: '',
						lg_jujuewanwei: '咀嚼玩味',
						lg_jujuewanwei_info: '',
						lg_jujuewanwei0: ' ',
						lg_jujuewanwei0_info: '',
						lg_nizhuan: '逆转',
						lg_nizhuan_info: '反制技,当你使用的牌被其他角色响应后,你可以获得其响应的牌.',
						lg_yongdong: '涌动',
						lg_yongdong_info: '转换技:<br/> ❶一名角色使用♣️️牌指定目标时,你可以弃置一张♣️️牌,选择一张牌替换其使用的牌.<br/> ❷一名角色使用♣️️牌指定目标时,你可以弃置一张♣️️牌,替换此牌指定的目标.<br/> ❸一名角色使用♣️️牌指定目标时,你可以弃置一张♣️️牌,对发动过此技能的目标各视为使用一张【魔力涌动】.',
						lg_bingzhuifengbao: '冰锥风暴',
						lg_bingzhuifengbao_info: '当你对其他角色造成冰属性伤害时,你可以令其区域内的两张牌移出游戏.若如此做,你可以令场上翻面的角色各失去1点体力.',
						lg_yileina_zhenwang: '阵亡',
						lg_yileina_zhenwang_info: '',
						lg_bingzhuifengbao1: '冰锥风暴',
						lg_bingzhuifengbao1_info: '',
						lg_diancichang: '电磁场',
						lg_diancichang_info: '一名角色的出牌阶段结束时,你可以将手牌数补至X.若你的体力值等于Y,其进入<感电>状态,直到回复体力为止;若你的体力值小于Y,防止你受到的雷电伤害,直到下回合开始(X为其装备区内的空栏数;Y为你点数3的手牌数).',
						lg_diancichang1: '电磁场',
						lg_diancichang1_info: '',
						lg_gandian: ' ',
						lg_gandian_info: '',
						lg_leijizhiqiang: '雷击之枪',
						lg_leijizhiqiang_info: '当你使用点数为3的牌指定目标时,你可以弃置一张手牌.若如此做,目标展示并弃置与此牌花色相同的手牌.',
						lg_chaodiancipao: '超电磁炮',
						lg_chaodiancipao_info: '瞬发技,结束阶段开始时,若你本回合有因使用而进入弃牌堆的牌,你可以将其中一张牌置于牌堆顶.若你的体力值等于X,对逆时针距离为3以内的其他角色各造成2点雷电伤害(X为你点数3的手牌数).',
						lg_chaodiancipao1: '超电磁炮',
						lg_chaodiancipao1_info: '',
						lg_yubanmeiqin_zhenwang: '阵亡',
						lg_yubanmeiqin_zhenwang_info: '',
						lg_jianshichuansong: '箭矢传送',
						lg_jianshichuansong_info: '一名其他角色使用【杀】指定目标时,你可以与其进行拼点.若你赢,你获得双方的拼点牌;若你没赢,将使用者与目标替换,你与其交换手牌.若如此做,你执行一个额外的出牌阶段;且你可以暗置一张手牌,选择两名角色进行拼点.赢的角色获得你以此法暗置的牌,其对没赢的角色造成1点伤害.',
						lg_kongjianzhangwo: '空间掌握',
						lg_kongjianzhangwo_info: '一名角色进行拼点时,你可以选择一名未进行拼点的其他角色.若如此做,该角色代替其打出拼点牌.',
						lg_kongjianyidong: '空间移动',
						lg_kongjianyidong_info: '出牌阶段,你可以弃置一张装备牌,与一名其他角色交换位置.',
						lg_baijingheizi_zhenwang: '阵亡',
						lg_baijingheizi_zhenwang_info: '',
						lg_jianshichuansong1: '箭矢传送',
						lg_jianshichuansong1_info: '',
						lg_bingyun: '冰陨',
						lg_bingyun_info: '结束阶段开始时,若你本回合内使用的牌数不小于X,你可以选择一项:①对攻击范围内的一名其他角色造成1点冰属性伤害;②摸两张牌(X为你的体力值).',
						lg_guizhu: '鬼助',
						lg_guizhu_info: '一名其他角色使用牌指定你为唯一目标时,你可以令一名角色重铸一张牌.若你的牌数小于其,其回复1点体力.',
						lg_leimu_zhenwang: '阵亡',
						lg_leimu_zhenwang_info: '',
						lg_jinglingqiyue: '精灵契约',
						lg_jinglingqiyue_info: '你的回合外,当你需要使用或打出一张基本牌时,若你没有手牌,你可以令其他角色选择是否打出一张对应的基本牌.若其选择是,你视为使用之.',
						lg_bingdongjingdi: '冰冻境地',
						lg_bingdongjingdi_info: '当你处于濒死状态时,你可以观看并弃置伤害来源的一张♣️️手牌.',
						lg_yuedingdehuayuan: '约定的花园',
						lg_yuedingdehuayuan_info: '出牌阶段限一次,你可以观看并交换一名其他角色的一张手牌.',
						lg_aimiliya_zhenwang: '阵亡',
						lg_aimiliya_zhenwang_info: '',
						lg_kai: '封解主·开',
						lg_kai_info: '限制技,当你因弃置而失去牌后,你可以使用这些牌.',
						lg_kai0: '封解主·开',
						lg_kai0_info: '',
						lg_bi: '封解主·闭',
						lg_bi_info: '限制技,一名角色使用普通锦囊牌指定目标时,若其不为唯一目标,你可以弃置任意张手牌.若如此做,令此牌对等量的目标无效.',
						lg_jie: '封解主·解',
						lg_jie_info: '当你的判定牌生效后,你可以令一名没有手牌的其他角色弃置装备区内的一张牌.',
						lg_jie0: ' ',
						lg_jie0_info: '',
						lg_fang: '封解主·放',
						lg_fang_info: '潜伏技,当你登场后,你可以令一名其他角色横置.若如此做,其不能使用或打出牌,直到回合结束;当你解除濒死状态后,随机将一张装备牌置入你的装备区.',
						lg_xinggongliucan_zhenwang: '阵亡',
						lg_xinggongliucan_zhenwang_info: '',
						lg_fang1: ' ',
						lg_fang1_info: '',
						lg_fuyao1: ' ',
						lg_fuyao1_info: '',
						lg_fuyao: '扶摇',
						lg_fuyao_info: '锁定技,当你因弃置而失去牌时,若你有♥️️手牌,你回复1点体力;若你的装备区内有防具牌,你计算与其他角色的距离时+2.',
						lg_suifengmotan: '随风莫叹',
						lg_suifengmotan_info: '当你受到伤害/回复体力后,你可以展示牌堆顶的一张牌并获得之.若以此法获得的牌为:♠️️,你可以弃置一张手牌;♣️️,你回复1点体力;♥️️,你与上家各摸一张牌;♦️️,直到你回合结束.当你造成伤害时,若受伤角色的装备区内有防具牌,此伤害值-1.',
						lg_suifengmotan1: ' ',
						lg_suifengmotan1_info: '',
						lg_tunshiguangye1: '吞噬光夜',
						lg_tunshiguangye1_info: '当你回复体力后,你可以与一名其他角色调换区域内的牌.若你以此法失去的牌数等于体力值,你翻面;当你受到伤害时,你可以将手牌数调整至X.若如此做,你可以展示任意张【杀】,当前回合结束时,你使用之(X为伤害来源的手牌数).',
						lg_tunshiguangye: '吞噬光夜',
						lg_tunshiguangye_info: '',
						lg_shuangshenzange: '双神赞歌',
						lg_shuangshenzange_info: '新生技,一名角色使用♠️️牌指定你为目标时,你可以令一名体力值等于你的其他角色成为此牌额外目标.若此牌被响应,对其余的目标无效;若此牌未被响应,你可以弃置一名其他角色的两张牌.',
						lg_xinsheng: ' ',
						lg_xinsheng_info: '',
						lg_diesikuli_zhenwang: '阵亡',
						lg_diesikuli_zhenwang_info: '',
						lg_chengshuang: '  ',
						lg_chengshuang_info: '',
						lg_shuangshen01: ' ',
						lg_shuangshen01_info: '',
						lg_shuangshen1: '双神赞歌·光',
						lg_shuangshen1_info: '当你回复体力后,你可以弃置任意张♠️️牌,选择等量的其他角色.若如此做,你对这些角色各造成2点无来源伤害.',
						lg_shuangshen11: ' ',
						lg_shuangshen11_info: '',
						lg_shuangshen2: '双神赞歌·夜',
						lg_shuangshen2_info: '当你受到伤害时,你可以弃置任意张♥️️牌,选择等量的其他角色.若如此做,你对这些角色各造成2点无来源伤害.',
						lg_pengpengliwu: '砰砰礼物',
						lg_pengpengliwu_info: '元素技,一名其他角色使用【杀】或【火攻】结算后,你可以交给其装备区内的一张牌.若如此做,你获得之.若你的体力值等于X,你可以对攻击范围内的一名其他角色视为使用一张火【杀】(X为你装备区内的牌数).',
						lg_huoyuansu: '火',
						lg_huoyuansu_info: '',
						lg_bengbengzhadan: '蹦蹦炸弹',
						lg_bengbengzhadan_info: '出牌阶段限一次,你可以弃置两张♦️️手牌,对一名其他角色造成1点火焰伤害.若如此做,其随机弃置X张牌,附近至多两名其他角色各受到等量的火焰伤害(X为其已损失的体力值).',
						lg_honghonghuohua: '轰轰火花',
						lg_honghonghuohua_info: '限定技,当你受到伤害时,防止之.你可以观看并展示一名其他角色的一张手牌,除其以外的角色对其使用牌时,若此牌花色与你以此法展示的相同,其摸一张牌.若其的手牌数大于体力值,你对其造成1点火焰伤害(若你受到火焰伤害,改为回复1点体力).',
						lg_honghonghuohua1: ' ',
						lg_honghonghuohua1_info: '',
						lg_keli_zhenwang: '阵亡',
						lg_keli_zhenwang_info: '',
						lg_bengbengzhadan1: ' ',
						lg_bengbengzhadan1_info: '',
						lg_xuniouxiang: '虚拟偶像',
						lg_xuniouxiang_info: '当你使用♥️️牌指定目标时,你可以与一名其他角色交换一个装备栏内的牌.',
						lg_kongjuyinmai1: ' ',
						lg_kongjuyinmai1_info: '',
						lg_xuezhikewang: '血之渴望',
						lg_xuezhikewang_info: '一名角色解除濒死状态后,若你的手牌数为全场最少或之一,你可以将体力回复至上限.',
						lg_linghunshouge: '灵魂收割',
						lg_linghunshouge_info: '当你使用【杀】指定其他角色为目标时,你可以与其进行拼点.若你赢,你回复1点体力,其失去1点体力并弃置一张手牌;若你没赢,此【杀】不能被【闪】响应.',
						lg_tonghuatingyuan: '童话庭院',
						lg_tonghuatingyuan_info: '虚实技,一名角色的判定牌生效后,你可以展示并弃置其中的♥️️手牌.若如此做,其横置,摸X张牌(X为你以此法弃置的牌数).',
						lg_tonghuawangguo: '童话王国',
						lg_tonghuawangguo_info: '虚实技,一名角色跳过出牌阶段后,你可以选择一种基础数值与手牌数进行交换,直到回合结束(攻击范围;手牌上限;使用限制).若你的手牌数因此变化,你可以令一名其他角色执行之.',
						lg_xushi: '虚实',
						lg_xushi_info: '',
						lg_wangziyugongzhu: '王子与公主',
						lg_wangziyugongzhu_info: '虚实技,一名其他角色使用♥️️牌指定你为目标时,你可以弃置一张牌.若此牌没有指定过其他男性角色,你可以令一名男性角色成为此牌的额外目标.',
						lg_jigongzhenbu_zhenwang: '阵亡',
						lg_jigongzhenbu_zhenwang_info: '',
						lg_huoyanboli: '火焰剥离',
						lg_huoyanboli_info: '假象技,出牌阶段开始时,你可以展示并弃置两张红色手牌.若其中没有【闪】,你选择一项:①摸三张牌;②对攻击范围内的一名其他角色视为使用一张火【杀】.若如此做,你可以弃置一张牌,选择攻击范围内的一名体力值不小于你的其他角色,对其造成1点火焰伤害.',
						lg_huoyanboli1: '火焰剥离',
						lg_huoyanboli1_info: '',
						lg_jiawei_zhenwang: '阵亡',
						lg_jiawei_zhenwang_info: '',
						lg_anliu: '魔王武装·暗流',
						lg_anliu_info: '元素技,当你对其他角色造成伤害时,你可以令其选择是否展示一张♣️️手牌.若其选择是,你随机弃置一张手牌;若其选择否,此伤害值+1.',
						lg_kuanglan: '魔王武装·狂澜',
						lg_kuanglan_info: '专精技,摸牌阶段开始时,你可以额外摸两张牌.将未以此法获得的手牌移出游戏,标记为<狂澜>.若如此做,你判定一次,将一张与判定牌花色相同的<狂澜>置入弃牌堆,随机获得一张♣️️牌.若你依然有符合上述条件的<狂澜>,则重复此流程.',
						lg_shuiyuansu: '水',
						lg_shuiyuansu_info: '',
						lg_dadaliya_zhenwang: '阵亡',
						lg_dadaliya_zhenwang_info: '',
						lg_duzou: '独奏',
						lg_duzou_info: '一名其他角色使用【杀】造成伤害后,若其的手牌数小于你,你可以展示牌堆顶的一张牌且获得之.若如此做,你可以获得其区域内的一张牌.',
						lg_lunwuqu: '轮舞曲',
						lg_lunwuqu_info: '每名角色限一次,一名角色回复体力/受到伤害后,若其的体力值等于X.你可以对其造成1点伤害.若如此做,你回复1点体力(X为你的体力值).',
						lg_zhenhunqu: '镇魂曲',
						lg_zhenhunqu_info: '你的回合外,当你因弃置而失去基本牌后,你可以令一名其他角色获得之.若其的手牌数大于X,其回复2点体力(X为你的体力值).',
						lg_jinxingqu0: '音律',
						lg_jinxingqu0_info: '',
						lg_jinxingqu: '进行曲',
						lg_jinxingqu_info: '音律技,一名其他角色因弃置而失去牌后,你可以弃置等量的牌.若如此做,其获得之.',
						lg_youxiaomeijiu_zhenwang: '阵亡',
						lg_youxiaomeijiu_zhenwang_info: '',
						lg_yeyanshiling: '始夜·夜魇噬灵',
						lg_yeyanshiling_info: '当你使用牌指定攻击范围内的其他角色为目标时,若其处于<横置>状态,你可以重铸其的一张牌.若以此法重铸的牌为:♠️️,其随机废除1个装备栏,进入<混乱>状态,直到下回合结束;♥️️,其失去2点体力.',
						lg_wujianduoluo: '始夜·无间堕落',
						lg_wujianduoluo_info: '沉默技,一名角色的体力值变化后,你可以选择一名手牌数大于的其他角色.你摸两张牌,对其视为使用一张【杀】.若其的手牌数大于你,你重复此流程.',
						lg_asilanzuzhou1: ' ',
						lg_asilanzuzhou1_info: '',
						lg_asilan_zhenwang: '阵亡',
						lg_asilan_zhenwang_info: '',
						lg_asilanzuzhou: '阿斯兰诅咒',
						lg_asilanzuzhou_info: '内奸技,一名其他角色回复体力时,你可以选择一名体力值为全场最多(或之一)的角色.若如此做,其非锁定技失效,直到下回合开始.',
						lg_qianyou_zhenwang: '阵亡',
						lg_qianyou_zhenwang_info: '',
						lg_jinjimishu: '禁忌秘术',
						lg_jinjimishu_info: '一名其他角色成为【杀】的目标时,若其在你的攻击范围,你可以将此【杀】目标改为你.若你的区域内没有牌,你观看牌堆顶的X张牌,将其中的牌以任意顺序置于牌堆顶/底(X为你下家区域内的♣️️牌数).',
						lg_liannaiyewu_zhenwang: '阵亡',
						lg_liannaiyewu_zhenwang_info: '',
						lg_ershidewuyue: '儿时的舞乐',
						lg_ershidewuyue_info: '一名其他角色使用牌指定你为唯一目标时,你可以弃置装备区内的至多三张牌.若如此做,你选择一项:①获得其等量的手牌;②令其摸一张牌.',
						lg_lianzhimonv0: '恋之魔女',
						lg_lianzhimonv0_info: '一名其他角色使用牌对你造成伤害后,你可以对其视为使用之.若以此法造成伤害,你随机弃置区域内的一张牌.',
						lg_lianzhimonv: ' ',
						lg_lianzhimonv_info: '',
						lg_huhuomiaoran: '狐火渺然',
						lg_huhuomiaoran_info: '一名其他角色成为♦️️牌的目标时,若其在你的攻击范围,你可以交给其一张手牌.若此牌为【杀】且结算后,你可以观看并获得其的一张手牌.若如此做,你与距离为2的其他角色各回复1点体力,摸一张牌.',
						lg_linglan_zhenwang: '阵亡',
						lg_linglan_zhenwang_info: '',
						lg_wujianzhixiajian: '无间之狭间',
						lg_wujianzhixiajian_info: '反制技,当你使用♥️️牌对其他角色造成伤害后,若其的装备区内有坐骑牌,你可以获得之.',
						lg_wujianzhixiajian1: ' ',
						lg_wujianzhixiajian1_info: '',
						lg_yumingwujixu: '余命无几许',
						lg_yumingwujixu_info: '出牌阶段限一次,你可以弃置至少两张花色均不同的手牌,令一名其他角色重复相同的流程.若其以此法弃置的牌数与你不同,你随机获得X张延时锦囊牌;若其的手牌数为全场最少或之一,你对其造成Y点真实伤害(X为其未弃置的花色数;Y为其体力值的一半,向上取整).',
						lg_mingtulvzhongyu1: ' ',
						lg_mingtulvzhongyu1_info: '',
						lg_mingtulvzhongyu: '冥途旅中雨',
						lg_mingtulvzhongyu_info: '彼岸技,一名其他角色的判定阶段开始时,若其的体力值不小于你,你可以交给其一张红色牌.若如此做,你与上家翻面,其跳过本回合的出牌阶段.',
						lg_xiaoyezhongxiaoding_zhenwang: '阵亡',
						lg_xiaoyezhongxiaoding_zhenwang_info: '',
						lg_xiaoyezhongxiaoding1: ' ',
						lg_xiaoyezhongxiaoding1_info: '',
						lg_shenghunliuli: '生魂流离的镰刀',
						lg_shenghunliuli_info: '',
						lg_shenghunliuli1: ' ',
						lg_shenghunliuli1_info: '',
						lg_xushuzhihuan: '虚数环',
						lg_xushuzhihuan_info: '拟似技,当你使用牌指定其他角色为唯一目标时,你可以获得其X张手牌.若这些牌有包含你使用的花色,你随机弃置区域内的三张牌(X为其手牌数的一半,且向上取整).',
						lg_nisi: '拟似',
						lg_nisi_info: '',
						lg_zhilianbuwei: '知恋不为·无爱也',
						lg_zhilianbuwei_info: '出牌阶段限一次,你可以弃置一张♣️️手牌,摸两张牌.若如此做,体力值为全场最少或之一的角色各摸一张牌.若你的装备区内的牌数等于X,将距离1以内的其他角色进行<魅惑>,直到下回合结束(X为你的体力值).',
						lg_zhilianbuwei0: ' ',
						lg_zhilianbuwei0_info: '',
						lg_meihuo: '魅惑',
						lg_meihuo_info: '',
						lg_paerwadi_zhenwang: '阵亡',
						lg_paerwadi_zhenwang_info: '',
						lg_caiyi: '彩忆',
						lg_caiyi_info: '每回合限一次,当你因弃置而失去牌后,你可以观看牌堆顶的一张牌,将此牌置于牌堆顶/底.若如此做,你可以将一张手牌当此牌使用.',
						lg_paomozhimeng: '泡沫之梦',
						lg_paomozhimeng_info: '每回合限一次,当你使用或打出一张♥️️牌后,你可以观看牌堆顶的X张牌.若如此做,获得其中花色均不相同的牌(X为此牌的点数与当前游戏轮数之差).',
						lg_ketengcaixiang_zhenwang: '阵亡',
						lg_ketengcaixiang_zhenwang_info: '',
						lg_jinmieshan1: '极恶技·尽灭闪',
						lg_jinmieshan1_info: '出牌阶段限一次,当你使用锦囊牌结算后,你可以将一张手牌当【杀】使用.',
						lg_jinmieshan: ' ',
						lg_jinmieshan_info: '',
						lg_xiezhizaohuo: '血之灶火',
						lg_xiezhizaohuo_info: '元素技,一名其他角色获得你的牌后,若其的装备区内没有牌,你对其可以造成2点火焰伤害;若其的装备区内有牌,你可以获得其区域内的一张牌.',
						lg_dieyinlaisheng: '蝶引来生',
						lg_dieyinlaisheng_info: '镜像技,当你使用【杀】指定其他角色为目标时,你可以选择至少一项:①此【杀】改为火【杀】;②你与目标横置;③此【杀】造成的伤害值+1.若此【杀】被【闪】响应,你与其交换手牌,其对你重复相同的流程.',
						lg_dieyinlaisheng1: '蝶引来生',
						lg_dieyinlaisheng1_info: '',
						lg_anshenmifa: '安神秘法',
						lg_anshenmifa_info: '进阶技,一名其他角色的出牌阶段开始时,你可以与其进行拼点.若你赢,你视为使用一张基本牌或普通锦囊牌;若你没赢,你回复1点体力.',
						lg_hutao_zhenwang: '阵亡',
						lg_hutao_zhenwang_info: '',
						lg_anshenmifa11: ' ',
						lg_anshenmifa11_info: '',
						lg_anshenmifa1: '安神秘法',
						lg_anshenmifa1_info: '进阶技,一名其他角色的出牌阶段开始时,你可以与其进行拼点.若你赢,你视为使用一张基本牌或普通锦囊牌;若你没赢,你回复2点体力.',
						lg_anshenmifa22: ' ',
						lg_anshenmifa22_info: '',
						lg_anshenmifa2: '安神秘法',
						lg_anshenmifa2_info: '进阶技,一名其他角色使用♣️️非基本牌时,若你没有♣️️手牌,你可以令其选择一项:①令你摸两张牌;②此牌对目标无效.',
						lg_chuncuidefengkuang1: '纯化',
						lg_chuncuidefengkuang1_info: '',
						lg_chuncuidefengkuang: '纯粹的疯狂',
						lg_chuncuidefengkuang_info: '纯化技,一名其他角色的状态变化时,你可以对其使用一张【杀】.若如此做,你执行一个额外的弃牌阶段.',
						lg_mihuanmantuoluo1: '纯化',
						lg_mihuanmantuoluo1_info: '',
						lg_mihuanmantuoluo: '迷幻曼陀罗',
						lg_mihuanmantuoluo_info: '纯化技,一名角色的出牌阶段开始时,你可以指定一名手牌数/体力值不等于你的其他角色,其选择一项:①你/其将手牌数调整至与其/你相同;②你/其将体力值调整至与你/其相同.若你没有♥️️手牌,你可以选择至多X名其他角色,将等量的牌当【杀】对其使用.若如此做,你获得这些角色区域内的至多两张牌(X为手牌数大于你的角色数,且至少为1).',
						lg_mihuanmantuoluo0: '迷幻曼陀罗',
						lg_mihuanmantuoluo0_info: '',
						lg_yingyierchu1: '纯化',
						lg_yingyierchu1_info: '',
						lg_yingyierchu: '盈溢而出的污秽',
						lg_yingyierchu_info: '纯化技,一名其他角色的判定阶段开始时,你可以令其选择一项:①交给你一张♥️️手牌;②不能使用♥️️牌,直到回合结束.若其选择的为①,你不能再发动此技能,直到回复体力为止.',
						lg_chunhu_zhenwang: '阵亡',
						lg_chunhu_zhenwang_info: '',
						lg_chunhu1: ' ',
						lg_chunhu1_info: '',
						lg_yuanshishenling: '原始的神灵界',
						lg_yuanshishenling_info: '',
						lg_xiandaishenling: '现代的神灵界',
						lg_xiandaishenling_info: '',
						lg_jingzhungaoguang: '精准高光',
						lg_jingzhungaoguang_info: '闪耀技,一名角色使用牌指定你为目标时,若此牌为♣️️,你可以展示并重铸任意张非♥️️手牌.',
						lg_shanyao: '闪耀',
						lg_shanyao_info: '',
						lg_damowangshike: '大魔王时刻',
						lg_damowangshike_info: '当你使用装备牌后,若你没有手牌,你可以视为使用一张未以此法使用过的普通锦囊牌.若你的♣️️牌数小于X,你可以令一名其他角色交给你一张牌.若其交给你的牌为【杀】,改为其对你使用之(X为当前游戏轮数).',
						lg_damowangshike1: '大魔王时刻',
						lg_damowangshike1_info: '',
						lg_xiangwan_zhenwang: '阵亡',
						lg_xiangwan_zhenwang_info: '',
						lg_tanqiuhuanchong: '探求缓冲因子',
						lg_tanqiuhuanchong_info: '每当你受到1点伤害后,你可以令至多三名角色各摸一张牌.若你的手牌数大于体力上限,你弃置两张牌.',
						lg_tanqiuhuanchong0: ' ',
						lg_tanqiuhuanchong0_info: '',
						lg_haojiedansheng: '豪杰诞生概论',
						lg_haojiedansheng_info: '摸牌阶段/弃牌阶段开始时,若你装备区内的牌数为全场最少或之一,你可以跳过此阶段,移动场上的一张牌.若你的手牌数小于体力上限,你摸一张牌.',
						lg_xueshi: '学识',
						lg_xueshi_info: '',
						lg_youni_zhenwang: '阵亡',
						lg_youni_zhenwang_info: '',
						lg_zhexue0: '认知发展的哲学',
						lg_zhexue0_info: '学识技,当你需要使用一张不为【酒】的基本牌时,若你没有手牌,你可以将装备区内的一张牌当对应的基本牌使用.',
						lg_zhexue: ' ',
						lg_zhexue_info: '',
						lg_ertianyiliu: '二天一流',
						lg_ertianyiliu_info: '当你使用【杀】造成伤害后,你可以展示牌堆顶的至多X张牌,将任意张牌与其进行交换.若如此做,其余的牌以任意顺序置于牌堆顶/底(X为你牌数的一半,且向下取整).',
						lg_julijialuo: '俱利伽罗天象',
						lg_julijialuo_info: '专精技,一名其他角色使用伤害类的牌指定你为目标时,你可以展示牌堆顶的一张牌.若如此做,你展示一张手牌,进入<无空>状态,直到下回合开始.若你的手牌中:没有与展示牌相同的花色,你对其造成2点无来源伤害;有与展示牌相同的花色,你获得之,执行一个额外的出牌阶段.',
						lg_gongbenwuzang_zhenwang: '阵亡',
						lg_gongbenwuzang_zhenwang_info: '',
						lg_wukong: '无空',
						lg_wukong_info: '',
						lg_xinyan: '心眼',
						lg_xinyan_info: '',
						lg_zhicai: '制裁',
						lg_zhicai_info: '',
						lg_zuimeng: '醉梦',
						lg_zuimeng_info: '反转技,一名其他角色成为♠️️【杀】或普通锦囊牌的目标时,若其的势力不为旧始(你不为使用者),你可以成为此牌的额外目标.',
						lg_zuimeng1: '醉梦',
						lg_zuimeng1_info: '反转技,一名其他角色成为♥️️【杀】或普通锦囊牌的目标时,若其的势力不为旧始(你不为使用者),你可以成为此牌的额外目标.',
						lg_kuwei: '枯萎',
						lg_kuwei_info: '转换技:<br/> ❶当你回复体力时,你可以令当前回合未指定过的一名其他角色选择一项:①交给你一张♠️️牌;②随机废除一个装备栏.若你没有♠️️手牌,你可以重复此流程.<br/>❷当你受到伤害后,若伤害来源的装备区内有牌,你可以将其装备区内的一张牌移至你对应的区域.',
						lg_kuwei0: ' ',
						lg_kuwei0_info: '',
						lg_kuwei1: '枯萎',
						lg_kuwei1_info: '转换技:<br/> ❶当你回复体力时,你可以令当前回合未指定过的一名其他角色选择一项:①交给你一张♠️️牌;②随机废除一个装备栏.若你没有♠️️手牌,你可以重复此流程.<br/> ❷当你受到伤害后,若伤害来源的装备区内有牌,你可以将其装备区内的一张牌移至你对应的区域.',
						lg_qingyanranran: '轻烟冉冉',
						lg_qingyanranran_info: '镜像技,一名其他角色的回合开始时,你可以弃置X张手牌,回复1点体力.若如此做.你对其视为使用一张【酒】(X为你的体力值).',
						lg_qingyanranran1: '轻烟冉冉',
						lg_qingyanranran1_info: '',
						lg_linghunsangzhong: '灵魂丧钟',
						lg_linghunsangzhong_info: '调制技,当你受到伤害时,你可以依次移动场上的至多X张牌(X为你已损失的体力值).',
						lg_juwuxing_zhenwang: '阵亡',
						lg_juwuxing_zhenwang_info: '',
						lg_tiaozhi: '调制',
						lg_tiaozhi_info: '',
						lg_qiangji: ' ',
						lg_qiangji_info: '',
						lg_xunjie: ' ',
						lg_xunjie_info: '',
						lg_mihuo: ' ',
						lg_mihuo_info: '',
						lg_tiaozhi00: ' ',
						lg_tiaozhi00_info: '',
						lg_yinyoukanpo: '因由勘破',
						lg_yinyoukanpo_info: '元素技,一名角色从牌堆底摸牌时,你可以令其弃置一张基本牌.若如此做,你与其展示并交换手牌.',
						lg_luxinquan: '勠心拳',
						lg_luxinquan_info: '出牌阶段限一次,你可以展示牌堆顶的一张牌,依次弃置两张基本牌.若如此做,令一名其他角色获得之.若以此法展示的为基本牌,你与其各从牌堆底摸一张牌;且每当你失去最后一张手牌,你可以对其他角色发起<拳势>,直到回合结束.',
						lg_luxinquan1: '拳势',
						lg_luxinquan1_info: '',
						lg_jufengcu: '聚风蹴',
						lg_jufengcu_info: '每回合限一次,当你的判定牌生效后,你可以与一名其他角色进行拼点.若你赢,你对其造成2点真实伤害.',
						lg_fengyuansu: '风',
						lg_fengyuansu_info: '',
						lg_shoulie: ' ',
						lg_shoulie_info: '',
						lg_shoulie1: ' ',
						lg_shoulie1_info: '',
						lg_shoulie000: ' ',
						lg_shoulie000_info: '',
						lg_shoulie00: ' ',
						lg_shoulie00_info: '',
						lg_shoulie0: ' ',
						lg_shoulie0_info: '',
						lg_lingxiuhuhuan: '领袖的呼唤',
						lg_lingxiuhuhuan_info: '狩猎技,出牌阶段限一次,你可以令一名角色将手牌数补至X,选择是否使用一张【杀】.若其以此法使用【杀】造成伤害,你可以令一名角色摸Y张牌,选择是否使用一张【杀】(X为其的体力值;Y为其已损失的体力值,且至少为1).',
						lg_lingxiukuizeng: '领袖的馈赠',
						lg_lingxiukuizeng_info: '制裁技,一名其他角色使用♠️️牌指定你为唯一目标时,你可以交给另一名角色一张手牌.若如此做,此牌目标改为其.',
						lg_lingxiuzunyan: '领袖的尊严',
						lg_lingxiuzunyan_info: '终焉技,一名其他角色的判定阶段开始时,若你在其的攻击范围,你可以令其选择一项:①对你使用一张【杀】;②不能使用♠️️牌,直到出牌阶段结束.若你装备区内的牌数不小于X,你翻面,失去1点体力(X为你的♠️️手牌数与体力值之和).',
						lg_siye_zhenwang: '阵亡',
						lg_siye_zhenwang_info: '',
						lg_zhongyan: ' ',
						lg_zhongyan_info: '',
						lg_shoulie2: ' ',
						lg_shoulie2_info: '',
						lg_yuanqi: ' ',
						lg_yuanqi_info: '',
						lg_tangguobinfen: '缤纷时刻',
						lg_tangguobinfen_info: '元气技,当你打出手牌时,你可以将一名角色区域内的两张牌移出游戏,称为<嘉>;一名角色回复体力时,若你有移出游戏的<嘉>,你可以令其选择获得一张<嘉>.若以此法获得<嘉>的不为你,你与其将手牌数补至X.若其的体力值大于你,其回复1点体力;若其的体力值小于你,你回复1点体力.若你/其未受伤,改为其/你摸两张牌(X为你与其的体力值之和).',
						lg_tianmijiaxin: '甜蜜嘉心',
						lg_tianmijiaxin_info: '每轮游戏开始时,你可以指定一名其他角色.若如此做,你选择一项:①弃置两张牌,随机获得一张基本牌;②回复1点体力,令一名角色摸一张牌.每当其使用♥️️牌造成伤害后,你可以展示牌堆顶的三张牌,将其中任意张牌交给你/其,直到本轮游戏结束.',
						lg_tianmijiaxin1: '甜蜜嘉心',
						lg_tianmijiaxin1_info: '',
						lg_jiaran_zhenwang: '阵亡',
						lg_jiaran_zhenwang_info: '',
						lg_wuxielingmei: '巫邪灵媒',
						lg_wuxielingmei_info: '伪装技,当你回复体力后,你可以令一名角色执行一个额外的判定/摸牌/出牌/弃牌阶段.',
						lg_weizhuang: '伪装',
						lg_weizhuang_info: '',
						lg_tiansumao: '天遡鉾',
						lg_tiansumao_info: '伪装技,当你使用伤害牌指定其他角色为目标时,你可以令其选择是否令你获得其区域内的两张牌.若其当前回合选择过否,你对其造成X点伤害(X为其当前回合选择过否的次数).',
						lg_tiansumao1: '天遡鉾',
						lg_tiansumao1_info: '',
						lg_yujinjian_zhenwang: '阵亡',
						lg_yujinjian_zhenwang_info: '',
						lg_jisi: '即死',
						lg_jisi_info: '',
						lg_chanazhige: '刹那之歌',
						lg_chanazhige_info: '心眼技,一名其他角色的弃牌阶段开始时,若其本回合未对你使用过牌,你可以随机获得一张♥️️牌;若其本回合对你使用过牌,你可以弃置X张手牌.若如此做,其依次失去2点体力(X未其本回合对你使用过的牌数).',
						lg_yongheng: '永恒',
						lg_yongheng_info: '',
						lg_shenlingyongcan: '神灵永璨',
						lg_shenlingyongcan_info: '永恒技,当你回复体力时,你可以选择一项:①重铸一张【杀】;②使用一张【杀】.若如此做,你令一名其他角色重复相同的流程.',
						lg_yinjiuzhike: '饮鸠止渴',
						lg_yinjiuzhike_info: '吞噬技,一名角色使用♥️️牌指定唯一目标时,若你不为此牌目标,你可以将此牌目标改为另一名角色.若你以此法成为此牌目标,你失去1点体力.',
						lg_yinjiuzhike0: ' ',
						lg_yinjiuzhike0_info: '',
						lg_buyesishennai_zhenwang: '阵亡',
						lg_buyesishennai_zhenwang_info: '',
						lg_yinjiuzhike1: ' ',
						lg_yinjiuzhike1_info: '',
						lg_shenzuiyinjiu: '神罪·饮鸠止渴',
						lg_shenzuiyinjiu_info: '吞噬技,当你使用基本牌指定目标时,若你没有记录此牌的点数,你可以记录之;一名其他角色使用普通锦囊牌指定你为目标时,若你有记录与此牌相同的点数,此牌对你无效.若如此做,距离此牌使用者为1以内的其他角色各失去1点体力.',
						lg_chuijinzhuanyu: '炊金馔玉',
						lg_chuijinzhuanyu_info: '元素技,一名角色使用【无懈可击】时,若你的手牌数小于体力上限,你可以获得至多X名其他角色的各一张手牌(X为你的体力上限).',
						lg_yanyuansu: '岩',
						lg_yanyuansu_info: '',
						lg_dixin: '地心',
						lg_dixin_info: '虚实技,一名其他角色的出牌阶段开始时,你可以弃置一张手牌.若如此做,其弃置一张牌.若其以此法弃置的为基本牌,你可以令另一名角色获得之.',
						lg_tianxing: '天星',
						lg_tianxing_info: '虚实技,若你本轮游戏未以此法使用过某张基本牌,你可以选择一个装备栏废除,视为使用之;当你使用【杀】造成伤害后,你随机对一名敌方角色造成1点真实伤害,选择一项:①摸一张牌;②回复1点体力,选择一个装备栏回复.',
						lg_tianxing1: '天星',
						lg_tianxing1_info: '',
						lg_zhongli_zhenwang: '阵亡',
						lg_zhongli_zhenwang_info: '',
						lg_qingying: '神里流·倾樱',
						lg_qingying_info: '元素技,当你受到伤害后,你可以观看伤害来源的至多X张手牌;且观看牌堆顶的X张牌.若如此做,令伤害来源获得其中一张牌,你获得其余的牌(X为伤害来源区域内的♣️️牌数).',
						lg_zhujing: '铸镜',
						lg_zhujing_info: '',
						lg_binghua: '神里流·冰华',
						lg_binghua_info: '每回合限一次,一名角色使用牌指定目标时,你可以令其选择一项:①摸一张牌,此牌额外指定一个目标;②令你弃置一张牌,此牌对其中一个目标无效.',
						lg_shuangmie: '神里流·霜灭',
						lg_shuangmie_info: '铸镜技,当你使用♣️️【杀】或普通锦囊牌指定目标时,你可以弃置其区域内的各一张牌.若此牌结算后,其获得以此法失去的牌,进入<冻伤>状态,直到回复体力为止.',
						lg_shenlilinghua_zhenwang: '阵亡',
						lg_shenlilinghua_zhenwang_info: '',
						lg_dongshang: '冻伤',
						lg_dongshang_info: '',
						lg_bingjiekuilei: '冰结傀儡',
						lg_bingjiekuilei_info: '沉默技,当你造成/受到伤害时,你可以随机获得目标/伤害来源的一张手牌.若以此法获得的牌为:♠️️,目标/伤害来源翻面;♣️️,你弃置目标/伤害来源的一张手牌;♥️️,你将手牌数补至X;♦️️,你获得1点护甲(X为你的体力值与装备区内的牌数之和).',
						lg_bingjiekuilei0: '冰结傀儡 ',
						lg_bingjiekuilei0_info: '',
						lg_dongkai: '冻铠',
						lg_dongkai_info: '冻结技,当你失去牌时,你可以令一名其他角色弃置等量的牌.若如此做,其摸等量的牌,你可以弃置三张黑色手牌,令距离为2以内的其他角色翻面.',
						lg_dongkai1: '冻铠',
						lg_dongkai1_info: '',
						lg_dongjie: '冻结',
						lg_dongjie_info: '',
						lg_sixinai_zhenwang: '阵亡',
						lg_sixinai_zhenwang_info: '',
						lg_youyazhiyi: '优雅之仪',
						lg_youyazhiyi_info: '出牌阶段限一次,你可以交给一名其他角色一张手牌,观看其的所有手牌.',
						lg_mengsebianzhi: '梦色编织',
						lg_mengsebianzhi_info: '潜伏技,准备阶段开始时,你可以与一名其他角色各随机展示一张手牌,摸两张牌.若以此法展示的花色均相同,你使用牌没有距离限制;且造成伤害值+1,直到回合结束.',
						lg_lize_zhenwang: '阵亡',
						lg_lize_zhenwang_info: '',
						lg_liuyun: '流韵',
						lg_liuyun_info: '当你受到伤害时,你可以弃置一张手牌,令伤害来源相同的流程.若以此法弃置牌的花色均不同,此伤害值-1.',
						lg_chunzhenzhufu: '纯真祝福',
						lg_chunzhenzhufu_info: '出牌阶段限一次,你可以弃置至多X张手牌,选择攻击范围内的一名其他角色.若如此做,你获得其的X张手牌.你可以令至多三名其他角色选择一项:①使用一张牌;②弃置一张牌(X为你已损失的体力值).',
						lg_chunzhenzhufu1: '纯真祝福',
						lg_chunzhenzhufu1_info: '',
						lg_shenleqinai_zhenwang: '阵亡',
						lg_shenleqinai_zhenwang_info: '',
						lg_suchong: '秘杖·速充模式',
						lg_suchong_info: '一名其他角色的出牌阶段结束时,你可以令至多X名角色各摸一张牌(X为你当前回合失去的手牌数).',
						lg_weili: '秘杖·微粒模式',
						lg_weili_info: '每回合限一次,当你需要使用或打出一张【闪】时,你可以选择一名手牌数为全场最多或之一的其他角色.若如此做,你交给其一张手牌,视为使用之.',
						lg_fanzhongli: '秘杖·反重力模式',
						lg_fanzhongli_info: '当你需要打岀一张【杀】时,你可以令一名其他角色选择是否交给你一张【杀】.若其选择是,其的下家获得一层<反重力>;一名角色摸牌时,少摸X张牌,随机弃置区域内的X张牌(X为其的<反重力>层数).',
						lg_anjielina_zhenwang: '阵亡',
						lg_anjielina_zhenwang_info: '',
						lg_poyuejianying: '神里流·破月渐盈',
						lg_poyuejianying_info: '元素技,摸牌阶段开始时,你可以额外摸X张牌;弃牌阶段开始时,你额外弃置Y张牌(X为攻击范围内体力值不大于你的角色数;Y为你本回合未造成伤害的角色数).',
						lg_jinghua: '神里流·镜花',
						lg_jinghua_info: '镜影技,一名其他角色获得你的牌时,你可以弃置之.若如此做,你弃置其区域内等量的牌.若你的手牌数为全场最少或之一,你可以对其视为使用等量的【杀】,取消上述流程;当你使用的【杀】被【闪】响应后,你与上家各执行一个额外的出牌阶段,重置<镜影>.',
						lg_jingying: '镜影',
						lg_jingying_info: '',
						lg_jingying1: '镜影',
						lg_jingying1_info: '',
						lg_shuiyou: '神里流·水囿',
						lg_shuiyou_info: '出牌阶段限一次,你可以令一名其他角色选择是否弃置至少一张牌.若其选择是,你可以重复相同的流程.若你以此法弃置的牌数:大于其,其对你视为使用一张【杀】;小于其,你对其视为使用一张【杀】.此【杀】结算后,你可以选择是否弃置/摸一张牌.若选择是,你可以与一名手牌数等于你的其他角色交换手牌.',
						lg_shuiyou1: '神里流·水囿',
						lg_shuiyou1_info: '',
						lg_shuiyou0: ' ',
						lg_shuiyou0_info: '',
						lg_shenlilingren_zhenwang: '阵亡',
						lg_shenlilingren_zhenwang_info: '',
						lg_jiyuanfan: '积怨返',
						lg_jiyuanfan_info: '当你受到伤害时,你可以选择一项:①弃置一张牌;②摸两张牌.若你的手牌数等于X,此伤害值+1(X为伤害来源的体力值).',
						lg_duyiyinbaozhe: '妒意引爆者',
						lg_duyiyinbaozhe_info: '堕落技,一名其他角色的出牌阶段开始/结束时,若其的体力值为全场最少或之一,你可以令其选择一项:①交给你一张手牌;②失去1点体力,进入<嫉恨>状态,直到下回合开始.',
						lg_shuiqiaopaluxi_zhenwang: '阵亡',
						lg_shuiqiaopaluxi_zhenwang_info: '',
						lg_duoluo: '堕落',
						lg_duoluo_info: '',
						lg_shuiqiaopaluxi0: ' ',
						lg_shuiqiaopaluxi0_info: '',
						lg_jihen: '嫉恨',
						lg_jihen_info: '',
						lg_choushicanbai: '丑时参拜',
						lg_choushicanbai_info: '',
						lg_tuzhan: '突斩',
						lg_tuzhan_info: '一名其他角色的判定牌生效后,若为♥️️,你可以对其视为使用一张【杀】.',
						lg_luenzhijian: '卢恩之剑',
						lg_luenzhijian_info: '当你使用的【杀】被【闪】响应后,若你的体力值不大于X,你可以对一名体力值为全场最多(或之一)的角色造成2点伤害.若如此做,其选择一项:①视为使用一张【杀】;②视为使用一张【决斗】(X为你区域内的♥️️牌数).',
						lg_kuqiulin_zhenwang: '阵亡',
						lg_kuqiulin_zhenwang_info: '',
						lg_hundun1: '混沌',
						lg_hundun1_info: '',
						lg_hundun: '混沌',
						lg_hundun_info: '',
						lg_fuhuazhiwu1: '腐化之雾',
						lg_fuhuazhiwu1_info: '当你受到伤害时,你可以令伤害来源依次弃置两张手牌.',
						lg_jing: '绯天·惊',
						lg_jing_info: '一名其他角色的横置状态变化后,若你处于横置状态,你可以对其造成1点伤害.',
						lg_luo: '绯天·落',
						lg_luo_info: '极刃技,一名其他角色使用【杀】指定你为目标时,你可以弃置两张牌,令其选择一项:①此【杀】造成的伤害值-1;②此【杀】结算后,你选择除其以外的一名角色对其使用一张【杀】.若其没有【杀】能使用,你获得一张【杀】.',
						lg_shewu: '绯天·蛇舞',
						lg_shewu_info: '混沌技,你的回合外,一名其他角色使用♦️️牌指定你为目标时,你可以将使用者与目标替换.若如此做,其使用♦️️牌指定你为目标时,额外结算一次,直到当前回合结束.',
						lg_luxueer_zhenwang: '阵亡',
						lg_luxueer_zhenwang_info: '',
						lg_jiren: '极刃',
						lg_jiren_info: '',
						lg_zhuiling: '坠灵',
						lg_zhuiling_info: '转换技:<br/> ❶一名其他角色使用♥️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值-1.<br/> ❷一名其他角色使用♠️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值+1.',
						lg_zhuiling1: '坠灵',
						lg_zhuiling1_info: '转换技:<br/> ❶一名其他角色使用♥️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值-1.<br/> ❷一名其他角色使用♠️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值+1.',
						lg_cuican: '摧残',
						lg_cuican_info: '',
						lg_anyouxinsheng: '暗由心生',
						lg_anyouxinsheng_info: '摧残技,出牌阶段结束时,若你此阶段内使用过的牌花色数:为1,你可以回复1点体力;为2,你可以令一名其他角色弃置两张♠️️牌;为3,你可以对一名其他角色造成1点伤害;为4,你可以令一名其他角色将手牌数补至体力上限.',
						lg_hundun_nuoya: ' ',
						lg_hundun_nuoya_info: '',
						lg_nuoya_zhenwang: '阵亡',
						lg_nuoya_zhenwang_info: '',
						lg_wujianhundun: '无间混沌',
						lg_wujianhundun_info: '混沌技,一名角色因弃置而失去♠️️牌后,你可以视为将一张♠️️【杀】置于牌堆顶.',
						lg_huanxiangdiesheng: '幻象迭生',
						lg_huanxiangdiesheng_info: '扭曲技,当你使用【杀】指定其他角色为目标时,你可以令其获得1枚<幻象>标记.若如此做,此【杀】对其无效,不计入使用的次数上限;一名其他角色受到伤害时,若其的区域内有♥️️牌.其弃置1枚<幻象>标记,随机弃置一张手牌,依次失去2点体力.若其的体力值等于X,伤害来源回复2点体力(X为伤害来源的♥️️手牌数).',
						lg_niuqu: '扭曲',
						lg_niuqu_info: '',
						lg_hundunchuyong: '混沌初拥',
						lg_hundunchuyong_info: '混沌技,当你解除濒死状态后,你可以与伤害来源交换位置.若攻击范围内有敌方角色,你随机获得这些角色的各一张手牌,对其各造成1点真实伤害.',
						lg_baiqiangweizhifa: '白蔷薇之罚',
						lg_baiqiangweizhifa_info: '每当你的体力值变化后,你可以展示并交给一名其他角色一张手牌.若如此做,其不能使用或打出以此法获得类别相同的牌,不能使用牌指定除你外的角色为目标,直到你下回合开始.若你的判定区内有牌,其进入<即死>状态.',
						lg_cuixue: '淬血',
						lg_cuixue_info: '',
						lg_baiqiangweizhilei: '白蔷薇之泪',
						lg_baiqiangweizhilei_info: '淬血技,出牌阶段结束时,当你在此阶段内使用过牌的点数为:严格递增,你可以令至多两名角色各摸一张牌;严格递减,你可以令至多两名角色各弃置两张牌.若上家区域内的♥️️牌数等于X,你可以对攻击范围内的一名其他角色视为使用一张【杀】(X为当前游戏轮数).',
						lg_nikesi_zhenwang: '阵亡',
						lg_nikesi_zhenwang_info: '',
						lg_baiqiangweizhilei1: '白蔷薇之泪 ',
						lg_baiqiangweizhilei1_info: '',
						lg_liangzizhongquan: '量子重拳',
						lg_liangzizhongquan_info: '混沌技,判定阶段开始时,你可以跳过此阶段.若如此做,你声明一张未以此法使用过的非伤害类牌,视为使用之.此牌结算后,你弃置X张手牌(X为你以此法使用牌指定的目标数).',
						lg_yunsui: '陨碎',
						lg_yunsui_info: '镜界技,出牌阶段结束时,若你此阶段内使用过牌的类别数等于X,你可以声明一张未使用过的基本牌或普通锦囊牌,视为你使用之.若以此法使用的为【杀】,你将手牌数补至Y(X为你上家的攻击范围;Y为你上家的基本牌数).',
						lg_weiouen_zhenwang: '阵亡',
						lg_weiouen_zhenwang_info: '',
						lg_yunsui1: '陨碎',
						lg_yunsui1_info: '',
						lg_shalubaochang: '杀戮报偿',
						lg_shalubaochang_info: '一名角色使用【杀】指定你为目标时,你可以获得1枚<杀戮>标记,摸两张牌;当你使用的【杀】被【闪】响应后,你可以将<杀戮>标记数调整至1枚,摸X张牌.若以此法失去的标记数不小于4,你执行一个额外的出牌阶段;你的手牌上限-Y(X为你以此法失去的<杀戮>标记数;Y为你的<杀戮>标记数).',
						lg_shengfeishizhui: '圣妃失坠',
						lg_shengfeishizhui_info: '心眼技,当你使用♥️️牌指定目标时,你可以展示其中任意名目标的各一张手牌.若以此法展示的牌为:黑色,其不能使用或打出手牌以响应之;红色,此牌对其造成的伤害值+X(X为你<杀戮>标记数的一半,向下取整).',
						lg_kelinxide_zhenwang: '阵亡',
						lg_kelinxide_zhenwang_info: '',
						lg_shouhufangzhen: '守护方阵',
						lg_shouhufangzhen_info: '出牌阶段限一次,若你的体力值等于X,你可以选择一名其他角色.若如此做,你与其各将一张随机宝物牌置入装备区,获得1点护甲(X为你的♦️️手牌数).',
						lg_shuoguang: '烁光',
						lg_shuoguang_info: '一名其他角色失去最后一张手牌时,若你没有手牌,你可以与其各摸两张牌.',
						lg_jinshu: '禁枢',
						lg_jinshu_info: '轮回技,当你使用一张♦️️牌结算后,你可以将此牌交给一名其他角色.',
						lg_amier_zhenwang: '阵亡',
						lg_amier_zhenwang_info: '',
						lg_lunhui: '轮回',
						lg_lunhui_info: '',
						lg_shiqikuangsan0: ' ',
						lg_shiqikuangsan0_info: '',
						lg_shiqikuangsan00: '食时之城 ',
						lg_shiqikuangsan00_info: '虚无技,一名其他角色的出牌阶段开始时,你可以令其摸一张牌,弃置两张♠️️牌.若如此做,其的出牌阶段结束时,若其此阶段内使用的♣️️牌数大于X,你对其视为使用一张【杀】(X为其的攻击范围).',
						lg_xuwu: '虚无',
						lg_xuwu_info: '',
						lg_shiqikuangsan000: ' ',
						lg_shiqikuangsan000_info: '',
						lg_yizhidan: '一之弹',
						lg_yizhidan_info: '当你使用【杀】指定其他角色为目标时,你可以展示其的一张手牌.若以此法展示牌的颜色:相同,此【杀】不能被【闪】响应;不相同,其从牌堆底摸一张牌,弃置以此法展示的手牌.',
						lg_yizhidan0: ' ',
						lg_yizhidan0_info: '',
						lg_shengfeishizhui1: ' ',
						lg_shengfeishizhui1_info: '',
						lg_erzhidan: '二之弹',
						lg_erzhidan_info: '一名角色的判定阶段开始时,你选择是否获得其一张手牌.若如此做,你可以弃置一张牌.若以此法弃置的牌为:♣️️,本回合其的摸牌阶段与出牌阶段调换;不为♣️️,本回合其的弃牌阶段与出牌阶段调换.',
						lg_erzhidan1: ' ',
						lg_erzhidan1_info: '',
						lg_sanzhidan: '三之弹',
						lg_sanzhidan_info: '当你使用【杀】造成伤害后,你可以选择一名体力值为全场最少(或之一)的角色.若如此做,其摸三张牌.',
						lg_sanzhidan1: ' ',
						lg_sanzhidan1_info: '',
						lg_sizhidan: '四之弹',
						lg_sizhidan_info: '一名其他角色使用牌指定你为目标时,你可以判定一次.若为♠️️,重置状态,此牌对你无效;若为♣️️,你执行一个额外的出牌阶段.',
						lg_sizhidan1: ' ',
						lg_sizhidan1_info: '',
						lg_wuzhidan: '五之弹',
						lg_wuzhidan_info: '一名角色的判定牌生效前,你可以展示牌堆顶的五张牌.若如此做,你可以选择是否打出其中一张♠️️牌代替之.若选择否,你可以获得其中一张♠️️牌.若如此做,将其余的牌置入弃牌堆.',
						lg_wuzhidan1: ' ',
						lg_wuzhidan1_info: '',
						lg_liuzhidan: '六之弹',
						lg_liuzhidan_info: '结束阶段开始时,你可以令下家摸X张牌,执行一个额外的出牌阶段(X为你本回合使用过的牌数).',
						lg_liuzhidan1: ' ',
						lg_liuzhidan1_info: '',
						lg_qizhidan: '七之弹',
						lg_qizhidan_info: '制裁技,当你受到伤害时,你可以令伤害来源弃置两张♠️️手牌.若如此做,其下回合开始时,翻面,结束回合.',
						lg_qizhidan1: ' ',
						lg_qizhidan1_info: '',
						lg_bazhidan: '八之弹',
						lg_bazhidan_info: '镜像技,一名其他角色使用♣️️牌指定你为目标时,你可以将使用者与目标替换.若如此做,你召唤三个<分身>.',
						lg_bazhidan2: '八之弹',
						lg_bazhidan2_info: '',
						lg_fenshen: ' ',
						lg_fenshen_info: '',
						lg_bazhidan1: ' ',
						lg_bazhidan1_info: '',
						lg_jiuzhidan: '九之弹',
						lg_jiuzhidan_info: '当你使用【杀】或普通锦囊牌指定唯一目标时,若你对其以外的角色使用过此类别的牌,你可以令此牌额外指定这些角色为目标.若如此做,直到你回复体力为止,每当其他角色因弃置而失去黑色牌后,你可以获得之.',
						lg_jiuzhidan1: ' ',
						lg_jiuzhidan1_info: '',
						lg_jiuzhidan2: ' ',
						lg_jiuzhidan2_info: '',
						lg_shizhidan: '十之弹',
						lg_shizhidan_info: '准备阶段开始时,若你最近获得过牌,你可以令一名其他角色获得你的当前手牌.若如此做,你获得X点护甲(X为其以此法获得的牌数).',
						lg_shizhidan1: ' ',
						lg_shizhidan1_info: '',
						lg_shiyizhidan: '十一之弹',
						lg_shiyizhidan_info: '一名角色受到伤害时,若当前回合角色不为伤害来源,你可以防止之.若如此做,你与其交换手牌,令伤害来源移出十轮游戏.',
						lg_shiyizhidan1: ' ',
						lg_shiyizhidan1_info: '',
						lg_shierzhidan: '十二之弹',
						lg_shierzhidan_info: '结束阶段开始时,你可以将场上的状态复原,执行一个额外的回合.若如此做,直到你额外回合结束,当你使用牌其他角色造成伤害时,若其在你的攻击范围,你可以观看其的随机三张手牌,使用其中一张与此牌类别相同的牌.此牌结算后,你执行一个额外的出牌阶段.',
						lg_shierzhidan0: ' ',
						lg_shierzhidan0_info: '',
						lg_shiqikuangsan_zhenwang: '阵亡',
						lg_shiqikuangsan_zhenwang_info: '',
						lg_shierzhidan1: '十二之弹',
						lg_shierzhidan1_info: '',
						lg_xuwu1: '虚无',
						lg_xuwu1_info: '',
						lg_jiuzhidan11: ' ',
						lg_jiuzhidan11_info: '',
						lg_kekedi: ' ',
						lg_kekedi_info: '',
						lg_shishizhicheng: ' ',
						lg_shishizhicheng_info: '',
						lg_shishizhicheng00: '食时之城',
						lg_shishizhicheng00_info: '',
						lg_buxiunuhuo: '不朽怒火',
						lg_buxiunuhuo_info: '虚实技,当你处于濒死状态时,你可以获得伤害来源的一张手牌.若以此法获得的牌为红色,你重复此流程.',
						lg_zengeqishi: '憎恶骑士之荣',
						lg_zengeqishi_info: '当你使用装备牌时,你可以判定一次.若为装备牌,你可以对攻击范围内的一名其他角色造成2点伤害;若不为装备牌,你摸X张牌(X为你的体力值与手牌数之差).',
						lg_kailan_zhenwang: '阵亡',
						lg_kailan_zhenwang_info: '',
						lg_chimizhinian: '痴迷执念',
						lg_chimizhinian_info: '限制技,当你成为【杀】的目标时,你可以弃置一张牌,令一名男性角色成为此牌的额外目标.',
						lg_zhimingchengfa: '致命惩罚',
						lg_zhimingchengfa_info: '每当你的体力值变化后,你可以获得一名角色的一张牌,对一名角色造成1点伤害.若你对以此法失去牌的其他角色造成伤害,你弃置两张牌.',
						lg_huilizi_zhenwang: '阵亡',
						lg_huilizi_zhenwang_info: '',
						lg_xixueguizhiye1: '吸血鬼之夜',
						lg_xixueguizhiye1_info: '出牌阶段限一次,你可以选择一名手牌数不等于体力值的角色.若其的手牌数大于体力值,你对其造成1点伤害;若其的手牌数小于体力值,你与其各将手牌数补至X(X为其的体力值).',
						lg_xixueguizhiye: ' ',
						lg_xixueguizhiye_info: '',
						lg_mingyun: '命运',
						lg_mingyun_info: '',
						lg_mingyun2: ' ',
						lg_mingyun2_info: '',
						lg_feisemingyun: '绯色命运',
						lg_feisemingyun_info: '命运技,一名角色跳过摸牌/出牌阶段后,你可以交给一名其他角色所有手牌.若如此做,你选择一项:①其交给你所有♥️️手牌;②其交给你所有♦️️手牌.',
						lg_leimiliya_zhenwang: '阵亡',
						lg_leimiliya_zhenwang_info: '',
						lg_leimiliya0: ' ',
						lg_leimiliya0_info: '',
						lg_wuxinposui: '吾心破碎',
						lg_wuxinposui_info: '',
						lg_feisemingjie: '绯色冥界',
						lg_feisemingjie_info: '',
						lg_feisemingjie1: ' ',
						lg_feisemingjie1_info: '',
						lg_feisemingjie2: ' ',
						lg_feisemingjie2_info: '',
						lg_jianxinkuxiu1: '坚心苦修',
						lg_jianxinkuxiu1_info: '转换技:<br/> ❶当你受到伤害时,你可以获得伤害来源装备区内的一张牌且展示之.若如此做,其展示并重铸与此牌点数均不同的牌.若你判定区内的牌数:大于其,你可以弃置两张♠️️牌;小于其,其废除防具栏.<br/> ❷一名角色使用♠️️牌造成伤害时,你可以令其选择攻击范围内的至多三名其他角色.若如此做,这些角色各获得X点护甲(X为其装备区内的♠️️牌数).',
						lg_jianxinkuxiu: '坚心苦修',
						lg_jianxinkuxiu_info: '转换技:<br/> ❶当你受到伤害时,你可以获得伤害来源装备区内的一张牌且展示之.若如此做,其展示并重铸与此牌点数均不同的牌.若你判定区内的牌数:大于其,你可以弃置两张♠️️牌;小于其,其废除防具栏.<br/> ❷一名角色使用♠️️牌造成伤害时,你可以令其选择攻击范围内的至多三名其他角色.若如此做,这些角色各获得X点护甲(X为其装备区内的♠️️牌数).',
						lg_pijingzhanji: '披荆斩棘',
						lg_pijingzhanji_info: '律法技,准备阶段开始时,你可以将其他角色场上的判定牌均移至你的判定区.',
						lg_lvfa1: '律法',
						lg_lvfa1_info: '',
						lg_lvfa: '律法',
						lg_lvfa_info: '',
						lg_chizui_zhenwang: '阵亡',
						lg_chizui_zhenwang_info: '',
						lg_xingxiang: '行相',
						lg_xingxiang_info: '元素技,当你使用【杀】指定目标时,你可以展示牌堆顶的X张牌.若如此做,你可以使用其中一张牌.若以此法使用牌指定目标,你可以令目标各获得其中一张牌.此牌结算后,你可以重复此流程.若展示的牌没有被其他角色均获得,你摸一张牌(X为你的攻击范围).',
						lg_caoyuansu: '草',
						lg_caoyuansu_info: '',
						lg_suowenbianji: '所闻遍计',
						lg_suowenbianji_info: '学识技,结束阶段开始时,若你本回合造成过伤害,你可以观看牌堆顶的七张牌,将其中以任意顺序置于牌堆顶/底;若你本回合未造成过伤害,你将手牌数调整至X(X为你的体力值与攻击范围之和).',
						lg_xinjinghuancheng: '心景幻成',
						lg_xinjinghuancheng_info: '领域技,当你使用普通锦囊牌指定唯一目标时,若此牌被【无懈可击】响应,你可以将此牌交给另一名其他角色.若如此做,直到你下回合结束,你随机解锁一个<摩耶之殿>领域.<br/><br/>摩耶之殿·火元素:<br/> 当你使用【杀】指定其他角色为目标时,你可以对其中一个目标造成1点火焰伤害.若此【杀】造成伤害,你随机弃置一张手牌.<br/><br/> 摩耶之殿·雷元素:<br/> 一名角色受到伤害时,你可以弃置其一张手牌.若以此法弃置手牌的为你,你将手牌数补至X(X为你的体力值与攻击范围之和).<br/><br/> 摩耶之殿·水元素:<br/> 当你对其他角色造成伤害时,你可以令其摸一张牌.若其的手牌数小于你,你弃置其两张牌.',
						lg_naxida_zhenwang: '阵亡',
						lg_naxida_zhenwang_info: '',
						lg_xinjinghuancheng11: ' ',
						lg_xinjinghuancheng11_info: '',
						lg_xinjinghuancheng1: '心景幻成',
						lg_xinjinghuancheng1_info: '',
						lg_xinjinghuancheng2: '心景幻成',
						lg_xinjinghuancheng2_info: '',
						lg_xinjinghuancheng3: '心景幻成',
						lg_xinjinghuancheng3_info: '',
						lg_shenlizhiyuyin: '神篱之御荫',
						lg_shenlizhiyuyin_info: '元素技,当你受到伤害/失去体力时,你可以令手牌数不小于你的其他角色各选择是否令你回复1点体力.若如此做,你可以对一名手牌数大于你的其他角色造成1点雷电伤害.此伤害结算后,你可以令一名手牌数等于你的角色进入<绯樱>状态,直到下回合结束.',
						lg_feiying: '绯樱',
						lg_feiying_info: '',
						lg_shashengying: '野干役咒·杀生樱',
						lg_shashengying_info: '轮回技,当你弃置一名其他角色的牌时,你可以选择一项:①获得一名手牌数大于你的其他角色的一张手牌;②令一名手牌数小于你的其他角色展示所有手牌.若其的手牌数等于体力值,你的下家随机弃置三张手牌.',
						lg_tianhuxianzhen: '大密法·天狐显真',
						lg_tianhuxianzhen_info: '秘法技,出牌阶段限一次,你可以令其他角色各选择是否交给你一张牌.若其选择是,你可以令其选择一项:①摸两张牌;②回复1点体力.若其选择否,其标记为<猎物>,直到你回合结束.若如此做,当你本回合首次对<猎物>造成伤害时,此伤害值+X(X为你场上的♦️️牌数).',
						lg_mifa: '秘法',
						lg_mifa_info: '',
						lg_bachongshenzi_zhenwang: '阵亡',
						lg_bachongshenzi_zhenwang_info: '',
						lg_pomochenghua: '泼墨成画',
						lg_pomochenghua_info: '潜伏技,当你登场后,你可以移动场上的一张装备牌.若如此做,以此法失去装备牌的角色对以此法置入装备牌的视为使用一张【杀】;当你成为♠️️牌的唯一目标时,你可以弃置一张基本牌,摸两张牌.',
						lg_pomochenghua1: '泼墨成画',
						lg_pomochenghua1_info: '',
						lg_fuyue: '富岳三十六景',
						lg_fuyue_info: '伪装技,一名其他角色的出牌阶段,当其使用【杀】使用目标时,你可以弃置装备区内的一张牌.若以此法弃置的牌为:♣️️,你可以令此【杀】额外指定一个目标;♠️️,此【杀】不计入次数上限.若你的攻击范围等于X,你可以令至多四名角色各摸一张牌,这些角色不能使用或打出手牌,直到当前回合结束(X为你的黑色手牌数).',
						lg_fuyue0: '富岳三十六景',
						lg_fuyue0_info: '',
						lg_geshibeizhai_zhenwang: '阵亡',
						lg_geshibeizhai_zhenwang_info: '',
						lg_xushuhuan: '虚数环',
						lg_xushuhuan_info: '拟似技,当你使用牌指定其他角色为唯一目标时,你可以获得其X张手牌.若这些牌有包含你使用的花色,你随机弃置区域内的三张牌(X为其手牌数的一半,且向上取整).',
						lg_xushu: '拟似',
						lg_xushu_info: '',
						lg_xushumoshu: '虚数魔术',
						lg_xushumoshu_info: '降临技:<br/> ❶一名其他角色使用♦️️牌指定唯一目标结算后,你可以令其获得一枚<虚数>标记;当你成为其他角色使用的♣️️牌目标时,若其有<虚数>标记,你可以令其弃置一枚<虚数>标记.若如此做,你对视为使用一张【杀】.<br/> ❷一名其他角色使用♣️️牌指定唯一目标结算后,你可以令其获得一枚<虚数>标记;当你成为其他角色使用的♦️️牌目标时,若其有<虚数>标记,你可以令其弃置一枚<虚数>标记.若如此做,你对视为使用一张【魔术吸收】.',
						lg_xushumoshu1: '虚数魔术',
						lg_xushumoshu1_info: '',
						lg_moshuxishou1: ' ',
						lg_moshuxishou1_info: '',
						lg_moshuxishou2: '魔术吸收',
						lg_moshuxishou2_info: '',
						lg_zhenwang_jiantongying: '阵亡',
						lg_zhenwang_jiantongying_info: '',
						lg_beicanmingyun: '悲惨的命运',
						lg_beicanmingyun_info: '反制技,当你使用♣️️牌指定其他角色为唯一目标时,你可以弃置至少四张手牌.若如此做,其弃置等量的牌.若其没有手牌,此牌对其无效.',
						lg_cishizhie: '此世之恶的诞生',
						lg_cishizhie_info: '限定技,一名其他角色使用普通锦囊牌结算后,若此牌为♣️️且没有造成伤害.你可以获得之,其翻面.若如此做,你指定一种花色,除你以外的角色不能使用或打出此花色的牌.',
						lg_cishizhie1: '此世之恶的诞生',
						lg_cishizhie1_info: '',
						lg_jiantongying1_zhenwang: '阵亡',
						lg_jiantongying1_zhenwang_info: '',
						lg_xuancaizhixu: '炫彩之绪',
						lg_xuancaizhixu_info: '音律技,摸牌阶段开始时,你可以跳过此阶段,令一名其他角色回复2点体力.若其的手牌数等于你,其随机获得一张点数为1的牌.',
						lg_shensuitiankong: '深邃的天空',
						lg_shensuitiankong_info: '每回合限一次,当你使用普通锦囊牌指定目标时,你可以选择一项:①令此牌额外指定至多X个目标;②令此牌减少至多X个目标.若你的手牌数为全场最多或之一,你执行一个额外的摸牌阶段(X为你已损失的体力值,且至少为1).',
						lg_shinaikong_zhenwang: '阵亡',
						lg_shinaikong_zhenwang_info: '',
						lg_shimeng: '噬梦',
						lg_shimeng_info: '当你对其他角色造成伤害后,你可以将手牌数调整至X,若你因此失去手牌,你可以令其随机废除一个装备栏;当你受到伤害后,你可以将手牌数调整至Y,若你因此失去手牌,你可以令伤害来源随机废除一个装备栏(X为你的体力值;Y为你已损失的体力值).',
						lg_zuimian: '罪冕',
						lg_zuimian_info: '当你对其他角色造成伤害后,你可以令其展示并弃置其中的非♥️️手牌.若其没有非♥️️手牌,你随机废除一个装备栏;当你受到伤害后,你可以令伤害来源展示并弃置其中的♥️️手牌.若其没有♥️️手牌,你随机废除一个装备栏.',
						lg_canhuncaozong: '残魂操纵',
						lg_canhuncaozong_info: '混沌技,当你需要使用或打出一张【杀】时,你可以将一名其他角色的一张手牌代替之.若以此法未造成伤害,你失去1点体力.',
						lg_lalaiye_zhenwang: '阵亡',
						lg_lalaiye_zhenwang_info: '',
						lg_xiemozhizhui: '邪魔之坠',
						lg_xiemozhizhui_info: '逆袭技,当你受到不为【杀】造成的伤害时,你可以防止之.若如此做,伤害来源失去1点体力,视为依次使用X张【决斗】(X为你受到的伤害值).',
						lg_nixi: '逆袭',
						lg_nixi_info: '',
						lg_pannizhe: '叛逆者的怒火',
						lg_pannizhe_info: '混沌技,一名角色处于濒死状态时,你可以选择一种花色,令一名其他角色判定一次.其获得以此法判定的牌,若此牌花色与你选择的不同,你对其造成X点伤害(X为其体力值的一半,向上取整).',
						lg_guxing_zhenwang: '阵亡',
						lg_guxing_zhenwang_info: '',
						lg_huangshi: '皇室',
						lg_huangshi_info: '',
						lg_huangshizhanji: '皇室斩击',
						lg_huangshizhanji_info: '皇室技,当你对其他角色造成伤害时,你可以与其进行拼点.若你赢,你弃置其区域内的一张牌.',
						lg_fantuanshijian: '饭团时间',
						lg_fantuanshijian_info: '锁定技,当你的判定牌生效前,若你的手牌数不等于体力值,你回复1点体力.',
						lg_gongzhutuxi: '公主突袭',
						lg_gongzhutuxi_info: '专精技,出牌阶段结束时,若你的体力值为全场最多或之一,你可以选择一名此阶段内未受到过伤害的其他角色.若如此做,你对其造成X点伤害(X为此阶段你对其使用过的牌数).',
						lg_peikelimu_zhenwang: '阵亡',
						lg_peikelimu_zhenwang_info: '',
						lg_heiying: '黑影',
						lg_heiying_info: '虚实技,当你某个区域内的牌因弃置而失去后,你可以令至多X名其他角色各将对应区域内的一张牌置于牌堆顶.若如此做,你可以翻面.若因此翻至正面,你随机弃置一张牌;若因此翻至背面,你将手牌数补至Y(X为你失去的牌数;Y为当前游戏轮数).',
						lg_heiying1: '黑影',
						lg_heiying1_info: '',
						lg_molitunshi: '魔力吞噬',
						lg_molitunshi_info: '堕落技,一名其他角色的出牌阶段开始时,你可以与其进行拼点.若你没赢,其摸一张牌,你可以用其本次拼点的牌重复此流程.',
						lg_jiantongying2_nei: ' ',
						lg_jiantongying2_nei_info: '',
						lg_jiantongying2_zhenwang: '阵亡',
						lg_jiantongying2_zhenwang_info: '',
						lg_xushukongjian: '虚数空间',
						lg_xushukongjian_info: '内奸技,出牌阶段限一次,你可以与一名其他角色各展示一张手牌.若以此法展示的牌花色:均相同,其失去1点体力;均不相同,其选择一项:①弃置两张牌;②令你摸一张牌.',
						lg_yuwen: '余温',
						lg_yuwen_info: '出牌阶段限一次,你可以将一张♣️️牌当【桃】使用.',
						lg_menghuanzhiyu: '梦幻治愈',
						lg_menghuanzhiyu_info: '准备阶段开始时,你可以获得任意名其他角色区域内的各一张牌,弃置等量的牌.若以此法获得的牌数等于X,你回复1点体力(X为你的体力值).',
						lg_baonue: '暴虐',
						lg_baonue_info: '',
						lg_shensheng: '神圣',
						lg_shensheng_info: '',
						lg_shangyu: '伤愈',
						lg_shangyu_info: '当你从牌堆摸牌时,若你的体力值等于X,你可以展示牌堆顶的四张牌.若如此做,你可以获得其中的基本牌(X为你的攻击范围).',
						lg_menglong: '朦胧',
						lg_menglong_info: '当你回复体力时,你可以与一名其他角色交换任意张手牌.',
						lg_suixiang: '随想',
						lg_suixiang_info: '余响技,一名角色的回合开始时,若其的装备区内没有武器牌,你可以随机弃置一张手牌.若如此做,选择任意一张武器牌,其视为使用之.',
						lg_yuxiang1: '余响',
						lg_yuxiang1_info: '',
						lg_zhenwang_kana: '阵亡',
						lg_zhenwang_kana_info: '',
						lg_suixiang0: ' ',
						lg_suixiang0_info: '',
						lg_zhuanshunjishi: '转瞬即逝',
						lg_zhuanshunjishi_info: '当你使用【杀】指定目标时,你可以翻面.若如此做,你获得至多三名其他角色的各一张手牌,将三张手牌置于牌堆顶.',
						lg_diaoling: '凋零',
						lg_diaoling_info: '一名其他角色使用牌指定目标时,若不为唯一目标,你可以将手牌数补至X,选择一个装备栏废除.若以此法获得的牌数大于Y,你失去1点体力(X为此牌指定的目标数;Y为你的体力值).',
						lg_xilide_zhenwang: '阵亡',
						lg_xilide_zhenwang_info: '',
						lg_linliezhihui: '凛冽之辉',
						lg_linliezhihui_info: '一名角色使用牌指定目标时,若目标在你的攻击范围,你可以交给其一张牌.若其以此法获得牌的颜色与指定牌相同,此牌使用者弃置两张手牌,你回复1点体力.',
						lg_yuexiahuanhun: '月下还魂',
						lg_yuexiahuanhun_info: '灾变技,当你对其他角色造成伤害时,你可以弃置其区域内的各一张牌.若如此做,你可以展示所有手牌,摸X张牌(X为你没有的花色牌数).',
						lg_zaibian: '灾变',
						lg_zaibian_info: '',
						lg_yuexiahuanhun1: '月下还魂',
						lg_yuexiahuanhun1_info: '',
						lg_keer_zhenwang: '阵亡',
						lg_keer_zhenwang_info: '',
						lg_jielika_zhenwang: '阵亡',
						lg_jielika_zhenwang_info: '',
						lg_yuanshengxing: '源生·星',
						lg_yuanshengxing_info: '当你造成属性伤害时,你可以弃置一张♦️️手牌.若如此做,此伤害值+1.',
						lg_yuanshengye: '源生·夜',
						lg_yuanshengye_info: '当你造成属性伤害时,你可以弃置一张♣️️手牌.若如此做,此伤害值-1.',
						lg_xingyetonggu: '星夜同孤',
						lg_xingyetonggu_info: '锁定技,当你对其他角色造成伤害时,若其处于<横置>状态,你摸两张牌;若其被翻面,此伤害值+1;若其的装备区内有牌,你获得其区域内的一张牌.',
						lg_yipusi_zhenwang: '阵亡',
						lg_yipusi_zhenwang_info: '',
						lg_chunjingqingyu: '纯净轻语',
						lg_chunjingqingyu_info: '弃牌阶段结束时,若你在此阶段内弃置牌,你可以获得至多X名其他角色区域内的各一张牌(X为你在此阶段内弃置的牌数).',
						lg_zhuguang: '烛光',
						lg_zhuguang_info: '每回合限一次,当你回复/失去体力时,你可以弃置一张牌,判定一次.若为♥️️,你回复1点体力,摸一张牌;若为♦️️,你摸三张牌;若为♠️️,将你场上的牌均置入手牌区,横置;若为♣️️,将你场上的牌均置入弃牌堆,回复2点体力.',
						lg_shangyuanyounai_zhenwang: '阵亡',
						lg_shangyuanyounai_zhenwang_info: '',
						lg_chunjingqingyu1: '纯净轻语',
						lg_chunjingqingyu1_info: '弃牌阶段结束时,若你在此阶段内弃置牌,你可以获得至多X名其他角色区域内的各一张牌(X为你在此阶段内弃置的牌数).',
						lg_dichui: '低垂',
						lg_dichui_info: '锁定技,一名角色回复体力时,若你的手牌数为全场唯一最多,你摸一张牌.',
						lg_youqu: '幽曲',
						lg_youqu_info: '隐匿技,当你登场后,你可以摸两张牌.若以此法获得牌的颜色均不同,你的上家失去1点体力.',
						lg_luofangtianhua: '落芳天华',
						lg_luofangtianhua_info: '闪耀技,当你受到伤害时,你可以令伤害来源选择是否弃置你区域内的一张牌.若其选择是,你与其各随机弃置一张牌.',
						lg_shengjieliaoluan: '圣洁缭乱之奏',
						lg_shengjieliaoluan_info: '神圣技,一名其他角色使用装备牌后,若其装备区内的牌数大/小于你,你可以令其依次弃置/摸三张牌.若如此做,你随机获得一张基本牌,重置状态;一名其他角色失去装备区的牌后,若其装备区内的牌数大/小于你,你可以令其回复/失去1点体力.若如此做,其进入<失神>状态,直到横置变化为止.',
						lg_shishen: '失神',
						lg_shishen_info: '',
						lg_zhu_xilide: ' ',
						lg_zhu_xilide_info: '',
						lg_xilide1_zhenwang: '阵亡',
						lg_xilide1_zhenwang_info: '',
						lg_fanxingwanxiang: '繁星万象之诗',
						lg_fanxingwanxiang_info: '主公技,当你因弃置而失去牌时,你可以获得一名其他角色区域内的一张牌;当你解除濒死状态后,距离1以内的角色各摸一张牌.',
						lg_shengjieliaoluan1: ' ',
						lg_shengjieliaoluan1_info: '',
						lg_xukong0: '虚空',
						lg_xukong0_info: '',
						lg_xukong: '虚空',
						lg_xukong_info: '',
						lg_fuxian: '浮现',
						lg_fuxian_info: '虚空技,当你使用【杀】造成伤害后,你可以弃置一张普通锦囊牌,获得此【杀】目标的一张手牌.',
						lg_zisuiwuji: '恣睢无忌',
						lg_zisuiwuji_info: '出牌阶段限一次,你可以选择一项:①令手牌数为全场最多的一名角色调整至全场最少;②令手牌数为全场最少的一名角色调整至全场最多.若你的手牌数为全场最多或之一,你将手牌数补至X(X为场上的势力数).',
						lg_zisuiwuji1: ' ',
						lg_zisuiwuji1_info: '',
						lg_hetiya_zhenwang: '阵亡',
						lg_hetiya_zhenwang_info: '',
						lg_xinlingqinzhan: '心灵侵占',
						lg_xinlingqinzhan_info: '指令技,一名其他角色回复/失去体力后,你可以交给其任意张手牌.若其以此法获得的牌数不小于2,其可以选择是否令你摸两张牌.若你的体力值小于手牌数,你摸X张牌,回复Y点体力(X为你的体力值;Y为你的♠️️手牌数).',
						lg_zhiling: '指令',
						lg_zhiling_info: '',
						lg_beilusi_zhenwang: '阵亡',
						lg_beilusi_zhenwang_info: '',
						lg_xinlingqinzhan1: ' ',
						lg_xinlingqinzhan1_info: '',
						lg_chaoliangqidian: '超量奇点',
						lg_chaoliangqidian_info: '扭曲技,你的回合外,当你造成伤害时,若你的手牌数大于X,此伤害值+1(X为你的体力上限).',
						lg_xinghexunhang: '推进·星河巡航',
						lg_xinghexunhang_info: '专精技,当你处于濒死状态时,你可以将手牌数补至X.若如此做,你可以弃置Y张手牌,对伤害来源造成等量的伤害(X为伤害来源的体力值;Y为伤害来源的攻击范围).',
						lg_suyuan: '溯源',
						lg_suyuan_info: '',
						lg_shikongyueqian: '重组·时空跃迁',
						lg_shikongyueqian_info: '溯源技,当牌堆中的武器牌数变化后,你可以摸一张牌,回复1点体力.当弃牌堆中的武器牌数变化后,你可以弃置一名其他角色的一张牌;你计算与其他角色的距离时-X;其他角色计算与你的距离时+X(X为牌堆中的武器牌数;Y为弃牌堆中的武器牌数).',
						lg_mishujiguan: '秘术机关',
						lg_mishujiguan_info: '出牌阶段,若你的手牌数大于体力值,你可以弃置一张手牌,令一名角色判定一次.若为红色,其获得1点护甲;若为黑色,其随机获得一张装备牌.',
						lg_shikongjiexian: '跨时空界限',
						lg_shikongjiexian_info: '溯源技,一名其他角色对你使用基本牌结算后,你可以随机弃置区域内的一张牌,获得之;你使用的♠️️牌没有距离限制.',
						lg_pulan_zhenwang: '阵亡',
						lg_pulan_zhenwang_info: '',
						lg_sisha: '邪翼·厮杀',
						lg_sisha_info: '暴虐技,若你的体力值为全场最少或之一,你使用的牌没有距离限制;若你的手牌数为全场最少或之一,你使用的牌没有次数限制.',
						lg_moshenchengjie: '邪翼·魔神惩戒',
						lg_moshenchengjie_info: '虚空技,当你的体力值变化后,你可以将牌堆顶的X张牌移出游戏.若如此做,直到有角色失去体力为止,当你使用牌结算后,你可以获得因此移出游戏的一张牌.若其余牌的两种颜色:均不相同,你摸两张牌;均相同,你与上家交换手牌(X为你上家区域内的红色牌数).',
						lg_qianliuyi_zhenwang: '阵亡',
						lg_qianliuyi_zhenwang_info: '',
						lg_lunmubianyu: '魔神·轮墓边狱',
						lg_lunmubianyu_info: '指令技,一名其他角色使用基本牌/普通锦囊牌指定你为目标时,你可以令其选择是否对你使用一张【杀】.若其选择否,你翻面,此牌对你无效;你的手牌上限-X(X为你成为过基本牌或普通锦囊牌的次数).',
						lg_lunmubianyu1: ' ',
						lg_lunmubianyu1_info: '',
						lg_shenyuanzhitong: '魔神·深渊之瞳',
						lg_shenyuanzhitong_info: '灾变技,一名角色使用牌对其中一个目标结算后,若其不为唯一目标.你可以展示所有手牌,令此牌对其余未结算的目标均无效.',
						lg_qianliuyi1_zhenwang: '阵亡',
						lg_qianliuyi1_zhenwang_info: '',
						lg_aoshagong: '鏖杀公',
						lg_aoshagong_info: '出牌阶段限一次,你可以令一名其他角色选择一项:①令你对其视为使用一张普通锦囊牌;②令你对其视为使用一张【杀】.若以此法使用【杀】对其造成伤害,你随机获得一张♦️️牌,重置此技能.',
						lg_zuihouzhijian: '最后之剑',
						lg_zuihouzhijian_info: '摧残技,当你使用的【杀】被【闪】响应后,你可以弃置一名角色的一张手牌.若以此法弃置的牌为【杀】,你可以使用之.',
						lg_shixiang_zhenwang: '阵亡',
						lg_shixiang_zhenwang_info: '',
						lg_molangzhiyin: '魔狼之印',
						lg_molangzhiyin_info: '当你使用【杀】结算后,你可以随机对另一名敌方角色视为使用一张【杀】.',
						lg_xiansuo: '线索',
						lg_xiansuo_info: '',
						lg_baliushu: '巴流术',
						lg_baliushu_info: '线索技,当你的体力值变化后,你可以令一名其他角色猜测你的手牌中是否有【闪】.若其猜对,你执行一个额外的回合;若其没猜对,其弃置两张手牌.',
						lg_jiashetuilun: '假设推论',
						lg_jiashetuilun_info: '出牌阶段限一次,你可以指定攻击范围内的一名其他角色的随机一张手牌,猜测这张手牌的花色.若你猜对,你获得之,选择是否将此牌改为任意一张普通锦囊牌;若你没猜对,你摸一张牌.',
						lg_zhenxiangjielu: '真相揭露',
						lg_zhenxiangjielu_info: '出牌阶段限一次,你可以令一名其他角色猜测你一张手牌的类别,猜测流程结算后,其获得之.若其猜对,你与其交换手牌;若其没猜对,你对其造成2点真实伤害.',
						lg_shushouwuce: '常识·束手无策',
						lg_shushouwuce_info: '虚实技,摸牌/出牌阶段开始时,你可以跳过此阶段.展示牌堆顶的X张牌,使用其中的牌,获得其中不能使用的牌.若你的手牌数等于Y,你进入<推论>状态,直到下回合开始(X为你发动此技能的次数;Y为你的攻击范围).',
						lg_fuermosi_zhenwang: '阵亡',
						lg_fuermosi_zhenwang_info: '',
						lg_tuilun: '推论',
						lg_tuilun_info: '',
						lg_bingruo: '病弱',
						lg_bingruo_info: '锁定技,当你使用牌对目标造成伤害时,若其的装备区内有宝物牌,此伤害值-1.',
						lg_juedao: '绝刀',
						lg_juedao_info: '心眼技,一名角色的回合内,当其使用【杀】造成伤害后,你可以与其各弃置一张装备牌,摸一张牌.若如此做,当前回合结束.',
						lg_wumingsanduantu: '无明三段突',
						lg_wumingsanduantu_info: '每回合限一次,当你使用【杀】指定目标时,你可以选择至多三张手牌,弃置一张♣️️牌.若以此法选择的有:♣️️牌,此【杀】造成的伤害值+X;♥️️牌,此【杀】无距离限制,你可以额外指定1个目标;武器牌,你获得这些牌的效果,直到此【杀】结算为止(X为你以此法选择的♣️️牌数).',
						lg_chongtianzongsi_zhenwang: '阵亡',
						lg_chongtianzongsi_zhenwang_info: '',
						lg_yuxia: '后悔打开的玉匣',
						lg_yuxia_info: '结界技,当你使用伤害类的牌指定目标时,你可以将此牌的伤害来源替换为一名其他角色.此牌结算后,你的下家将手牌数补至X,伤害来源弃置Y张手牌(X为你的攻击范围;Y为此牌造成的伤害值).',
						lg_mengjingyuxianshi: '梦境与现实的诅咒',
						lg_mengjingyuxianshi_info: '虚实技,出牌阶段,你可以将X张牌当一张【杀】使用(不计入次数限制).若如此做,你可以弃置其中一个目标区域内的各一张牌,令其获得此【杀】对应的实体牌.若你的手牌数为全场最多或之一,你的下家翻面,随机弃置区域内的一张牌(X为你发动此技能的次数).',
						lg_guangmingyuheian: '光明与黑暗的网孔',
						lg_guangmingyuheian_info: '潜伏技,一名其他角色使用牌指定你为唯一目标时,你可以令此牌对你无效.若如此做,直到你因弃置而失去牌时,这些角色对你使用以此法被无效的牌.',
						lg_jiejie: '结界',
						lg_jiejie_info: '',
						lg_zhiqiuyuquqiu: '直球与曲球的梦乡',
						lg_zhiqiuyuquqiu_info: '幻象技,当你使用【杀】造成伤害后,你可以展示牌堆顶的一张牌.若如此做,你可以弃置场上与此牌相同花色的一张牌;当你使用的【杀】被【闪】响应后,你可以展示牌堆顶的一张牌.若如此做,你可以弃置场上与此牌相同颜色的一张牌.',
						lg_zhiqiuyuquqiu1: '直球与曲球的梦乡',
						lg_zhiqiuyuquqiu1_info: '',
						lg_huanxiang: '幻象',
						lg_huanxiang_info: '',
						lg_bayunzi_zhenwang: '阵亡',
						lg_bayunzi_zhenwang_info: '',
						lg_bayunzi0: ' ',
						lg_bayunzi0_info: '',
						lg_boyuli: '波与粒的境界',
						lg_boyuli_info: '',
						lg_boyuli2: ' ',
						lg_boyuli2_info: '',
						lg_boyuli1: ' ',
						lg_boyuli1_info: '',
						lg_zuishengzhimeng: '醉生之梦',
						lg_zuishengzhimeng_info: '结束阶段开始时,若你本回合连续使用过相同名称的基本牌,你可以弃置一张手牌,令一名角色摸三张牌.',
						lg_shehua: '奢华',
						lg_shehua_info: '出牌阶段,你可以弃置任意张牌,令一名其他角色弃置等量的牌.若你以此法弃置的红色牌数最多,其摸一张牌;若其以此法弃置的红色牌数最多,你摸一张牌.',
						lg_nailin_zhenwang: '阵亡',
						lg_nailin_zhenwang_info: '',
						lg_qiangzhiqingjie: '强制清洁',
						lg_qiangzhiqingjie_info: '沉默技,一名角色对你造成伤害时,你可以与其交换手牌.',
						lg_wuyu: '无欲',
						lg_wuyu_info: '限定技,一名其他角色使用牌指定目标时,你可以弃置一张与此牌类别相同的牌.若如此做,其弃置三张手牌,你可以弃置等量的牌,此牌对其无效.',
						lg_miyu: '蜜语',
						lg_miyu_info: '限定技,一名角色回复体力时,你可以弃置任意张♣️️牌.若如此做,此回复值+X,你与其各摸Y张牌(X为你以此法弃置的♣️️牌数;Y为其回复的体力值).',
						lg_zhelinai_zhenwang: '阵亡',
						lg_zhelinai_zhenwang_info: '',
						lg_miyu1: ' ',
						lg_miyu1_info: '',
						lg_zhuorelinghun: '灼热灵魂',
						lg_zhuorelinghun_info: '一名角色的体力值变化后,若其的体力值大于你,你可以令其视为使用一张随机装备牌.',
						lg_gaoguihongyan: '高贵红炎',
						lg_gaoguihongyan_info: '当你使用的【杀】被【闪】响应后,你可以令一名其他角色摸一张牌.若其的手牌数大于体力值,你摸X张牌;若你的手牌数大于体力值,你对其造成2点火焰伤害(X为其的手牌数与体力值之差).',
						lg_qiunai_zhenwang: '阵亡',
						lg_qiunai_zhenwang_info: '',
						lg_xinyue: '新月',
						lg_xinyue_info: '你的回合外,当你使用或打出一张♥️️牌后,你可以获得一名其他角色的一张牌.',
						lg_xianyue: '弦月',
						lg_xianyue_info: '当你使用【杀】对目标造成伤害后,你可以弃置两张红色牌,对其造成1点真实伤害.',
						lg_manyue: '满月',
						lg_manyue_info: '一名其他角色使用♥️️锦囊牌指定目标时,你可以令其判定一次.若为红色,此牌对其无效,其距离1以内的角色各随机弃置一张手牌.',
						lg_helage_zhenwang: '阵亡',
						lg_helage_zhenwang_info: '',
						lg_gaoxiaochongji: '高效冲击',
						lg_gaoxiaochongji_info: '出牌阶段限一次,你可以将一名角色场上的一张牌当【杀】对其使用.若你的♦️️手牌数等于X,你选择一个装备栏回复(X为你的攻击范围).',
						lg_bitanglianfa: '闭膛连发',
						lg_bitanglianfa_info: '出牌阶段,当你需要使用一张【杀】时,你可以选择一个装备栏废除,视为使用之.若你的♦️️手牌数大于X,你摸Y张牌;若你的装备区内没有牌,你使用【杀】没有距离限制(X为你的攻击范围;Y为你的手牌数与攻击范围之差).',
						lg_fengdi_zhenwang: '阵亡',
						lg_fengdi_zhenwang_info: '',
						lg_pozhanbaichu: '破绽百出',
						lg_pozhanbaichu_info: '锁定技,一名其他角色使用【杀】或【决斗】指定你为目标时,其随机弃置一张手牌.',
						lg_xunci: '迅刺',
						lg_xunci_info: '专精技,一名其他角色使用的【杀】被【闪】响应后,你可以对其视为使用一张【杀】或【决斗】.',
						lg_jinbenshun_zhenwang: '阵亡',
						lg_jinbenshun_zhenwang_info: '',
						lg_huanjing: '幻境',
						lg_huanjing_info: '',
					},
					skill: {
						lg_huishou: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							discard: false,
							prepare(cards, player, targets) {
								player.$give(cards, targets[0], false);
							},
							filter(event, player) {
								return player.countCards('e', { type: 'equip' }) > 0;
							},
							filterCard(card) {
								return get.type(card) == 'equip';
							},
							check(card) {
								var player = _status.currentPhase;
								if (player.countCards('he', { subtype: get.subtype(card) }) > 1) {
									return 11 - get.equipValue(card);
								}
								return 6 - get.value(card);
							},
							filterTarget(card, player, target) {
								return player != target && !target.getEquip(card);
							},
							content() {
								target.equip(cards[0]);
								target.recover();
								if (target.hp == target.countCards('e')) player.chooseUseTarget('指定目标', false, { name: 'lg_duanshe' });
							},
							ai: {
								order: 7,
								result: {
									target(player, target) {
										if (target.hp >= 2 && get.attitude(player, target) > 0) return 1;
										return -1;
									},
								},
							},
						},
						lg_duanshe1: {
							trigger: {
								player: 'phaseUseBegin',
							},
							forced: true,
							preHidden: true,
							content() {
								player.chooseToDiscard(2, true, 'h', { type: 'equip' });
							},
						},
						lg_paoying: {
							audio: 'ext:幻颜风华/audio:4',
							trigger: {
								player: 'damageAfter',
							},
							forced: true,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current != player && current.countCards('he');
								});
							},
							content() {
								'step 0';
								var str = '令一名其他角色选择是否交给你一张牌';
								player
									.chooseTarget(get.prompt('lg_paoying'), str, function (card, player, target) {
										return target != player && target.countCards('he');
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										if (get.attitude(player, target) >= 0 && get.attitude(target, player) >= 0) {
											return Math.sqrt(target.countCards('he'));
										}
										return 0;
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									target
										.chooseCard('he', '是否交给' + get.translation(player) + '一张牌？若选择是,' + get.translation(player) + '视为使用一张普通锦囊牌')
										.set('ai', function (card) {
											return 7 - get.value(card);
										})
										.set(get.attitude(target, player) > 1);
									event.target = target;
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									event.target.give(result.cards, player);
									event.goto(3);
								} else {
									event.finish();
								}
								('step 3');
								var list = { basic: [], equip: [], trick: [], delay: [] };
								for (var i = 0; i < lib.inpile.length; i++) {
									var name = lib.inpile[i];
									var info = lib.card[name];
									if (info.autoViewAs || name == 'yuansuhuimie') continue;
									if (lib.filter.cardEnabled({ name: name }, player)) {
										if (!list[info.type]) {
											list[info.type] = [];
										}
										list[info.type].push([get.translation(lib.card[name].type), '', name]);
									}
								}
								list.trick.sort(lib.sort.name);
								var dialog = ui.create.dialog('泡影·殆尽', [list.trick, 'vcard']);
								var rand1 = Math.random() < 1 / 3;
								var rand2 = Math.random() < 0.5;
								var rand3 = Math.random() < 1 / 3;
								var rand4 = Math.random() < 1 / 3;
								player.chooseButton(dialog, true).ai = function (button) {
									var player = _status.event.player;
									var players = game.filterPlayer();
									if (player.countCards('h', button.link)) return 0.1;
									if (button.link[2] == 'wuzhong') {
										if (player.countCards('h') < player.hp) {
											return 3 + Math.random();
										}
										return 0.2;
									}
									if (button.link[2] == 'juedou') {
										return 2 + Math.random();
									}
									if (button.link[2] == 'shunshou' || button.link[2] == 'guohe') {
										for (var i = 0; i < players.length; i++) {
											if (player.canUse('shunshou', players[i]) && get.attitude(player, players[i]) < 0 && players[i].countCards('he')) {
												return 2 + Math.random();
											}
										}
										return 0;
									}
									if (button.link[2] == 'tiesuo') {
										return 1 + Math.random();
									}
									if (button.link[2] == 'nanman' || button.link[2] == 'wanjian' || button.link[2] == 'taoyuan' || button.link[2] == 'wugu') {
										var eff = 0;
										for (var i = 0; i < players.length; i++) {
											if (players[i] != player) {
												eff += get.effect(players[i], { name: button.link[2] }, player, player);
											}
										}
										if (eff > 0) {
											return 1 + Math.random();
										}
										return 0;
									}
									return Math.random();
								};
								('step 4');
								if (result.bool) {
									player.chooseUseTarget(result.links[0][2]);
								}
							},
						},
						lg_paoying0: {
							trigger: {
								player: 'lg_paoyingAfter',
							},
							forced: true,
							content() {
								if (player.countCards('h') < player.hp) player.chooseUseTarget('指定目标', false, { name: 'lg_daijin' });
							},
						},
						lg_haimo_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_paoying1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseDarwSkipped',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_paoying.jpg',
							intro: {
								content: '泡影',
							},
							forced: true,
							content() {
								player.loseMaxHp();
								player.loseHp();
								player.removeSkill('lg_paoying1');
							},
						},
						lg_molitongdiao: {
							init(player, skill) {
								player.storage[skill] = [];
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_molitongdiao.jpg',
							intro: {
								mark(dialog, storage, player) {
									if (!storage.length) return '无';
									var list = [];
									for (var i = 0; i < storage.length; i++) {
										list.push(['装备', '', storage[i]]);
									}
									dialog.addAuto([list, 'vcard']);
								},
								markcount(storage, player) {
									return storage.length;
								},
							},
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'useCard',
							},
							filter(event, player) {
								if (get.type(event.card) != 'equip' && get.type(event.card) != 'equip') return false;
								return !player.storage.lg_molitongdiao.includes(event.card.name);
							},
							content() {
								//player.storage.lg_molitongdiao=lib.inpile.slice(0);
								game.log(player, '记录了', trigger.card);
								var num = player.countCards('e');
								player.drawTo(num);
								player.markAuto('lg_molitongdiao', [trigger.card.name]);
							},
						},
						lg_xiehouweizhi: {
							juexingji: true,
							audio: 'ext:幻颜风华/audio:1',
							derivation: ['lg_tanqiuweizhi'],
							trigger: {
								player: 'shaDamage',
							},
							forced: true,
							filter(event, player) {
								var storage = player.getStorage('lg_molitongdiao');
								if (!storage.length) return false;
								return storage.length >= 5 && !player.storage.lg_molitongdiao;
							},
							content() {
								player.draw(2);
								player.removeSkill('lg_molitongdiao');
								player.addSkill('lg_tanqiuweizhi');
							},
						},
						lg_tanqiuweizhi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							forced: true,
							content() {
								'step 0';
								if (player.storage.lg_tanqiuweizhi || (get.mode() == 'guozhan' && player.hiddenSkills.includes('lg_tanqiuweizhi'))) {
									if (!player.storage.lg_tanqiuweizhi) {
										event.skillHidden = true;
									}
									player.chooseBool(get.prompt2('lg_tanqiuweizhi')).set('ai', function () {
										var player = _status.event.player;
										if (player.hp > 3) return true;
										if (player.hp == 3 && player.countCards('h') < 3) return true;
										//if(player.hp==2&&player.countCards('h')==0)return true;
										return false;
									});
								} else {
									event.forced = true;
								}
								('step 1');
								if (event.forced || result.bool) {
									//player.draw();
								} else {
									event.finish();
								}
								('step 2');
								event.card = get.cards(1)[0];
								player.showCards([event.card]);
								player.gain(event.card, 'gain2', 'log');
								('step 3');
								if (get.type(event.card, false) == 'equip') {
									if (player.hp == player.maxHp) player.draw();
								} else if (get.type(event.card, false) == 'basic') {
									event.finish();
								}
								('step 4');
								event.goto(2);
							},
							ai: {
								threaten: 1.5,
							},
						},
						lg_huoyantianzhu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCard2',
							},
							filter(event, player) {
								return event.targets && event.card && event.card.name == 'sha' && player.countCards('he') && !player.isMinHandcard();
							},
							check(event, player) {
								if (!player.countCards('he', (card) => 6 - get.value(card))) return false;
								if (!player.hasFriend()) return false;
								return game.hasPlayer(function (current) {
									if (event.targets.includes(current)) return false;
									return player.canUse(event.card, current, false) && get.effect(current, event.card, player, player) > 0;
								});
							},
							content() {
								'step 0';
								event.i = 0;
								event.gn = 0;
								event.hs = player.getCards('he').slice(0);
								('step 1');
								var fc = event.i > 0 ? false : true;
								var hs = event.hs;
								player.chooseCardTarget({
									prompt: '交给一名其他角色至少两张牌？',
									selectCard: [2, Infinity],
									filterCard: (card) => hs.includes(card),
									forced: fc,
									position: 'he',
									complexCard: true,
									complexTarget: true,
									complexSelect: true,
									filterTarget: (card, player, target) => player != target,
									ai1: (card) => (ui.selected.cards.length < 1 ? 6 - get.value(card) : -1),
									ai2: (target) => get.attitude(get.player(), target) / (1 + target.countCards('h')),
								});
								('step 2');
								if (result.bool) {
									event.i++;
									player.line(result.targets, 'green');
									player.give(result.cards, result.targets[0]);
									for (var i = 0; i < result.cards.length; i++) {
										event.hs.remove(result.cards[i]);
									}
									event.gn += result.cards.length;
								} else if (event.i && event.gn > 0) event.goto(4);
								else event.finish();
								('step 3');
								if (player.countCards('he', (c) => event.hs.includes(c))) event.goto(1);
								('step 4');
								if (game.hasPlayer((current) => current != player && !trigger.targets.includes(current) && player.canUse(trigger.card, current, false))) {
									player
										.chooseTarget('需额外指定至多' + get.cnNumber(event.gn) + '名其他角色为' + get.translation(trigger.card) + '的目标', [2, event.gn], function (card, player, target) {
											if (player == target) return false;
											var sc = _status.event.sc;
											var tgs = _status.event.tgs;
											return !tgs.includes(target) && player.canUse(sc, target, false);
										})
										.set('sc', trigger.card)
										.set('tgs', trigger.targets)
										.set('ai', (target) => get.effect(target, _status.event.sc, get.player(), get.player()));
								} else event.finish();
								('step 5');
								if (result.bool) {
									player.line(result.targets, 'fire');
									game.log(result.targets, '成为了', trigger.card, '的额外目标');
									trigger.targets.addArray(result.targets);
								}
							},
						},
						lg_hailunna_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xiefengwuye: {
							audio: 'ext:幻颜风华/audio:3',
							enable: 'phaseUse',
							filter(event, player) {
								return !player.getEquips(5) && game.countPlayer((p) => p.countCards('he') && player != p && !p.hasSkill('lg_xiefengwuye1'));
							},
							filterTarget(card, player, target) {
								return target.countCards('he') && player != target && !target.hasSkill('lg_xiefengwuye1');
							},
							content() {
								'step 0';
								target.addTempSkill('lg_xiefengwuye1');
								player.gainPlayerCard('e', target, true);
								('step 1');
								target.chooseBool('对' + get.translation(player) + '使用一张【杀】？').ai = function (event, player) {
									return get.effect(player, { name: 'sha' }, target, target) + 3;
								};
								('step 2');
								if (result.bool) {
									target.useCard({ name: 'sha' }, player, false);
								}
							},
							ai: {
								order: 9,
								result: {
									player(player, target) {
										if (player.hp <= 2) return -2;
										if (!player.countCards('h', 'shan')) return -1;
										return -0.5;
									},
									target: -1,
								},
							},
						},
						lg_xiefengwuye1: {
							inherit: 'lg_xiefengwuye1',
							trigger: {
								player: 'useCard',
								target: 'useCardToTargeted',
							},
							forced: true,
							filter(event, player) {
								return event.card && event.card.name == 'sha';
							},
							content() {
								if (trigger.name == 'useCard') trigger.directHit.addArray(game.players);
								else trigger.directHit.add(player);
							},
							ai: {
								directHit_ai: true,
								skillTagFilter(player, tag, arg) {
									return arg.card.name == 'sha';
								},
							},
							global: 'lg_xiefengwuye1_ai',
						},
						lg_zhugong_weila: {
							ai: {
								neg: true,
							},
							init(player) {
								if (player.isZhu) {
									player.addSkill('lg_mozhixuetong');
								}
							},
						},
						lg_xiefengwuye0: {
							trigger: {
								player: 'lg_xiefengwuyeAfter',
							},
							filter(event, player) {
								return player.isMinHandcard();
							},
							forced: true,
							content() {
								'step 0';
								var num1 = 0,
									num2 = 0;
								var choice;
								if (player.hasUnknown(2)) {
									if (game.dead.length == 0) {
										choice = '暗';
									} else {
										choice = 'cancel2';
									}
								} else {
									game.countPlayer(function (current) {
										var att = get.attitude(player, current);
										if (att > 0) {
											num1++;
										} else if (att < 0) {
											num2++;
										}
									});
									choice = num1 > num2 ? '光' : '暗';
								}
								player
									.chooseControl('光', '暗', 'cancel2', function () {
										return choice;
									})
									.set('prompt', get.prompt('lg_xiefengwuye0'))
									.set('choiceList', ['光之封印', '暗之封印']);
								('step 1');
								if (result.control != 'cancel2') {
									var list = [];
									for (var i in lib.card) {
										if (lib.inpile.includes(i) && lib.card[i].selectTarget == -1 && lib.card[i].type != 'equip' && lib.card[i].ai && lib.card[i].ai.tag && lib.card[i].ai.tag.multitarget) {
											if (lib.card[i].ai.tag.multineg) {
												if (result.control == '暗') {
													list.push(i);
												}
											} else {
												if (result.control == '光') {
													list.push(i);
												}
											}
										}
									}
									var name = null;
									while (list.length) {
										name = list.randomRemove();
										if (
											game.hasPlayer(function (current) {
												return player.canUse(name, current);
											})
										) {
											break;
										} else {
											name = null;
										}
									}
									if (name) {
										var targets = game.filterPlayer(function (current) {
											return player.canUse(name, current);
										});
										targets.sortBySeat();
										player.useCard({ name: name }, targets);
									}
								}
							},
						},
						lg_mozhixuetong: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'roundStart',
							},
							filter(event, player) {
								return !player.isMaxHandcard();
							},
							content() {
								var num = 0;
								for (var i of game.players) {
									//QQ
									if (i != player) {
										num = Math.max(num, i.countCards('h'));
									}
								}
								var dh = num - player.countCards('h');
								if (dh > 0) {
									player.draw(dh);
								}
							},
						},
						lg_weila_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_monibaozhu: {
							nobracket: true,
							trigger: {
								target: 'shaBefore',
							},
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							filter(event, player) {
								return event.card.name == 'sha' && event.card.suit == 'diamond';
							},
							content() {
								if (player.countCards('e') != player.hp) trigger.cancel();
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (card.name == 'sha' && card.suit == 'diamond') return 'zerotarget';
									},
								},
							},
						},
						lg_chirekuangbao: {
							trigger: {
								player: 'shaMiss',
							},
							check(event, player) {
								if (event.target.isTurnedOver()) return get.attitude(player, event.target) > 0;
								return get.attitude(player, event.target) < 0;
							},
							audio: 'ext:幻颜风华/audio:2',
							prompt(event, player) {
								return '对' + get.translation(event.target) + '造成1点火焰伤害？';
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha';
							},
							content() {
								trigger.target.damage('fire');
							},
						},
						lg_fennuzhiyan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin4',
							},
							filter(event, player) {
								if (player.hasSkill('lg_fennuzhiyan_temp')) return false;
								if (!event.card) return false;
								if ((event.card.name != 'sha' && event.card.name != 'sha') || !event.notLink()) return false;
								return player.isDamaged();
							},
							_priority: -998,
							check(event, player) {
								return event.num < player.getDamagedHp();
							},
							prompt2(event, player) {
								return '对' + get.translation(event.player) + '造成的伤害值改为' + player.getDamagedHp() + '？';
							},
							content() {
								player.addSkill('lg_fennuzhiyan1');
								player.addTempSkill('lg_fennuzhiyan_temp', { player: 'shaMiss' });
								var nm = player.getDamagedHp();
								trigger.num = nm;
							},
							ai: {
								damageBonus: true,
							},
							subSkill: {
								temp: {
									charlotte: true,
								},
							},
						},
						lg_masi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_fennuzhiyan1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'lg_fennuzhiyanAfter',
							},
							forced: true,
							filter(event, player) {
								var list = [];
								player.getHistory('useCard', function (evt) {
									list.add(get.type2(evt.card, false));
								});
								for (var i = 0; i < ui.cardPile.childNodes.length; i++) {
									if (!list.includes(get.type2(ui.cardPile.childNodes[i], false))) return true;
								}
								return false;
							},
							content() {
								var list = [],
									cards = [];
								player.getHistory('useCard', function (evt) {
									list.add(get.type2(evt.card, false));
								});
								for (var i = 0; i < ui.cardPile.childNodes.length; i++) {
									var type = get.type2(ui.cardPile.childNodes[i], false);
									if (!list.includes(type)) {
										list.push(type);
										cards.push(ui.cardPile.childNodes[i]);
									}
								}
								player.gain(cards, 'gain2');
								player.removeSkill('lg_fennuzhiyan1');
							},
						},
						lg_pingyituji: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							filter(event, player) {
								return event.source != undefined;
							},
							_priority: 6,
							forced: true,
							checkx(event, player) {
								var att1 = get.attitude(player, event.player);
								var att2 = get.attitude(player, event.source);
								return att1 > 0 && att2 <= 0;
							},
							content() {
								'step 0';
								var c = player.getAttackRange();
								trigger.source.drawTo(c);
								('step 1');
								var kk = player.countCards('ej');
								if (kk < 2) kk = 2;
								var next = player.chooseToDiscard('h', kk, get.prompt('lg_pingyituji'));
								var check = lib.skill.beige.checkx(trigger, player);
								next.set('ai', function (card) {
									if (_status.event.goon) return 8 - get.value(card);
									return 0;
								});
								next.set('goon', check);
								('step 2');
								if (result.bool) {
									trigger.source.disableEquip(['equip2', 'equip3', 'equip4', 'equip5'].randomGet());
									trigger.source.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
								}
							},
							ai: {
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (player.countCards('h') > 1 && get.tag(card, 'damage')) {
											if (player.hasSkillTag('jueqing', false, target)) return [1, -1.5];
											if (get.attitude(target, player) < 0) return [1, 1];
										}
									},
								},
							},
						},
						lg_simianchuge: {
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseJudgeBegin',
							},
							content() {
								'step 0';
								var list = [];
								if (player.isDamaged()) list.push('摸一张牌');
								list.push('摸两张牌');
								list.push('取消');
								player
									.chooseControl(list, function (event, player) {
										if (list.includes('摸一张牌') && player.countCards('h', { type: 'trick' }) > 0 && player.hp % 2 == 1) {
											return '摸一张牌';
										} else if (player.countCards('h', 'sha') > 0 && player.hp % 2 == 0 && player.hp > 1) {
											return '摸两张牌';
										} else {
											return '取消';
										}
									})
									.set('prompt', get.prompt2('lg_simianchuge'));
								('step 1');
								if (result && result.control != '取消') {
									if (result.control == '摸一张牌') {
										player.draw('bottom');
										player.addTempSkill('lg_simianchuge1', { player: 'phaseBegin' });
									} else if (result.control == '摸两张牌') {
										player.draw(2, 'bottom');
										player.addTempSkill('lg_simianchuge2', { player: 'phaseBegin' });
									}
								}
							},
						},
						lg_bayunlan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_simianchuge1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'recoverBegin',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_simianchuge1'), '选择至多三名角色', [1, 3]).set('ai', function (target) {
									return Math.sqrt(5 - Math.min(4, target.countCards('h'))) * get.attitude(_status.event.player, target);
								});
								('step 1');
								if (result.bool) {
									var targets = result.targets.sortBySeat();
									if (targets.length == 1) {
										targets[0].draw();
										event.finish();
									} else game.asyncDraw(targets);
								} else event.finish();
								('step 2');
							},
						},
						lg_simianchuge2: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'respondAfter',
							},
							forced: true,
							content() {
								player.chooseToDiscard(1, true, 'he');
								if (player.countCards('he') == 0) player.recover();
							},
						},
						lg_bayunlan0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_bayunlan0 = 0;
								player.markSkill('lg_bayunlan0');
							},
							filter(event, player) {
								return player.storage.lg_bayunlan0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_bayunlan0 += 5;
								player.markSkill('lg_bayunlan0');
							},
						},
						lg_xianhusinian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'recoverBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_xianhusinian.jpg',
							intro: {
								content: '灵力消耗:<br/>40点<br/><br/>符卡效果:<br/>一名其他角色回复体力时,你可以与其进行拼点.若你赢,回复1点体力,你可以将一张手牌置于牌堆顶.',
							},
							filter(event, player) {
								return event.player != player && event.player.countCards('h') > 0 && player.countCards('h') > 0 && player.storage.lg_bayunlan0 > 39;
							},
							check(event, player) {
								if (player.isUnseen()) return false;
								if (get.attitude(player, event.player) >= 0) return false;
								var hs = player.getCards('h');
								if (hs.length < event.player.countCards('h')) return false;
								for (var i = 0; i < hs.length; i++) {
									var val = get.value(hs[0]);
									if (hs[i].number >= 10 && val <= 6) return true;
									if (hs[i].number >= 8 && val <= 3) return true;
								}
								return false;
							},
							logTarget: 'player',
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								if (result.bool) {
									player.recover();
								} else {
									event.finish();
								}
								('step 2');
								player.chooseCard('你可以将一张手牌置于牌堆顶', 1, 'h');
								('step 3');
								if (result.bool) {
									player.lose(result.cards, ui.special);
									event.cards = result.cards;
								} else {
									event.finish();
								}
								('step 4');
								var nodes = [];
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										var cardx = ui.create.card();
										cardx.classList.add('infohidden');
										cardx.classList.add('infoflip');
										nodes.push(cardx);
									}
								player.$throw(nodes, 700, 'nobroadcast');
								game.log(player, '将' + get.cnNumber(event.cards.length) + '张手牌置于牌堆顶');
								('step 5');
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										ui.cardPile.insertBefore(i, ui.cardPile.firstChild);
									}
							},
							ai: {
								mingzhi: false,
								expose: 0.2,
							},
						},
						lg_diannengzhichu: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							enable: 'phaseUse',
							filter(event, player) {
								return player.countCards('he', { suit: 'spade' }) > 0;
							},
							filterCard(card) {
								return card.name == '' && card.suit == 'spade';
							},
							filterTarget(card, player, target) {
								return player != target && target.countCards('h') > 0;
							},
							line: 'metal',
							content() {
								'step 0';
								target.draw();
								target.showHandcards();
								('step 1');
								var cards = target.getCards('h', { color: 'black' });
								if (cards.length) {
									target.discard(cards);
								} else {
									target.damage('thunder');
									target.damage('thunder');
								}
							},
							ai: {
								order: 7,
								result: {
									target(player, target) {
										return get.damageEffect(target, player, target, 'thunder');
									},
								},
								expose: 0.2,
							},
						},
						lg_jujiaozhiling: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 2,
							trigger: {
								global: 'discardEnd',
							},
							filter(event, player) {
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (get.position(i) == 'd') return true;
									}
								return false;
							},
							content() {
								'step 0';
								event.list = [];
								for (var i = 0; i < trigger.cards.length; i++) {
									if (get.position(trigger.cards[i]) == 'd') {
										event.list.push(trigger.cards[i]);
									}
								}
								('step 1');
								trigger.player.gainPlayerCard(player, 2, 'h');
								player.chooseCardButton('选择其中至多两张牌置于牌堆顶', event.list, [1, 2], true).ai = function (button) {
									if (ui.selected.buttons.length) {
										return 0;
									}
									return 2 + Math.random();
								};
								('step 2');
								event.cards = result.links;
								player.lose(event.cards, ui.cardPile, 'insert');
								player.$throw(event.cards.length, 1000);
								game.log(player, '将', event.cards, '置于牌堆顶');
								('step 3');
								for (var i = 0; i < ui.cardPile.childNodes.length; i++) {
									var card = ui.cardPile.childNodes[i];
									if (event.cards.every((c) => card.number != c.number)) {
										player.gain(card, 'gain2');
										break;
									}
								}
							},
						},
						lg_zhuanjing: {
							group: ['lg_zhuanjing_gain', 'lg_zhuanjing_lose'],
							subSkill: {
								gain: {
									trigger: {
										player: 'gainEnd',
									},
									forced: true,
									popup: false,
									filter(event, player) {
										if (!event.cards) return false;
										if (Array.isArray(event.cards))
											for (var i of event.cards) {
												//QQ
												if (get.type(i) == 'equip' && lib.card[i.name].skills) return true;
											}
										return false;
									},
									content() {
										for (var i = 0; i < trigger.cards.length; i++) {
											if (lib.card[trigger.cards[i].name].skills) player.addSkill(lib.card[trigger.cards[i].name].skills);
										}
									},
								},
								lose: {
									trigger: {
										player: 'loseEnd',
									},
									forced: true,
									popup: false,
									filter(event, player) {
										if (!event.cards) return false;
										if (Array.isArray(event.cards))
											for (var i of event.cards) {
												//QQ
												if (get.type(i) == 'equip' && lib.card[i.name].skills && player.countCards('h', { name: i.name }) <= 0) return true;
											}
										return false;
									},
									content() {
										game.log(trigger.cards);
										for (var i = 0; i < trigger.cards.length; i++) {
											if (lib.card[trigger.cards[i].name].skills) player.removeSkill(lib.card[trigger.cards[i].name].skills);
										}
									},
								},
							},
						},
						lg_huihuangliepian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageEnd',
							},
							filter(event, player) {
								if (!event.source) return false;
								if (!event.source.isIn()) return false;
								if (!event.source.countDiscardableCards(player, 'h')) return false;
								if (_status.currentPhase != event.source) return false;
								var history = event.source.getHistory('useCard');
								for (var i = 0; i < history.length; i++) {
									if (history[i].card.name == 'sha' && history[i].isPhaseUsing()) return false;
								}
								return true;
							},
							content() {
								'step 0';
								player
									.discardPlayerCard(get.prompt2('lg_huihuangliepian', trigger.source), 'h', '弃置其一张手牌', trigger.source)
									.set('ai', function (button) {
										var target = _status.event.target;
										var player = _status.event.player;
										var att = get.attitude(player, target) > 0;
										var val = get.jyValue(button.link, target);
										if (!att && target.countDiscardableCards(player, 'h') == 1) return val;
										var result = lib.card.jiu.ai.result.target(target, target);
										if (result <= 0 && !att) return val;
										if (result > 0 && att && target.countCards('h') > 3) return 5 - val;
										return 0;
									})
									('step 1');
								if (result.bool) {
									trigger.source.useCard({ name: 'sha' }, trigger.source);
									if (player.countCards('h') > player.hp) trigger.source.damage('thunder');
								}
							},
							ai: {
								maixie: true,
							},
						},
						lg_yike_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_tiandijiaotai: {
							mod: {
								maxHandcard(player, num) {
									var count = game.countPlayer(function (current) {
										return current.group == '提瓦特';
									});
									return num + count;
								},
							},
						},
						lg_shanzelinji: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							enable: 'phaseUse',
							filter(event, player) {
								if (!player.countCards('h')) return false;
								var cards = player.getCards('h', function (card) {
									return lib.filter.cardEnabled(card, player) && lib.filter.cardUsable(card, player);
								});
								if (!cards.length) {
									return true;
								} else return false;
							},
							content() {
								var cards = player.getCards('h', { suit: 'spade' });
								var num = cards.length;
								player.showHandcards();
								player.discard(cards);
								player.recover(num);
								player.addTempSkill('lg_shanzelinji1', { player: 'phaseEnd' });
							},
							ai: {
								order: 6,
								result: {
									player(player) {
										var val = 0;
										var cards = player.getCards('h');
										for (var i = 0; i < cards.length; i++) {
											val += get.value(cards[i], player, 'raw');
										}
										val = val / cards.length;
										if (val > 3) return -1;
										return 1;
									},
								},
							},
						},
						lg_shanzelinji1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'damageBegin',
							},
							forced: true,
							content() {
								trigger.cancel();
							},
						},
						lg_jiangzhongtianhua: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseBegin',
							},
							logTarget: 'player',
							filter(event, player) {
								return player != event.player && event.player.isAlive() && player.countCards('h') > 0;
							},
							check(event, player) {
								if (get.attitude(player, event.player) <= 4) return false;
								if (event.player.hasJudge('lebu')) return false;
								return game.hasPlayer(function (current) {
									return (
										event.player != player &&
										game.hasPlayer(function (current) {
											return current != player && current != event.player && event.player.inRange(current) && get.attitude(event.player, current) < 0;
										})
									);
								});
							},
							content() {
								var cards = player.getCards('h');
								trigger.player.gain(cards, player, 'giveAuto');
								player.addTempSkill('lg_jiangzhongtianhua_effect');
							},
							subSkill: {
								effect: {
									charlotte: true,
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: 'damageSource',
									},
									filter(event, player) {
										var source = event.source;
										return source && source == _status.currentPhase && player.countCards('he') != source.countCards('he');
									},
									content() {
										var num = player.countCards('e');
										player.next.damage('ice');
										player.previous.damage('ice');
										player.recover();
										if (player.hp == player.maxHp) player.chooseToDiscard(999, true, 'e')._triggered = null;
										if (player.hp == player.maxHp) player.draw(num);
									},
								},
								round: {
									charlotte: true,
								},
							},
						},
						lg_ganyu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_bingyuansu: {
							trigger: {
								source: 'damageEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_bing.jpg',
							intro: {
								content: '「冰」<br/>元素效果:<br/>当你使用♣️️牌对其他角色造成伤害后,若其未翻面,你可以令其翻面,弃置一张手牌.',
							},
							filter(event, player) {
								return event.card && event.card.suit == 'club' && !event.player.isTurnedOver() && event.player.isAlive();
							},
							content() {
								trigger.player.turnOver();
								trigger.player.chooseToDiscard(1, true, 'h');
								if (get.is.altered('lg_bingyuansu'));
							},
							ai: {
								threaten: 1.5,
								effect: {
									player(card, player, target, current) {
										if (card.suit == 'club' && get.tag(card, 'damage')) {
											return [1, 0, 1, -2];
										}
									},
								},
							},
						},
						lg_xingzhiwenzhang: {
							usable: 1,
							trigger: {
								player: 'gainEnd',
							},
							audio: 'ext:幻颜风华/audio:3',
							filter(event, player) {
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (i.suit == 'diamond') return true;
									}
								return false;
							},
							forced: true,
							content() {
								'step 0';
								event.cards = trigger.cards.slice(0);
								var num = 0;
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (i.suit == 'diamond') num++;
									}
								player
									.chooseCard([1, num], 'h', '展示其中的♦️️牌并摸等量的牌？', function (card, player) {
										return card.suit == 'diamond' && _status.event.parent.cards.includes(card);
									})
									.set('ai', function (card) {
										return 1;
									});
								('step 1');
								if (result.bool) {
									player.showCards(result.cards, '星之纹章');
									if (player.countCards('hej', { suit: 'diamond' }) > player.getAttackRange()) player.addTempSkill('lg_xingzhiwenzhang1', { player: 'phaseBeginStart' });
									if (player.countCards('hej', { suit: 'diamond' }) > player.getAttackRange() + player.hp) player.chooseToDiscard('请弃置两张♦️️牌', 2, 'he', { suit: 'diamond' });
									player.draw(result.cards.length);
								}
							},
						},
						lg_xingzhiwenzhang1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								source: 'damageBegin1',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.card.suit == 'diamond' && event.notLink();
							},
							forced: true,
							content() {
								trigger.num++;
							},
						},
						lg_junshenzhijian1: {
							nobracket: true,
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardToBefore',
							},
							filter(event, player) {
								return get.distance(player, event.target, 'attack') <= 1 && ((get.type(event.card) != 'delay' && event.card.name == 'sha') || get.type(event.card) == 'trick');
							},
							content() { },
							mod: {
								wuxieRespondable(card, player, target, current) {
									if (player != current && get.distance(player, current, 'attack') <= 1) {
										return false;
									}
								},
							},
							ai: {
								threaten: 2,
								norespond: true,
								skillTagFilter(player, tag, arg) {
									if (tag == 'norespond' && Array.isArray(arg)) {
										if (get.distance(player, arg[1], 'attack') <= 1) return true;
									}
									return false;
								},
							},
						},
						lg_junshenzhijian: {
							nobracket: true,
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseBefore',
							},
							content() {
								'step 0';
								var num = game.countPlayer(function (current) {
									return get.distance(player, current, 'attack') <= 1;
								});
								player.addTempSkill('lg_junshenzhijian2', { player: 'phaseUseBegin' });
								player
									.chooseTarget('选择攻击范围内的至多' + get.cnNumber(num) + '名其他角色各弃置一张手牌', [1, num], function (card, player, target) {
										if (player != game.me) return player.getEnemies().includes(target) && target.countCards('h') > 0 && get.distance(player, target, 'attack') <= 1;
										return player != target && target.countCards('h') > 0 && get.distance(player, target, 'attack') <= 1;
									})
									.set('ai', function (target) {
										if (player.getEnemies().includes(target)) return 3;
										return false;
									});
								('step 1');
								if (result.bool) {
									event.targets = result.targets;
									event.nums = result.targets.length;
								}
								('step 2');
								if (targets && targets.length) {
									for (var i = 0; i < targets.length; i++) {
										player.line(targets[i], ['fire', 'thunder'].randomGet());
										targets[i].chooseToDiscard('h', true);
									}
								}
							},
							ai: {
								threaten: 2,
								expose: 0.1,
							},
						},
						lg_adila_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_junshenzhijian2: {
							trigger: {
								global: 'loseAfter',
							},
							check(event, player) {
								return get.damageEffect(event.player, player, player) > 0;
							},
							filter(event, player) {
								if (event.player.countCards('h')) return false;
								if (_status.currentPhase != player) return false;
								if (event.player == player) return false;
								return event.hs && event.hs.length;
							},
							forced: true,
							content() {
								player.line(trigger.player, 'green');
								trigger.player.damage()._triggered = null;
							},
							ai: {
								threaten: 1.1,
							},
						},
						lg_chenmoji: {
							mod: {
								targetEnabled(card, player, target) {
									var suit = card.suit;
									if (suit && !target.countCards('h', { suit: suit })) {
										return false;
									}
								},
							},
						},
						lg_shixingmoya: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								global: 'respondBegin',
							},
							filter(event, player) {
								return player.countCards('j', { color: 'black' }) && player.isMinHandcard();
							},
							content() {
								'step 1';
								player.chooseToEnable();
								('step 2');
								player.chooseUseTarget('指定目标', false, { name: 'sha', nature: 'thunder' });
								player.chooseUseTarget('指定目标', false, { name: 'sha', nature: 'thunder' });
								player.addTempSkill('lg_leiyuansu', { player: 'damageEnd' });
							},
							ai: {
								threaten: 1.5,
							},
						},
						lg_zhiyehuanxian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'shaBegin',
							},
							filter(event, player) {
								return player.countCards('h') > 0 && event.player != player && event.player.countCards('h') > 0;
							},
							check(event, player) {
								var att = get.attitude(player, event.player);
								var cards = player.getCards('h');
								if (att < 0) {
									for (var i = 0; i < cards.length; i++) {
										if (get.value(cards[i]) < 5 && cards[i].number > Math.min(12, 6 + event.player.countCards('h'))) return true;
									}
									return false;
								} else if (att > 0) {
									for (var i = 0; i < cards.length; i++) {
										if (get.value(cards[i]) < 8 && cards[i].number < Math.min(12, 5 + event.player.countCards('h'))) return true;
									}
									return false;
								}
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].name == 'du') return true;
								}
								return false;
							},
							content() {
								'step 0';
								event.target = trigger.player;
								('step 1');
								player.chooseToCompare(event.target).set('small', get.attitude(player, event.target) > 0);
								('step 2');
								if (!result.bool) {
									event.target.gainPlayerCard(player, 1, 'he');
									player.storage.lg_zhiyehuanxian_card = result.target;
									event.goto(3);
								} else event.finish();
								('step 3');
								event.list = ['是', '取消'];
								player.chooseControl(event.list, true).set('prompt', '重复此流程？').ai = function () {
									//console.log(player.storage.lg_zhiyehuanxian_card);
									var att = get.attitude(player, event.target);
									if (att < 0) {
										if (player.storage.lg_zhiyehuanxian_card.number > Math.min(12, 6 + event.target.countCards('h'))) return '是';
										return '取消';
									} else if (att > 0) {
										if (player.storage.lg_zhiyehuanxian_card.number < Math.min(12, 5 + event.target.countCards('h'))) return '是';
										return '取消';
									}
									return '取消';
								};
								('step 4');
								if (result.control == '是') {
									var next = player
										.chooseToCompare(event.target)
										.set('small', get.attitude(player, event.target) > 0)
										.set('fixedResult', true);
									next.fixedResult = {};
									next.fixedResult[player.playerid] = player.storage.lg_zhiyehuanxian_card;
								} else event.finish();
								('step 5');
								if (!result.bool) {
									event.target.gainPlayerCard(player, 1, 'he');
									player.storage.lg_zhiyehuanxian_card = result.target;
									event.goto(3);
								} else event.finish();
							},
							ai: {
								expose: 0.7,
								threaten: 1.2,
							},
						},
						lg_feixieer_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_leiyuansu: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dyingAfter',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_lei.jpg',
							intro: {
								content: '「雷」<br/>元素效果:<br/>当你解除濒死状态后,对伤害来源造成1点雷电伤害.若你装备区内的牌数大于X,此伤害值+1(X为你的手牌数).',
							},
							forced: true,
							content() {
								trigger.source.damage('thunder');
								if (player.countCards('e') > player.countCards('h')) trigger.source.damage('thunder');
							},
						},
						lg_zhiyehuanxian0: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_zhiyehuanxianAfter',
							},
							filter(event, player) {
								return player.countCards('h') > 0 && player.isMinHandcard();
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget('弃置两张牌,对攻击范围内的一名其他角色造成2点雷电伤害？', function (card, player, target) {
									return target != player && get.distance(player, target, 'attack') <= 2;
								}).ai = function (target) {
									return -get.attitude(player, target);
								};
								('step 1');
								if (result.bool) {
									player.chooseToDiscard(2, 'he', true);
									result.targets[0].damage(2, 'thunder');
								} else {
									event.finish();
								}
							},
						},
						lg_zhiyehuanxian1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_zhiyehuanxian0After',
							},
							forced: true,
							content() { },
						},
						lg_ziyezhiniao1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								global: 'phaseBegin',
							},
							filter(event, player) {
								if (player.isLinked()) return false;
								return lib.filter.filterCard({ name: 'sha' }, event.player, event) && event.player.isEnemiesOf(player);
							},
							mark: true,
							intro: {
								content: '转换:<br/>一名敌方角色的回合开始时,你令其翻面,对其视为使用一张【杀】.若你的区域内没有牌,你移出两轮游戏.',
							},
							logTarget: 'player',
							check(event, player) {
								// if(event.player!=player)return false;
								if (get.attitude(player, event.player) <= 0) return false;
								if (player.hp < 3) return false;
								if (!event.player.hasSha()) return false;
								return game.hasPlayer(function (current) {
									return get.effect(current, { name: 'sha' }, event.player, event.player) > 0 && event.player.canUse({ name: 'sha' }, current);
								});
							},
							forced: true,
							content() {
								'step 0';
								trigger.player.turnOver();
								trigger.player.useCard({ name: 'sha' }, trigger.player);
								('step 1');
								player.removeSkill('lg_ziyezhiniao1');
								player.addSkill('lg_ziyezhiniao');
								('step 2');
								if (player.countCards('e') == 0) player.out(2);
							},
							ai: {
								order: 10,
								expose: 1,
								threaten: 4,
								maixie: true,
							},
						},
						lg_ziyezhiniao: {
							shaRelated: true,
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								global: 'useCardToPlayered',
							},
							mark: true,
							intro: {
								content: '转换<br/>一名角色使用【杀】指定目标时,你可以获得此【杀】目标的一张手牌.若其手牌中的花色数未因此变化,此【杀】不能被【闪】响应.',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.target.countDiscardableCards(player, 'h') > 0;
							},
							forced: true,
							content() {
								'step 0';
								var ai2 = function (button) {
									var val = get.buttonValue(button);
									if (get.attitude(_status.event.player, get.owner(button.link)) > 0) return -val;
									return val;
								};
								var att = get.attitude(player, trigger.target) <= 0;
								//var boolai=trigger.parent.directHit.includes(trigger.target);
								event.suits = [];
								trigger.target.countCards('h', function (cardx) {
									var suit = cardx.suit;
									if (['club', 'spade', 'diamond', 'heart'].includes(suit)) event.suits.add(suit);
								});
								player
									.gainPlayerCard(trigger.target, get.prompt2('lg_ziyezhiniao', trigger.target), 'h')
									.set('ai', function (button) {
										if (!_status.event.att) return 0;
										var ai2 = _status.event.ai2;
										var boolai = _status.event.boolai;
										var result = ai2(button);
										if (result > 0) {
											if (get.position(button.link) == 'e' && get.subtype(button.link) == 'equip2') return result + 10;
										}
										return result;
									})
									.set('att', att)
									.set('ai2', ai2);
								('step 1');
								if (result.bool && result.links && result.links.length) {
									var suits = [];
									trigger.target.countCards('h', function (cardx) {
										var suit = cardx.suit;
										if (['club', 'spade', 'diamond', 'heart'].includes(suit)) suits.add(suit);
									});
									if (suits.length >= event.suits.length) trigger.parent.directHit.add(trigger.target);
								}
							},
							ai: {
								unequip: true,
								skillTagFilter(player, tag, arg) {
									var card = arg.card;
									var target = arg.target;
									if (!card || !target) return false;
									if (card.name != 'sha') return false;
									if (get.attitude(player, target) > 0) return false;
									var equip = target.getEquip(2);
									if (!equip) return false;
									var list = target.getDiscardableCards(player, 'h');
									if (list.includes(equip) && get.equipValue(equip, target) > 0) return true;
									return false;
								},
							},
						},
						lg_ziyezhiniao0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_ziyezhiniaoAfter',
							},
							forced: true,
							content() {
								player.removeSkill('lg_ziyezhiniao');
								player.addSkill('lg_ziyezhiniao1');
							},
						},
						lg_lumiya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yexunyingyi1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'loseEnd',
							},
							forced: true,
							filter(event, player) {
								return event.player != player && _status.currentPhase == player && event.player.countCards('hej') > 0;
							},
							check(event, player) {
								return get.attitude(player, event.player) < 0;
							},
							forced: true,
							content() {
								'step 0';
								event.num = 0;
								('step 1');
								player.judge(function (card) {
									if (card.suit == 'spade') return 1;
									return -1;
								});
								('step 2');
								if (result.card.suit == 'spade') trigger.player.chooseToDiscard(2, 'e', true) && player.init('lg_feixieer');
								event.num++;
								if (event.num < trigger.num && trigger.player.countCards('hej') > 0) event.goto(1);
							},
						},
						lg_yexunyingyi: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 3,
							trigger: {
								player: 'lg_yexunyingyi1Begin',
							},
							forced: true,
							content() { },
						},
						lg_lumiya0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_lumiya0 = 0;
								player.markSkill('lg_lumiya0');
							},
							filter(event, player) {
								return player.storage.lg_lumiya0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_lumiya0 += 5;
								player.markSkill('lg_lumiya0');
							},
						},
						lg_yueliangguang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_yueliangguang.jpg',
							intro: {
								content: '灵力消耗:<br/>15点<br/><br/>符卡效果:<br/>出牌阶段结束时,你可以获得弃牌堆的一张【乐不思蜀】或【兵粮寸断】.',
							},
							filter(event, player) {
								var card = get.discardPile(function (card) {
									return card.name == 'lebu' || (card.name == 'bingliang' && player.storage.lg_lumiya0 > 14);
								});
								return card;
							},
							forced: true,
							content() {
								'step 0';
								var list = [];
								game.log(ui.discardPile.childElementCount);
								for (var i = 0; i < ui.discardPile.childElementCount; i++) {
									var card = ui.discardPile.childNodes[i];
									if (card.name == 'lebu' || card.name == 'bingliang') list.push(card);
								}
								player.chooseCardButton('选择获得的一张牌', list);
								('step 1');
								player.gain(result.links, 'log', 'gain2');
								player.storage.lg_lumiya0 -= 15;
								player.markSkill('lg_lumiya0');
							},
						},
						lg_jingjiexian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'damageEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_jingjiexian.jpg',
							intro: {
								content: '灵力消耗:<br/>70点<br/><br/>符卡效果:<br/>一名其他角色受到【杀】造成的伤害后,若其在你的攻击范围且你不为伤害来源,你可以回复X点体力.若如此做,伤害来源不能使用黑色牌,直到翻面为止(X为其的攻击范围).',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.notLink() && event.player.inRangeOf(player) && event.source && event.source.isAlive();
							},
							check(event, player) {
								if (player.hp > 2) return get.attitude(player, event.source) < 0;
								return 0;
							},
							prompt(event, player) {
								var str = '';
								str += '对' + get.translation(event.source) + '发动符卡？';
								return str;
							},
							content() {
								var num = trigger.player.getAttackRange();
								player.recover(num);
								player.line(trigger.source);
								trigger.source.addTempSkill('lg_jingjiexian1', { player: 'turnOverEnd' });
								player.storage.lg_lumiya0 -= 70;
								player.markSkill('lg_lumiya0');
							},
						},
						lg_jingjiexian0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_jingjiexianBegin',
							},
							filter(event, player) {
								return player.storage.lg_lumiya0 < 70;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_jingjiexian1: {
							mod: {
								cardEnabled(card) {
									if (get.color(card) == 'black') return false;
								},
							},
						},
						lg_tiangoushijue: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return player.maxHp - player.hp > 0;
							},
							filterTarget(card, player, target) {
								return player != target && target.num('h') > 0 && get.distance(player, target, 'attack') <= 1;
							},
							content() {
								if (player.maxHp - player.hp <= target.num('h')) {
									target.showCards(target.getCards('h').randomGets(player.maxHp - player.hp));
								} else {
									target.showCards(target.getCards('h').randomGets(target.num('h')));
								}
							},
							ai: {
								order: 13,
								result: {
									target: -1,
								},
							},
						},
						lg_tiangoushijue1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'lg_tiangoushijueAfter',
							},
							filter(event, player) {
								return player.isMinHp() && player.countCards('he', { suit: 'diamond' });
							},
							content() {
								player.viewCards('牌堆顶的' + get.cnNumber(player.hp) + '张牌', get.cards(player.hp));
							},
						},
						lg_kuangquanduanshi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								if (player.hasSkill('lg_kuangquanduanshi_temp')) return false;
								return event.card && event.card.name == 'sha' && event.notLink();
							},
							content() {
								'step 0';
								player.chooseTarget(get.prompt2('lg_kuangquanduanshi'), function (card, player, target) {
									var trigger = _status.event.getTrigger();
									return player != target && trigger.player != target && target.countCards('h');
								}).ai = function (target) {
									var player = _status.event.player;
									var att = get.attitude(player, target);
									if (target.countCards('h') > 2) return att;
									return -att;
								};
								('step 1');
								if (result.bool) {
									player.addTempSkill('lg_kuangquanduanshi_temp');
									event.target1 = result.targets[0];
									event.target1
										.chooseControl()
										.set('choiceList', ['交给' + get.translation(player) + '一张手牌', '令其摸一张牌'])
										.set('ai', function (event, player) {
											var att = get.attitude(player, event.target1);
											if (att > 0) return 0;
											return 1;
										});
								} else event.finish();
								('step 2');
								if (result.index == 1) {
									player.draw();
									event.finish();
								} else {
									event.target1.chooseCard('交给' + get.translation(player) + '一张手牌', 'h', true).ai = function (card) {
										if (card.name == 'sha') return 1;
										return 6 - get.value(card);
									};
								}
								('step 3');
								if (result.bool) {
									player.gain(result.cards[0], event.target1, 'giveAuto');
									if (player.stat[player.stat.length - 1].card.sha > 0) {
										player.stat[player.stat.length - 1].card.sha--;
									}
								}
							},
							subSkill: {
								temp: {
									charlotte: true,
								},
							},
						},
						lg_kuangquanduanshi1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								if (player.hasSkill('lg_kuangquanduanshi1_temp')) return false;
								return event.card && event.card.name == 'sha' && event.notLink();
							},
							content() {
								'step 0';
								player.chooseTarget(get.prompt2('lg_kuangquanduanshi1'), function (card, player, target) {
									var trigger = _status.event.getTrigger();
									return player != target && trigger.player != target && target.countCards('h');
								}).ai = function (target) {
									var player = _status.event.player;
									var att = get.attitude(player, target);
									if (target.countCards('h') > 2) return att;
									return -att;
								};
								('step 1');
								if (result.bool) {
									player.addTempSkill('lg_kuangquanduanshi1_temp');
									event.target1 = result.targets[0];
									event.target1
										.chooseControl()
										.set('choiceList', ['交给' + get.translation(player) + '一张手牌', '令其摸一张牌'])
										.set('ai', function (event, player) {
											var att = get.attitude(player, event.target1);
											if (att > 0) return 0;
											return 1;
										});
								} else event.finish();
								('step 2');
								if (result.index == 1) {
									player.draw();
									event.finish();
								} else {
									event.target1.chooseCard('交给' + get.translation(player) + '一张手牌', 'h', true).ai = function (card) {
										if (card.name == 'sha') return 1;
										return 6 - get.value(card);
									};
								}
								('step 3');
								if (result.bool) {
									player.gain(result.cards[0], event.target1, 'giveAuto');
									if (player.stat[player.stat.length - 1].card.sha > 0) {
										player.stat[player.stat.length - 1].card.sha--;
									}
								}
							},
							subSkill: {
								temp: {
									charlotte: true,
								},
							},
						},
						lg_quanzouhua_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_quanzouhua0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_quanzouhua0 = 0;
								player.markSkill('lg_quanzouhua0');
							},
							filter(event, player) {
								return player.storage.lg_quanzouhua0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_quanzouhua0 += 5;
								player.markSkill('lg_quanzouhua0');
							},
						},
						lg_jujuewanwei: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'phaseDiscardEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_jujuewanwei.jpg',
							intro: {
								content: '灵力消耗:<br/>30点<br/><br/>符卡效果:<br/>弃牌阶段结束时,若你在此阶段内弃置♦️️牌,你可以弃置两张基本牌.若如此做,将手牌数补至X(X为你已损失的体力值).',
							},
							filter(event, player) {
								if (event.cards) {
									if (Array.isArray(event.cards))
										for (var i of event.cards) {
											//QQ
											if (i.suit == 'diamond') return true;
										}
								}
								return false;
							},
							content() {
								player.chooseToDiscard('弃置两张基本牌', 2, 'h', true, { type: 'basic' });
								player.drawTo(player.maxHp - player.hp);
							},
						},
						lg_jujuewanwei0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_jujuewanweiBegin',
							},
							filter(event, player) {
								return player.storage.lg_quanzouhua0 < 30;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_nizhuan: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								global: ['respond', 'useCard'],
							},
							filter(event, player) {
								if (!event.respondTo) return false;
								if (event.player == player && player != event.respondTo[0]) {
									var cards = [];
									if (get.itemtype(event.respondTo[1]) == 'card') cards.push(event.respondTo[1]);
									else if (event.respondTo[1].cards) cards.addArray(event.respondTo[1].cards);
									return cards.filterInD('od').length != 0;
								}
								if (event.player != player && player == event.respondTo[0]) {
									return event.cards && event.cards.filterInD('od').length;
								}
								return false;
							},
							check(event, player) {
								return true;
								// return get.value(event.cards.filterInD('od'), player) > 0;
							},
							logTarget: 'player',
							content() {
								var cards = [];
								if (trigger.player == player && player != trigger.respondTo[0]) {
									if (get.itemtype(trigger.respondTo[1]) == 'card') cards.push(trigger.respondTo[1]);
									else if (trigger.respondTo[1].cards) cards.addArray(trigger.respondTo[1].cards);
								} else {
									cards = trigger.cards;
								}
								cards = cards.filterInD('od');
								player.gain(cards, 'log', 'gain2');
							},
						},
						lg_yongdong: {
							zhuanhuanji: true,
							init(player) {
								player.storage.lg_yongdong = [1, 2, 3];
							},
							audio: 'ext:幻颜风华/audio:2',
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_yongdong.jpg',
							intro: {
								content(storage, player, skill) {
									if (player.storage.lg_yongdong[0] == 1) return '❶';
									else if (player.storage.lg_yongdong[0] == 2) return '❷';
									else if (player.storage.lg_yongdong[0] == 3) return '❸';
								},
							},
							trigger: {
								global: 'useCardBegin',
							},
							filter(event, player) {
								if (player.hasSkill('lg_yongdong_temp')) return false;
								if (event.parent.name == 'lg_yongdong') return false;
								if (!event.targets) return false;
								if (event.targets.length != 1) return false;
								if (event.card.suit != 'club') return false;
								return player.countCards('he');
							},
							forced: true,
							content() {
								'step 0';
								var str = '';
								if (player.storage.lg_yongdong[0] == 1) {
									str = '弃置一张♣️️牌,选择一张牌替换' + get.translation(trigger.player) + '对' + get.translation(trigger.targets[0]) + '使用的' + get.translation(trigger.card) + '？';
								}
								if (player.storage.lg_yongdong[0] == 2) {
									str = '弃置一张♣️️牌,令' + get.translation(trigger.player) + '对' + get.translation(trigger.targets[0]) + '使用' + get.translation(trigger.card) + '指定的目标替换？';
								}
								if (player.storage.lg_yongdong[0] == 3) {
									var temp = player.storage.lg_yongdong_mark;
									event.tars = [];
									if (temp.length) {
										for (var i = 0; i < temp.length; i++) {
											if (temp[i].isAlive() && temp[i] != player) event.tars.push(temp[i]);
										}
										if (event.tars.length) str = '弃置一张♣️️牌,对' + get.translation(event.tars) + '各视为使用一张【魔力涌动】？';
									}
								}
								player.chooseCard(str, 1, 'he', { suit: 'club' }, function (card) {
									var cds = _status.event.getTrigger().cards;
									return !cds.includes(card);
								}).ai = function (card) {
									var tri = _status.event.getTrigger();
									if (get.attitude(player, tri.player) > 0 && player.storage.lg_yongdong[0] != 3) return 0;
									var eff = get.effect(tri.targets[0], tri.card, tri.player, player);
									if (player.storage.lg_yongdong[0] == 1 && eff < 0) return 5 - get.value(card);
									if (player.storage.lg_yongdong[0] == 2 && eff < 0) return 6 - get.value(card);
									if (player.storage.lg_yongdong[0] == 3) return 4 - get.value(card);
									return 0;
								};
								('step 1');
								if (result.bool) {
									event.dis = result.cards[0];
								} else event.finish();
								('step 2');
								if (player.storage.lg_yongdong[0] == 1) {
									player
										.chooseCard('he', '选择一张手牌替换' + get.translation(trigger.player) + '使用的' + get.translation(trigger.card), function (card) {
											var info = get.info(card);
											if (info.selectTarget && info.selectTarget == 2) return false;
											if (info.notarget) return false;
											var tri = _status.event.getTrigger();
											return event.dis != card;
											// tri.player.canUse(card,tri.targets[0],false)
										})
										.set('ai', function (card) {
											var tri = _status.event.getTrigger();
											var eff = get.effect(tri.targets[0], card, tri.player, player);
											if (eff > 0) {
												return get.value(tri.card) - get.value(card);
											} else {
												return get.value(tri.card) - get.value(card) - 1;
											}
										});
								} else if (player.storage.lg_yongdong[0] == 2) {
									event.goto(4);
								} else if (player.storage.lg_yongdong[0] == 3) {
									event.goto(6);
								}
								('step 3');
								if (result.bool) {
									player.discard(event.dis);
									player.gain(trigger.cards);
									game.log(player, '用', result.cards[0], '替换了', trigger.player, '使用的', trigger.card);
									player.lose(result.cards[0], ui.special);
									player.$throw(result.cards[0], 1000, 'nobroadcast');
									trigger.card = result.cards[0];
									trigger.cards = result.cards;
									trigger.card.cards = trigger.cards;
									if (!player.storage.lg_yongdong_mark.includes(trigger.player)) {
										player.storage.lg_yongdong_mark.push(trigger.player);
									}
									event.goto(7);
								} else event.finish();
								('step 4');
								player.chooseTarget(
									'令' + get.translation(trigger.player) + '使用' + get.translation(trigger.card) + '指定的目标替换',
									function (card, player, target) {
										var tar = _status.event.getTrigger();
										//return target!=tar.targets[0]&&lib.filter.targetEnabled(trigger.card,trigger.player,target);
										return !tar.targets.includes(target);
									},
									function (target) {
										var tri = _status.event.getTrigger();
										var eff = get.effect(target, tri.card, tri.player, player);
										return eff;
									}
								);
								('step 5');
								if (result.bool) {
									player.discard(event.dis);
									trigger.targets.remove(trigger.targets[0]);
									trigger.targets.push(result.targets[0]);
									if (!player.storage.lg_yongdong_mark.includes(trigger.player)) {
										player.storage.lg_yongdong_mark.push(trigger.player);
									}
									game.log(player, '', trigger.player, '使用的', trigger.card, '重新指定了1名目标');
									event.goto(7);
								} else event.finish();
								('step 6');
								player.discard(event.dis);
								player.useCard({ name: 'lg_moliyongdong' }, event.tars);
								('step 7');
								player.addTempSkill('lg_yongdong_temp');
								var temp = player.storage.lg_yongdong.shift();
								player.storage.lg_yongdong.push(temp);
								player.markSkill('lg_yongdong_mark');
							},
							ai: {
								expose: 0.3,
							},
							group: ['lg_yongdong_mark'],
							subSkill: {
								mark: {
									init(player) {
										player.storage.lg_yongdong_mark = [];
									},
									markimage: 'extension/幻颜风华/Trace/lg_trace_yongdong.jpg',
									intro: {
										content(storage, player) {
											if (!storage.length) return '你没有对任何角色发动过此技能';
											else {
												return '发动过技能的:' + get.translation(storage);
											}
										},
									},
								},
								temp: {
									charlotte: true,
								},
							},
						},
						lg_bingzhuifengbao: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							init(player) {
								player.storage.lg_bingzhuifengbao = [];
							},
							intro: {
								content: 'cards',
								onunmark(storage, player) {
									if (storage && storage.length) {
										player.$throw(storage, 1000);
										game.cardsDiscard(storage);
										game.log(storage, '被置入了弃牌堆');
										storage.length = 0;
									}
								},
							},
							filter(event, player) {
								return event.nature == 'ice' && event.player.countCards('hej') > 1;
							},
							logTarget(event, player) {
								return event.player;
							},
							line: 'water',
							check(event, player) {
								var target = event.player;
								if (get.attitude(player, target) > 0 && target.hp > 3 && target.countCards('j') > 0) return true;
								if (get.attitude(player, target) <= 0 && target.countCards('hej') == target.countCards('j')) return false;
								return get.attitude(player, target) <= 0;
							},
							content() {
								'step 0';
								player.choosePlayerCard('hej', trigger.player, 2, true);
								('step 1');
								if (result.links) {
									player.storage.lg_bingzhuifengbao = player.storage.lg_bingzhuifengbao.concat(result.links);
									trigger.player.lose(result.links, ui.special, 'toStorage');
									trigger.player.$throw(result.links, 1000);
								}
							},
						},
						lg_yileina_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:1',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_bingzhuifengbao1: {
							trigger: {
								player: 'lg_bingzhuifengbaoAfter',
							},
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current.isTurnedOver();
								});
							},
							content() {
								'step 0';
								event.players = get.players(player);
								event.num = 0;
								for (var i = 0; i < event.players.length; i++) {
									if (!event.players[i].isTurnedOver()) {
										event.players.splice(i--, 1);
									}
								}
								('step 1');
								if (event.players.length) {
									event.players.shift().loseHp();
									event.redo();
								}
							},
						},
						lg_diancichang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseEnd',
							},
							filter(event, player) {
								if (!event.player.isAlive()) return false;
								var num = player.countCards('h');
								if (num >= 5) return false;
								var num2 = 0;
								for (var i = 1; i <= 5; i++) {
									if (event.player.isEmpty(i)) num2++;
								}
								return num < num2;
							},
							logTarget: 'player',
							content() {
								var num2 = 0;
								for (var i = 1; i <= 5; i++) {
									if (trigger.player.isEmpty(i)) num2++;
								}
								player.drawTo(num2);
								if (player.countCards('h', { number: '3' }) > player.hp) player.addTempSkill('lg_diancichang1', { player: 'phaseBegin' });
								if (player.countCards('h', { number: '3' }) == player.hp) trigger.player.addTempSkill('lg_gandian', { player: 'recoverEnd' });
							},
						},
						lg_diancichang1: {
							trigger: {
								player: 'damageBefore',
							},
							filter(event, player) {
								return event.nature == 'thunder';
							},
							forced: true,
							content() {
								trigger.cancel();
							},
							ai: {
								nofire: true,
								effect: {
									target(card, player, target, current) {
										if (get.tag(card, 'fireDamage')) return 0;
									},
								},
							},
						},
						lg_gandian: {
							trigger: {
								player: 'damageBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_gandian.jpg',
							intro: {
								content: '「感电」<br/>状态效果:<br/>当你受到雷电伤害时,随机弃置区域内的两张牌,此伤害值+1.',
							},
							forced: true,
							filter(event, player) {
								return event.nature == 'thunder';
							},
							content() {
								player.popup('感电', 'thunder');
								trigger.num++;
								player.randomDiscard(2, 'hej');
							},
						},
						lg_leijizhiqiang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardToPlayered',
							},
							filter(event, player) {
								return event.card && event.card.number == '3' && player.countCards('h') && event.target.countCards('h');
							},
							content() {
								'step 0';
								player
									.chooseToDiscard(get.prompt('lg_leijizhiqiang', trigger.target), '弃置一张手牌？', 'h')
									.set('ai', function (card) {
										var att = get.attitude(player, trigger.target);
										var getCard = trigger.target.countCards('he', { suit: card.suit });
										var value = (10 - get.value(card)) / 10;
										if (att < 0) {
											if (getCard < 2) return -1;
											return getCard + value;
										}
										return -1;
									})
									('step 1');
								if (result.bool) {
									trigger.target.showHandcards();
									event.suitx = result.cards[0].suit;
								} else event.finish();
								('step 2');
								var todis = trigger.target.getCards('he', { suit: event.suitx });
								if (todis.length) trigger.target.discard(todis);
							},
						},
						lg_chaodiancipao: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseEnd',
							},
							filter(event, player) {
								var cards = [];
								game.countPlayer2(function (current) {
									current.getHistory('useCard', function (evt) {
										if (evt.getParent('phaseUse').player == event.player && evt.cards && evt.cards.length && evt.cards.filterInD('d').length) cards.addArray(evt.cards.filterInD('d'));
									});
								});
								return cards.length;
							},
							forced: true,
							content() {
								'step 0';
								var cards = [];
								game.countPlayer2(function (current) {
									current.getHistory('useCard', function (evt) {
										if (evt.getParent('phaseUse').player == trigger.player && evt.cards && evt.cards.length && evt.cards.filterInD('d').length) cards.addArray(evt.cards.filterInD('d'));
									});
								});
								player
									.chooseCardButton(get.prompt('lg_chaodiancipao'), cards, 1, '将其中一张牌置于牌堆顶')
									.set('filterButton', function (button) {
										return get.position(button.link) == 'd';
									})
									.set('ai', function (button) {
										var player = _status.event.player;
										var target = _status.event.targetx;
										var att = get.attitude(player, target);
										var judges = target.getCards('j');
										if (judges.length) {
											var judge = get.judge(judges[0]);
											if (ui.cardPile.childNodes.length) return (judge(button.link) - judge(ui.cardPile.firstChild)) * att;
											return judge(button.link) * att;
										} else {
											if (ui.cardPile.childNodes.length >= 2) return (target.getUseValue(button.link) - target.getUseValue(ui.cardPile.childNodes[1])) * att;
											return target.getUseValue(button.link) * att;
										}
									})
									.set('targetx', trigger.player.next);
								('step 1');
								if (result.bool) {
									result.links[0].fix();
									game.log(player, '将', result.links[0], '置于牌堆顶');
									player.$throw(result.links[0], 1000);
									ui.cardPile.insertBefore(result.links[0], ui.cardPile.firstChild);
								}
							},
						},
						lg_chaodiancipao1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_chaodiancipaoAfter',
							},
							filter(event, player) {
								return player.countCards('h', { number: '3' }) == player.hp;
							},
							forced: true,
							content() {
								'step 1';
								player.previous.damage(2, 'thunder');
								('step 2');
								player.previous.previous.damage(2, 'thunder');
								('step 3');
								player.previous.previous.previous.damage(2, 'thunder');
							},
						},
						lg_yubanmeiqin_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jianshichuansong: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['shaBefore'],
							},
							filter(event, player) {
								if (event.player == player) return false;
								return player.countCards('h') && event.player.countCards('h');
							},
							logTarget: 'player',
							check(event, player) {
								if (get.attitude(player, event.player) > 0) return false;
								var hs = player.getCards('h');
								if (hs.length < 3) return false;
								var bool = false;
								for (var i = 0; i < hs.length; i++) {
									if (hs[i].number >= 9 && get.value(hs[i]) < 7) {
										bool = true;
										break;
									}
								}
								if (!bool) return false;
								return true;
							},
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								if (result.bool) {
									player.gain(result.player, 'gain2');
									player.gain(result.target, 'gain2');
								} else {
									trigger.target = trigger.player;
									player.swapHandcards(trigger.player);
									player.phaseUse();
									player.addTempSkill('lg_jianshichuansong1', { player: 'phaseUseEnd' });
								}
							},
							ai: {
								expose: 0.3,
								threaten: 0.9,
							},
						},
						lg_kongjianzhangwo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'chooseToCompareBegin',
							},
							forced: true,
							filter(event, player) {
								var targets = event.targets && event.targets.length ? event.targets.slice(0) : [event.target];
								targets.add(event.player);
								return game.hasPlayer(function (current) {
									return !targets.includes(current) && current.countCards('h');
								});
							},
							content() {
								'step 0';
								var targets = trigger.targets && trigger.targets.length ? trigger.targets.slice(0) : [trigger.target];
								targets.add(trigger.player);
								var next = player.chooseTarget(2, function (card, player, target) {
									if (ui.selected.targets.length) {
										return !_status.event.targetx.includes(target) && target.countCards('h');
									} else {
										return _status.event.targetx.includes(target);
									}
								});
								next.set('targetx', targets);
								next.set('ai', function (target) {
									var player = _status.event.player;
									var att = get.attitude(player, target);
									if (ui.selected.targets.length == 0) {
										return att;
									} else return -att;
								});
								next.set('complexSelect', true);
								next.set('multitarget', true);
								next.set('targetprompt', ['发起者', '目标']);
								next.set('prompt', get.prompt2('lg_kongjianyidong'));
								('step 1');
								if (result.bool) {
									event.target1 = result.targets[0];
									event.target2 = result.targets[1];
									event.target2.chooseCard('代替其打出一张拼点牌', 'h', true);
									//event.target2.chooseCard('代替其打出一张拼点牌','h',true);
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									event.card = result.cards[0];
									event.target2.respond(event.card, 'highlight');
									if (!trigger.fixedResult) trigger.fixedResult = {};
									trigger.fixedResult[event.target1.playerid] = event.card;
								} else {
									event.finish();
								}
								('step 3');
								game.cardsGotoOrdering(event.card).relatedEvent = trigger;
								game.swapSeat(player, trigger.player);
							},
							ai: {
								expose: 0.8,
							},
						},
						lg_kongjianyidong: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							changeSeat: true,
							filterTarget(card, player, target) {
								return player != target && player.next != target;
							},
							filterCard: {
								type: 'equip',
							},
							check(card) {
								return 4 - get.value(card);
							},
							content() {
								game.swapSeat(player, target);
							},
							ai: {
								order: 4,
								result: {
									player(player, target) {
										var att = get.attitude(player, target);
										if (target == player.previous && att > 0) return att;
										if (target == player.next && att < 0) return -att;
										var att2 = get.attitude(player, player.next);
										if (target == player.next.next && att < 0 && att2 < 0) return -att - att2;
										return 0;
									},
								},
							},
						},
						lg_baijingheizi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jianshichuansong1: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							enable: 'phaseUse',
							filterTarget(card, player, target) {
								if (player == target) return false;
								if (!ui.selected.targets.length) return target.countCards('h') > 0;
								return ui.selected.targets[0].canCompare(target);
							},
							selectTarget: 2,
							multitarget: true,
							multiline: true,
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							prepare: 'throw',
							discard: false,
							filterCard: true,
							check(card) {
								return 6 - get.value(card);
							},
							content() {
								'step 0';
								if (targets[0].canCompare(targets[1])) {
									targets[0].chooseToCompare(targets[1]);
								} else {
									event.finish();
								}
								('step 1');
								if (result.bool) {
									targets[0].gain(cards, 'log');
									targets[0].$gain2(cards);
									targets[1].damage(targets[0]);
								} else if (!result.tie) {
									targets[1].gain(cards, 'log');
									targets[1].$gain2(cards);
									targets[0].damage(targets[1]);
								}
							},
							ai: {
								expose: 0.3,
								threaten: 2,
								order: 9,
								result: {
									target: -1,
								},
							},
						},
						lg_bingyun: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseEnd',
							},
							filter(event, player) {
								return player.countUsed() >= Math.min(player.hp);
							},
							content() {
								'step 0';
								player
									.chooseTarget('冰陨', function (card, player, target) {
										return player != target && get.distance(player, target, 'attack') <= 1;
									})
									.set('prompt2', '对攻击范围内的一名其他角色造成1点冰属性伤害？').ai = function (target) {
										if (player.hp == 1) return 0;
										if (player.hp == 2 && target.hp >= 3) return 0;
										return get.damageEffect(target, player, player);
									};
								('step 1');
								if (result.bool) {
									player.line(result.targets[0]);
									result.targets[0].damage('ice');
								} else {
									player.draw(2);
								}
							},
							ai: {
								order: -10,
								result: {
									target: 2,
								},
								threaten: 1.5,
							},
						},
						lg_guizhu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToTargeted',
							},
							forced: true,
							filter(event, player) {
								return (
									player != event.player &&
									event.targets.length == 1 &&
									game.hasPlayer(function (current) {
										return current.countCards('he') > 0;
									})
								);
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_guizhu'), '令一名角色重铸一张牌', function (card, player, target) {
										return target.countCards('he') > 0;
									})
									.set('ai', function (target) {
										return get.attitude(_status.event.player, target) * Math.min(3, Math.floor(target.countCards('h') / 2));
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									event.target = target;
								} else event.finish();
								('step 2');
								if (target.countCards('he') == 0) event.finish();
								else target.chooseCard('he', 1, true, '请重铸一张牌');
								('step 3');
								target.loseToDiscardpile(result.cards);
								target.draw();
								if (player.countCards('he') < target.countCards('he')) target.recover();
							},
						},
						lg_leimu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jinglingqiyue: {
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_jinglingqiyue_a', 'lg_jinglingqiyue_b', 'lg_jinglingqiyue_c', 'lg_jinglingqiyue_e', 'lg_jinglingqiyue_g'],
							subSkill: {
								a: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										player: ['chooseToRespondBefore', 'chooseToUseBefore'],
									},
									filter(event, player) {
										if (event.responded) return false;
										if (player.storage.lg_jinglingqiyue) return false;
										if (!event.filterCard || !event.filterCard({ name: 'shan' }, player, event)) return false;
										if (_status.currentPhase == player) return false;
										if (player.countCards('h')) return false;
										return true;
									},
									check(event, player) {
										if (get.damageEffect(player, event.player, player) >= 0) return false;
										return true;
									},
									content() {
										'step 0';
										if (event.current == undefined) event.current = player.next;
										if (event.current == player) event.finish();
										else {
											if ((event.current == game.me && !_status.auto) || get.attitude(event.current, player) > 2 || event.current.isOnline()) {
												player.storage.lg_jinglingqiyue = true;
												var next = event.current.chooseToRespond('代替' + get.translation(player) + '打出一张闪？', { name: 'shan' });
												next.set('ai', function () {
													var event = _status.event;
													return get.attitude(event.player, event.source) - 2;
												});
												next.set('skillwarn', '代替' + get.translation(player) + '打出一张闪');
												next.autochoose = lib.filter.autoRespondShan;
												next.set('source', player);
											}
										}
										('step 1');
										player.storage.lg_jinglingqiyue = false;
										if (result.bool) {
											event.finish();
											trigger.result = { bool: true, card: { name: 'shan' } };
											trigger.responded = true;
											trigger.animate = false;
										} else {
											event.current = event.current.next;
											event.goto(0);
										}
									},
									ai: {
										respondShan: true,
										skillTagFilter(player) {
											if (player.storage.lg_jinglingqiyue) return false;
											if (_status.currentPhase == player) return false;
											if (player.countCards('h')) return false;
										},
									},
								},
								b: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										player: 'chooseToRespondBegin',
									},
									check(event) {
										if (event.lg_jinglingqiyue) return false;
										return true;
									},
									filter(event, player) {
										if (event.responded) return false;
										if (player.storage.lg_jinglingqiyue) return false;
										if (!event.filterCard || !event.filterCard({ name: 'sha' }, player, event)) return false;
										if (_status.currentPhase == player) return false;
										if (player.countCards('h')) return false;
										return true;
									},
									content() {
										'step 0';
										if (event.current == undefined) event.current = player.next;
										if (event.current == player) event.finish();
										else {
											player.storage.lg_jinglingqiyue = true;
											var next = event.current.chooseToRespond('代替' + get.translation(player) + '打出一张杀？', { name: 'sha' });
											next.set('ai', function () {
												var event = _status.event;
												return get.attitude(event.player, event.source) - 2;
											});
											next.set('source', player);
											next.set('lg_jinglingqiyue', true);
											next.set('skillwarn', '代替' + get.translation(player) + '打出一张杀');
											next.noOrdering = true;
											next.autochoose = lib.filter.autoRespondSha;
										}
										('step 1');
										player.storage.lg_jinglingqiyue = false;
										if (result.bool) {
											event.finish();
											trigger.result = result;
											trigger.responded = true;
											trigger.animate = false;
										} else {
											event.current = event.current.next;
											event.goto(0);
										}
									},
								},
								c: {
									audio: 'ext:幻颜风华/audio:2',
									enable: 'chooseToUse',
									prompt: '发动此技能？',
									filter(event, player) {
										if (event.filterCard && !event.filterCard({ name: 'sha' }, player, event)) return false;
										if (player.hasSkill('lg_jinglingqiyue_d')) return false;
										if (!lib.filter.cardUsable({ name: 'sha' }, player)) return false;
										if (_status.currentPhase == player) return false;
										if (player.countCards('h')) return false;
										return true;
									},
									filterTarget(card, player, target) {
										if (_status.event._backup && typeof _status.event._backup.filterTarget == 'function' && !_status.event._backup.filterTarget({ name: 'sha' }, player, target)) {
											return false;
										}
										return player.canUse({ name: 'sha' }, target);
									},
									content() {
										'step 0';
										if (event.current == undefined) event.current = player.next;
										if (event.current == player) {
											player.addSkill('lg_jinglingqiyue_d');
											event.getParent(2).step = 0;
											event.finish();
										} else {
											var next = event.current.chooseToRespond('代替' + get.translation(player) + '对' + get.translation(target) + '使用一张杀', function (card, player, event) {
												event = event || _status.event;
												return card.name == 'sha' && event.source.canUse(card, event.target);
											});
											next.set('ai', function (card) {
												var event = _status.event;
												return get.effect(event.target, card, event.source, event.player);
											});
											next.set('source', player);
											next.set('target', target);
											next.set('lg_jinglingqiyue', true);
											next.set('skillwarn', '代替' + get.translation(player) + '打出一张杀');
											next.noOrdering = true;
											next.autochoose = lib.filter.autoRespondSha;
										}
										('step 1');
										if (result.bool) {
											event.finish();
											if (result.cards && result.cards.length) {
												player.useCard({ name: 'sha' }, result.cards, target).animate = false;
											} else {
												player.useCard({ name: 'sha' }, target).animate = false;
											}
										} else {
											event.current = event.current.next;
											event.goto(0);
										}
									},
									ai: {
										respondSha: true,
										skillTagFilter(player) {
											if (_status.currentPhase == player) return false;
											if (player.countCards('h')) return false;
										},
										result: {
											target(player, target) {
												if (player.hasSkill('lg_jinglingqiyue_d')) return 0;
												return get.effect(target, { name: 'sha' }, player, target);
											},
										},
										order: 2.9,
									},
								},
								d: {
									trigger: {
										global: ['useCardAfter', 'useSkillAfter', 'phaseAfter'],
									},
									silent: true,
									filter(event, player) {
										return event.skill != 'lg_jinglingqiyue_c';
									},
									content() {
										'step 0';
										player.removeSkill('lg_jinglingqiyue_d');
									},
									forced: true,
									popup: false,
								},
								e: {
									audio: 'ext:幻颜风华/audio:2',
									enable: 'chooseToUse',
									name: '精灵契约',
									prompt: '发动此技能？',
									filter(event, player) {
										if (event.filterCard && !event.filterCard({ name: 'tao' }, player, event)) return false;
										if (player.hasSkill('lg_jinglingqiyue_f')) return false;
										if (!lib.filter.cardUsable({ name: 'tao' }, player)) return false;
										if (_status.currentPhase == player) return false;
										if (player.countCards('h')) return false;
										return true;
									},
									selectTarget: -1,
									filterTarget(card, player, target) {
										return target == _status.event.dying;
									},
									content() {
										'step 0';
										if (event.current == undefined) event.current = player.next;
										if (event.current == player) {
											player.addSkill('lg_jinglingqiyue_f');
											event.getParent(2).step = 0;
											event.finish();
										} else {
											var next = event.current.chooseToRespond('代替' + get.translation(player) + '对' + get.translation(target) + '使用一张桃', function (card, player, event) {
												event = event || _status.event;
												return card.name == 'tao';
											});
											next.set('ai', function (card) {
												var event = _status.event;
												return get.effect(event.target, card, event.source, event.player);
											});
											next.set('source', player);
											next.set('target', target);
											next.set('lg_jinglingqiyuec', true);
											next.set('skillwarn', '代替' + get.translation(player) + '打出一张桃');
											next.noOrdering = true;
											var restao = function () {
												return !this.player.countCards('h', 'tao');
											};
											next.autochoose = restao;
										}
										('step 1');
										if (result.bool) {
											event.finish();
											if (result.cards && result.cards.length) {
												player.useCard({ name: 'tao' }, result.cards, target).animate = false;
											} else {
												player.useCard({ name: 'tao' }, target).animate = false;
											}
										} else {
											event.current = event.current.next;
											event.goto(0);
										}
									},
									ai: {
										save: true,
										skillTagFilter(player) {
											if (_status.currentPhase == player) return false;
											if (player.countCards('h')) return false;
										},
										result: {
											target(player, target) {
												if (player.hasSkill('lg_jinglingqiyue_f')) return 0;
												return get.effect(target, { name: 'tao' }, player, target);
											},
										},
										order: 1,
									},
								},
								f: {
									trigger: {
										global: ['useCardAfter', 'useSkillAfter', 'phaseAfter', 'dyingAfter'],
									},
									silent: true,
									filter(event, player) {
										return event.skill != 'lg_jinglingqiyue_e' && event.skill != 'lg_jinglingqiyue_g';
									},
									content() {
										'step 0';
										player.removeSkill('lg_jinglingqiyue_f');
									},
									forced: true,
									popup: false,
								},
								g: {
									audio: 'ext:幻颜风华/audio:2',
									enable: 'chooseToUse',
									name: '精灵契约',
									prompt: '发动此技能？',
									filter(event, player) {
										if (event.filterCard && !event.filterCard({ name: 'jiu' }, player, event)) return false;
										if (player.hasSkill('lg_jinglingqiyue_h')) return false;
										if (!lib.filter.cardUsable({ name: 'jiu' }, player)) return false;
										if (_status.currentPhase == player) return false;
										if (player.countCards('h')) return false;
										return true;
									},
									selectTarget: -1,
									filterTarget(card, player, target) {
										return target == _status.event.dying;
									},
									content() {
										'step 0';
										if (event.current == undefined) event.current = player.next;
										if (event.current == player) {
											player.addSkill('lg_jinglingqiyue_h');
											event.getParent(2).step = 0;
											event.finish();
										} else {
											var next = event.current.chooseToRespond('代替' + get.translation(player) + '对' + get.translation(target) + '使用一张酒', function (card, player, event) {
												event = event || _status.event;
												return card.name == 'jiu' && event.source.canUse(card, event.target);
											});
											next.set('ai', function (card) {
												var event = _status.event;
												return get.effect(event.target, card, event.source, event.player);
											});
											next.set('source', player);
											next.set('target', target);
											next.set('lg_jinglingqiyued', true);
											next.set('skillwarn', '代替' + get.translation(player) + '打出一张酒');
											next.noOrdering = true;
											var resjiu = function () {
												return !this.player.countCards('h', 'jiu');
											};
											next.autochoose = resjiu;
										}
										('step 1');
										if (result.bool) {
											event.finish();
											if (result.cards && result.cards.length) {
												player.useCard({ name: 'jiu' }, result.cards, target).animate = false;
											} else {
												player.useCard({ name: 'jiu' }, target).animate = false;
											}
										} else {
											event.current = event.current.next;
											event.goto(0);
										}
									},
									ai: {
										save: true,
										skillTagFilter(player) {
											if (_status.currentPhase == player) return false;
											if (player.countCards('h')) return false;
										},
										result: {
											target(player, target) {
												if (player.hasSkill('lg_jinglingqiyue_h')) return 0;
												return get.effect(target, { name: 'jiu' }, player, target);
											},
										},
										order: 2,
									},
								},
								h: {
									trigger: {
										global: ['useCardAfter', 'useSkillAfter', 'phaseAfter', 'dyingAfter'],
									},
									silent: true,
									filter(event, player) {
										return event.skill != 'lg_jinglingqiyue_e' && event.skill != 'lg_jinglingqiyue_g';
									},
									content() {
										'step 0';
										player.removeSkill('lg_jinglingqiyue_h');
									},
									forced: true,
									popup: false,
								},
							},
						},
						lg_bingdongjingdi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'dyingBegin',
							},
							filter(event, player) {
								return event.source && event.source != player && event.source.countCards('h') != 0;
							},
							check(event, player) {
								return 1;
							},
							content() {
								player.discardPlayerCard(trigger.source, 'h', 'visible').set('filterButton', function (button, player) {
									return button.link.suit == 'club';
								});
							},
							ai: {
								maixie_defend: true,
							},
						},
						lg_yuedingdehuayuan: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filterTarget(card, player, target) {
								return target != player && target.countCards('h');
							},
							content() {
								'step 0';
								if (player.countCards('h')) {
									player.chooseCardButton('约定的花园', target.getCards('h')).ai = function (button) {
										return get.value(button.link) - 5;
									};
								} else {
									player.viewHandcards(target);
									event.finish();
								}
								('step 1');
								if (result.bool) {
									event.card = result.links[[0]];
									player.chooseCard('h', true, '交换一张手牌').ai = function (card) {
										return -get.value(card);
									};
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									player.gain(event.card, target);
									target.gain(result.cards, player);
									player.$giveAuto(result.cards, target);
									target.$giveAuto(event.card, player);
									game.log(player, '与', target, '交换了一张手牌');
								}
							},
							ai: {
								threaten: 1.3,
								result: {
									target(player, target) {
										return -target.countCards('h');
									},
								},
								order: 10,
								expose: 0.2,
							},
						},
						lg_aimiliya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_kai: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'discardEnd',
							},
							forced: true,
							filter(event, player) {
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										var card = i;
										var type = get.type(card);
										if (!get.info(card).multitarget && !get.info(card).notarget && get.position(card) == 'd') return true;
									}
								return false;
							},
							content() {
								'step 0';
								event.nh = 0;
								event.lists = [];
								for (var i = 0; i < trigger.cards.length; i++) {
									var card = trigger.cards[i];
									var type = get.type(card);
									if (!get.info(card).multitarget && !get.info(card).notarget && get.position(card) == 'd') event.lists.push(card);
								}
								('step 1');
								if (event.lists.length) {
									event.cardss = event.lists.shift();
									var cards = event.cardss;
									var info = get.info(cards);
									var select = get.select(info.selectTarget);
									if (['delay', 'equip'].includes(get.type(cards))) event.num = [1, 1];
									else if (info.toself) event.num = [1, 1];
									else if (select[1] == -1 && !info.toself) {
										if (info.filterTarget == true) {
											event.num = [1, game.players.length];
										} else if (typeof info.filterTarget == 'function') {
											if (info.filterTarget(null, player, player)) event.num = [1, game.players.length];
											else event.num = [1, game.players.length - 1];
										}
									} else event.num = get.select(info.selectTarget);
									player
										.chooseTarget('封解主·开<br/><br/>使用' + get.translation(cards), [event.num[0], event.num[1]], function (card, player, target) {
											return player.canUse(cards, target);
										})
										.set('ai', function (target) {
											if (cards.name == 'nanman' || cards.name == 'wanjian') return get.attitude(player, target) <= 0;
											if (cards.name == 'wugu' || cards.name == 'taoyuan') return get.attitude(player, target) > 0;
											return get.effect(target, cards, player, player);
										});
								} else event.finish();
								('step 2');
								if (result.bool) {
									var target = result.targets;
									var card = event.cardss;
									player.popup('封解主·开', 'metal');
									if (event.nh == 0) {
										event.nh++;
									}
									game.log(player, '对', target, '发动了技能', '#g【封解主·开】');
									player.line(target, 'metal');
									var targets = [];
									for (var i = 0; i < target.length; i++) {
										targets.push(target[i]);
									}
									player.useCard(card, targets).animate = false;
									event.goto(1);
								} else event.goto(1);
							},
							ai: {
								effect: {
									player(card, player, target) {
										if ((card.name == 'nanman' || card.name == 'wanjian' || card.name == 'wugu' || card.name == 'taoyuan') && player.isPhaseUsing()) return 'zeroplayertarget';
									},
								},
								threaten: 1.5,
								noh: true,
								noe: true,
							},
						},
						lg_kai0: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: ['rewriteGainResult', 'rewriteDiscardResult'],
							},
							forced: true,
							preHidden: true,
							filter(event, player) {
								return event.player != player;
							},
							forced: true,
							content() {
								'step 0';
								var prompt = '对' + get.translation(trigger.result.cards) + '发动此技能？';
								var next = player.choosePlayerCard(player, prompt, trigger.position);
								next.set('ai', function (button) {
									return 20 - get.value(button.link);
								});
								next.filterButton = trigger.filterButton;
								next.selectButton = trigger.result.cards.length;
								next.setHiddenSkill('lg_kai0');
								('step 1');
								if (result.bool) {
									trigger.result.cards = result.links.slice(0);
									trigger.result.links = result.links.slice(0);
									trigger.cards = result.links.slice(0);
									trigger.untrigger();
								}
							},
						},
						lg_bi: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCard',
							},
							forced: true,
							filter(event, player) {
								if (get.type(event.card) != 'trick') return false;
								return event.targets.length > 1 && player.countCards('he') > 0;
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									filterCard(card, player) {
										return lib.filter.cardDiscardable(card, player);
									},
									filterTarget(card, player, target) {
										var trigger = _status.event.getTrigger();
										return trigger.targets.includes(target);
									},
									// position:'he',
									ai1(card) {
										return 10 - get.value(card);
									},
									ai2(target) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										return -get.effect(target, trigger.card, player, player);
									},
									prompt: get.prompt('lg_bi'),
									prompt2: lib.translate.lg_bi_info,
								});
								('step 1');
								if (result.bool) {
									player.line(result.targets[0], 'metal');
									player.discard(result.cards);
									trigger.targets.remove(result.targets[0]);
								} else event.finish();
								('step 2');
								event.goto(0);
							},
						},
						lg_jie: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'judgeEnd',
							},
							forced: true,
							filter(event, player) {
								return game.hasPlayer(function (player) {
									return player.countCards('h') == 0;
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_jie'), '发动此技能', function (card, player, target) {
										return target.countCards('h') == 0;
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										return get.damageEffect(target, player, player);
									});
								('step 1');
								if (result.bool) {
									result.targets[0].chooseToDiscard(1, true, 'e');
								}
							},
						},
						lg_jie0: {
							trigger: {
								player: 'drawBegin',
							},
							forced: true,
							content() {
								'step 0';
								trigger.cancel();
								('step 1');
								if (ui.cardPile.childElementCount >= trigger.num) {
									var list = [];
									for (var i = 0; i < trigger.num; i++) {
										if (ui.cardPile.childElementCount == 0) {
											var cards = get.cards(ui.cardPile.childElementCount + 1);
											for (var i = 0; i < cards.length; i++) {
												ui.cardPile.insertBefore(cards[i], ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
											}
											game.updateRoundNumber();
										}
										var cardx = get.cardPile2(function (card) {
											var s = ['diamond'].randomGet();
											var n = [0, 1, 2, 4].randomGet();
											return card.suit == s && card.number == n && !list.includes(card);
										});
										if (cardx) list.push(cardx);
									}
									if (list.length) {
										player.gain(list, 'draw');
										if (list.length == trigger.num) event.finish();
										else trigger.num -= list.length;
									}
								}
								('step 2');
								var list = [];
								for (var i = 0; i < trigger.num; i++) {
									if (ui.cardPile.childElementCount == 0) {
										var cards = get.cards(ui.cardPile.childElementCount + 1);
										for (var i = 0; i < cards.length; i++) {
											ui.cardPile.insertBefore(cards[i], ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
										}
										game.updateRoundNumber();
									}
									var cardx = get.cardPile2(function (card) {
										var s = ['diamond'].randomGet();
										var n = [1, 2, 0, 4].randomGet();
										return card.suit == s && card.number == n && !list.includes(card);
									});
									if (cardx) list.push(cardx);
								}
								if (list.length) {
									player.gain(list, 'draw');
									if (list.length != trigger.num) {
										trigger.num -= list.length;
										event.goto(1);
									}
								} else event.goto(1);
							},
						},
						lg_fang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'showCharacterAfter',
							},
							directHit_ai: true,
							skillTagFilter(player, tag, arg) {
								if (!arg.target.hasSkillTag('lg_fang_nouse')) return false;
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_fang'), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										var pl = _status.event.player;
										var tahs = target.countCards('h');
										var att = get.attitude(pl, target);
										if (att < 0) {
											var usesha = 0;
											var num = 0;
											var ca = pl.getCards('h');
											for (var i = 0; i < ca.length; i++) {
												if (ca[i].name != 'sha' && get.tag(ca[i], 'damage') && pl.canUse(ca[i], target)) {
													var eff1 = get.effect(target, ca[i], pl, pl);
													if (eff1 > 0) num++;
												}
											}
											for (var i = 0; i < ca.length; i++) {
												if (ca[i].name == 'sha' && pl.canUse(ca[i], target)) {
													var eff1 = get.effect(target, ca[i], pl, pl);
													if (eff1 > 0) usesha++;
												}
											}
											if (usesha > 0) num++;
											if (target.hp <= 0) return -1;
											if (target.countCards('h') < 2) return -1;
											if (num > 1) return num / target.hp + 1;
										}
										if (att > 0) {
											if (target.countCards('h') == 0) return 0.5;
											if (target.countCards('h') > 0) return 1 / (target.countCards('h') + 1);
										}
										return -1;
									});
								('step 1');
								if (result.bool) {
									result.targets[0].link();
									result.targets[0].addTempSkill('lg_fang_nouse');
								}
							},
							subSkill: {
								nouse: {
									mark: true,
									marktext2: '放',
									marktext: '放',
									intro: {
										content: '你不能使用或打出牌.',
									},
									mod: {
										cardEnabled2(card) {
											return false;
										},
										cardEnabled(card, player) {
											return false;
										},
										cardUsable(card, player) {
											return false;
										},
										cardRespondable(card, player) {
											return false;
										},
										cardSavable(card, player) {
											return false;
										},
										targetInRange(card) {
											return false;
										},
									},
									ai: {
										threaten: 3,
										effect: {
											target(card, player, target) {
												if (get.tag(card, 'damage')) return [1, -1];
											},
										},
									},
								},
							},
						},
						lg_xinggongliucan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_fang1: {
							trigger: {
								player: 'dyingAfter',
							},
							_priority: 10,
							forced: true,
							content() {
								'step 0';
								var card = get.cardPile(function (card) {
									return get.type(card) == 'equip';
								});
								event.card = card;
								('step 1');
								if (event.card) {
									player.equip(event.card);
									var hp = player.hp;
									player.init('lg_xinggongliucan');
									player.hp = hp;
									player.update();
									ui.clear();
								}
							},
						},
						lg_fuyao1: {
							mod: {
								globalFrom(player, target, distance) {
									if (player.getEquip(2)) return distance + 2;
								},
							},
						},
						lg_fuyao: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'discardBegin',
							},
							filter(event, player) {
								return player.countCards('h', { suit: 'heart' });
							},
							forced: true,
							content() {
								player.recover();
							},
						},
						lg_suifengmotan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['recoverEnd', 'damageEnd'],
							},
							content() {
								'step 0';
								var card = get.cards()[0];
								player.gain(card);
								player.$gain(card);
								event.suit = card.suit;
								('step 1');
								var suit = event.suit;
								if (suit == 'spade') {
									player.chooseToDiscard('h');
								}
								if (suit == 'heart') player.previous.draw() && player.draw();
								if (suit == 'club') {
									player.recover();
								}
								if (suit == 'diamond') player.addTempSkill('lg_suifengmotan1', { player: 'phaseEnd' });
							},
							ai: {
								threaten: 2,
								moreDraw: true,
							},
						},
						lg_suifengmotan1: {
							nobracket: true,
							forced: true,
							_priority: 10,
							trigger: {
								source: 'damageBefore',
							},
							filter(event, player) {
								if (event.player.getEquips(2)) return true;
								return false;
							},
							content() {
								player.line(trigger.player, 'water');
								trigger.num--;
							},
						},
						lg_tunshiguangye1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'recoverEnd',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_tunshiguangye1')).ai = function (target) {
									if (target.countCards('hej') > player.countCards('hej') && get.attitude(player, target) < 0) return 1;
									if (player.countCards('hej') == 0) return 1;
									return 0;
								};
								('step 1');
								if (result.bool) {
									var pl = result.targets[0];
									player.line(pl);
									game.log(player, '和', pl, '交换了区域内的牌');
									var cards = [player.getCards('hej'), pl.getCards('hej')];
									player.lose(cards[0], ui.special);
									pl.lose(cards[1], ui.special);
									if (cards[0].length) player.$give(cards[0], pl);
									if (cards[1].length) pl.$give(cards[1], player);
									for (var i = 0; i < cards[1].length; i++) {
										player.equip(cards[1][i]);
									}
									for (var i = 0; i < cards[0].length; i++) {
										pl.equip(cards[0][i]);
									}
									if (cards[0].length == player.hp) player.turnOver();
								}
							},
						},
						lg_tunshiguangye: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['damageBegin'],
							},
							check(event, player) {
								return event.source && event.source.countCards('h') > player.countCards('h');
							},
							logTarget: 'source',
							filter(event, player) {
								if (!event.source) return false;
								return event.source && event.source.countCards('h') != player.countCards('h');
							},
							content() {
								'step 0';
								var num1 = trigger.source.countCards('h') - player.countCards('h');
								if (num1 < 0) player.chooseToDiscard('h', -num1, true);
								else player.draw(num1);
								('step 1');
								if (player.countCards('h', 'sha')) {
									var num2 = player.countCards('h', 'sha');
									player.chooseCard('请展示任意张【杀】', [1, num2], { name: 'sha' }, false).ai = function (card) {
										if (
											game.hasPlayer(function (current) {
												return player.canUse({ name: 'sha' }, current) && get.effect(current, { name: 'sha' }, player, player) > 0;
											})
										)
											return 20;
										return -1;
									};
								} else event.finish();
								('step 2');
								if (result.bool && result.cards) {
									player.showCards(result.cards);
									player.storage.lg_tunshiguangye_use = result.cards;
									player.addTempSkill('lg_tunshiguangye_use');
									player.markSkill('lg_tunshiguangye_use');
								}
							},
							ai: {
								maixie: true,
								maixie_hp: true,
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage')) {
											if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
											if (!target.hasFriend()) return;
											var num1 = player.countCards('h') - target.countCards('h');
											if (num1 <= 0) return;
											if (target.hp > 1) return [1, num1];
											else return [1, num1 * 0.5];
										}
									},
								},
							},
							subSkill: {
								use: {
									charlotte: true,
									onremove(player) {
										if (player.storage.lg_tunshiguangye_use) {
											for (var i = 0; i < player.storage.lg_tunshiguangye_use.length; i++) {
												player.chooseUseTarget(player.storage.lg_tunshiguangye_use[i], true, true);
											}
										}
									},
									intro: {
										content: 'cards',
									},
								},
							},
						},
						lg_shuangshenzange: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							logTarget(event, player) {
								var targets = [];
								var evt = event.parent;
								for (var i = event.num; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) targets.push(evt.targets[i]);
								}
								return targets;
							},
							line: 'metal',
							check(event, player) {
								var num = 0,
									init = true;
								var evt = event.parent;
								for (var i = event.num; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) {
										var eff = get.effect(evt.targets[i], event.card, player, player);
										if (init) {
											if (eff > 0) return false;
										}
										num += eff;
										init = false;
									}
								}
								return num < 0;
							},
							trigger: {
								global: ['useCardToBefore'],
							},
							init(player) {
								player.storage.lg_shuangshenzange = 0;
								player.storage.lg_shuangshenzangeCard = [];
								player.storage.lg_shuangshenzangeDis = false;
							},
							filter(event, player) {
								if (player.storage.lg_shuangshenzange != 2) return false;
								var evt = event.parent;
								if (evt.card != player.storage.lg_shuangshenzangeCard[0]) return false;
								for (var i = event.num; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) return true;
								}
								return false;
							},
							content() {
								var targets = [];
								var evt = trigger.parent;
								for (var i = trigger.num; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) targets.push(evt.targets[i]);
								}
								//    //game.rainSay(player,'对',targets,'发动了技能','<span style=\"color: #FFD700\">【双神赞歌】</span>');
								trigger.cancel();
								trigger.parent.excluded.addArray(
									game.filterPlayer(function (current) {
										return true;
									})
								);
								player.storage.lg_shuangshenzangeDis = false;
							},
							group: ['lg_shuangshenzange_push', 'lg_shuangshenzange_use', 'lg_shuangshenzange_update'],
							subSkill: {
								update: {
									popup: false,
									forced: true,
									trigger: {
										global: 'useCardEnd',
									},
									content() {
										'step 0';
										if (player.storage.lg_shuangshenzangeCard.length && trigger.card == player.storage.lg_shuangshenzangeCard[0] && player.storage.lg_shuangshenzangeDis) {
											player.storage.lg_shuangshenzangeDis = false;
											player.storage.lg_shuangshenzange = 0;
											player.storage.lg_shuangshenzangeCard = [];
											var name = '双神赞歌';
											var info = '<br><br>弃置一名其他角色的两张牌';
											player
												.chooseTarget(name + info, function (card, player, target) {
													return target.countCards('he') > 0;
												})
												.set('ai', function (target) {
													var recover = 0;
													if (target.getEquip('baiyin') && target.isDamaged()) recover++;
													var att = get.attitude(player, target);
													if (att > 0) {
														if (recover > 0) return 100;
														return 0;
													} else {
														if (target.countCards('he') == 1 && recover > 0) return 0;
														return 50;
													}
												});
										}
										('step 1');
										if (result.bool) {
											var target = result.targets[0];
											////game.rainSay(player,'对',target,'发动了武将技能','<span style=\"color: #FFD700\">【双神赞歌】</span>');
											player.discardPlayerCard('he', target, 2, true);
										}
										if (player.storage.lg_shuangshenzangeCard.length && trigger.card == player.storage.lg_shuangshenzangeCard[0]) {
											player.storage.lg_shuangshenzangeDis = false;
											player.storage.lg_shuangshenzange = 0;
											player.storage.lg_shuangshenzangeCard = [];
										}
									},
								},
								push: {
									forced: true,
									trigger: {
										target: 'useCardToTargeted',
									},
									filter(event, player) {
										return ['spade'].includes(event.card.suit) && !get.info(event.card).multitarget;
									},
									content() {
										'step 0';
										var targets = trigger.targets;
										var cards = trigger.card;
										var tar = trigger.player;
										var name = '双神赞歌';
										var info = '<br><br>令一名体力值等于你的其他角色成为' + get.translation(cards) + '的额外目标';
										player
											.chooseTarget(name + info, function (card, player, target) {
												var trigger = _status.event.getTrigger();
												return !targets.includes(target) && target.hp == player.hp && lib.filter.targetEnabled2(trigger.card, trigger.player, target);
											})
											.set('ai', function (target) {
												var trigger = _status.event.getTrigger();
												return get.effect(target, trigger.card, trigger.player, _status.event.player);
											});
										('step 1');
										if (result.bool) {
											var target = result.targets[0];
											////game.rainSay(player,'对',target,'发动了技能','<span style=\"color: #FFD700\">【双神赞歌】</span>');
											trigger.targets.push(target);
											game.log(target, '成为', trigger.card, '额外目标');
											player.storage.lg_shuangshenzange = 1;
											player.storage.lg_shuangshenzangeCard.push(trigger.card);
											player.storage.lg_shuangshenzangeDis = true;
										}
									},
								},
								use: {
									popup: false,
									forced: true,
									trigger: {
										global: ['useCard', 'respond'],
									},
									filter(event, player) {
										if (!event.respondTo) return false;
										if (player.storage.lg_shuangshenzange != 1) return false;
										if (event.respondTo[1] != player.storage.lg_shuangshenzangeCard[0]) return false;
										return true;
									},
									content() {
										player.storage.lg_shuangshenzange = 2;
									},
								},
							},
						},
						lg_xinsheng: {
							trigger: {
								player: 'recoverBegin',
							},
							forced: true,
							filter(event, player) {
								if (player.countCards('h', { type: 'basic' }) == 0) return true;
								if (player.countCards('h', { type: ['trick', 'delay'] }) == 0) return true;
								if (player.countCards('h', { type: 'equip' }) == 0) return true;
								return false;
							},
							content() {
								'step 0';
								if (player.countCards('h', { type: 'basic' }) == 0) {
									var card = get.cardPile(function (card) {
										return get.type(card) == 'basic';
									});
									if (card) {
										player.gain(card, 'draw');
									}
									event.basiccard = card;
								}
								('step 1');
								if (event.basiccard) {
									if (player.hasUseTarget(event.basiccard)) {
										var next = player.chooseToUse();
										next.filterCard = function (card) {
											return card == event.basiccard;
										};
										next.prompt = '使用' + get.translation(event.basiccard) + '？';
									}
								}
								('step 2');
								if (player.countCards('h', { type: ['trick', 'delay'] }) == 0) {
									var card = get.cardPile(function (card) {
										return get.type(card) == 'trick' || get.type(card) == 'delay';
									});
									if (card) {
										player.gain(card, 'draw');
									}
									event.trickcard = card;
								}
								('step 3');
								if (event.trickcard) {
									if (player.hasUseTarget(event.trickcard)) {
										var next = player.chooseToUse();
										next.filterCard = function (card) {
											return card == event.trickcard;
										};
										next.prompt = '使用' + get.translation(event.trickcard) + '？';
									}
								}
								('step 4');
								if (player.countCards('h', { type: 'equip' }) == 0) {
									var card = get.cardPile(function (card) {
										return get.type(card) == 'equip';
									});
									if (card) {
										player.gain(card, 'draw');
									}
									event.equipcard = card;
								}
								('step 5');
								if (event.equipcard) {
									if (player.hasUseTarget(event.equipcard)) {
										var next = player.chooseToUse();
										next.filterCard = function (card) {
											return card == event.equipcard;
										};
										next.prompt = '使用' + get.translation(event.equipcard) + '？';
									}
								}
							},
							ai: {
								threaten: 1.7,
							},
						},
						lg_diesikuli_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_chengshuang: {
							trigger: {
								global: 'phaseBefore',
								player: 'enterGame',
							},
							group: 'sunohara_chengshuang_phase',
							forced: true,
							filter(event, player) {
								return event.name != 'phase' || game.phaseNumber == 0;
							},
							content() {
								'step 0';
								var evt = event.getParent('phase');
								if (evt && evt.player == player) evt.sunohara_chengshuang = true;
								player.chooseControl('male', 'female').set('prompt', '选择你的性别');
								('step 1');
								var sex = result.control;
								game.broadcastAll(
									function (player, sex) {
										player.sex = sex;
										if (player.marks && player.marks.sunohara_chengshuang) player.marks.sunohara_chengshuang.firstChild.innerHTML = sex == 'male' ? '♂' : '♀';
									},
									player,
									sex
								);
								game.log(player, '将性别变更为', '#g' + get.translation(sex) + '性');
							},
							mark: true,
							intro: {
								content(storage, player) {
									if (player.sex == 'unknown' || player.sex == 'double') return '性别未确定';
									return '你的性别:' + get.translation(player.sex);
								},
							},
						},
						lg_shuangshen01: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'dyingBegin',
							},
							forced: true,
							content() {
								trigger.cancel();
								game;
								player.removeSkill('lg_shuangshen01');
								player.removeSkill('lg_tunshiguangye1');
								player.removeSkill('lg_tunshiguangye');
								player.removeSkill('lg_shuangshenzange');
								player.addSkill('lg_shuangshen1');
								player.addSkill('lg_shuangshen11');
							},
						},
						lg_shuangshen1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'recoverEnd',
							},
							forced: true,
							filter(event, player) {
								return player.countCards('he', { suit: 'spade' }) > 0;
							},
							content() {
								'step 0';
								var enemy = game.countPlayer(function (current) {
									return current != player && get.damageEffect(current, player, player) > 0;
								});
								var next = player.chooseCardTarget({
									position: 'he',
									filterTarget(card, player, target) {
										return player != target;
									},
									selectCard: [1, player.countCards('he', { suit: 'spade' })],
									selectTarget() {
										if (ui.selected.targets.length > ui.selected.cards.length) {
											game.uncheck('target');
										}
										return ui.selected.cards.length;
									},
									filterCard(card, player) {
										return card.suit == 'spade' && lib.filter.cardDiscardable(card, player);
									},
									ai1(card) {
										if (ui.selected.cards.length >= enemy) return 0;
										return 9 - get.value(card);
									},
									ai2(target) {
										return get.damageEffect(target, player, player);
									},
									prompt: get.prompt('lg_shuangshen1'),
								});
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									event.targets = result.targets;
									event.targets.sort(lib.sort.seat);
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets.length) {
									event.targets.shift().damage(2, 'nosource');
									event.redo();
								}
							},
							ai: {
								maixie: true,
								maixie_hp: true,
								effect(card, player, target) {
									if (get.tag(card, 'damage')) {
										if (player.hasSkillTag('jueqing', false, target)) return [1, -0.5];
										if (!target.hasFriend()) {
											if (get.mode() == 'guozhan') {
												if (!player.hasFriend()) return;
											} else {
												return;
											}
										}
										if (target.countCards('h') > 2 || target.countCards('e', { suit: 'spade' })) {
											return [1, 0, 0, -1];
										}
										return [1, -0.5];
									}
								},
							},
						},
						lg_shuangshen11: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dyingAfter',
							},
							forced: true,
							content() {
								trigger.cancel();
								gam;
								player.removeSkill('lg_shuangshen11');
								player.addSkill('lg_shuangshen2');
							},
						},
						lg_shuangshen2: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								return player.countCards('he', { suit: 'heart' }) > 0;
							},
							content() {
								'step 0';
								var enemy = game.countPlayer(function (current) {
									return current != player && get.damageEffect(current, player, player) > 0;
								});
								var next = player.chooseCardTarget({
									position: 'he',
									filterTarget(card, player, target) {
										return player != target;
									},
									selectCard: [1, player.countCards('he', { suit: 'heart' })],
									selectTarget() {
										if (ui.selected.targets.length > ui.selected.cards.length) {
											game.uncheck('target');
										}
										return ui.selected.cards.length;
									},
									filterCard(card, player) {
										return card.suit == 'heart' && lib.filter.cardDiscardable(card, player);
									},
									ai1(card) {
										if (ui.selected.cards.length >= enemy) return 0;
										return 9 - get.value(card);
									},
									ai2(target) {
										return get.damageEffect(target, player, player);
									},
									prompt: get.prompt('lg_shuangshen2'),
								});
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									event.targets = result.targets;
									event.targets.sort(lib.sort.seat);
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets.length) {
									event.targets.shift().damage(2, 'nosource');
									event.redo();
								}
							},
							ai: {
								maixie: true,
								maixie_hp: true,
								effect(card, player, target) {
									if (get.tag(card, 'damage')) {
										if (player.hasSkillTag('jueqing', false, target)) return [1, -0.5];
										if (!target.hasFriend()) {
											if (get.mode() == 'guozhan') {
												if (!player.hasFriend()) return;
											} else {
												return;
											}
										}
										if (target.countCards('h') > 2 || target.countCards('e', { suit: 'heart' })) {
											return [1, 0, 0, -1];
										}
										return [1, -0.5];
									}
								},
							},
						},
						lg_pengpengliwu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCardAfter',
							},
							filter(event, player) {
								return (event.card.name == 'sha' || event.card.name == 'huogong') && event.player != player && get.itemtype(event.cards) == 'cards' && get.position(event.cards[0]) == 'd';
							},
							check(event, player) {
								return get.attitude(player, event.player) > 2;
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCard('交给' + get.translation(trigger.player) + '装备区内的一张牌,获得' + get.translation(trigger.card), 'e').ai = function (card) {
									return 5 - get.value(card);
								};
								('step 1');
								if (result.bool) {
									trigger.player.gain(result.cards[0]);
									player.$give(result.cards[0], trigger.player);
									player.gain(trigger.cards, 'gain2');
									if (player.countCards('e') == player.hp) player.chooseUseTarget('指定目标', false, { name: 'sha', nature: 'fire' });
								}
							},
							ai: {
								expose: 0.2,
							},
						},
						lg_huoyuansu: {
							nobracket: true,
							trigger: {
								player: 'shaDamage',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_huo.jpg',
							intro: {
								content: '「火」<br/>元素效果:<br/>当你使用【杀】造成伤害后,你可以弃置两张♦️️手牌.若如此做,你对攻击范围内的其他角色各造成1点火焰伤害.',
							},
							filter(event, player) {
								return player.countCards('h', { suit: 'diamond' }) > 1;
							},
							check(event, player) {
								var active = 0;
								for (var i of game.players) {
									//QQ
									if (i == player) continue;
									if (!i.isOut()) {
										if (get.attitude(player, i) > 0) {
											if (get.distance(player, i, 'attack') <= 1) {
												active--;
												if (i.hp > 1) active += 0.5;
											}
										} else if (get.attitude(player, i) < 0) {
											if (get.distance(player, i, 'attack') <= 1) {
												active++;
												if (i.hp <= 1) active += 0.5;
											}
										}
									}
								}
								if (active > 0) return 1;
								return 0;
							},
							content() {
								'step 0';
								player.chooseToDiscard(2, true, 'h', { suit: 'diamond' });
								('step 1');
								var targets = [];
								for (var i of game.players) {
									//QQ
									if (i == player) continue;
									if (!i.isOut()) {
										if (get.distance(player, i, 'attack') <= 1) {
											targets.push(i);
										}
									}
								}
								for (var i = 0; i < targets.length; i++) {
									var mubiao = targets[i];
									player.line(mubiao, 'fire');
									targets[i].damage();
								}
							},
							ai: {
								basic: {
									order: 4,
									useful: 1,
									value: 5,
								},
								wuxie(target, card, player, viewer) {
									if (get.attitude(viewer, target) > 0 && target.countCards('h', 'shan')) {
										if (!target.countCards('h') || target.hp == 1 || Math.random() < 0.7) return 0;
									}
								},
								result: {
									target(player, target) {
										if (player.hasUnknown(2) && get.mode() != 'guozhan') return 0;
										var nh = target.countCards('h');
										if (get.mode() == 'identity') {
											if (target.isZhu && nh <= 2 && target.hp <= 1) return -100;
										}
										if (nh == 0) return -2;
										if (nh == 1) return -1.7;
										return -1.5;
									},
								},
								tag: {
									respond: 1,
									respondShan: 1,
									damage: 1,
									multitarget: 1,
									multineg: 1,
								},
							},
						},
						lg_bengbengzhadan: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return player.countCards('h', { suit: 'diamond' }) > 1;
							},
							filterCard: {
								suit: 'diamond',
							},
							selectCard: 2,
							filterTarget(card, player, target) {
								return player != target;
							},
							check(card) {
								return 10 - get.value(card);
							},
							content() {
								'step 0';
								target.damage('fire');
								if (get.is.altered('lg_bengbengzhadan')) {
									event.finish();
								}
								('step 1');
								var he = target.getCards('he');
								target.discard(he.randomGets(target.maxHp - target.hp));
							},
							ai: {
								expose: 0.3,
								result: {
									target(player, target) {
										return get.damageEffect(target, player) - (target.maxHp - target.hp) / 2;
									},
								},
								order: 5,
							},
						},
						lg_honghonghuohua: {
							subSkill: {
								draw: {
									mark: true,
									marktext2: '轰',
									marktext: '轰',
									intro: {
										name: '轰轰火花',
										name2: '轰',
										content(storage) {
											return '累计获得' + storage + '张牌.';
										},
									},
								},
								card: {
									mark: 'card',
									intro: {
										content: '轰轰火花',
									},
								},
								target: {
									intro: {
										content: '轰轰火花',
									},
								},
								draws: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: 'useCard',
									},
									logTarget: 'player',
									forced: true,
									filter(event, player) {
										if (!player.storage.lg_honghonghuohua_target) return false;
										if (!player.storage.lg_honghonghuohua_card) return false;
										if (event.player == player.storage.lg_honghonghuohua_target) return false;
										if (!event.targets || !event.targets.includes(player.storage.lg_honghonghuohua_target)) return false;
										return event.card.suit == player.storage.lg_honghonghuohua_card.suit;
									},
									content() {
										trigger.player.draw();
										if (trigger.player.countCards('h') < trigger.player.hp) trigger.player.damage('fire');
										trigger.player.addMark('lg_honghonghuohua_draw', 1);
									},
								},
							},
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							init(player, skill) {
								player.storage[skill] = false;
							},
							mark: true,
							marktext2: '轰',
							marktext: '轰',
							intro: {
								content: 'limited',
							},
							forced: true,
							filter(event, player) {
								return !player.storage.lg_honghonghuohua;
							},
							content() {
								'step 0';
								trigger.cancel();
								player
									.chooseTarget(get.prompt2('lg_honghonghuohua'), function (card, player, target) {
										return target != player && target.countCards('h');
									})
									.set('ai', function (target) {
										var att = get.attitude(_status.event.player, target);
										return -att;
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									player.storage.lg_honghonghuohua_target = target;
									player.addSkill('lg_honghonghuohua_target');
									player.choosePlayerCard('h', target, true, 'visible');
									event.target = target;
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									player.storage.lg_honghonghuohua = true;
									player.awakenSkill('lg_honghonghuohua');
									player.showCards(get.translation(event.target) + '的一张手牌<br>', result.links);
									player.storage.lg_honghonghuohua_card = result.links[0];
									player.addSkill('lg_honghonghuohua_card');
									player.addSkill('lg_honghonghuohua_draws');
								} else {
									event.finish();
								}
							},
						},
						lg_honghonghuohua1: {
							trigger: {
								player: 'damageBefore',
							},
							filter(event, player) {
								return event.nature == 'fire';
							},
							forced: true,
							content() {
								trigger.cancel();
								player.recover();
							},
							ai: {
								nofire: true,
								effect: {
									target(card, player, target, current) {
										if (get.tag(card, 'fireDamage')) return 0;
									},
								},
							},
						},
						lg_keli_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_bengbengzhadan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_bengbengzhadanBegin',
							},
							forced: true,
							content() {
								var n = [1, 2, 3].randomGet();
								if (n == 1) player.previous.damage('fire');
								if (n == 1) player.next.next.damage('fire');
								if (n == 2) player.next.next.damage('fire');
								if (n == 2) player.previous.previous.damage('fire');
								if (n == 3) player.previous.previous.previous.damage('fire');
								if (n == 3) player.next.damage('fire');
							},
						},
						lg_xuniouxiang: {
							trigger: {
								player: 'useCardToTarget',
							},
							forced: true,
							filter(event, player) {
								if (event.card.suit != 'heart') return false;
								return true;
							},
							content() {
								'step 0';
								var list = [];
								for (var i = 1; i < 6; i++) {
									if (!player.isDisabled('equip' + i)) list.push('equip' + i);
								}
								list.push('cancel2');
								player
									.chooseControl(list, function (event, player) {
										return 'equip1';
									})
									.set('prompt', '选择一个装备栏');
								('step 1');
								if (result.control != 'cancel2') {
									event.types = result.control;
									var bool = game.hasPlayer(function (target) {
										if (target == player) return false;
										if (!player.isEmpty(event.types) && !player.isEmpty(event.types)) return !target.isDisabled(event.types);
										return !target.isDisabled(event.types) && !target.isEmpty(event.types);
									});
									if (bool) {
										player.chooseTarget('与一名其他角色交换' + get.translation(event.types) + '栏内的牌', true, function (card, player, target) {
											if (target == player) return false;
											if (!player.isEmpty(event.types) && !player.isEmpty(event.types)) return !target.isDisabled(event.types);
											return !target.isDisabled(event.types) && !target.isEmpty(event.types);
										});
									}
								} else event.finish();
								('step 2');
								if (result.bool) {
									var target = result.targets[0];
									event.target = target;
									event.card1 = player.getEquip(event.types);
									event.card2 = target.getEquip(event.types);
									if (event.card1) player.lose(event.card1, ui.ordering, 'visible');
									if (event.card2) target.lose(event.card2, ui.ordering, 'visible');
									if (event.card1) player.$give(event.card1, target, false);
									if (event.card2) target.$give(event.card2, player, false);
								} else event.finish();
								('step 3');
								if (event.card2) player.equip(event.card2);
								if (event.card1) event.target.equip(event.card1);
							},
						},
						lg_kongjuyinmai1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_kongjuyinmaiBegin',
							},
							forced: true,
							content() { },
						},
						lg_xuezhikewang: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								global: 'dyingAfter',
							},
							filter(event, player) {
								return player.hp < player.maxHp && player.isMinHandcard();
							},
							content() {
								player.hp = player.maxHp;
							},
							ai: {
								threaten: 1.2,
							},
						},
						lg_linghunshouge: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardToBegin',
							},
							check(event, player) {
								return get.attitude(player, event.target) < 0;
							},
							filter(event, player) {
								return (event.card.name == 'sha' || event.card.name == '') && player.canCompare(event.target);
							},
							logTarget: 'target',
							content() {
								'step 0';
								player.chooseToCompare(trigger.target);
								('step 1');
								if (result.bool) {
									trigger.target.loseHp();
									trigger.target.chooseToDiscard(1, true, 'h');
									player.recover();
								} else {
									trigger.directHit = true;
								}
							},
						},
						lg_tonghuatingyuan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'JudgeAfter',
							},
							_priority: 6,
							filter(event, player) {
								return event.player.hp <= 0 && player.countCards('h', { suit: 'heart' });
							},
							check(event, player) {
								if (get.attitude(player, event.player) <= 0) return false;
								var cards = player.getCards('h', { suit: 'heart' });
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].name == 'tao') return false;
									if (get.value(cards[i]) > 7 && cards.length > 2) return false;
								}
							},
							content() {
								'step 0';
								player.showHandcards();
								('step 1');
								var cards = player.getCards('h', { suit: 'heart' });
								event.num = cards.length;
								player.discard(cards);
								('step 2');
								trigger.player.link();
								trigger.player.draw(event.num);
							},
							ai: {
								threaten: 1.6,
								expose: 0.2,
							},
						},
						lg_tonghuawangguo: {
							init(player) {
								player.storage.lg_tonghuawangguo = ['攻击范围', '手牌上限', '使用限制'];
								player.storage.lg_tonghuawangguo_a = 0;
							},
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseSkipped',
							},
							check(event, player) {
								return true;
							},
							_priority: 99,
							filter(event, player) {
								return player.storage.lg_tonghuawangguo.length;
							},
							content() {
								'step 0';
								var list = player.storage.lg_tonghuawangguo;
								player
									.chooseControl(list)
									.set('ai', function (event) {
										var hs = player.countCards('h');
										var ran = Math.min(5, player.getAttackRange());
										var lit = Math.min(5, player.getHandcardLimit());
										var sh = Math.min(5, player.getCardUsable('sha' && 'jiu'));
										if (list.includes('攻击范围')) {
											if (ran > hs) return '攻击范围';
										}
										if (list.includes('手牌上限')) {
											if (lit > hs) return '手牌上限';
										}
										if (list.includes('使用限制')) {
											if (sh > hs) return '使用限制';
										}
										return -1;
									})
									.set('prompt', '发动此技能');
								('step 1');
								if (result.control) {
									var temp = 0;
									var num1 = player.countCards('h');
									player.storage.lg_tonghuawangguo_a = num1;
									if (result.control == '攻击范围') {
										temp = num1 - Math.min(5, player.getAttackRange());
										player.addTempSkill('lg_tonghuawangguo_ran');
									}
									if (result.control == '手牌上限') {
										temp = num1 - Math.min(5, player.getHandcardLimit());
										player.addTempSkill('lg_tonghuawangguo_lit');
									}
									if (result.control == '使用限制') {
										temp = num1 - Math.min(5, player.getCardUsable('sha' && 'jiu'));
										player.addTempSkill('lg_tonghuawangguo_sh');
									}
									if (temp < 0) {
										player.draw(-temp);
									} else if (temp > 0) {
										player.chooseToDiscard(temp, 'h', true);
									}
									event.str = result.control;
									event.num2 = temp;
								} else event.finish();
								('step 2');
								if (event.num2 != 0) {
									var st = '<将手牌数与' + event.str + '交换的流程>';
									player.chooseTarget('令一名其他角色执行' + st, 1, function (card, player, target) {
										return player != target;
									}).ai = function (target) {
										var att = get.attitude(player, target);
										var hs = target.countCards('h');
										if (event.str == '攻击范围') {
											var ran = Math.min(5, target.getAttackRange());
											if (ran < hs) return -att;
										}
										if (event.str == '手牌上限') {
											var ran = Math.min(5, target.getHandcardLimit());
											if (ran < hs) return -att;
										}
										if (event.str == '使用限制') {
											var ran = Math.min(5, target.getCardUsable('sha' && 'jiu'));
											if (ran < hs) return -att;
										}
										return att;
									};
								} else event.finish();
								('step 3');
								if (result.bool) {
									player.line(result.targets[0], 'green');
									var tar = result.targets[0];
									var num1 = tar.countCards('h');
									switch (event.str) {
										case '攻击范围':
											var temp = num1 - Math.min(5, tar.getAttackRange());
											tar.storage.lg_tonghuawangguo_a = player.storage.lg_tonghuawangguo_a;
											tar.addTempSkill('lg_tonghuawangguo_ran', { player: 'phaseAfter' });
											break;
										case '手牌上限':
											var temp = num1 - Math.min(5, tar.getHandcardLimit());
											tar.storage.lg_tonghuawangguo_a = player.storagelg_tonghuawangguo._a;
											tar.addTempSkill('lg_tonghuawangguo_lit', { player: 'phaseAfter' });
											break;
										case '使用限制':
											var temp = num1 - Math.min(5, tar.getCardUsable('sha' && 'jiu'));
											tar.storage.lg_tonghuawangguo_a = player.storage.lg_tonghuawangguo_a;
											tar.addTempSkill('lg_tonghuawangguo_sh', { player: 'phaseAfter' });
											break;
									}
									if (temp < 0) tar.draw(-temp);
									else if (temp > 0) tar.chooseToDiscard(temp, 'h', true);
								}
							},
							subSkill: {
								ran: {
									charlotte: true,
									mod: {
										attackFrom(from, to, distance) {
											var num1 = from.storage.lg_tonghuawangguo_a - 1;
											return distance - num1;
										},
									},
								},
								sh: {
									charlotte: true,
									mod: {
										cardUsable(card, player, num) {
											var num1 = player.storage.lg_tonghuawangguo_a;
											if (card.name == 'sha') return num1;
										},
									},
								},
								lit: {
									charlotte: true,
									mod: {
										maxHandcard(player, num) {
											var num1 = player.storage.lg_tonghuawangguo_a;
											return num1;
										},
									},
								},
							},
						},
						lg_xushi: {
							trigger: {
								player: 'damageBefore',
							},
							forced: true,
							_priority: 15,
							filter(event, player) {
								if (get.type(event.card, 'trick') == 'trick') {
									if (event.getParent(2).name == 'useCard') {
										return event.getParent(2).targets.length == 1;
									}
									return true;
								}
								return false;
							},
							content() {
								trigger.cancel();
							},
							ai: {
								notrick: true,
								effect: {
									target(card, player, target, current) {
										if (get.type(card) == 'trick' && get.tag(card, 'damage') && !get.tag(card, 'multitarget')) {
											return 'zeroplayertarget';
										}
									},
								},
							},
							group: 'lg_xushi_cancel',
							subSkill: {
								cancel: {
									trigger: {
										target: 'useCardToAfter',
									},
									silent: true,
									filter(event, player) {
										return get.type(event.card, 'trick') == 'trick' && _status.currentPhase == event.player && event.player != player;
									},
									content() {
										player.addTempSkill('lg_xushi_disable');
									},
									forced: true,
									popup: false,
								},
								disable: {
									trigger: {
										target: 'useCardToBefore',
									},
									forced: true,
									_priority: 15,
									filter(event, player) {
										return event.player == _status.currentPhase && get.type(event.card, 'trick') == 'trick';
									},
									content() {
										trigger.cancel();
									},
									ai: {
										effect: {
											target(card, player, target, current) {
												if (get.type(card, 'trick') == 'trick' && _status.currentPhase == player) return 'zeroplayertarget';
											},
										},
									},
								},
							},
						},
						lg_wangziyugongzhu: {
							trigger: {
								global: 'useCard2',
							},
							audio: 'ext:幻颜风华/audio:2',
							_priority: -1,
							forced: true,
							filter(event, player) {
								if (event.player == player) return false;
								if (event.card.suit != 'heart') return false;
								if (!event.targets.includes(player)) return false;
								var info = get.info(event.card);
								if (info.allowMultiple == false) return false;
								if (event.targets && !info.multitarget) {
									if (
										game.hasPlayer(function (current) {
											return current.hasSex('male') && lib.filter.targetEnabled2(event.card, event.player, current) && !event.targets.includes(current);
										})
									) {
										return true;
									}
								}
								return false;
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									position: 'hs',
									filterCard: lib.filter.cardDiscardable,
									filterTarget(card, player, target) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										if (trigger.targets.includes(target)) return false;
										if (!target.hasSex('male')) return false;
										return lib.filter.targetEnabled2(trigger.card, trigger.player, target);
									},
									ai1(card) {
										return get.value(trigger.card) - get.value(card);
									},
									ai2(target) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										return get.effect(target, trigger.card, player, player);
									},
									prompt: get.prompt('lg_wangziyugongzhu'),
								});
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									if (!event.isMine()) game.delayx();
									event.targets = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets) {
									game.log(event.targets, '成为了' + get.translation(trigger.card) + '的目标');
									trigger.targets.addArray(event.targets);
								}
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (target.countCards('he') == 0) return;
										if (card.suit != 'heart') return;
										var min = 1;
										var friend = get.attitude(player, target) > 0;
										var vcard = { name: 'shacopy', nature: card.nature, suit: card.suit };
										var players = game.filterPlayer();
										for (var i = 0; i < players.length; i++) {
											if (player != players[i] && players[i].hasSex('male') && get.attitude(target, players[i]) < 0 && player.canUse(card, players[i], false)) {
												if (!friend) return 0;
												if (get.effect(players[i], vcard, player, player) > 0) {
													if (!player.canUse(card, players[i], false)) {
														return [0, 0.1];
													}
													min = 0;
												}
											}
										}
										return min;
									},
								},
							},
						},
						lg_jigongzhenbu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_huoyanboli: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							filter(event, player) {
								return true;
							},
							check(event, player) {
								var cards = player.getCards('h');
								var players = game.filterPlayer();
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].name == 'shan') return false;
								}
								var count = 0;
								for (var i = 0; i < players.length; i++) {
									if (players[i] == player) continue;
									if (get.attitude(player, players[i]) >= 0) continue;
									if (
										get.distance(player, players[i], 'attack') > 1 &&
										get.effect(
											player,
											{
												name: 'shan',
											},
											players[i],
											player
										) < 0
									)
										count += 1;
								}
								return count <= 2;
							},
							content() {
								'step 0';
								player.showHandcards();
								player.chooseToDiscard('弃置两张红色手牌', 2, true, 'h', { color: 'red' });
								if (
									player.countCards('h', {
										name: 'shan',
									}) > 0
								) {
									event.finish();
								}
								('step 1');
								player.chooseControl(['①', '②'], true).set('prompt', '选择一项').ai = function () {
									if (player.hp <= 2) return '②';
									if (player.isDamaged()) {
										if (player.getCards('h') <= 2) return '①';
										return '②';
									}
									return '①';
								};
								('step 2');
								if (result.control) {
									if (result.control == '①') player.draw(3);
									else player.chooseUseTarget('指定目标', false, { name: 'sha', nature: 'fire' });
								} //QQQ
							},
							ai: {
								expose: 0.2,
								threaten: 1.5,
							},
							mod: {
								aiUseful(player, card, num) {
									var cards = player.getCards('h');
									var players = game.filterPlayer();
									var count = 0;
									for (var i = 0; i < players.length; i++) {
										if (players[i] == player) continue;
										if (get.attitude(player, players[i]) >= 0) continue;
										if (
											get.distance(player, players[i], 'attack') > 1 &&
											get.effect(
												player,
												{
													name: 'sha',
												},
												players[i],
												player
											) < 0
										)
											count += 1;
									}
									if (count <= 2 && card.name == 'sha') return 0;
								},
							},
						},
						lg_huoyanboli1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_huoyanboliAfter',
							},
							forced: true,
							filter(event, player) {
								if (player.countCards('he') == 0) return false;
								return game.hasPlayer(function (current) {
									return current != player && get.distance(player, current, 'attack') <= 1 && player.hp <= current.hp;
								});
							},
							content() {
								'step 0';
								var next = player.chooseCardTarget({
									position: 'he',
									filterTarget(card, player, target) {
										return get.distance(player, target, 'attack') <= 1 && player != target && player.hp <= target.hp;
									},
									filterCard: lib.filter.cardDiscardable,
									ai1(card) {
										return 9 - get.value(card);
									},
									ai2(target) {
										return get.damageEffect(target, player, player);
									},
									prompt: get.prompt('lg_huoyanboli1'),
								});
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									result.targets[0].damage('fire');
								}
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_jiawei_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_anliu: {
							audio: 'ext:幻颜风华/audio:2',
							logTarget: 'player',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								if (event.player == player) return false;
								return event.notLink();
							},
							content() {
								'step 0';
								player.addTempSkill('lg_shuiyuansu', { player: 'damageEnd' });
								trigger.player
									.chooseCard('h', false, function (card) {
										return card.suit == 'club';
									})
									.set('ai', function () {
										return true;
									});
								('step 1');
								if (result.bool) {
									var cards = result.cards[0];
									trigger.player.showCards(cards, '魔王武装·暗流');
									player.randomDiscard(1, 'h');
								} else {
									trigger.num++;
								}
							},
							ai: {
								damageBonus: true,
							},
						},
						lg_kuanglan: {
							init(player) {
								player.storage.lg_kuanglan = [];
							},
							intro: {
								content: 'cards',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_kuanglan.jpg',
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseDrawBegin',
							},
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							check(event, player) {
								return player.countCards('h') >= 2;
							},
							content() {
								'step 0';
								trigger.num += 2;
								for (var i = 0; i < player.getCards('h').length; i++) {
									player.storage.lg_kuanglan.push(player.getCards('h')[i]);
								}
								player.showHandcards();
								player.markSkill('lg_kuanglan');
								player.lose(player.getCards('h'), ui.special);
								('step 1');
								player.judge(function (card) {
									for (var i = 0; i < player.storage.lg_kuanglan.length; i++) {
										var card1 = player.storage.lg_kuanglan[i];
										if (card.suit == card1.suit) return 1;
									}
									return -0.5;
								});
								('step 2');
								var card;
								for (var i = 0; i < player.storage.lg_kuanglan.length; i++) {
									var card1 = player.storage.lg_kuanglan[i];
									if (card1.suit == result.card.suit) card = card1;
								}
								if (card != undefined) {
									player.storage.lg_kuanglan.remove(card);
									player.discard(game.createCard(card));
									player.gain(
										get.cardPile(function (card) {
											return card.suit == 'club';
										}),
										'gain2'
									);
									if (player.storage.lg_kuanglan.length) event.goto(1);
								}
							},
						},
						lg_shuiyuansu: {
							trigger: {
								player: 'shaBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_shui.jpg',
							intro: {
								content: '「水」<br/>元素效果:<br/>当你使用【杀】指定其他角色为目标时,若其装备区内的牌数大于你,你可以将其装备区内的牌数调整至与你相同.',
							},
							filter(event, player) {
								return event.target.countCards('e') > player.countCards('e');
							},
							check(event, player) {
								return get.attitude(player, event.target) < 0;
							},
							logTarget: 'target',
							content() {
								var hs = trigger.target.getCards('e');
								trigger.target.discard(hs.randomGets(hs.length - player.countCards('e')));
							},
						},
						lg_dadaliya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_duzou: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'shaDamage',
							},
							filter(event, player) {
								return event.player.countCards('h') < player.countCards('h');
							},
							content() {
								var card = get.cards();
								player.showCards('破军歌姬·独奏', card);
								player.gain(card, 'gain2');
								player.gainPlayerCard(trigger.player, 1, 'hej');
							},
						},
						lg_lunwuqu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['damageAfter', 'recoverAfter'],
							},
							filter(event, player) {
								return event.player.hp == player.hp && !event.player.hasSkill('lg_lunwuqu_temp');
							},
							check(event, player) {
								return get.attitude(player, event.player) > 0;
							},
							logTarget: 'player',
							content() {
								trigger.player.damage();
								trigger.player.addSkill('lg_lunwuqu_temp');
								player.recover();
							},
							ai: {
								expose: 0.3,
							},
							subSkill: {
								temp: {
									charlotte: true,
								},
							},
						},
						lg_zhenhunqu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'loseAfter',
							},
							forced: true,
							filter(event, player) {
								if (player == _status.currentPhase || event.type != 'discard' || event.position != ui.discardPile || !game.hasPlayer((current) => current != player)) return false;
								for (var i of event.cards2) {
									if (get.type(i, player) == 'basic' && get.position(i, true) == 'd') return true;
								}
								return false;
							},
							content() {
								'step 0';
								var cards = [];
								for (var i of trigger.cards2) {
									if (get.type(i, player) == 'basic' && get.position(i, true) == 'd') cards.push(i);
								}
								player
									.chooseButton(['发动此技能？', cards], [1, cards.length])
									.set(
										'goon',
										game.hasPlayer(function (current) {
											return current != player && get.attitude(player, current) > 0;
										})
									)
									.set('ai', function (button) {
										if (_status.event.goon) return get.value(button.link);
										return button.link.name == 'du' ? 1 : 0;
									});
								('step 1');
								if (result.bool) {
									event.cards = result.links;
									player.chooseTarget('令一名其他角色获得:', get.translation(cards), true, lib.filter.notMe).set('ai', function (target) {
										var player = _status.event.player,
											cards = _status.event.parent.cards;
										if (cards[0].name == 'du') return -get.attitude(player, target);
										var att = get.attitude(player, target);
										if (att <= 0) return 0;
										if (target.hasSkillTag('nogain')) att /= 10;
										if (target.hasJudge('lebu')) att /= 4;
										return get.value(cards, target) * att;
									});
								} else event.finish();
								('step 2');
								if (result.bool) {
									var target = result.targets[0];
									target.gain(cards, 'gain2');
									if (target.countCards('h') > player.hp) target.recover(2);
								}
							},
						},
						lg_jinxingqu0: {
							init(player) {
								player.storage.lg_jinxingqu01 = player.storage.lg_jinxingqu01 || [];
								player.storage.lg_jinxingqu02 = player.storage.lg_jinxingqu02 || [];
							},
							trigger: {
								player: 'damageEnd',
							},
							filter(event, player) {
								return event.num > 0;
							},
							forced: true,
							content() {
								'step 0';
								if (trigger.source) {
									player.storage.lg_jinxingqu01.remove(trigger.source);
									player.storage.lg_jinxingqu01.unshift(trigger.source);
									player.storage.lg_jinxingqu01.splice(2);
								}
								event.cnt = trigger.num;
								('step 1');
								--event.cnt;
								if (player.storage.lg_jinxingqu01.every((p) => !p.countCards('he')) && !player.storage.lg_jinxingqu02.length) {
									event.finish();
									return;
								}
								let v = 0;
								for (let p of player.storage.lg_jinxingqu01) {
									v += get.attitude(player, p) > 0 ? -1 : 1;
								}
								for (let p of player.storage.lg_jinxingqu02) {
									v += get.attitude(player, p) > 0 ? 1 : -1;
								}
								player.chooseBool(get.prompt2(event.name), v >= 0);
								('step 2');
								if (!result.bool) {
									event.finish();
									return;
								}
								player.storage.lg_jinxingqu01
									.slice()
									.sortBySeat()
									.forEach((p) => p.randomDiscard(false));
								game.asyncDraw(player.storage.lg_jinxingqu02.slice().sortBySeat());
								('step 3');
								if (event.cnt) {
									event.goto(1);
								}
							},
							group: ['lg_jinxingqu0_recover'],
							subSkill: {
								recover: {
									forced: true,
									trigger: {
										player: 'recoverEnd',
									},
									silent: true,
									filter(event, player) {
										return event.source;
									},
									content() {
										// player.storage.lg_jinxingqu 2.remove(trigger.source);
										player.storage.lg_jinxingqu02.unshift(trigger.source);
										player.storage.lg_jinxingqu02.splice(2);
									},
									popup: false,
								},
							},
						},
						lg_jinxingqu: {
							trigger: {
								global: 'loseAfter',
							},
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							filter(event, player) {
								if (event.player == player) return false;
								var evt = event.parent;
								if (evt.name != 'discard' || event.type != 'discard') return false;
								var num = player.getHistory('custom', function (evt) {
									return evt.lg_jinxingqu && evt.lg_jinxingqu == event.player;
								}).length;
								if (num > 0) return false;
								if (event.cards2 && event.cards2.length && event.cards2.filterInD('d').length) {
									return player.countCards('h') && player.countCards('h') >= event.cards2.filterInD('d').length && event.player.isIn();
								}
								return false;
							},
							content() {
								'step 0';
								var numm = trigger.cards2.filterInD('d').length;
								var next = player.chooseCard(numm, 'h', get.prompt2('lg_jinxingqu', trigger.player));
								next.set('ai', function (card) {
									var att = get.attitude(_status.event.player, _status.event.sourcex);
									if (_status.event.sourcex.hasSkillTag('nogain')) return -1;
									if (att < 0) {
										if (_status.event.isdu) return 6 - get.value(card);
										return -1;
									} else {
										if (_status.event.isdu) return -1;
										var name = card.name;
										if (name == 'tao' || name == 'jiu' || name == 'wuxie') return -1;
										if (player.hasSkillTag('noh')) return 9 - get.value(card);
										return 6 - get.value(card);
									}
								});
								next.set('sourcex', trigger.player);
								next.set('isdu', trigger.cards2.filterInD('d').length == 1 && trigger.cards2.filterInD('d')[0].name == 'du');
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									player.getHistory('custom').push({ lg_jinxingqu: trigger.player });
								}
								('step 2');
								if (result.bool) {
									trigger.player.gain(trigger.cards2.filterInD('d'));
									trigger.player.$gain2(trigger.cards2.filterInD('d'), true);
								}
							},
						},
						lg_youxiaomeijiu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:1',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yeyanshiling: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCard',
							},
							filter(event, player) {
								if (!event.targets || !event.targets.length) return false;
								for (var a of event.targets) {
									if (a != player) {
										if (player.inRange(a)) {
											if (a.isLinked()) {
												if (a.countCards('he') > 0) return true;
											}
										}
									}
								}
								return false;
							},
							forced: true,
							content() {
								'step 0';
								var name = '始夜·夜魇噬灵';
								var info = '<br><br>发动此技能？';
								var tar = trigger.player;
								var targets = trigger.targets;
								player
									.chooseTarget(name + info, [1, Infinity], function (card, player, target) {
										return player.inRange(target) && target != player && target.countCards('he') > 0 && target.isLinked() && targets.includes(target);
									})
									.set('ai', function (target) {
										var recover = 0;
										if (target.getEquip('baiyin') && get.recoverEffect(target, player, player) > 0) recover++;
										var att = get.attitude(player, target);
										if (att > 0) {
											if (recover > 0) return 10;
											return 0;
										} else {
											if (recover > 0 && target.countCards('he') == 1) return 0;
											return 5;
										}
										return -get.attitude(player, target);
									});
								('step 1');
								if (result.bool) {
									var targets = result.targets;
									event.targets = targets;
								} else event.finish();
								('step 2');
								if (event.targets.length) {
									event.current = event.targets.shift();
								} else event.finish();
								('step 3');
								if (event.current.countCards('he') == 0) {
									event.goto(2);
								}
								player.choosePlayerCard(event.current, 'he', true);
								('step 4');
								var card = result.links[0];
								event.current.$throw(card, 1000);
								event.current.lose(card, ui.discardPile, 'visible');
								game.log(event.current, '将', card, '置入弃牌堆');
								event.current.draw('nodelay');
								if (card.suit == 'heart') event.current.loseHp(2);
								if (card.suit == 'spade') event.current.goMad('phaseEndStart');
								if (card.suit == 'spade') event.current.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
								event.goto(2);
							},
						},
						lg_wujianduoluo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'changeHp',
							},
							forced: true,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return (
										current != player &&
										player.canUse(
											{
												name: 'sha',
											},
											current,
											false
										) &&
										player.countCards('h') < current.countCards('h')
									);
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_wujianduoluo'), function (card, player, target) {
										if (player == target) return false;
										if (player.countCards('h') >= target.countCards('h')) return false;
										return player.canUse({ name: 'sha' }, target, false);
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										var effect = get.effect(target, { name: 'sha' }, player);
										if (effect > 0) return effect;
										if (get.attitude(player, target) <= 0) return target.countCards('h') - player.countCards('h');
										return 0;
									});
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
								} else {
									event.finish();
								}
								('step 2');
								player.draw(2);
								('step 3');
								if (player.canUse({ name: 'sha' }, target, false)) {
									player.useCard({ name: 'sha' }, target);
								} else {
									player.recover();
									//event.finish();
								}
								('step 4');
								if (player.countCards('h') < target.countCards('h')) event.goto(2);
							},
						},
						lg_asilanzuzhou1: {
							ai: {
								neg: true,
							},
							init(player) {
								if (player.identity == 'nei') {
									player.addSkill('lg_asilanzuzhou');
								}
							},
						},
						lg_asilan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_asilanzuzhou: {
							nobracket: true,
							trigger: {
								global: 'recoverBegin',
							},
							filter(event, player) {
								return event.player != player;
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_asilanzuzhou'), function (card, player, target) {
									return player != target && !target.isMinHp();
								}).ai = function (target) {
									return get.damageEffect(target, player, player);
								};
								('step 1');
								if (result.bool) {
									result.targets[0].addTempSkill('fengyin', { player: 'phaseBegin' });
								}
							},
						},
						lg_qianyou_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jinjimishu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'shaBefore',
							},
							filter(event, player) {
								return get.distance(player, event.target, 'attack') <= 1 && event.target != player;
							},
							check(event, player) {
								if (get.attitude(player, event.target) > 0) return true;
								return false;
							},
							content() {
								var num = player.next.countCards('hej', { suit: 'club' });
								trigger.target = player;
								if (player.countCards('hej') == 0) player.chooseToGuanxing(num);
							},
						},
						lg_liannaiyewu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_ershidewuyue: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								target: 'useCardToTargeted',
							},
							filter(event, player) {
								if (player == event.player || event.targets.length != 1) return false;
								return player.countCards('e') >= 1;
							},
							forced: true,
							usable: 2,
							content() {
								'step 0';
								player
									.chooseToDiscard('e', [1, 3], get.prompt('lg_ershidewuyue', trigger.player), '<div class="text center">发动此技能？</div>')
									.set('', function (card) {
										if (_status.event.goon && ui.selected.cards.length < 2) return 5.6 - get.value(card);
										return 0;
									})
									.set(
										'goon',
										(function () {
											var target = trigger.player;
											if (get.damageEffect(target, player, player) > 0) return true;
											if (
												target.countCards('he', function (card) {
													return get.value(card, target) > 6;
												}) >= 2
											)
												return true;
											return false;
										})()
									);
								('step 1');
								if (!result.bool) {
									player.getStat('triggerSkill').lg_ershidewuyue--;
									event.finish();
									return;
								}
								var num = result.cards.length;
								event.num = num;
								var target = trigger.player,
									str = get.translation(target);
								event.target = target;
								if (!target.isIn()) event.finish();
								else if (
									!target.hasCard(function (card) {
										return lib.filter.canBeDiscarded(card, player, target);
									}, 'he')
								)
									event._result = { index: 1 };
								else
									player
										.chooseControl()
										.set('choiceList', ['获得' + str + '的' + get.cnNumber(num) + '张手牌', '令' + str + '摸一张牌'])
										.set('ai', function () {
											var player = _status.event.player;
											var eff0 = get.effect(target, { name: 'guohe_copy2' }, player, player) * Math.min(1.7, target.countCards('h'));
											var eff1 = get.damageEffect(target, player, player);
											return eff0 > eff1 ? 0 : 1;
										});
								('step 2');
								if (result.index == 0) player.gainPlayerCard(target, num, true, 'h');
								else target.draw();
							},
						},
						lg_lianzhimonv0: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageEnd',
							},
							filter(event, player) {
								return event.source && event.source != player && event.num > 0 && event.card;
							},
							check(event, player) {
								return get.attitude(player, event.source) <= 0;
							},
							prompt(event, player) {
								return '恋之魔女<br/><br/>对' + get.translation(event.source) + '视为使用' + get.translation(event.card);
							},
							init(player) {
								player.storage.lg_lianzhimonv0 = [];
							},
							popup: false,
							content() {
								player.popup('恋之魔女', 'water');
								player.line(trigger.source, 'water');
								player.storage.lg_lianzhimonv0.push(trigger.card);
								player.useCard(trigger.card, trigger.source);
							},
							group: ['lg_lianzhimonv0_recover', 'lg_lianzhimonv0_update'],
							subSkill: {
								update: {
									popup: false,
									forced: true,
									trigger: {
										global: 'phaseBefore',
									},
									content() {
										player.storage.lg_lianzhimonv0 = [];
									},
								},
								recover: {
									popup: false,
									forced: true,
									trigger: {
										source: 'damage',
									},
									content() {
										if (trigger.card && player.storage.lg_lianzhimonv0.includes(trigger.card)) {
											player.popup('恋之魔女', 'water');
											player.randomDiscard(1, 'hej');
										}
									},
								},
							},
						},
						lg_lianzhimonv: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_lianzhimonv0After',
							},
							forced: true,
							content() { },
						},
						lg_huhuomiaoran: {
							audio: 'ext:幻颜风华/audio:2',
							init(player) {
								player.storage.lg_huhuomiaoran = [];
							},
							_priority: 19,
							trigger: {
								global: 'useCardToBefore',
							},
							filter(event, player) {
								if (event.card.suit != 'diamond') return false;
								if (!event.target || event.target == player) return false;
								if (!event.target.inRange(player)) return false;
								return player.countCards('h');
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCardButton('你可以交给' + get.translation(trigger.target) + '一张手牌,' + get.translation(trigger.card) + '结算后,你观看并获得其的一张手牌.', player.getCards('h')).ai = function (button) {
									var trigger = _status.event.getTrigger();
									var att = get.attitude(player, trigger.target);
									if (att > 0) {
										if (button.link.name == 'shan') return 10;
										return 8 - get.value(button.link);
									} else {
										if (trigger.target.countCards('h') <= 1) return -1;
										return 4.5 - get.value(button.link);
									}
								};
								('step 1');
								if (result.bool) {
									trigger.target.gain(result.links[0], player, 'giveAuto');
									player.storage.lg_huhuomiaoran.push(trigger.card);
								}
							},
							ai: {
								threaten: 1.1,
								expose: 0.1,
							},
							group: ['lg_huhuomiaoran_gain'],
							subSkill: {
								gain: {
									trigger: {
										global: ['shaAfter', 'shaCancelled'],
									},
									silent: true,
									filter(event, player) {
										return player.storage.lg_huhuomiaoran.indexOf(event.card) >= 0;
									},
									content() {
										player.gainPlayerCard('h', trigger.target, 1, 'visible');
										player.recover();
										player.next.next.recover();
										player.previous.previous.recover();
										player.draw();
										player.next.next.draw();
										player.previous.previous.draw();
										var n = player.storage.lg_huhuomiaoran.indexOf(trigger.card);
										player.storage.lg_huhuomiaoran.splice(n, 1);
									},
									forced: true,
									popup: false,
								},
							},
						},
						lg_linglan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_wujianzhixiajian: {
							trigger: {
								source: 'damageSource',
							},
							filter(event, player) {
								if (!event.card || event.card.suit != 'heart') return false;
								return event.player.isIn() && event.player.getEquip(3) && event.player.getEquip(4);
							},
							check(event, player) {
								var bool = get.attitude(player, event.player) <= 0;
								var togain = event.player.getEquip(3) && event.player.getEquip(4);
								var value = get.equipValue(togain, event.player);
								if (bool && value > 0) return true;
								if (!bool && value <= 0) return true;
								return false;
							},
							audio: 'ext:幻颜风华/audio:2',
							logTarget: 'player',
							content() {
								var equip = trigger.player.getEquip(3);
								var equip1 = trigger.player.getEquip(4);
								player.gain(equip1, trigger.player, 'log', 'give', 'bySelf');
								player.gain(equip, trigger.player, 'log', 'give', 'bySelf');
							},
						},
						lg_wujianzhixiajian1: {
							trigger: {
								global: 'rewriteGainResult',
							},
							prompt(event, player) {
								var prompt = '<span style="color: #FF0000">【' + get.translation(event.player) + '】</span>';
								prompt += '获得<span style="color: #FF0000">【' + get.translation(event.target) + '】</span>的';
								prompt += get.translation(event.result.cards) + ',对其反制？';
								return prompt;
							},
							check(event, player) {
								return get.attitude(player, event.player) < 0 && get.attitude(player, event.target) > 0;
							},
							logTarget: 'player',
							filter(event, player) {
								if (event.player == event.target) return false;
								return event.player != player && player.canCompare(event.player);
							},
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								if (result.bool) {
									trigger.cancel();
									trigger.player.randomDiscard(1, 'hj');
								}
							},
						},
						lg_yumingwujixu: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							position: 'h',
							filterCard(card, player) {
								if (!ui.selected.cards) return true;
								for (var i = 0; i < ui.selected.cards.length; i++) {
									var cardb = ui.selected.cards[i];
									if (card.suit == cardb.suit) return false;
								}
								return true;
							},
							selectCard: [2, 4],
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							check(card) {
								var val = get.value(card);
								return 7 - get.value(card);
							},
							filterTarget(card, player, target) {
								return player != target;
							},
							content() {
								'step 0';
								var suits = [];
								var num = 0;
								for (var i = 0; i < cards.length; i++) {
									var suit = cards[i].suit;
									if (target.countCards('h', { suit: suit })) {
										suits.add(suit);
										num++;
									}
								}
								if (num > 0) {
									target
										.chooseToDiscard('弃置' + num + '张花色为' + get.translation(suits) + '且花色各不相同的手牌.', 'h', true, num, function (card) {
											if (ui.selected.cards.length) {
												for (var i = 0; i < ui.selected.cards.length; i++) {
													var cardb = ui.selected.cards[i];
													if (card.suit == cardb.suit) return false;
												}
											}
											return suits.includes(card.suit);
										})
										.set('complexCard', true);
								}
								('step 1');
								var num = cards.length;
								var s = Math.ceil(target.hp / 2);
								if (result.cards && result.cards.length) num -= result.cards.length;
								if (num > 0) player.gain(game.createCard(get.inpile('delay').randomGet()), 'draw');
								if (target.isMinHandcard()) target.damage(s)._triggered = null;
							},
							ai: {
								order: 7,
								result: {
									target: -1,
								},
							},
						},
						lg_mingtulvzhongyu1: {
							mod: {
								globalFrom(from, to, distance) {
									return (
										distance -
										game.countPlayer(function (current) {
											return current.hasSex('female');
										})
									);
								},
							},
						},
						lg_mingtulvzhongyu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseJudgeBegin',
							},
							forced: true,
							filter(event, player) {
								return (
									player != event.player &&
									event.player.hp >= player.hp &&
									player.countCards('he', function (card) {
										if (_status.connectMode) return true;
										return get.color(card, player) == 'red';
									}) > 0
								);
							},
							content() {
								'step 0';
								player
									.chooseCard('he', get.prompt('lg_mingtulvzhongyu', trigger.player), '交给其一张红色牌？', function (card, player) {
										return get.color(card, player) == 'red';
									})
									.set('ai', function (card) {
										if (_status.event.goon) return 5 - get.value(card);
										return 0;
									})
									.set(
										'goon',
										(function () {
											if (get.attitude(player, trigger.player) >= 0) return false;
											if (trigger.player.countCards('hs') < trigger.player.hp) return false;
											return true;
										})()
									);
								('step 1');
								if (result.bool) {
									var target = trigger.player;
									target.gain(result.cards, player, 'give');
									player.turnOver();
									player.previous.turnOver();
									target.skip('phaseUse');
								}
							},
						},
						lg_xiaoyezhongxiaoding_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xiaoyezhongxiaoding1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_xiaoyezhongxiaoding1 = 0;
								player.markSkill('lg_xiaoyezhongxiaoding1');
							},
							filter(event, player) {
								return player.storage.lg_xiaoyezhongxiaoding1 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_xiaoyezhongxiaoding1 += 5;
								player.markSkill('lg_xiaoyezhongxiaoding1');
							},
						},
						lg_shenghunliuli: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.notLink() && event.player.countCards('h');
							},
							forced: true,
							content() {
								'step 0';
								player.choosePlayerCard('h', trigger.player);
								('step 1');
								if (!result.bool) {
									event.finish();
									return;
								}
								player.showCards(result.cards);
								var card = result.cards[0];
								if (card.suit == 'heart' || card.suit == 'heart') {
									player.gain(card, trigger.player, 'give', 'bySelf');
								}
								if (card.suit != 'heart') {
									trigger.player.discard(card, 'notBySelf');
									var num = Math.ceil(player.countCards('hej', { suit: 'heart' }) / 2);
									player.recover(num);
									player.storage.lg_xiaoyezhongxiaoding1 -= 45;
									player.markSkill('lg_xiaoyezhongxiaoding1');
								}
							},
						},
						lg_shenghunliuli1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_shenghunliuliBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_shenghunliuli.jpg',
							intro: {
								content: '灵力消耗:<br/>45点<br/><br/>符卡效果:<br/>当你使用【杀】对其他角色造成伤害时,你可以展示其的一张手牌.若此牌为♥️️,你获得之;若此牌不为♥️️,你回复X点体力,弃置之(X为你区域内♥️️牌数的一半,且向上取整).',
							},
							filter(event, player) {
								return player.storage.lg_xiaoyezhongxiaoding1 < 45;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_xushuzhihuan: {
							audio: 'ext:幻颜风华/audio:3',
							usable: 1,
							trigger: {
								player: 'useCardToPlayered',
							},
							logTarget: 'target',
							filter(event, player) {
								return event.targets.length == 1 && player != event.target && event.target.countCards('h') > 1;
							},
							check(event, player) {
								var target = event.target;
								if (get.attitude(player, target) >= 0) return false;
								if (get.color(event.card) == 'none') return true;
								return Math.ceil(target.countCards('h') / 2) >= Math.ceil(player.countCards('h') / 2);
							},
							content() {
								'step 0';
								var target = trigger.target;
								event.target = target;
								var num = Math.ceil(target.countCards('h') / 2);
								if (num > 0) player.gainPlayerCard(target, 'h', num, true);
								else event.finish();
								('step 1');
								var suit = trigger.card.suit;
								if (result.bool && lib.suit.includes(suit) && player.countCards('h') > 1) {
									var bool = false;
									for (var i of result.cards) {
										if (i.suit == suit) {
											bool = true;
											break;
										}
									}
									if (!bool) event.finish();
								} else event.finish();
								('step 2');
								player.randomDiscard(3, 'hej');
							},
						},
						lg_nisi: {
							trigger: {
								player: 'phaseUseEnd',
							},
							filter(event, player) {
								if (!player.storage.lg_nisi) return false;
								for (var i = 0; i < player.storage.lg_nisi.length; i++) {
									if (get.position(player.storage.lg_nisi[i]) == 'd') return true;
								}
								return false;
							},
							forced: true,
							content() {
								var list = [];
								for (var i = 0; i < player.storage.lg_nisi.length; i++) {
									if (get.position(player.storage.lg_nisi[i]) == 'd') {
										list.push(player.storage.lg_nisi[i]);
										if (list.length >= 3) break;
									}
								}
								player.gain(list, 'gain2', 'log');
							},
							ai: {
								threaten: 1.8,
							},
							group: ['lg_nisi_count', 'lg_nisi_count2'],
							subSkill: {
								count: {
									trigger: {
										player: 'useCard',
									},
									silent: true,
									filter(event, player) {
										return _status.currentPhase == player;
									},
									content() {
										if (!player.storage.lg_nisi) {
											player.storage.lg_nisi = [];
										}
										for (var i = 0; i < trigger.cards.length; i++) {
											if (trigger.cards[i].suit == 'club') {
												player.storage.lg_nisi.add(trigger.cards[i]);
											}
										}
									},
									forced: true,
									popup: false,
								},
								count2: {
									trigger: {
										player: 'phaseAfter',
									},
									silent: true,
									content() {
										delete player.storage.lg_nisi;
									},
									forced: true,
									popup: false,
								},
							},
						},
						lg_zhilianbuwei: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filterCard: {
								suit: 'club',
							},
							filter(event, player) {
								if (!player.countCards('h', { suit: 'club' })) return false;
								var players = game.filterPlayer();
								var min = players[0].hp;
								for (var i = 0; i < players.length; i++) {
									min = Math.min(min, players[i].hp);
								}
								for (var i = 0; i < players.length; i++) {
									if (players[i].hp == min && players[i].isDamaged()) return true;
								}
								return false;
							},
							prompt() {
								var players = game.filterPlayer();
								var targets = [];
								var min = players[0].hp;
								for (var i = 0; i < players.length; i++) {
									min = Math.min(min, players[i].hp);
								}
								for (var i = 0; i < players.length; i++) {
									if (players[i].hp == min && players[i].hp < players[i].maxHp) {
										targets.push(players[i]);
									}
								}
								return '令' + get.translation(targets) + '摸一张牌';
							},
							check(card) {
								return 8 - get.value(card);
							},
							filterTarget(card, player, target) {
								return target.isDamaged() && target.isMinHp();
							},
							selectTarget: -1,
							content() {
								target.draw();
								if (player.countCards('e') == player.hp) player.previous.addTempSkill('lg_meihuo', { player: 'phaseEndStart' });
								if (player.countCards('e') == player.hp) player.next.addTempSkill('lg_meihuo', { player: 'phaseEndStart' });
							},
							ai: {
								expose: 0.1,
								order: 11,
								threaten: 1.4,
								result: {
									player(player, target) {
										var players = game.filterPlayer();
										var num = 0;
										var min = players[0].hp;
										for (var i = 0; i < players.length; i++) {
											min = Math.min(min, players[i].hp);
										}
										for (var i = 0; i < players.length; i++) {
											if (players[i].hp == min && players[i].hp < players[i].maxHp) {
												num += get.recoverEffect(players[i], player, player);
											}
										}
										return num;
									},
								},
							},
						},
						lg_zhilianbuwei0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_zhilianbuweiBegin',
							},
							forced: true,
							content() {
								player.draw(2);
							},
						},
						lg_meihuo: {
							trigger: {
								player: 'shaBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_meihuo.jpg',
							intro: {
								content: '魅惑',
							},
							check(event, player) {
								if (get.attitude(player, event.target) > 0) return true;
								return player.hp < player.maxHp;
							},
							logTarget: 'target',
							forced: true,
							content() {
								'step 0';
								trigger.target.draw(2);
								('step 1');
								player.chooseToDiscard(2, true, 'he');
								player.recover();
								if (player.countCards('h') != player.hp) player.goMad('phaseAfter');
							},
						},
						lg_paerwadi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_caiyi: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'discardAfter',
							},
							content() {
								'step 0';
								event.cards = get.cards(1);
								player.showCards(event.cards, '彩忆');
								('step 1');
								var choice = '牌堆底';
								var judges = player.getCards('j');
								if (judges.length) {
									var judge = get.judge(judges[0]);
									if (ui.cardPile.childNodes.length) {
										if (judge(event.cards[0]) - judge(ui.cardPile.firstChild) > 0) choice = '牌堆顶';
									} else {
										if (judge(event.cards[0]) > 0) choice = '牌堆顶';
									}
								} else {
									if (ui.cardPile.childNodes.length >= 2) {
										if (player.getUseValue(event.cards[0]) - player.getUseValue(ui.cardPile.childNodes[1]) > 0) choice = '牌堆顶';
									} else {
										if (player.getUseValue(event.cards[0]) > 0) choice = '牌堆顶';
									}
								}
								player
									.chooseControl('牌堆顶', '牌堆底')
									.set('dialog', ['彩忆', event.cards])
									.set('ai', function () {
										return _status.event.choice;
									})
									.set('choice', choice);
								('step 2');
								if (result.control == '牌堆顶') {
									ui.cardPile.insertBefore(event.cards[0], ui.cardPile.firstChild);
									game.log(player, '将', event.cards[0], '置于牌堆顶');
								} else {
									ui.cardPile.appendChild(event.cards[0]);
									game.log(player, '将', event.cards[0], '置于牌堆底');
								}
								//player.$throw(event.cards[0],1000);
								('step 3');
								var card = { name: event.cards[0].name };
								if (
									get.type(card) != 'equip' &&
									game.hasPlayer(function (current) {
										return player.countCards('h', function (xxx) {
											var cardxxx = { name: event.cards[0].name, cards: [xxx] };
											return player.canUse(cardxxx, current);
										});
									})
								) {
									lib.skill.lg_caiyi_use.viewAs = card;
									var next = player.chooseToUse();
									if (next.isOnline()) {
										player.send(function (card) {
											lib.skill.lg_caiyi_use.viewAs = card;
										}, card);
									}
									next.set('openskilldialog', '将一张手牌当' + get.translation(card) + '使用？');
									next.set('norestore', true);
									next.set('_backupevent', 'lg_caiyi_use');
									next.set('custom', {
										add: {},
										replace: {
											window() { },
										},
									});
									next.backup('lg_caiyi_use');
									next.set('addCount', false); //不计入次数
								}
							},
							ai: {
								guanxing: true,
							},
							subSkill: {
								use: {
									filterCard(card) {
										return get.itemtype(card) == 'card';
									},
									check(card) {
										return 6 - get.value(card);
									},
									log: false,
									selectCard: 1,
									popname: true,
									charlotte: true,
									fixed: true,
									viewAs: {
										name: 'sha',
									},
									ai: {
										wuxie(target, card, player, viewer) {
											if (player == game.me && get.attitude(viewer, player) > 0) {
												return 0;
											}
										},
										basic: {
											order: 5,
											useful: 1,
											value: 5.5,
										},
										result: {
											target: -1.5,
											player(player, target, card) {
												if (
													player.hasSkillTag(
														'directHit_ai',
														true,
														{
															target: target,
															card: card,
														},
														true
													)
												) {
													return 0;
												}
												if (get.damageEffect(target, player, target) > 0 && get.attitude(player, target) > 0 && get.attitude(target, player) > 0) {
													return 0;
												}
												var hs1 = target.getCards('h', 'sha');
												var hs2 = player.getCards('h', 'sha');
												if (hs1.length > hs2.length + 1) {
													return -2;
												}
												var hsx = target.getCards('h');
												if (hsx.length > 2 && hs2.length == 0 && hsx[0].number < 6) {
													return -2;
												}
												if (hsx.length > 3 && hs2.length == 0) {
													return -2;
												}
												if (hs1.length > hs2.length && (!hs2.length || hs1[0].number > hs2[0].number)) {
													return -2;
												}
												return -0.5;
											},
											target_use(player, target) {
												if (player.hasUnknown(2) && get.mode() != 'guozhan') return 0;
												var nh = target.countCards('h');
												if (get.mode() == 'identity') {
													if (target.isZhu && nh <= 2 && target.hp <= 1) return -100;
												}
												if (nh == 0) return -2;
												if (nh == 1) return -1.7;
												return -1.5;
											},
										},
										tag: {
											respond: 2,
											respondSha: 2,
											damage: 1,
											multitarget: 1,
											multineg: 1,
											skip: 'phaseDraw',
											respondShan: 1,
											natureDamage(card) {
												if (card.nature) return 1;
											},
											fireDamage(card, nature) {
												if (card.nature == 'fire') return 1;
											},
											thunderDamage(card, nature) {
												if (card.nature == 'thunder') return 1;
											},
											poisonDamage(card, nature) {
												if (card.nature == 'poison') return 1;
											},
											jy_duDamage(card, nature) {
												if (card.nature == 'jy_du') return 1;
											},
											jy_xieDamage(card, nature) {
												if (card.nature == 'jy_xie') return 1;
											},
										},
										order: 2.5,
										value: [4, 1],
										useful: 1,
										yingbian(card, player, targets, viewer) {
											if (get.attitude(viewer, player) <= 0) return 0;
											var base = 0,
												hit = false;
											if (get.cardtag(card, 'yingbian_hit')) {
												hit = true;
												if (
													targets.filter(function (target) {
														return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_all')) {
												if (
													game.hasPlayer(function (current) {
														return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_damage')) {
												if (
													targets.filter(function (target) {
														return (
															get.attitude(player, target) < 0 &&
															(hit ||
																!target.mayHaveShan() ||
																player.hasSkillTag(
																	'directHit_ai',
																	true,
																	{
																		target: target,
																		card: card,
																	},
																	true
																)) &&
															!target.hasSkillTag('filterDamage', null, {
																player: player,
																card: card,
																jiu: true,
															})
														);
													})
												)
													base += 5;
											}
											return base;
										},
										canLink(player, target, card) {
											if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
											if (
												target.mayHaveShan() &&
												!player.hasSkillTag(
													'directHit_ai',
													true,
													{
														target: target,
														card: card,
													},
													true
												)
											)
												return false;
											if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
											return true;
										},
									},
								},
							},
						},
						lg_paomozhimeng: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: ['useCard', 'respond'],
							},
							filter(event, player) {
								return event.card && event.card.suit == 'heart' && event.card.number > 0;
							},
							content() {
								'step 0';
								var num = trigger.card.number - game.roundNumber;
								event.cards = get.cards(num);
								game.cardsGotoOrdering(event.cards);
								event.videoId = lib.status.videoId++;
								game.broadcastAll(
									function (player, id, cards) {
										var str;
										if (player == game.me && !_status.auto) {
											str = '获得花色均不同的牌';
										} else {
											str = '泡沫之梦';
										}
										var dialog = ui.create.dialog(str, cards);
										dialog.videoId = id;
									},
									player,
									event.videoId,
									event.cards
								);
								event.time = get.utc();
								game.addVideo('showCards', player, ['lg_paomozhimeng', get.cardsInfo(event.cards)]);
								game.addVideo('delay', null, 2);
								('step 1');
								var next = player.chooseButton([0, 5], true);
								next.set('dialog', event.videoId);
								next.set('filterButton', function (button) {
									for (var i = 0; i < ui.selected.buttons.length; i++) {
										if (ui.selected.buttons[i].link.suit == button.link.suit) return false;
									}
									return true;
								});
								next.set('ai', function (button) {
									return get.value(button.link, _status.event.player);
								});
								('step 2');
								if (result.bool && result.links) {
									event.cards2 = result.links;
								} else {
									event.finish();
								}
								var time = 1000 - (get.utc() - event.time);
								if (time > 0) {
								}
								('step 3');
								game.broadcastAll('closeDialog', event.videoId);
								var cards2 = event.cards2;
								player.gain(cards2, 'log', 'gain2');
							},
							ai: {
								threaten: 1.2,
							},
							audioname2: {
								key_shiki: 'shiki_omusubi',
							},
						},
						lg_ketengcaixiang_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jinmieshan1: {
							usable: 1,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardAfter',
							},
							filter(event, player) {
								if (!player.isPhaseUsing()) return false;
								if (!player.countCards('h')) return false;
								var t = get.type(event.card);
								return t == 'trick' || t == 'delay';
							},
							forced: true,
							content() {
								'step 0';
								var next = player.chooseToUse({ name: 'sha' }, false);
								next.set('openskilldialog', '极恶技·尽灭闪<br/><br/>发动此技能？');
								next.set('norestore', true);
								next.set('_backupevent', 'lg_jinmieshan1_a');
								next.backup('lg_jinmieshan1_a');
							},
							subSkill: {
								a: {
									filterCard(card) {
										return get.itemtype(card) == 'card';
									},
									check(card) {
										return 8 - get.value(card);
									},
									popname: true,
									viewAs: {
										name: 'sha',
									},
									ai: {
										wuxie(target, card, player, viewer) {
											if (player == game.me && get.attitude(viewer, player) > 0) {
												return 0;
											}
										},
										basic: {
											order: 5,
											useful: 1,
											value: 5.5,
										},
										result: {
											target: -1.5,
											player(player, target) {
												if (get.damageEffect(target, player, target) > 0 && get.attitude(player, target) > 0 && get.attitude(target, player) > 0) {
													return 0;
												}
												var hs1 = target.getCards('h', 'sha');
												var hs2 = player.getCards('h', 'sha');
												if (hs1.length > hs2.length + 1) {
													return -2;
												}
												var hsx = target.getCards('h');
												if (hsx.length > 2 && hs2.length == 0 && hsx[0].number < 6) {
													return -2;
												}
												if (hsx.length > 3 && hs2.length == 0) {
													return -2;
												}
												if (hs1.length > hs2.length && (!hs2.length || hs1[0].number > hs2[0].number)) {
													return -2;
												}
												return -0.5;
											},
										},
										tag: {
											respond: 2,
											respondSha: 2,
											damage: 1,
											respondShan: 1,
											natureDamage(card) {
												if (card.nature) return 1;
											},
											fireDamage(card, nature) {
												if (card.nature == 'fire') return 1;
											},
											thunderDamage(card, nature) {
												if (card.nature == 'thunder') return 1;
											},
											poisonDamage(card, nature) {
												if (card.nature == 'poison') return 1;
											},
											jy_duDamage(card, nature) {
												if (card.nature == 'jy_du') return 1;
											},
											jy_xieDamage(card, nature) {
												if (card.nature == 'jy_xie') return 1;
											},
										},
										yingbian(card, player, targets, viewer) {
											if (get.attitude(viewer, player) <= 0) return 0;
											var base = 0,
												hit = false;
											if (get.cardtag(card, 'yingbian_hit')) {
												hit = true;
												if (
													targets.filter(function (target) {
														return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_all')) {
												if (
													game.hasPlayer(function (current) {
														return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_damage')) {
												if (
													targets.filter(function (target) {
														return (
															get.attitude(player, target) < 0 &&
															(hit ||
																!target.mayHaveShan() ||
																player.hasSkillTag(
																	'directHit_ai',
																	true,
																	{
																		target: target,
																		card: card,
																	},
																	true
																)) &&
															!target.hasSkillTag('filterDamage', null, {
																player: player,
																card: card,
																jiu: true,
															})
														);
													})
												)
													base += 5;
											}
											return base;
										},
										canLink(player, target, card) {
											if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
											if (
												target.mayHaveShan() &&
												!player.hasSkillTag(
													'directHit_ai',
													true,
													{
														target: target,
														card: card,
													},
													true
												)
											)
												return false;
											if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
											return true;
										},
										order(item, player) {
											if (player.hasSkillTag('presha', true, null, true)) return 10;
											if (lib.linked.includes(get.nature(item))) {
												if (
													game.hasPlayer(function (current) {
														return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
													}) &&
													game.countPlayer(function (current) {
														return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
													}) > 1
												)
													return 3.1;
												return 3;
											}
											return 3.05;
										},
									},
								},
							},
						},
						lg_jinmieshan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_jinmieshan1Begin',
							},
							forced: true,
							content() { },
						},
						lg_xiezhizaohuo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'gainAfter',
							},
							check(event, player) {
								if (get.damageEffect(event.player, player, player) > 0 && event.player.countCards('e') == 0) return true;
								return get.attitude(player, event.player) < 0;
							},
							filter(event, player) {
								if (event.source == player && event.player != player) {
									if (event.cards && event.cards.length) return true;
								}
								return false;
							},
							logTarget: 'player',
							content() {
								'step 0';
								if (!trigger.player.countCards('e')) {
									player.line(trigger.player, 'green');
									trigger.player.damage(2, 'fire');
									player.addTempSkill('lg_huoyuansu', { player: 'damageEnd' });
									event.finish();
								}
								('step 1');
								player.gainPlayerCard(trigger.player, get.prompt('lg_xiezhizaohuo', trigger.player), 'hej').set('ai', function (button) {
									return get.value(button.link);
								});
							},
						},
						lg_dieyinlaisheng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['shaBefore'],
							},
							check(event, player) {
								return get.attitude(player, event.target) < 0;
							},
							logTarget: 'target',
							content() {
								'step 0';
								player.addTempSkill('lg_dieyinlaisheng_fan', { player: ['shaAfter', 'shaCancelled'] });
								player.addTempSkill('lg_dieyinlaisheng_dam', { player: ['shaAfter', 'shaCancelled'] });
								var func = function (card, target) {
									var list = ['' + card + '改为火【杀】', '与' + target + '横置', '' + card + '造成的伤害值+1'];
									var choiceList = ui.create.dialog('发动此技能？', 'forcebutton');
									for (var i = 0; i < list.length; i++) {
										var str = '<div class="popup text" style="width:calc(100% - 10px);display:inline-block">';
										if (i == 0) str += '<div>';
										str += list[i];
										if (i == 0) str += '</div>';
										str += '</div>';
										var next = choiceList.add(str);
										next.firstChild.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', ui.click.button);
										next.firstChild.link = i;
										Object.setPrototypeOf(next, lib.element.Button.prototype); //QQQ
										choiceList.buttons.add(next.firstChild);
									}
									return choiceList;
								};
								if (player.isOnline2()) {
									player.send(func, get.translation(trigger.card), get.translation(trigger.target));
								}
								event.dialog = func(get.translation(trigger.card), get.translation(trigger.target));
								if (player != game.me || _status.auto) {
									event.dialog.style.display = 'none';
								}
								var next = player.chooseButton();
								next.set('forced', false);
								next.set('selectButton', [1, 3]);
								next.set('filterButton', function (button) {
									return true;
								});
								next.set('ai', function (button) {
									var player = _status.event.player;
									var event = _status.event.getTrigger();
									switch (button.link) {
										case 0: {
											return 1;
										}
										case 1: {
											if (event.target.countCards('h', 'shan')) return 0;
											return 1;
										}
										case 2: {
											if (!event.target.countCards('h', 'shan') || player.countCards('h', 'shan')) return 1;
											return 0;
										}
									}
								});
								('step 1');
								event.dialog.close();
								var map = [
									function (trigger, player, event) {
										trigger.Changena = true;
									},
									function (trigger, player, event) {
										if (!player.isLinked()) player.link();
										if (!trigger.target.isLinked()) trigger.target.link();
									},
									function (trigger, player, event) {
										trigger.ADDdam = true;
									},
								];
								for (var i of result.links) {
									game.log(player, '选择了', '#g<蝶引来生>', '的', '#y选项' + get.cnNumber(result.links[i] + 1, true));
									map[result.links[i]](trigger, player, event);
								}
							},
							ai: {
								expose: 0.3,
							},
							subSkill: {
								dam: {
									trigger: {
										source: 'damageBegin1',
									},
									filter(event, player) {
										if (!event.card || event.card.name != 'sha' || !event.notLink()) return false;
										if (event.getParent(6).ADDdam == true || event.getParent(6).Changena == true) return true;
										return event.parent.ADDdam == true || event.parent.Changena == true;
									},
									forced: true,
									content() {
										'step 0';
										if (trigger.parent.Changena == true || trigger.getParent(6).Changena == true) {
											trigger.nature = 'fire';
										}
										('step 1');
										if (trigger.parent.ADDdam == true || trigger.getParent(6).ADDdam == true) {
											trigger.num++;
										}
									},
								},
								fan: {
									charlotte: true,
									forced: true,
									trigger: {
										player: 'shaMiss',
									},
									_priority: -99,
									content() {
										player.swapHandcards(trigger.target);
										trigger.target.useCard(trigger.card, player);
										trigger.target.addTempSkill('lg_dieyinlaisheng_dam', { player: 'shaAfter' });
									},
								},
							},
						},
						lg_dieyinlaisheng1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['shaBefore'],
							},
							check(event, player) {
								return get.attitude(player, event.target) < 0;
							},
							logTarget: 'target',
							content() {
								'step 0';
								player.addTempSkill('lg_dieyinlaisheng1_fan', { player: ['shaAfter', 'shaCancelled'] });
								player.addTempSkill('lg_dieyinlaisheng1_dam', { player: ['shaAfter', 'shaCancelled'] });
								var func = function (card, target) {
									var list = ['' + card + '改为火【杀】', '与' + target + '横置', '' + card + '造成的伤害值+1'];
									var choiceList = ui.create.dialog('发动此技能？', 'forcebutton');
									for (var i = 0; i < list.length; i++) {
										var str = '<div class="popup text" style="width:calc(100% - 10px);display:inline-block">';
										if (i == 0) str += '<div>';
										str += list[i];
										if (i == 0) str += '</div>';
										str += '</div>';
										var next = choiceList.add(str);
										next.firstChild.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', ui.click.button);
										next.firstChild.link = i;
										Object.setPrototypeOf(next, lib.element.Button.prototype); //QQQ
										choiceList.buttons.add(next.firstChild);
									}
									return choiceList;
								};
								if (player.isOnline2()) {
									player.send(func, get.translation(trigger.card), get.translation(trigger.target));
								}
								event.dialog = func(get.translation(trigger.card), get.translation(trigger.target));
								if (player != game.me || _status.auto) {
									event.dialog.style.display = 'none';
								}
								var next = player.chooseButton();
								next.set('forced', false);
								next.set('selectButton', [1, 3]);
								next.set('filterButton', function (button) {
									return true;
								});
								next.set('ai', function (button) {
									var player = _status.event.player;
									var event = _status.event.getTrigger();
									switch (button.link) {
										case 0: {
											return 1;
										}
										case 1: {
											if (event.target.countCards('h', 'shan')) return 0;
											return 1;
										}
										case 2: {
											if (!event.target.countCards('h', 'shan') || player.countCards('h', 'shan')) return 1;
											return 0;
										}
									}
								});
								('step 1');
								event.dialog.close();
								var map = [
									function (trigger, player, event) {
										trigger.Changena = true;
									},
									function (trigger, player, event) {
										if (!player.isLinked()) player.link();
										if (!trigger.target.isLinked()) trigger.target.link();
									},
									function (trigger, player, event) {
										trigger.ADDdam = true;
									},
								];
								for (var i of result.links) {
									game.log(player, '选择了', '#g<蝶引来生>', '的', '#y选项' + get.cnNumber(result.links[i] + 1, true));
									map[result.links[i]](trigger, player, event);
								}
							},
							ai: {
								expose: 0.3,
							},
							subSkill: {
								dam: {
									trigger: {
										source: 'damageBegin1',
									},
									filter(event, player) {
										if (!event.card || event.card.name != 'sha' || !event.notLink()) return false;
										if (event.getParent(6).ADDdam == true || event.getParent(6).Changena == true) return true;
										return event.parent.ADDdam == true || event.parent.Changena == true;
									},
									forced: true,
									content() {
										'step 0';
										if (trigger.parent.Changena == true || trigger.getParent(6).Changena == true) {
											trigger.nature = 'fire';
										}
										('step 1');
										if (trigger.parent.ADDdam == true || trigger.getParent(6).ADDdam == true) {
											trigger.num++;
										}
									},
								},
								fan: {
									charlotte: true,
									forced: true,
									trigger: {
										player: 'shaMiss',
									},
									_priority: -99,
									content() {
										player.removeSkill('lg_dieyinlaisheng1');
										player.swapHandcards(trigger.target);
										trigger.target.useCard(trigger.card, player);
										trigger.target.addTempSkill('lg_dieyinlaisheng1_dam', { player: 'shaAfter' });
									},
								},
							},
						},
						lg_anshenmifa: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseBegin',
							},
							filter(event, player) {
								return player.canCompare(event.player); // && !event.player.hasSkill("jlsg_chanyuan");
							},
							check(event, player) {
								var cards = player.getCards('h');
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].number > 11 && get.value(cards[i]) < 7) {
										return get.attitude(player, event.player) < 0;
									}
								}
								if (get.attitude(player, event.player) < 0 && player.countCards('h') > 2) return 1;
								return 0;
							},
							logTarget: 'player',
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								var target = trigger.player;
								if (result.bool) {
									var list = [];
									for (var name of lib.inpile) {
										var type = get.type(name);
										if (!['basic', 'trick'].includes(type)) {
											continue;
										}
										if (lib.filter.cardEnabled({ name: name }, player)) {
											list.push([type, '', name]);
										}
										if (name == 'sha') {
											for (var j of lib.inpile_nature) {
												if (lib.filter.cardEnabled({ name: name, nature: j }, player)) list.push([type, '', name, j]);
											}
										}
									}
									var dialog = ui.create.dialog('安神秘法', [list, 'vcard']);
									var next = player.chooseButton(dialog);
									var choice,
										value = 0;
									for (let [_, __, cardName, nature] of list) {
										// choose button ai
										let card = { name: cardName, nature: nature };
										let newV = player.getUseValue(card);
										if (newV > value) {
											choice = [cardName, nature];
											value = newV;
										}
									}
									next.filterButton = function (button, player) {
										return true;
									};
									next.ai = function (button) {
										return button.link[2] === _status.event.choice[0] && (button.link[3] || true) === (_status.event.choice[1] || true);
									};
									next.choice = choice;
								} else {
									player.recover();
									player.removeSkill('lg_anshenmifa');
									player.addSkill('lg_anshenmifa11');
									event.finish();
								}
								('step 2');
								if (!result.bool) {
									event.finish();
									return;
								}
								var target = trigger.player;
								event.card = { name: result.links[0][2], nature: result.links[0][3] };
								player.chooseUseTarget(event.card, true);
							},
							ai: {
								expose: 0.1,
								order: 8,
								result: {
									player(player) {
										if (player.storage.lg_huoyuansu != undefined) return 1;
										if (player.hp > 2 && player.storage.lg_huoyuansu == undefined) return -10;
										if (Math.random() < 0.67) return 0.5;
										return -1;
									},
								},
								threaten: 4,
							},
						},
						lg_hutao_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_anshenmifa11: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseBegin',
							},
							forced: true,
							content() {
								player.removeSkill('lg_anshenmifa11');
								player.addSkill('lg_anshenmifa1');
							},
						},
						lg_anshenmifa1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseBegin',
							},
							filter(event, player) {
								return player.canCompare(event.player); // && !event.player.hasSkill("jlsg_chanyuan");
							},
							check(event, player) {
								var cards = player.getCards('h');
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].number > 11 && get.value(cards[i]) < 7) {
										return get.attitude(player, event.player) < 0;
									}
								}
								if (get.attitude(player, event.player) < 0 && player.countCards('h') > 2) return 1;
								return 0;
							},
							logTarget: 'player',
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								var target = trigger.player;
								if (result.bool) {
									var list = [];
									for (var name of lib.inpile) {
										var type = get.type(name);
										if (!['basic', 'trick'].includes(type)) {
											continue;
										}
										if (lib.filter.cardEnabled({ name: name }, player)) {
											list.push([type, '', name]);
										}
										if (name == 'sha') {
											for (var j of lib.inpile_nature) {
												if (lib.filter.cardEnabled({ name: name, nature: j }, player)) list.push([type, '', name, j]);
											}
										}
									}
									var dialog = ui.create.dialog('安神秘法', [list, 'vcard']);
									var next = player.chooseButton(dialog);
									var choice,
										value = 0;
									for (let [_, __, cardName, nature] of list) {
										// choose button ai
										let card = { name: cardName, nature: nature };
										let newV = player.getUseValue(card);
										if (newV > value) {
											choice = [cardName, nature];
											value = newV;
										}
									}
									next.filterButton = function (button, player) {
										return true;
									};
									next.ai = function (button) {
										return button.link[2] === _status.event.choice[0] && (button.link[3] || true) === (_status.event.choice[1] || true);
									};
									next.choice = choice;
								} else {
									player.recover(2);
									player.removeSkill('lg_anshenmifa1');
									player.addSkill('lg_anshenmifa22');
									event.finish();
								}
								('step 2');
								if (!result.bool) {
									event.finish();
									return;
								}
								var target = trigger.player;
								event.card = { name: result.links[0][2], nature: result.links[0][3] };
								player.chooseUseTarget(event.card, true);
							},
							ai: {
								expose: 0.1,
								order: 8,
								result: {
									player(player) {
										if (player.storage.lg_huoyuansu != undefined) return 1;
										if (player.hp > 2 && player.storage.lg_huoyuansu == undefined) return -10;
										if (Math.random() < 0.67) return 0.5;
										return -1;
									},
								},
								threaten: 4,
							},
						},
						lg_anshenmifa22: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							forced: true,
							content() {
								player.removeSkill('lg_anshenmifa22');
								player.addSkill('lg_anshenmifa2');
							},
						},
						lg_anshenmifa2: {
							audio: 'ext:幻颜风华/audio:2',
							logTarget: 'player',
							trigger: {
								global: 'useCard',
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (get.type(event.card) == 'basic') return false;
								if (!event.targets || !event.targets.length) return false;
								if (player.countCards('h', { suit: 'club' })) return false;
								return event.card.suit == 'club';
							},
							check: () => true,
							check_ai(event, player) {
								var eff = 0;
								for (var i = 0; i < event.targets.length; i++) {
									var target = event.targets[i];
									var eff1 = get.effect(target, event.card, player, player);
									eff += eff1;
								}
								return eff >= 0;
							},
							content() {
								'step 0';
								var value = get.attitude(trigger.player, player) > 0 || lib.skill.tlbb_qingheng.check_ai(trigger, trigger.player);
								//var value=get.attitude(trigger.player,player)>0||(trigger.targets&&trigger.targets.length&&lib.skill.lg_anshenmifa2.check_ai(trigger,trigger.player))||trigger.cards.name=='wuxie';
								trigger.player
									.chooseBool('令' + get.translation(player) + '摸两张牌;或' + get.translation(trigger.card) + '对目标无效.')
									.set('ai', function () {
										return _status.event.value;
									})
									.set('value', value);
								('step 1');
								if (result.bool) {
									trigger.player.line(player);
									player.draw(2);
								} else {
									trigger.targets.length = 0;
									trigger.all_excluded = true;
								}
							},
						},
						lg_chuncuidefengkuang1: {
							intro: {
								content: 'card',
							},
							trigger: {
								player: 'useCard',
							},
							forced: true,
							filter(event, player) {
								if (!event.cards || event.cards.length != 1) return false;
								if (_status.currentPhase != player) return false;
								if (!player.storage.lg_chuncuidefengkuang1) return false;
								return player.storage.lg_chuncuidefengkuang1.number > event.cards[0].number;
							},
							content() {
								var num = player.previous.previous.previous.countCards('h', { number: '6' });
								player.drawTo(2 * num);
							},
							group: ['lg_chuncuidefengkuang1_1', 'lg_chuncuidefengkuang1_2'],
							subSkill: {
								1: {
									trigger: {
										player: 'useCard',
									},
									_priority: -1,
									forced: true,
									popup: false,
									forced: true,
									filter(event, player) {
										if (!event.cards || event.cards.length != 1) return false;
										if (_status.currentPhase != player) return false;
										return true;
									},
									content() {
										player.storage.lg_chuncuidefengkuang1 = trigger.cards[0];
									},
								},
								2: {
									trigger: {
										player: 'phaseBefore',
									},
									forced: true,
									popup: false,
									forced: true,
									_priority: 10,
									content() {
										player.storage.lg_chuncuidefengkuang1 = null;
									},
								},
							},
						},
						lg_chuncuidefengkuang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['linkBegin', 'turnOverBegin'],
							},
							forced: true,
							filter(event, player) {
								return lib.filter.targetEnabled({ name: 'sha' }, player, event.player) && player.hasSha(null, true);
							},
							content() {
								var next = player.chooseToUse({ name: 'sha' }, '对' + get.translation(trigger.player) + '发动此技能？', trigger.player, -1);
								next.oncard = function () {
									player.phaseDiscard();
								};
							},
						},
						lg_mihuanmantuoluo1: {
							trigger: {
								player: 'useCardToPlayered',
								target: 'useCardToTargeted',
							},
							forced: true,
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.player.hp == event.target.hp;
							},
							content() {
								trigger.cancel();
							},
							ai: {
								effect: {
									player(card, player, target) {
										var hp = player.hp,
											evt = _status.event;
										if (evt.name == 'chooseToUse' && evt.player == player && evt.skill == 'spjungong' && !ui.selected.cards.length) hp -= (player.getStat('skill').spjungong || 0) + 1;
										if (card && card.name == 'sha' && hp == target.hp) return [1, 0.3];
									},
									target(card, player, target) {
										if (card && card.name == 'sha' && player.hp == target.hp) return [1, 0.3];
									},
								},
							},
						},
						lg_mihuanmantuoluo: {
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_mihuanmantuoluo_draw', 'lg_mihuanmantuoluo_use'],
							subSkill: {
								draw: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: 'phaseUseBegin',
									},
									check(event, player) {
										var att = get.attitude(player, event.player);
										if (att > 0) {
											return event.player.hp > player.hp || event.player.countCards('h') > player.countCards('h') + 1;
										} else {
											return event.player.hp > player.hp && event.player.countCards('h') > player.countCards('h') + 1;
										}
									},
									logTarget: 'player',
									filter(event, player) {
										if (event.player == player) return false;
										if (player.hasSkill('lg_mihuanmantuoluo_temp')) return false;
										return event.player.hp != player.hp || event.player.countCards('h') != player.countCards('h');
									},
									prompt2(event, player) {
										return '对' + get.translation(event.player) + '发动此技能？';
									},
									content() {
										'step 0';
										var list = [];
										event.pla = player;
										if (trigger.player.hp != player.hp) list.push('体力');
										if (trigger.player.countCards('h') != player.countCards('h')) list.push('手牌');
										if (!list.length) event.finish();
										trigger.player
											.chooseControl(list)
											.set('ai', function (event, player) {
												var tri = _status.event.getTrigger().player;
												var att = get.attitude(tri, event.pla);
												var num1 = tri.countCards('h') - event.pla.countCards('h');
												var num2 = Math.min(tri.hp - event.pla.hp, event.pla.maxHp - event.pla.hp) * 2;
												if (att > 0) {
													if (num1 >= num2) return list.includes('手牌') ? '手牌' : '体力';
													else return list.includes('体力') ? '体力' : '手牌';
												} else {
													if (num1 >= num2) return list.includes('体力') ? '体力' : '手牌';
													else return list.includes('手牌') ? '手牌' : '体力';
												}
											})
											.set('prompt', '选择一项' + get.translation(player) + '调整');
										('step 1');
										if (result.control) {
											if (result.control == '体力') {
												var nm = trigger.player.hp - player.hp;
												if (nm > 0) player.recover(nm);
												else player.loseHp(-nm);
											} else if (result.control == '手牌') {
												var num = trigger.player.countCards('h') - player.countCards('h');
												if (num > 0) player.draw(num);
												else player.chooseToDiscard('h', -num, true);
											}
											player.addTempSkill('lg_mihuanmantuoluo_temp', 'roundStart');
										}
									},
								},
								use: {
									audio: 'ext:幻颜风华/audio:4',
									enable: 'phaseUse',
									usable: 1,
									filter(event, player) {
										if (player.hasSkill('lg_mihuanmantuoluo_temp')) return false;
										return game.hasPlayer(function (current) {
											return current != player && (current.hp != player.hp || current.countCards('h') != player.countCards('h'));
										});
									},
									filterTarget(card, player, target) {
										if (player == target) return false;
										return target.hp != player.hp || target.countCards('h') != player.countCards('h');
									},
									selectTarget: 1,
									content() {
										'step 0';
										var list = [];
										if (target.hp != player.hp) list.push('体力');
										if (target.countCards('h') != player.countCards('h')) list.push('手牌');
										if (!list.length) event.finish();
										event.tar = target;
										event.pla = player;
										target
											.chooseControl(list)
											.set('ai', function (event, player) {
												var att = get.attitude(event.tar, event.pla);
												var num1 = event.tar.countCards('h') - event.pla.countCards('h');
												var num2 = (event.tar.hp - event.pla.hp) * 2;
												if (att > 0) {
													if (num1 >= num2) return list.includes('手牌') ? '手牌' : '体力';
													else return list.includes('体力') ? '体力' : '手牌';
												} else {
													if (num1 >= num2) return list.includes('体力') ? '体力' : '手牌';
													else return list.includes('手牌') ? '手牌' : '体力';
												}
											})
											.set('prompt', '选择一项' + get.translation(player) + '调整');
										('step 1');
										if (result.control) {
											if (result.control == '体力') {
												var nm = target.hp - player.hp;
												if (nm > 0) player.recover(nm);
												else player.loseHp(-nm);
											} else if (result.control == '手牌') {
												var num = target.countCards('h') - player.countCards('h');
												if (num > 0) player.draw(num);
												else player.chooseToDiscard('h', -num, true);
											}
											player.addTempSkill('lg_mihuanmantuoluo_temp', 'roundStart');
										}
									},
									ai: {
										order: 3,
										result: {
											target(player, target) {
												var att = get.attitude(player, target);
												var num1 = target.countCards('h') - player.countCards('h');
												var num2 = (target.hp - player.hp) * 2;
												if (att > 0) {
													return Math.max(num1, num2);
												} else {
													return -Math.min(num1, num2);
												}
											},
										},
									},
								},
								temp: {
									charlotte: true,
								},
							},
						},
						lg_mihuanmantuoluo0: {
							nobracket: true,
							trigger: {
								global: 'phaseUseBegin',
							},
							filter(event, player) {
								return player.countCards('h', { suit: 'heart' }) == 0;
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCardTarget({
									filterCard(card) {
										return true;
									},
									position: 'he',
									filterTarget(card, player, target) {
										return player != target;
									},
									selectTarget() {
										return ui.selected.cards.length;
									},
									selectCard() {
										var player = _status.event.player;
										var num = game.countPlayer(function (current) {
											return current.countCards('h') > player.countCards('h');
										});
										return [1, Math.max(1, num)];
									},
									ai1(card) {
										var player = _status.event.player;
										return 7 - get.value(card);
									},
									ai2(target) {
										return get.effect(target, { name: 'sha' }, player, player);
									},
									prompt: '发动此技能？',
								});
								('step 1');
								if (!result.bool) {
									event.finish();
									return;
								}
								var target = result.targets;
								var card = result.cards;
								player.popup('迷幻曼陀罗', 'thunder');
								player.line(target, 'thunder');
								for (var i = 0; i < target.length; i++) {
									if (target[i].countCards('h')) player.gainPlayerCard(target[i], 'hej', [1, 2], true);
								}
								player.useCard({ name: 'sha' }, target, card, false);
							},
						},
						lg_yingyierchu1: {
							nobracket: true,
							usable: 1,
							trigger: {
								source: 'damageBegin',
							},
							forced: true,
							content() {
								'step 0';
								var num1 = game.countPlayer();
								var num2 = game.countPlayer(function (current) {
									return current.hp < trigger.player.hp;
								});
								if (num2 + 1 >= num1) {
									trigger.num++;
								}
								('step 1');
								trigger.source = trigger.player;
							},
						},
						lg_yingyierchu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseJudgeBegin',
							},
							filter(event, player) {
								if (player.hasSkill('lg_yingyierchu_off')) return false;
								if (event.player == player) return false;
								return true;
							},
							logTarget: 'player',
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							content() {
								'step 0';
								if (!trigger.player.countCards('h', { suit: 'heart' })) {
									trigger.player.addTempSkill('lg_yingyierchu_spade');
									event.finish();
								}
								('step 1');
								trigger.player
									.chooseCard(1, 'h', '将一张♥️️手牌交给' + get.translation(player) + '？', function (card, player) {
										return card.suit == 'heart';
									})
									.set('ai', function (card) {
										var att1 = get.attitude(trigger.player, player);
										if (att1 > 0) {
											return 1;
										}
										return 5 - get.value(card);
									});
								('step 2');
								if (result.bool) {
									player.gain(result.cards[0], trigger.player, 'give');
									player.addTempSkill('lg_yingyierchu_off', 'recoverEnd');
								} else {
									trigger.player.addTempSkill('lg_yingyierchu_spade');
								}
							},
							subSkill: {
								off: {
									mark: true,
									marktext2: '纯',
									marktext: '纯',
									intro: {
										content: '你不能发动此技能',
									},
								},
								spade: {
									mark: true,
									marktext2: '♥️️️',
									marktext: '♥️️️',
									intro: {
										content: '你不能使用♥️️牌',
									},
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardUsable(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardRespondable(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardSavable(card, player) {
											if (card.suit == 'heart') return false;
										},
										targetInRange(card) {
											if (card.suit == 'heart') return false;
										},
									},
								},
							},
						},
						lg_chunhu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_chunhu1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_chunhu1 = 0;
								player.markSkill('lg_chunhu1');
							},
							filter(event, player) {
								return player.storage.lg_chunhu1 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_chunhu1 += 5;
								player.markSkill('lg_chunhu1');
							},
						},
						lg_yuanshishenling: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								target: 'useCardToBefore',
							},
							filter(event, player) {
								return player.storage.lg_chunhu1 > 19;
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_yuanshishenling.jpg',
							intro: {
								content: '灵力消耗:<br/>20点<br/><br/>符卡效果:<br/>一名其他角色使用牌指定你为目标时,你可以对其使用一张牌.若以此法对其造成伤害,其使用的牌无效;且若其使用的牌为♥️️,你回复1点体力.',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseToUse(
									function (card) {
										return !get.info(card).multitarget;
									},
									get.prompt('lg_yuanshishenling', trigger.player),
									trigger.player,
									-1
								);
								('step 1');
								if (event.damaged) {
									trigger.cancel();
									if (trigger.card.suit == 'heart') {
										player.recover();
									}
								}
							},
							subSkill: {
								damage: {
									trigger: {
										source: 'damageAfter',
									},
									silent: true,
									filter(event, player) {
										return event.getParent(4).name == 'lg_yuanshishenling';
									},
									content() {
										trigger.getParent(4).damaged = true;
									},
									forced: true,
									popup: false,
								},
							},
							group: 'lg_yuanshishenling_damage',
							ai: {
								effect: {
									player(card, player, target) {
										if (_status.currentPhase != player) return;
										if (get.tag(card, 'damage') && !player.needsToDiscard(1) && target.hp > 1) {
											return 'zeroplayertarget';
										}
									},
								},
							},
						},
						lg_xiandaishenling: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								target: 'useCardToBefore',
							},
							filter(event, player) {
								return player.storage.lg_chunhu1 > 69;
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_xiandaishenling.jpg',
							intro: {
								content: '灵力消耗:<br/>70点<br/><br/>符卡效果:<br/>一名其他角色使用牌指定你为目标时,你可以对其使用一张牌.若以此法对其造成伤害,其使用的牌无效;且若其使用的牌为♠️️,你摸三张牌.',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseToUse(
									function (card) {
										return !get.info(card).multitarget;
									},
									get.prompt('lg_xiandaishenling', trigger.player),
									trigger.player,
									-1
								);
								('step 1');
								if (event.damaged) {
									trigger.cancel();
									if (trigger.card.suit == 'spade') {
										player.draw(3);
									}
								}
							},
							subSkill: {
								damage: {
									trigger: {
										source: 'damageAfter',
									},
									silent: true,
									filter(event, player) {
										return event.getParent(4).name == 'lg_xiandaishenling';
									},
									content() {
										trigger.getParent(4).damaged = true;
									},
									forced: true,
									popup: false,
								},
							},
							group: 'lg_xiandaishenling_damage',
							ai: {
								effect: {
									player(card, player, target) {
										if (_status.currentPhase != player) return;
										if (get.tag(card, 'damage') && !player.needsToDiscard(1) && target.hp > 1) {
											return 'zeroplayertarget';
										}
									},
								},
							},
						},
						lg_jingzhungaoguang: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								target: 'useCardToTarget',
							},
							filter(event, player) {
								if (!player.countCards('h')) return false;
								return event.card.suit == 'club';
							},
							content() {
								'step 0';
								player.showHandcards();
								('step 1');
								if (player.countCards('h', { suit: 'club' }) < player.countCards('h')) {
									player
										.chooseCard([1, Infinity], '重铸任意张非♥️️手牌？', function (card) {
											return card.suit != 'heart';
										})
										.set('ai', function (card) {
											return 7 - get.value(card);
										});
								} else event.finish();
								('step 2');
								if (result.bool) {
									player.lose(result.cards, ui.discardPile);
									game.log(player, '重铸了', result.cards);
									player.draw(result.cards.length, 'nodelay');
								}
							},
						},
						lg_shanyao: {
							nobracket: true,
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return player.storage.lg_shanyao < player.maxHp - player.hp;
							},
							init(player) {
								player.storage.lg_shanyao = 0;
							},
							check(event, player) {
								if (get.attitude(player, event.player) > -2) return false;
								return true;
							},
							logTarget: 'player',
							line: 'thunder',
							forced: true,
							content() {
								var num = player.previous.previous.countCards('h', { number: '10' });
								player.storage.lg_shanyao++;
								trigger.num++;
								player.drawTo(3 * num);
							},
						},
						lg_damowangshike: {
							audio: 'ext:幻颜风华/audio:2',
							init(player) {
								player.storage.lg_damowangshike = [];
								for (var i = 0; i < lib.inpile.length; i++) {
									if (get.type({ name: lib.inpile[i] }) == 'trick') player.storage.lg_damowangshike.push(lib.inpile[i]);
								}
								player.markSkill('lg_damowangshike');
							},
							marktext2: '晚',
							markimage: 'extension/幻颜风华/Trace/lg_trace_damowangshike.jpg',
							mark: true,
							intro: {
								mark(dialog, storage, player) {
									if (!storage.length) return '无';
									var list = [];
									for (var i = 0; i < storage.length; i++) {
										list.push(['锦囊', '', storage[i]]);
									}
									dialog.addAuto([list, 'vcard']);
								},
								markcount(storage, player) {
									return storage.length;
								},
							},
							filter(event, player) {
								if (!(lib.config.extension_幻颜风华_damowangshike && player.storage.lg_damowangshike) && player.countCards('h')) return false;
								for (var i = 0; i < player.storage.lg_damowangshike.length; i++) {
									if (player.hasUseTarget({ name: player.storage.lg_damowangshike[i] })) return true;
								}
								return false;
							},
							trigger: {
								player: ['equipEnd'],
							},
							forced: true,
							content() {
								'step 0';
								var list = [];
								var list2 = [];
								for (var i = 0; i < player.storage.lg_damowangshike.length; i++) {
									if (player.hasUseTarget({ name: player.storage.lg_damowangshike[i] })) {
										list.push(['锦囊', '', player.storage.lg_damowangshike[i]]);
									} else {
										list2.push(['锦囊', '', player.storage.lg_damowangshike[i]]);
									}
								}
								list.sort(lib.sort.name);
								var dialog = ui.create.dialog('能使用的普通锦囊牌:', [list, 'vcard']);
								if (list2.length) {
									dialog.add('不能使用的普通锦囊牌:');
									dialog.add([list2, 'vcard']);
								}
								player
									.chooseButton(dialog)
									.set('ai', function (button) {
										return _status.event.player.getUseValue({ name: button.link[2] });
									})
									.set('filterButton', function (button) {
										return _status.event.player.hasUseTarget({ name: button.link[2] });
									});
								('step 1');
								if (result.bool) {
									player.chooseUseTarget({ name: result.links[0][2] }, true);
									player.storage.lg_damowangshike.remove(result.links[0][2]);
									player.markSkill('lg_damowangshike');
								}
							},
						},
						lg_damowangshike1: {
							trigger: {
								player: 'lg_damowangshikeAfter',
							},
							filter(event, player) {
								return game.hasPlayer(function (current) {
									if (player == current) return false;
									return current.countCards('he') && player.countCards('he', { suit: 'club' }) < game.roundNumber;
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_damowangshike1'), true, function (card, player, target) {
										if (player == target) return false;
										return target.countCards('he');
									})
									.set('ai', function (target) {
										var player = get.player();
										return -get.attitude(player, target);
									});
								('step 1');
								event.target = result.targets[0];
								event.target
									.chooseCard('交给' + get.translation(player) + '一张牌', 'he', true)
									.set('ai', function (card) {
										var tg = _status.event.tg;
										var player = get.player();
										if (card.name == 'sha') {
											if (!player.canUse(card, tg, false)) return 0;
											return get.effect(tg, card, player, player);
										}
										return -get.value(card);
									})
									.set('tg', player);
								('step 2');
								if (result.cards[0].name == 'sha' && event.target.canUse(result.cards[0], player, false)) {
									event.target.useCard(result.cards[0], player, false);
								} else event.target.give(result.cards, player);
							},
						},
						lg_xiangwan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_tanqiuhuanchong: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageEnd',
							},
							forced: true,
							line: {
								color: [235, 96, 138],
							},
							content() {
								'step 0';
								event.count = Math.abs(trigger.num);
								('step 1');
								event.count--;
								player.chooseTarget([1, 3], get.prompt('lg_tanqiuhuanchong'), '发动此技能？').set('ai', function (target) {
									return get.attitude(_status.event.player, target);
								});
								('step 2');
								if (result.bool) {
									var targets = result.targets;
									targets.sortBySeat();
									game.asyncDraw(targets);
								} else event.finish();
								('step 3');
								if (event.count > 0) event.goto(1);
							},
						},
						lg_tanqiuhuanchong0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_tanqiuhuanchongAfter',
							},
							filter(event, player) {
								return player.countCards('h') > player.maxHp;
							},
							forced: true,
							content() {
								player.chooseToDiscard(2, true, 'he');
							},
						},
						lg_haojiedansheng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseDrawBegin',
							},
							_priority: 2,
							filter(event, player) {
								return !player.isMaxEquip(true) && player.canMoveCard(false);
							},
							check(event, player) {
								return player.countCards('h') > 1 && player.canMoveCard(true);
							},
							prompt2(event, player) {
								return '跳过摸牌阶段？';
							},
							content() {
								player.moveCard();
								trigger.cancel();
								if (player.countCards('h') < player.maxHp) player.draw();
							},
							ai: {
								threaten: 1.2,
								expose: 0.2,
							},
							group: ['lg_haojiedansheng_draw'],
							subSkill: {
								draw: {
									trigger: {
										player: 'phaseDiscardBegin',
									},
									_priority: 2,
									filter(event, player) {
										return !player.isMaxEquip(true) && player.canMoveCard(false);
									},
									check(event, player) {
										return !player.needsToDiscard() && player.canMoveCard(true);
									},
									prompt2(event, player) {
										return '跳过弃牌阶段？';
									},
									content() {
										player.moveCard();
										trigger.cancel();
										if (player.countCards('h') < player.maxHp) player.draw();
									},
								},
							},
						},
						lg_xueshi: {
							usable: 2,
							trigger: {
								global: ['useCard', 'respond'],
							},
							filter(event, player) {
								var respondTo = event.respondTo;
								if (!respondTo) return false;
								if (!event.cards || event.cards.length != 1) return false;
								if (player == event.player && get.position(event.cards[0]) == 'd') {
									if (get.itemtype(respondTo[1]) == 'card') {
										return event.cards[0].number > respondTo[1].number;
									} else if (respondTo[1].cards && respondTo[1].cards.length == 1) {
										return event.cards[0].number > respondTo[1].cards[0].number;
									} else return false;
								} else if (respondTo[0] == player) {
									if (get.itemtype(respondTo[1]) == 'card' && get.position(respondTo[1]) == 'd') {
										return event.cards[0].number < respondTo[1].number;
									} else if (respondTo[1].cards && respondTo[1].cards.length == 1 && get.position(respondTo[1].cards[0]) == 'd') {
										return event.cards[0].number < respondTo[1].cards[0].number;
									} else return false;
								}
								return false;
							},
							check(event, player) {
								var respondTo = event.respondTo;
								if (player == event.player) {
									if (event.cards[0].name == 'du') return false;
									return true;
								} else if (respondTo[0] == player) {
									if (get.itemtype(respondTo[1]) == 'card' && respondTo[1].name == 'du') {
										return false;
									} else if (respondTo[1].cards && respondTo[1].cards.length == 1) {
										if (respondTo[1].cards[0].name == 'du') return false;
										return true;
									}
								}
								return true;
							},
							forced: true,
							content() {
								var respondTo = trigger.respondTo;
								var togain = null;
								if (player == trigger.player) {
									togain = trigger.cards;
								} else if (respondTo[0] == player) {
									if (get.itemtype(respondTo[1]) == 'card') {
										togain = respondTo[1];
									} else if (respondTo[1].cards && respondTo[1].cards) {
										togain = respondTo[1].cards;
									}
								}
								player.gain(togain, 'gain2', 'log');
								player.draw();
							},
						},
						lg_youni_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_zhexue0: {
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_zhexue0_sha', 'lg_zhexue0_shan', 'lg_zhexue0_tao'],
							subSkill: {
								sha: {
									name: '认知发展的哲学',
									audio: 'ext:幻颜风华/audio:2',
									enable: ['chooseToRespond', 'chooseToUse'],
									position: 'e',
									filterCard: true,
									viewAsFilter(player) {
										return player.countCards('h') == 0;
									},
									viewAs: {
										name: 'sha',
									},
									prompt: '将一张装备区内的牌当【杀】使用或打出',
									ai: {
										skillTagFilter(player) {
											if (!player.countCards('e')) return false;
										},
										respondSha: true,
										yingbian(card, player, targets, viewer) {
											if (get.attitude(viewer, player) <= 0) return 0;
											var base = 0,
												hit = false;
											if (get.cardtag(card, 'yingbian_hit')) {
												hit = true;
												if (
													targets.filter(function (target) {
														return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_all')) {
												if (
													game.hasPlayer(function (current) {
														return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
													})
												)
													base += 5;
											}
											if (get.cardtag(card, 'yingbian_damage')) {
												if (
													targets.filter(function (target) {
														return (
															get.attitude(player, target) < 0 &&
															(hit ||
																!target.mayHaveShan() ||
																player.hasSkillTag(
																	'directHit_ai',
																	true,
																	{
																		target: target,
																		card: card,
																	},
																	true
																)) &&
															!target.hasSkillTag('filterDamage', null, {
																player: player,
																card: card,
																jiu: true,
															})
														);
													})
												)
													base += 5;
											}
											return base;
										},
										canLink(player, target, card) {
											if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
											if (
												target.mayHaveShan() &&
												!player.hasSkillTag(
													'directHit_ai',
													true,
													{
														target: target,
														card: card,
													},
													true
												)
											)
												return false;
											if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
											return true;
										},
										basic: {
											useful: [5, 3, 1],
											value: [5, 3, 1],
										},
										order(item, player) {
											if (player.hasSkillTag('presha', true, null, true)) return 10;
											if (lib.linked.includes(get.nature(item))) {
												if (
													game.hasPlayer(function (current) {
														return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
													}) &&
													game.countPlayer(function (current) {
														return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
													}) > 1
												)
													return 3.1;
												return 3;
											}
											return 3.05;
										},
										result: {
											target(player, target, card, isLink) {
												var eff = (function () {
													if (!isLink && player.hasSkill('jiu')) {
														if (
															!target.hasSkillTag('filterDamage', null, {
																player: player,
																card: card,
																jiu: true,
															})
														) {
															if (get.attitude(player, target) > 0) {
																return -7;
															} else {
																return -4;
															}
														}
														return -0.5;
													}
													return -1.5;
												})();
												if (
													!isLink &&
													target.mayHaveShan() &&
													!player.hasSkillTag(
														'directHit_ai',
														true,
														{
															target: target,
															card: card,
														},
														true
													)
												)
													return eff / 1.2;
												return eff;
											},
										},
										tag: {
											respond: 1,
											respondShan: 1,
											damage(card) {
												if (card.nature == 'poison') return;
												return 1;
											},
											natureDamage(card) {
												if (card.nature) return 1;
											},
											fireDamage(card, nature) {
												if (card.nature == 'fire') return 1;
											},
											thunderDamage(card, nature) {
												if (card.nature == 'thunder') return 1;
											},
											poisonDamage(card, nature) {
												if (card.nature == 'poison') return 1;
											},
											jy_duDamage(card, nature) {
												if (card.nature == 'jy_du') return 1;
											},
											jy_xieDamage(card, nature) {
												if (card.nature == 'jy_xie') return 1;
											},
										},
									},
								},
								shan: {
									name: '认知发展的哲学',
									audio: 'ext:幻颜风华/audio:2',
									enable: ['chooseToRespond'],
									position: 'e',
									filterCard: true,
									viewAsFilter(player) {
										return player.countCards('h') == 0;
									},
									viewAs: {
										name: 'shan',
									},
									prompt: '将一张装备区内的牌当【闪】使用或打出',
									ai: {
										respondShan: true,
										skillTagFilter(player) {
											if (!player.countCards('e')) return false;
										},
										effect: {
											target(card, player, target, current) {
												if (get.tag(card, 'respondShan') && current < 0) return 0.6;
											},
										},
										order: 3,
										basic: {
											useful: [7, 5.1, 2],
											value: [7, 5.1, 2],
										},
										result: {
											player: 1,
										},
									},
								},
								tao: {
									name: '认知发展的哲学',
									audio: 'ext:幻颜风华/audio:2',
									enable: ['phaseUse', 'chooseToUse', 'chooseToRespond'],
									position: 'e',
									filterCard: true,
									viewAsFilter(player) {
										return player.countCards('h') == 0;
									},
									viewAs: {
										name: 'tao',
									},
									prompt: '将一张装备区内的牌当【桃】使用或打出',
									ai: {
										skillTagFilter(player) {
											return player.countCards('e') > 0;
										},
										save: true,
										basic: {
											order(card, player) {
												if (player.hasSkillTag('pretao')) return 5;
												return 2;
											},
											useful: [6.5, 4, 3, 2],
											value: [6.5, 4, 3, 2],
										},
										result: {
											target: 2,
											target_use(player, target) {
												// if(player==target&&player.hp<=0) return 2;
												if (player.hasSkillTag('nokeep', true, null, true)) return 2;
												var nd = player.needsToDiscard();
												var keep = false;
												if (nd <= 0) {
													keep = true;
												} else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
													keep = true;
												}
												var mode = get.mode();
												if (target.hp >= 2 && keep && target.hasFriend()) {
													if (target.hp > 2 || nd == 0) return 0;
													if (target.hp == 2) {
														if (
															game.hasPlayer(function (current) {
																if (target != current && get.attitude(target, current) >= 3) {
																	if (current.hp <= 1) return true;
																	if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
																}
															})
														) {
															return 0;
														}
													}
												}
												if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
												var att = get.attitude(player, target);
												if (att < 3 && att >= 0 && player != target) return 0;
												var tri = _status.event.getTrigger();
												if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
													if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
														var num = game.countPlayer(function (current) {
															if (current.identity == 'fan') {
																return current.countCards('h', 'tao');
															}
														});
														if (num > 1 && player == target) return 2;
														return 0;
													}
												}
												if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
													if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
														return 0;
													}
												}
												if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
													return 0;
												}
												return 2;
											},
										},
										tag: {
											recover: 1,
											save: 1,
										},
									},
								},
							},
						},
						lg_zhexue: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 3,
							trigger: {
								player: ['taoBegin', 'shanBegin', 'shaBegin'],
							},
							forced: true,
							content() {
								player.phaseJudge();
							},
						},
						lg_ertianyiliu: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'shaDamage',
							},
							content() {
								'step 0';
								event.num = Math.floor(player.countCards('he') / 2);
								event.cards = get.cards(event.num);
								event.chosen = [];
								if (player.countCards('he') == 0) event.goto(4);
								('step 1');
								player.chooseCardButton('选择交换的牌', event.cards, [0, player.countCards('he')]).ai = function (button) {
									return get.value(button.link) - 5;
								};
								('step 2');
								if (result.bool) {
									event.cards1 = result.links;
									player.chooseCard(event.cards1.length, 'he', true).set('ai', function (card) {
										return 1;
									});
								} else {
									event.goto(4);
								}
								('step 3');
								if (result.bool) {
									var cards = result.cards;
									var cards1 = [];
									var cards2 = [];
									for (var i = 0; i < event.cards1.length; i++) {
										var card = event.cards1[i];
										cards1.push(card);
										event.cards.remove(event.cards1[i]);
									}
									player.gain(cards1);
									for (var i = 0; i < cards.length; i++) {
										var card1 = cards[i];
										cards2.push(card1);
										event.cards.add(game.createCard(cards[i]));
									}
									player.lose(cards2, ui.special);
								}
								('step 4');
								var js = player.getCards('j');
								var pos;
								var choice = -1;
								var getval = function (card, pos) {
									if (js[pos]) {
										return get.judge(js[pos])(card);
									} else {
										return get.value(card);
									}
								};
								for (pos = 0; pos < Math.min(event.cards.length, js.length + 2); pos++) {
									var max = getval(event.cards[pos], pos);
									for (var j = pos + 1; j < event.cards.length; j++) {
										var current = getval(event.cards[j], pos);
										if (current > max) {
											choice = j;
											max = current;
										}
									}
									if (choice != -1) break;
								}
								player
									.chooseCardButton('将任意张牌置于牌堆顶;或牌堆底', event.cards)
									.set('filterButton', function (button) {
										return !_status.event.chosen.includes(button.link);
									})
									.set('chosen', event.chosen)
									.set('ai', function (button) {
										return button.link == _status.event.choice ? 1 : 0;
									})
									.set('choice', event.cards[choice]);
								event.pos = pos;
								('step 5');
								if (result.bool) {
									var card = result.links[0];
									var index = event.cards.indexOf(card);
									event.card = card;
									event.chosen.push(card);
									event.cards.remove(event.card);
									var buttons = event.cards.slice(0);
									player
										.chooseControl(function () {
											return _status.event.controlai;
										})
										.set('controlai', event.pos || 0)
										.set('sortcard', buttons)
										.set('tosort', card);
								} else {
									event.goto(7);
								}
								('step 6');
								if (typeof result.index == 'number') {
									if (result.index > event.cards.length) {
										ui.cardPile.appendChild(event.card);
									} else {
										event.cards.splice(result.index, 0, event.card);
									}
									event.num--;
									if (event.num > 0) event.goto(4);
								}
								('step 7');
								while (event.cards.length) {
									ui.cardPile.insertBefore(event.cards.pop(), ui.cardPile.firstChild);
								}
							},
						},
						lg_julijialuo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToTargeted',
							},
							check(event, player) {
								return get.damageEffect(event.player, player, player) > 0;
							},
							logTarget: 'player',
							filter(event, player) {
								if (!event.card || event.player == player) return false;
								return get.tag(event.card, 'damage');
							},
							content() {
								'step 0';
								event.cd = get.cards(1)[0];
								player.showCards('俱利伽罗天象', event.cd);
								('step 1');
								player.showHandcards();
								player.addTempSkill('lg_wukong', { player: 'phaseBeginStart' });
								('step 2');
								var mk = true,
									st = event.cd.suit,
									cds = player.getCards('h');
								for (var i = 0; i < cds.length; i++) {
									if (cds[i].suit == st) {
										mk = false;
										break;
									}
								}
								if (mk) trigger.player.damage(2, 'nosource', player);
								else player.gain(event.cd, 'gain2', 'log') && player.phaseUse();
							},
							ai: {
								expose: 0.4,
								threaten: 0.9,
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage') || card.name == 'tiesuo') {
											if (!target.hasFriend()) return;
											var hs = Math.max(0, 4 - target.countCards('h'));
											return [1, 0, 1, -hs];
										}
									},
								},
							},
						},
						lg_gongbenwuzang_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_wukong: {
							trigger: {
								player: 'damageBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_wukong.jpg',
							intro: {
								content: '「无空」<br/>状态效果:<br/>当你受到伤害时,若你的体力值为:奇数,你摸一张牌;偶数,防止之.',
							},
							forced: true,
							filter(event, player) {
								return player.hp % 2 == 1 || player.isDamaged();
							},
							content() {
								if (player.hp % 2 == 1) player.draw();
								else trigger.cancel();
							},
						},
						lg_xinyan: {
							trigger: {
								player: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								var evt = event.getParent(2);
								if (evt.name != 'useCard' || evt.card != event.card) return false;
								var source = evt.player;
								var phsu = evt.getParent('phaseUse');
								if (!source || source == player || source != phsu.player) return false;
								return (
									source.getHistory('useCard', function (evt2) {
										return evt2.getParent('phaseUse') == phsu;
									})[0] == evt
								);
							},
							content() {
								trigger.num -= 2;
							},
							group: 'lg_xinyan_card',
							subSkill: {
								card: {
									trigger: {
										target: 'useCardToTargeted',
									},
									forced: true,
									filter(event, player) {
										if (event.card.suit != 'diamond') return false;
										var evt = event.parent;
										var source = evt.player;
										var phsu = evt.getParent('phaseUse');
										if (!source || source == player || source != phsu.player) return false;
										return (
											source
												.getHistory('useCard', function (evt2) {
													return evt2.getParent('phaseUse') == phsu;
												})
												.indexOf(evt) == 1
										);
									},
									content() {
										var num = player.next.next.countCards('h', { suit: 'diamond' });
										trigger.excluded.add(player);
										player.drawTo(2 * num);
									},
								},
							},
							ai: {
								effect: {
									target(card, player, target, current, isLink) {
										if (isLink || !player.isPhaseUsing()) return;
										var num;
										var evt = _status.event.getParent('useCard'),
											evt2 = _status.event.getParent('phaseUse');
										if (evt.card == card) {
											num = player
												.getHistory('useCard', function (evt) {
													return evt.getParent('phaseUse') == evt2;
												})
												.indexOf(evt);
										} else
											num = player.getHistory('useCard', function (evt) {
												return evt.getParent('phaseUse') == evt2;
											}).length;
										if (num < 0 || num > 1) return;
										if (num == 0 && get.tag(card, 'damage')) return 'zerotarget';
										if (num == 1 && card.suit == 'diamond') return 'zeroplayertarget';
									},
								},
							},
						},
						lg_zhicai: {
							nobracket: true,
							trigger: {
								player: ['useCard', 'die'],
								global: 'phaseAfter',
							},
							forceDie: true,
							forced: true,
							popup: false,
							init(player) {
								player.storage.lg_zhicai = [];
								game.countPlayer(function (current) {
									if (current != player) current.storage.lg_zhicaiUse = [];
								});
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_zhicai.jpg',
							intro: {
								content(storage) {
									var str = '其他角色不能使用或打出' + get.translation(storage[0]);
									for (var i = 1; i < storage.length; i++) {
										str += '、' + get.translation(storage[i]);
									}
									str += '牌';
									return str;
								},
							},
							content() {
								if (trigger.name == 'die') {
									game.countPlayer(function (current) {
										if (current != player) current.storage.lg_zhicaiUse = [];
									});
									event.finsih();
									return;
								} else if (trigger.name == 'useCard') {
									if (!trigger.card.suit) {
										event.finish();
										return;
									}
									if (!player.storage.lg_zhicai.includes(trigger.card.suit)) {
										player.storage.lg_zhicai.add(trigger.card.suit);
										player.markSkill('lg_zhicai');
										game.countPlayer(function (current) {
											if (current != player) current.storage.lg_zhicaiUse.push(trigger.card.suit);
										});
									}
								} else {
									player.storage.lg_zhicai = [];
									player.unmarkSkill('lg_zhicai');
									game.countPlayer(function (current) {
										if (current != player) current.storage.lg_zhicaiUse = [];
									});
								}
							},
							global: ['lg_zhicai_use'],
							subSkill: {
								use: {
									popup: false,
									forced: true,
									mod: {
										cardEnabled2(card, player) {
											if (player.storage.lg_zhicaiUse && player.storage.lg_zhicaiUse.includes(card.suit)) return false;
										},
									},
								},
							},
						},
						lg_zuimeng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCardToTarget',
							},
							check(event, player) {
								return get.effect(player, event.card, event.player, player) > 0;
							},
							filter(event, player) {
								if (event.card.suit != 'spade') return false;
								if (event.player.group == '旧始') return false;
								if (!event.targets) return false;
								if (event.player == player) return false;
								if (event.targets.includes(player)) return false;
								if (get.info(event.card).multitarget) return false;
								var type = get.type(event.card);
								if (event.card.name != 'sha' && type != 'trick') return false;
								//if(event.player.canUse(event.card,player)){
								//return true;
								//}
								if (lib.filter.targetEnabled2(event.card, event.player, player)) {
									return true;
								}
								return false;
							},
							autodelay: true,
							content() {
								trigger.parent.targets.add(player);
								trigger.player.line(player, 'green');
								player.removeSkill('lg_zuimeng');
								player.addSkill('lg_zuimeng1');
							},
						},
						lg_zuimeng1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCardToTarget',
							},
							check(event, player) {
								return get.effect(player, event.card, event.player, player) > 0;
							},
							filter(event, player) {
								if (event.card.suit != 'heart') return false;
								if (event.player.group == '旧始') return false;
								if (!event.targets) return false;
								if (event.player == player) return false;
								if (event.targets.includes(player)) return false;
								if (get.info(event.card).multitarget) return false;
								var type = get.type(event.card);
								if (event.card.name != 'sha' && type != 'trick') return false;
								//if(event.player.canUse(event.card,player)){
								//return true;
								//}
								if (lib.filter.targetEnabled2(event.card, event.player, player)) {
									return true;
								}
								return false;
							},
							autodelay: true,
							content() {
								trigger.parent.targets.add(player);
								trigger.player.line(player, 'green');
							},
						},
						lg_kuwei: {
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'recoverBegin',
							},
							mark: true,
							intro: {
								content: '转换:<br/>当你回复体力时,你可以令当前回合未指定过的一名其他角色选择一项:①交给你一张♠️️牌;②随机废除一个装备栏.若你没有♠️️手牌,你可以重复此流程.',
							},
							content() {
								'step 0';
								event.targets = [];
								('step 1');
								player
									.chooseTarget(get.prompt2('lg_kuwei'), function (card, player, target) {
										return target != player && !event.targets.includes(target) /*&&target.countCards('h')*/;
									})
									.set('ai', function (target) {
										return -get.attitude(player, target);
									});
								('step 2');
								if (result.bool) {
									event.target = result.targets[0];
									event.targets.add(event.target);
								} else {
									event.finish();
								}
								('step 3');
								target
									.chooseCard('请选择', function (card) {
										return card.suit == 'spade';
									})
									.set('ai', function (card) {
										if (get.attitude(_status.event.player, player) > 0) {
											return 11 - get.value(card);
										} else {
											return 7 - get.value(card);
										}
									});
								('step 4');
								if (result.bool) {
									player.gain(result.cards, 'giveAuto', target);
								} else {
									target.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
								}
								('step 5');
								if (
									!player.countCards('h', { suit: 'spade' }) &&
									game.hasPlayer(function (current) {
										return current != player && !event.targets.includes(current);
									})
								)
									event.goto(1);
							},
						},
						lg_kuwei0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_kuweiAfter',
							},
							forced: true,
							content() {
								player.removeSkill('lg_kuwei');
								player.addSkill('lg_kuwei1');
							},
						},
						lg_kuwei1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'damageEnd',
							},
							mark: true,
							intro: {
								content: '转换:<br/>当你受到伤害后,若伤害来源的装备区内有牌,你可以将其装备区内的一张牌移至你对应的区域.',
							},
							forced: true,
							filter(event, player) {
								return event.source && event.source.countCards('e') > 0;
							},
							content() {
								'step 0';
								var att = get.attitude(player, trigger.source);
								player.choosePlayerCard('e', get.prompt('lg_kuwei1'), trigger.source).ai = function (button) {
									if (att <= 0) {
										return get.equipValue(button.link);
									}
									return 0;
								};
								('step 1');
								if (result.bool) {
									player.equip(result.links[0]);
									trigger.source.$give(result.links[0], player, false);
									player.removeSkill('lg_kuwei1');
									player.addSkill('lg_kuwei');
								}
							},
							ai: {
								maixie_defend: true,
							},
						},
						lg_qingyanranran: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseBegin',
							},
							filter(event, player) {
								return event.player != player && player.countCards('h') >= player.hp;
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCard('h', player.hp, get.prompt('lg_qingyanranran')).set('ai', function (card) {
									if (get.attitude(player, trigger.player) > 0 && player.hp < 2 && player.countCards('h') > 1) return 6 - get.value(card);
									return 0;
								});
								('step 1');
								if (result.bool) {
									player.line(trigger.player);
									player.discard(result.cards);
									player.recover();
									player.useCard({ name: 'jiu' }, trigger.player);
								}
							},
						},
						lg_qingyanranran1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseBegin',
							},
							filter(event, player) {
								return event.player != player && player.countCards('h') >= player.hp;
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCard('h', player.hp, get.prompt('lg_qingyanranran1')).set('ai', function (card) {
									if (get.attitude(player, trigger.player) > 0 && player.hp < 2 && player.countCards('h') > 1) return 6 - get.value(card);
									return 0;
								});
								('step 1');
								if (result.bool) {
									player.line(trigger.player);
									player.discard(result.cards);
									player.recover();
									player.useCard({ name: 'jiu' }, trigger.player);
									player.removeSkill('lg_qingyanranran1');
								}
							},
						},
						lg_linghunsangzhong: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'damageBegin',
							},
							filter(event, player) {
								if (player.isHealthy()) return false;
								return game.hasPlayer(function (current) {
									var ejs = current.getCards('ej');
									for (var i = 0; i < ejs.length; i++) {
										if (
											game.hasPlayer(function (current2) {
												return current != current2 && !current2.isMin() && ((get.position(ejs[i]) == 'e' && current2.isEmpty(get.subtype(ejs[i]))) || (get.position(ejs[i]) == 'j' && !current2.hasJudge(ejs[i])));
											})
										) {
											return true;
										}
									}
								});
							},
							content() {
								'step 0';
								event.count = player.getDamagedHp();
								event.cards = [];
								('step 1');
								event.count--;
								if (
									!game.hasPlayer(function (current) {
										var ejs = current.getCards('ej', function (card) {
											return !event.cards.includes(card);
										});
										for (var i = 0; i < ejs.length; i++) {
											if (
												game.hasPlayer(function (current2) {
													return current != current2 && !current2.isMin() && ((get.position(ejs[i]) == 'e' && current2.isEmpty(get.subtype(ejs[i]))) || (get.position(ejs[i]) == 'j' && !current2.hasJudge(ejs[i])));
												})
											) {
												return true;
											}
										}
									})
								) {
									event.finish();
									return;
								}
								var next = player.chooseTarget(2, function (card, player, target) {
									if (ui.selected.targets.length) {
										var from = ui.selected.targets[0];
										if (target.isMin()) return false;
										var ejs = from.getCards('ej', function (card) {
											return !event.cards.includes(card);
										});
										for (var i = 0; i < ejs.length; i++) {
											if ((get.position(ejs[i]) == 'e' && target.isEmpty(get.subtype(ejs[i]))) || (get.position(ejs[i]) == 'j' && !target.hasJudge(ejs[i]))) return true;
										}
										return false;
									} else {
										return (
											target.countCards('ej', function (card) {
												return !event.cards.includes(card);
											}) > 0
										);
									}
								});
								next.set('ai', function (target) {
									var att = get.attitude(player, target);
									var sgnatt = get.sgn(att);
									if (ui.selected.targets.length == 0) {
										if (att > 0) {
											if (
												target.countCards('e', function (card) {
													return (
														get.value(card, target) < 0 &&
														!event.cards.includes(card) &&
														game.hasPlayer(function (current) {
															return current != target && ((get.position(card) == 'e' && current.isEmpty(get.subtype(card))) || (get.position(card) == 'j' && !current.hasJudge(card))) && get.effect(current, card, player, player) < 0;
														})
													);
												}) > 0
											)
												return 9;
										} else if (att < 0) {
											if (
												game.hasPlayer(function (current) {
													if (current != target && get.attitude(player, current) > 0) {
														var ejs = target.getCards('ej', function (card) {
															return !event.cards.includes(card);
														});
														for (var i = 0; i < ejs.length; i++) {
															if (get.value(ejs[i], target) > 0 && ((get.position(ejs[i]) == 'e' && current.isEmpty(get.subtype(ejs[i]))) || (get.position(ejs[i]) == 'j' && !current.hasJudge(ejs[i]))) && get.effect(current, ejs[i], player, current) > 0) return true;
														}
													}
												})
											) {
												return -att;
											}
										}
										return 0;
									}
									var ejs = ui.selected.targets[0].getCards('ej', function (card) {
										return !event.cards.includes(card);
									});
									var i;
									var att2 = get.sgn(get.attitude(player, ui.selected.targets[0]));
									for (var i = 0; i < ejs.length; i++) {
										if (sgnatt != 0 && att2 != 0 && sgnatt != att2 && get.sgn(get.value(ejs[i], ui.selected.targets[0])) == -att2 && get.sgn(get.effect(target, ejs[i], player, target)) == sgnatt && target.isEmpty(get.subtype(ejs[i]))) {
											return Math.abs(att);
										}
									}
									if (i == ejs.length) {
										return 0;
									}
									return -att * get.attitude(player, ui.selected.targets[0]);
								});
								next.set('multitarget', true);
								next.set('targetprompt', ['移动', '移动目标']);
								next.set('prompt', '移动场上的一张牌');
								('step 2');
								if (result.bool) {
									player.line2(result.targets, 'green');
									event.tar0 = result.targets[0];
									event.tar1 = result.targets[1];
								} else {
									event.finish();
								}
								('step 3');
								('step 4');
								player
									.choosePlayerCard(
										'ej',
										true,
										function (button) {
											if (get.attitude(player, event.tar0) > 0 && get.attitude(player, event.tar1) < 0) {
												if (get.value(button.link, event.tar0) < 0 && get.effect(event.tar1, button.link, player, event.tar1) > 0) return 10;
												return 0;
											} else {
												return get.value(button.link) * get.effect(event.tar1, button.link, player, player);
											}
										},
										event.tar0
									)
									.set('filterButton', function (button) {
										if (event.cards.includes(button.link)) return false;
										return (get.position(button.link) == 'e' && event.tar1.isEmpty(get.subtype(button.link))) || (get.position(button.link) == 'j' && !event.tar1.hasJudge(button.link));
									});
								('step 5');
								if (result.bool && result.links.length) {
									var link = result.links[0];
									event.cards.add(link);
									if (get.position(link) == 'e') {
										event.tar1.equip(link);
									} else {
										event.tar1.addJudge(link);
									}
									event.tar0.$give(link, event.tar1);
								} else event.finish();
								('step 6');
								if (event.count > 0) event.goto(1);
							},
							ai: {
								maixie: true,
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage')) {
											if (!target.hasFriend()) return;
											if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
											if (target.canMoveCard(true)) return [1, 1.5];
										}
									},
								},
							},
						},
						lg_juwuxing_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_tiaozhi: {
							enable: 'phaseUse',
							usable: 2,
							filterCard(card) {
								var type = get.type(card, 'trick');
								for (var i = 0; i < ui.selected.cards.length; i++) {
									if (type == get.type(ui.selected.cards[i], 'trick')) return false;
								}
								return true;
							},
							complexCard: true,
							position: 'he',
							check(card) {
								return 8 - get.value(card);
							},
							selectCard: [1, Infinity],
							content() {
								var cards2 = [];
								for (var i = 0; i < cards.length; i++) {
									var type = get.type(cards[i], 'trick');
									var list = game.findCards(function (name) {
										if (cards[i].name == name) return;
										if (get.type({ name: name }, 'trick') == type) {
											return get.value({ name: name }) > get.value(cards[i]);
										}
									});
									if (!list.length) {
										list = game.findCards(function (name) {
											if (cards[i].name == name) return;
											if (get.type({ name: name }, 'trick') == type) {
												return get.value({ name: name }) == get.value(cards[i]);
											}
										});
									}
									if (!list.length) {
										list = [cards[i].name];
									}
									cards2.push(game.createCard(list.randomGet()));
								}
								player.gain(cards2, 'log');
								player.$draw(cards2);
								player.$skill('调制');
							},
							ai: {
								order: 8,
								result: {
									player: 1,
								},
							},
						},
						lg_qiangji: {
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.card.suit == 'spade' && event.notLink();
							},
							forced: true,
							content() {
								trigger.num++;
							},
						},
						lg_xunjie: {
							mod: {
								targetEnabled(card, player, target) {
									if (get.type(card) == 'delay' && player != target) {
										return false;
									}
								},
							},
						},
						lg_mihuo: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'damageBegin',
							},
							forced: true,
							content() {
								player.phaseDiscard();
							},
						},
						lg_tiaozhi00: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_tiaozhiBegin',
							},
							forced: true,
							content() {
								var n = [1, 2, 3].randomGet();
								var list = ['qiangjiyaoshui', 'xunjieyaoshui', 'mihuoyaoshui'];
								if (n == 1) player.randomDiscard(1, 'j');
								if (n == 2) player.randomDiscard(1, 'j');
								if (n == 3) player.gain(game.createCard('lg_' + list.randomGet()), 'draw');
							},
						},
						lg_yinyoukanpo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'drawBegin',
							},
							filter(event, player) {
								return event.bottom;
							},
							logTarget: 'player',
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							content() {
								trigger.player.chooseToDiscard(1, true, 'h', { type: 'basic' });
								player.showHandcards();
								trigger.player.showHandcards();
								player.swapHandcards(trigger.player);
								player.addSkill('lg_fengyuansu');
							},
						},
						lg_luxinquan: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							content() {
								'step 0';
								event.card = get.cards()[0];
								game.cardsGotoOrdering(event.card);
								player.showCards(event.card);
								player.chooseToDiscard(1, true, 'h', { type: 'basic' });
								player.chooseToDiscard(1, true, 'h', { type: 'basic' });
								('step 1');
								player
									.chooseTarget('令一名角色获得' + get.translation(card), true)
									.set('ai', function (target) {
										var att = get.attitude(_status.event.player, target);
										if (_status.event.du) {
											if (target.hasSkillTag('nodu')) return 0;
											return -att;
										}
										if (att > 0) {
											if (target == player) att *= 0.6;
											return att + Math.sqrt(Math.max(0, 5 - target.countCards('h')));
										}
										return att;
									})
									.set('du', card.name == 'du');
								('step 2');
								if (result && result.bool) {
									var target = result.targets[0];
									target.gain(card, 'gain2');
									if (get.type(card, false) == 'basic') target.draw('bottom');
									if (get.type(card, false) == 'basic') player.draw('bottom');
									if (get.type(card, false) == 'basic') player.addTempSkill('lg_luxinquan1', { player: 'phaseEnd' });
								}
							},
							ai: {
								order: 0.1,
								result: {
									player: 1,
								},
							},
						},
						lg_luxinquan1: {
							trigger: {
								player: 'loseEnd',
							},
							filter(event, player) {
								if (player.countCards('h')) return false;
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (i.original == 'h') return true;
									}
								return false;
							},
							forced: true,
							usable: 2,
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_luxinquan1'), function (card, player, target) {
									return lib.filter.targetEnabled({ name: 'sha' }, player, target);
								}).ai = function (target) {
									return get.effect(target, { name: 'sha' }, player);
								};
								('step 1');
								if (result.bool) {
									player.useCard({ name: 'sha' }, result.targets, false);
								}
							},
							ai: {
								noh: true,
								skillTagFilter(player, tag) {
									if (tag == 'noh') {
										if (player.countCards('h') != 1) return false;
									}
								},
								expose: 0.2,
							},
							group: ['fbeifa_draw'],
							subSkill: {
								draw: {
									trigger: {
										source: 'damageAfter',
									},
									forced: true,
									popup: false,
									filter(event, player) {
										return event.parent.parent.parent.name == 'lg_luxinquan1';
									},
									content() {
										var num = player.next.next.next.countCards('h', { suit: 'heart' });
										player.drawTo(2 * num);
									},
								},
							},
						},
						lg_jufengcu: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'judgeEnd',
							},
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_jufengcu'), function (card, player, target) {
									return player != target;
								}).ai = function (target) {
									return -get.attitude(player, target);
								};
								('step 1');
								if (result.bool) {
									player.line(result.targets);
									event.target = result.targets[0];
									player.chooseToCompare(event.target);
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) event.target.damage(2)._triggered = null;
							},
						},
						lg_fengyuansu: {
							trigger: {
								target: 'useCardToTargeted',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_feng.jpg',
							intro: {
								content: '「风」<br/>元素效果:<br/>一名其他角色使用【杀】指定你为目标时,你可以与其进行拼点.若你赢,你弃置其的两张牌;若你没赢,此【杀】不能被【闪】响应.',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && player.canCompare(event.player);
							},
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								if (result.bool) {
									player.discardPlayerCard(trigger.player, 2, true);
								} else {
									// trigger.directHit = true;
									trigger.parent.directHit.add(player);
									// player.draw();
								}
							},
						},
						lg_shoulie: {
							audio: 'ext:幻颜风华/At dawn:2',
							usable: 1,
							trigger: {
								player: 'loseHpBegin',
							},
							markimage: 'extension/幻颜风华/Call/lg_call_langying.jpg',
							mark: true,
							intro: {
								content: '你的狼影数为#',
							},
							init(player) {
								player.storage.lg_shoulie = 3;
								player.markSkill('lg_shoulie');
							},
							filter(event, player) {
								return player.storage.lg_shoulie > 0;
							},
							forced: true,
							content() {
								player.storage.lg_shoulie -= 1;
								player.markSkill('lg_shoulie');
							},
						},
						lg_shoulie1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseBegin',
							},
							forced: true,
							content() {
								if (player.storage.lg_shoulie == 0) player.addSkill('lg_kuizeng');
								if (player.storage.lg_shoulie == 0) player.addSkill('lg_zunyan');
								if (player.storage.lg_shoulie == 0) player.addSkill('lg_huhuan');
								if (player.storage.lg_shoulie == 0) player.removeSkill('lg_shoulie1');
								if (player.storage.lg_shoulie == 3) player.addTempSkill('lg_shoulie000', { player: 'damageEnd' });
								if (player.storage.lg_shoulie == 2) player.addTempSkill('lg_shoulie00', { player: 'phaseEndStart' });
								if (player.storage.lg_shoulie == 1) player.addTempSkill('lg_shoulie0', { player: 'phaseEndStart' });
							},
						},
						lg_shoulie000: {
							mod: {
								maxHandcard(player, num) {
									if (player.hp < player.maxHp) return num + player.maxHp - player.hp;
								},
								targetEnabled(card, player, target, now) {
									if (target.countCards('h') < target.maxHp) {
										if (card.name == 'sha' || card.name == 'nanman') return false;
									} else if (target.countCards('h') > target.maxHp) {
										if (card.name == 'lebu') return false;
									}
								},
							},
						},
						lg_shoulie00: {
							trigger: {
								source: 'damageEnd',
							},
							forced: true,
							filter(event, player) {
								return event.card && event.card.name == 'sha' && _status.currentPhase == player;
							},
							content() {
								player.getStat().card.sha--;
							},
						},
						lg_shoulie0: {
							forced: true,
							trigger: {
								player: 'damageEnd',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.source && event.source.isIn() && player != event.source && event.cards.filterInD().length && player.getEquip(1);
							},
							check(event, player) {
								var card = {
									name: 'sha',
									cards: event.cards.filterInD(),
								},
									target = event.source;
								return !player.canUse(card, target, false) || get.effect(target, card, player, player) > 0;
							},
							content() {
								'step 0';
								event.cards = trigger.cards.filterInD();
								player.gain(event.cards, 'gain2');
								('step 1');
								var target = trigger.source,
									hs = player.getCards('h');
								if (
									target &&
									target.isIn() &&
									hs.length >= cards.length &&
									cards.filter(function (i) {
										return hs.includes(i);
									}).length == cards.length &&
									player.canUse({ name: 'sha', cards: cards }, target, false)
								) {
									var next = player.useCard({ name: 'sha' }, cards, target, false);
									if (!target.getEquip(1)) next.baseDamage = 3;
								}
							},
						},
						lg_lingxiuhuhuan: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filterTarget: true,
							line: 'thunder',
							content() {
								'step 0';
								target.drawTo(Math.min(target.hp));
								target
									.chooseToUse(function (card, player, event) {
										if (card.name != 'sha') return false;
										return lib.filter.filterCard.apply(this, arguments);
									}, '使用一张【杀】？')
									.set('targetRequired', true)
									.set('complexSelect', true)
									.set('filterTarget', function (card, player, target) {
										return lib.filter.filterTarget.apply(this, arguments);
									})
									.set('sourcex', player);
								('step 1');
								if (
									result.bool &&
									game.hasPlayer(function (current) {
										return current.getHistory('damage', function (evt) {
											return evt.parent.type == 'card' && evt.getParent(4) == event;
										}).length;
									})
								) {
								} else {
									event.finish();
									return;
								}
								('step 2');
								player.chooseTarget('发动此技能？', 1).set('ai', function (targets) {
									return get.attitude(player, targets) + Math.min(1, targets.maxHp - targets.hp);
								});
								('step 3');
								if (result.bool) {
									result.targets[0].draw(Math.min(1, result.targets[0].maxHp - result.targets[0].hp));
									result.targets[0]
										.chooseToUse(function (card, player, event) {
											if (card.name != 'sha') return false;
											return lib.filter.filterCard.apply(this, arguments);
										}, '使用一张【杀】')
										.set('targetRequired', true)
										.set('complexSelect', true)
										.set('filterTarget', function (card, player, target) {
											return lib.filter.filterTarget.apply(this, arguments);
										})
										.set('sourcex', player);
								}
							},
							ai: {
								order: 7,
								result: {
									target(player, target) {
										return Math.min(1, target.maxHp - target.hp);
									},
								},
							},
						},
						lg_lingxiukuizeng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToTarget',
							},
							forced: true,
							filter(event, player) {
								if (event.card.suit != 'spade') return false;
								if (event.player == player) return false;
								if (event.targets && event.targets.length > 1) return false;
								if (player.countCards('h') == 0) return false;
								return game.hasPlayer(function (current) {
									return current != event.player && current != player && lib.filter.targetEnabled(event.card, event.player, current);
								});
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									position: 'h',
									filterTarget(card, player, target) {
										var trigger = _status.event;
										if (target != player && target != trigger.source) {
											if (lib.filter.targetEnabled(trigger.card, trigger.source, target)) return true;
										}
										return false;
									},
									ai1(card) {
										return get.unuseful(card) + 9;
									},
									ai2(target) {
										var trigger = _status.event;
										var player = _status.event.player;
										if (get.effect(player, trigger.card, player, player) > 0) return 0;
										return get.effect(target, trigger.card, player, player);
									},
									prompt: get.prompt2('lg_lingxiukuizeng'),
									source: trigger.player,
									card: trigger.card,
								});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									target.gain(result.cards, player);
									var evt = trigger.parent;
									evt.triggeredTargets2.remove(player);
									evt.targets.remove(player);
									evt.targets.push(target);
								}
							},
						},
						lg_lingxiuzunyan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['phaseJudgeBegin'],
							},
							_priority: 2,
							prompt2(event, player) {
								return '令' + get.translation(event.player) + '对你使用一张【杀】?';
							},
							check(event, player) {
								if (player.hp < 2 && !player.countCards('h', 'shan')) return false;
								return get.attitude(player, event.player) < 0;
							},
							filter(event, player) {
								return event.player != player && event.player.inRange(player);
							},
							logTarget: 'player',
							content() {
								'step 0';
								event.pla = player;
								trigger.player
									.chooseToUse(
										function (card, player, event) {
											if (card.name != 'sha') return false;
											return lib.filter.filterCard.apply(this, arguments);
										},
										'对' + get.translation(player) + '使用一张【杀】？'
									)
									.set('ai2', function (target, card, player, player2, isLink) {
										return true;
									})
									.set('filterTarget', function (card, player, target) {
										if (target != event.pla) return false;
										return lib.filter.targetEnabled.apply(this, arguments);
									});
								('step 1');
								if (!result.bool) {
									if (player.countCards('e') >= player.hp + player.countCards('h', { suit: 'spade' })) player.turnOver();
									if (player.countCards('e') >= player.hp + player.countCards('h', { suit: 'spade' })) player.loseHp();
									trigger.player.addTempSkill('lg_lingxiuzunyan_temp');
									trigger.player.markSkillCharacter('lg_lingxiuzunyan_temp', player, '领袖的尊严', '你不能使用♠️️牌');
								}
							},
							subSkill: {
								temp: {
									onremove(player) {
										player.unmarkSkill('lg_lingxiuzunyan_temp');
									},
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'spade') return false;
										},
									},
								},
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_siye_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_zhongyan: {
							subSkill: {
								cardx: {
									temp: true,
									charlotte: true,
									intro: {
										content(storage, player) {
											return get.translation(storage.suit) + '手牌均视为' + get.translation(storage);
										},
									},
									mod: {
										cardname(card, player) {
											var item = player.storage.lg_zhongyan_cardx;
											if (card.suit == item.suit) return item.name;
										},
										cardnature(card, player) {
											var item = player.storage.lg_zhongyan_cardx;
											if (card.suit == item.suit && item.nature) return item.nature;
										},
									},
									ai: {
										respondShan: true,
										save: true,
										respondSha: true,
										skillTagFilter(player, tag) {
											var item = player.storage.lg_zhongyan_cardx;
											var name = item.name;
											var suit = item.suit;
											if (!player.countCards('h', { suit: suit })) return false;
											if (tag == 'respondSha') {
												if (name != 'sha') return false;
											} else if (tag == 'respondShan') {
												if (name != 'shan') return false;
											} else if (tag == 'save') {
												if (name != 'tao' && name != 'jiu') return false;
											}
										},
									},
								},
							},
							mark: true,
							marktext2: '',
							marktext: '',
							init(player) {
								player.storage.lg_zhongyan;
							},
							trigger: {
								player: 'useCardAfter',
							},
							forced: true,
							filter(event, player) {
								if (player.hasSkill('lg_zhongyan_cardx')) return false;
								if (player.storage.lg_zhongyan) return false;
								if (!['heart', 'diamond', 'club', 'spade'].includes(event.card.suit)) return false;
								if (get.type(event.card) != 'trick') return false;
								return true; //get.info(event.card).enable;
							},
							content() {
								player.storage.lg_zhongyan = true;
								//player.awakenSkil('lg_zhongyan');
								var item = game.createCard(trigger.card);
								player.storage.lg_zhongyan_cardx = item;
								player.addSkill('lg_zhongyan_cardx');
							},
						},
						lg_shoulie2: {
							audio: 'ext:幻颜风华/At dawn:2',
							usable: 1,
							trigger: {
								player: 'dyingBegin',
							},
							forced: true,
							content() {
								trigger.cancel();
							},
						},
						lg_yuanqi: {
							nobracket: true,
							forced: true,
							trigger: {
								player: 'drawBegin',
								source: 'damageBegin2',
							},
							filter(event, player) {
								if (event.name == 'draw') return player.isMinHp(true) && player.isDamaged();
								return player.isMinHandcard(true);
							},
							logTarget(event, player) {
								return event.name == 'damage' ? event.player : player;
							},
							line: 'metal',
							content() {
								'step 0';
								if (trigger.name == 'draw') {
									player.recover(2);
									trigger.num = 0;
									event.finish();
									return;
								}
								trigger.cancel();
								('step 1');
								if (trigger.player.countGainableCards(player, 'he')) {
									player.gainPlayerCard('hj', trigger.player, true);
								}
								('step 2');
								if (trigger.player.countGainableCards(player, 'he')) {
									player.gainPlayerCard('hj', trigger.player, true);
								}
							},
						},
						lg_tangguobinfen: {
							init(player) {
								player.storage.lg_tangguobinfen = [];
							},
							intro: {
								content: 'cards',
							},
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_tangguobinfen_de', 'lg_tangguobinfen_gei'],
							subSkill: {
								de: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										player: 'respondBegin',
									},
									forced: true,
									content() {
										'step 0';
										player
											.chooseTarget(get.prompt('lg_tangguobinfen'), function (card, player, target) {
												return target.countCards('hej') > 0;
											})
											.set('ai', function (target) {
												var player = _status.event.player;
												if (get.attitude(player, target) > 0 && target.countCards('j') > 0) return 10;
												if (get.attitude(player, target) < 0 && target.countCards('j') > 0 && target.countCards('he') < 1) return -10;
												return -get.attitude(player, target);
											});
										('step 1');
										if (result.bool) {
											event.targets = result.targets[0];
										} else {
											event.finish();
										}
										('step 2');
										if (event.targets) {
											player.choosePlayerCard(event.targets, true, 2, 'hej');
										} else {
											event.finish();
										}
										('step 3');
										if (result.bool) {
											player.storage.lg_tangguobinfen = player.storage.lg_tangguobinfen.concat(result.links);
											player.markSkill('lg_tangguobinfen');
											event.targets.lose(result.links, ui.special, 'toStorage');
											event.targets.$give(result.links, player);
										}
									},
								},
								gei: {
									trigger: {
										global: 'recoverBefore',
									},
									forced: true,
									popup: false,
									forced: true,
									filter(event, player) {
										return player.storage.lg_tangguobinfen && player.storage.lg_tangguobinfen.length && event.player.countCards('h') != event.player.maxHp;
									},
									content() {
										'step 0';
										player.chooseBool('对' + get.translation(trigger.player) + '发动此技能？').ai = function (event, player) {
											if (get.attitude(player, trigger.player) > 2) return true;
											return false;
										};
										('step 1');
										if (result.bool) {
											event.goto(2);
										} else {
											event.finish();
										}
										('step 2');
										trigger.player.chooseCardButton('获得其中一张牌', true, player.storage.lg_tangguobinfen);
										('step 3');
										if (result.bool) {
											trigger.player.gain(result.links[0], 'draw2', 'log', 'fromStorage');
											player.storage.lg_tangguobinfen.remove(result.links[0]);
											if (player.storage.lg_tangguobinfen.length == 0) {
												player.unmarkSkill('lg_tangguobinfen');
											} else {
												player.markSkill('lg_tangguobinfen');
											}
											if (trigger.player != player) {
												var num = player.hp + trigger.player.hp;
												player.drawTo(num);
												trigger.player.drawTo(num);
												if (player.hp > trigger.player.hp) {
													if (player.isDamaged()) {
														player.recover();
													} else {
														trigger.player.draw(2);
													}
												} else if (trigger.player.hp > player.hp) {
													if (trigger.player.isDamaged()) {
														trigger.player.recover();
													} else {
														player.draw(2);
													}
												} else event.finish();
											} else event.finish();
										}
									},
								},
							},
						},
						lg_tianmijiaxin: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'roundStart',
							},
							_priority: -99,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current != player && !current.hasSkill('lg_tianmijiaxin_mark');
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_tianmijiaxin'), '发动此技能？', 1, false, function (card, player, target) {
										return target != player && !target.hasSkill('lg_tianmijiaxin_mark');
									})
									.set('ai', function (target) {
										return get.attitude(player, target);
									});
								('step 1');
								if (result.bool) {
									player.storage.lg_tianmijiaxin = result.targets[0];
									result.targets[0].addTempSkill('lg_tianmijiaxin_mark', 'roundStart');
									result.targets[0].markSkillCharacter('lg_tianmijiaxin_mark', player, '甜蜜嘉心', '当你使用♥️️牌造成伤害后,' + get.translation(player) + '可以发动技能效果.');
								}
							},
							group: ['lg_tianmijiaxin_give'],
							subSkill: {
								give: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: 'damageEnd',
									},
									ai: {
										expose: 0.2,
									},
									filter(event, player) {
										if (!event.source || !event.source.hasSkill('lg_tianmijiaxin_mark')) return false;
										if (!player.storage.lg_tianmijiaxin) return false;
										if (event.source != player.storage.lg_tianmijiaxin) return false;
										return event.card && event.card.suit == 'heart' && event.notLink() && event.num > 0;
									},
									content() {
										'step 0';
										event.cards = get.cards(3);
										event.translation1 = get.translation(player.storage.lg_tianmijiaxin);
										('step 1');
										if (event.cards.length > 1) {
											player.chooseCardButton('发动此技能？' + event.translation1, true, event.cards, [1, event.cards.length]).set('ai', function (button) {
												if (ui.selected.buttons.length == 0) return 1;
												return 0;
											});
										} else if (event.cards.length == 1) {
											event._result = { links: event.cards.slice(0), bool: true };
										} else {
											event.finish();
										}
										('step 2');
										if (result.bool) {
											for (var i of result.links) {
												event.cards.remove(result.links[i]);
											}
											event.togive = result.links.slice(0);
											var translation1 = get.translation(player.storage.lg_tianmijiaxin);
											player
												.chooseTarget('将其中的任意张牌交给你或' + event.translation1, true, function (card, player, target) {
													return target == player || target == player.storage.lg_tianmijiaxin;
												})
												.set('ai', function (target) {
													var att = get.attitude(_status.event.player, target);
													if (_status.event.enemy) {
														return -att;
													} else if (att > 0) {
														return att / (1 + target.countCards('h'));
													} else {
														return att / 100;
													}
												})
												.set('enemy', get.value(event.togive[0]) < 0);
										}
										('step 3');
										if (result.targets.length) {
											result.targets[0].gain(event.togive, 'draw');
											player.line(result.targets[0], 'green');
											game.log(result.targets[0], '获得了' + get.cnNumber(event.togive.length) + '张牌');
											event.goto(1);
										}
									},
								},
								mark: {
									onremove(player, skill) {
										player.unmarkSkill('lg_tianmijiaxin_mark');
									},
									charlotte: true,
								},
							},
						},
						lg_tianmijiaxin1: {
							forced: true,
							trigger: {
								player: 'lg_tianmijiaxinAfter',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseCardTarget({
									filterTarget() {
										if (ui.selected.cards.length) return false;
										return true;
									},
									filterCard() {
										if (ui.selected.targets.length) return false;
										return lib.filter.cardDiscardable.apply(this, arguments);
									},
									selectTarget() {
										if (!ui.selected.cards.length) return [1, 1];
										return [0, 0];
									},
									selectCard() {
										if (ui.selected.targets.length) return [0, 0];
										if (!ui.selected.cards.length) return [0, 2];
										return [2, 2];
									},
									prompt: get.prompt2('lg_tianmijiaxin1'),
									complexCard: true,
									complexTarget: true,
									ai1(card) {
										var player = _status.event.player;
										if (player.hp > 3) return 0;
										return player.getDamagedHp() * 2 - get.value(card);
									},
									ai2(target) {
										if (player.hp < 4 || target.hasSkillTag('nogain')) return 0;
										return get.attitude(_status.event.player, target);
									},
								});
								('step 1');
								if (result.bool) {
									if (result.cards.length) {
										player.discard(result.cards);
										player.gain(game.createCard(get.inpile('basic').randomGet()), 'draw');
									} else {
										var target = result.targets[0];
										player.recover();
										target.draw();
									}
								}
							},
						},
						lg_jiaran_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_wuxielingmei: {
							audio: 'ext:幻颜风华/audio:4',
							trigger: {
								player: 'recoverEnd',
							},
							forced: true,
							filter(event, player) {
								return event.num > 0 && player.isAlive();
							},
							content() {
								'step 0';
								player.chooseTarget(get.prompt2('lg_wuxielingmei')).set('ai', function (target) {
									return 1 + Math.random();
								});
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
									var controls = ['判定阶段', '摸牌阶段', '出牌阶段', '弃牌阶段'];
									player
										.chooseControl(controls)
										.set('ai', function () {
											var player = _status.event.player;
											var att = get.attitude(player, event.target);
											if (att <= 0) {
												if (event.target.countCards('h') >= event.target.hp + 3) return '弃牌阶段';
												else return '弃牌阶段';
											}
											if (att > 0) {
												if (event.target.countCards('h') >= 4) return '出牌阶段';
												else return '摸牌阶段';
											}
											return '判定阶段';
										})
										.set('prompt', '令' + get.translation(event.target) + '执行某个指定的阶段');
								} else event.finish();
								('step 2');
								player.popup(result.control);
								switch (result.control) {
									case '判定阶段':
										event.target.addTempSkill('lg_wuxielingmei_judge', 'phaseZhunbeiBegin');
										break;
									case '摸牌阶段':
										event.target.addTempSkill('lg_wuxielingmei_draw', 'phaseZhunbeiBegin');
										break;
									case '出牌阶段':
										event.target.addTempSkill('lg_wuxielingmei_use', 'phaseZhunbeiBegin');
										break;
									case '弃牌阶段':
										event.target.addTempSkill('lg_wuxielingmei_discard', 'phaseZhunbeiBegin');
										break;
								}
							},
							subSkill: {
								judge: {
									trigger: {
										global: 'phaseAfter',
									},
									silent: true,
									forced: true,
									content() {
										player.phaseJudge();
									},
									popup: false,
								},
								draw: {
									trigger: {
										global: 'phaseAfter',
									},
									silent: true,
									forced: true,
									content() {
										player.phaseDraw();
									},
									popup: false,
								},
								use: {
									trigger: {
										global: 'phaseAfter',
									},
									silent: true,
									forced: true,
									content() {
										player.phaseUse();
									},
									popup: false,
								},
								discard: {
									trigger: {
										global: 'phaseAfter',
									},
									silent: true,
									forced: true,
									content() {
										player.phaseDiscard();
									},
									popup: false,
								},
							},
						},
						lg_weizhuang: {
							trigger: {
								source: 'damageBegin1',
							},
							init(player) {
								if (!player.storage.lg_weizhuang) player.storage.lg_weizhuang = [];
							},
							mark: true,
							intro: {
								content(storage) {
									if (!storage.length) return '';
									var str = get.translation(storage);
									return '对' + str + '造成过伤害';
								},
							},
							filter(event, player) {
								return event.card && event.notLink() && (event.card.name == 'sha' || event.card.name == 'juedou');
							},
							forced: true,
							content() {
								if (!player.storage.lg_weizhuang.includes(trigger.player)) {
									trigger.num--;
									player.storage.lg_weizhuang.push(trigger.player);
								} else if (player.storage.lg_weizhuang.includes(trigger.player)) {
									player.storage.lg_weizhuang.remove(trigger.player);
								}
							},
						},
						lg_tiansumao: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCard',
							},
							filter(event, player) {
								if (!get.tag(event.card, 'damage')) return false;
								if (!event.targets) return false;
								if (event.targets.length == 1 && event.targets[0] == player) return false;
								return true;
							},
							init(player) {
								game.countPlayer(function (current) {
									if (current != player) current.storage.lg_tiansumao = 0;
								});
							},
							forced: true,
							content() {
								'step 0';
								var targets = [];
								for (var i = 0; i < trigger.targets.length; i++) {
									if (trigger.targets[i] != player && trigger.targets[i].isAlive()) targets.push(trigger.targets[i]);
								}
								if (targets.length == 0) {
									event.finish();
									return;
								}
								var num = targets.length;
								player
									.chooseTarget('对' + get.translation(targets) + '发动此技能？', [1, num], function (card, player, target) {
										return targets.includes(target) && target.countCards('he') > 0;
									})
									.set('ai', function (target) {
										var recover = 0;
										if (target.isDamaged() && target.getEquip('baiyin')) recover++;
										if (get.attitude(player, target) > 0) {
											if (recover > 0) return 10;
											return -1;
										} else {
											if (target.countCards('he') == 1 && recover > 0) return -1;
											return 5;
										}
									});
								('step 1');
								if (!result.bool) {
									event.finish();
									return;
								}
								var targets = result.targets;
								player.popup('天遡鉾', 'water');
								player.line(targets, 'water');
								event.targets = targets;
								('step 2');
								if (event.targets.length) {
									event.current = event.targets.shift();
									if (player.storage.lg_tiansumao && player.storage.lg_tiansumao.includes(event.current)) {
										event.goto(5);
									}
								} else event.finish();
								('step 3');
								var target = event.current;
								event.current.chooseBool('令' + get.translation(player) + '获得你区域内的两张牌').ai = function () {
									if (get.attitude(target, player) > 0) return true;
									var nh = player.countCards('h', function (card) {
										return player.canUse(card, target) && get.tag(card, 'damage');
									});
									var num = target.countCards('he', function (card) {
										return get.value(card) > 6;
									});
									if (num / target.countCards('he') >= 1 / 2) return false;
									if (nh == 0) return false;
									return true;
								};
								('step 4');
								if (!result.bool) {
									event.current.popup('否', 'fire');
									event.current.storage.lg_tiansumao++;
									event.goto(2);
								} else {
									player.gainPlayerCard(event.current, 'hej', 2, true);
									event.goto(2);
								}
								('step 5');
								var target = event.current;
								player.chooseBool('获得' + get.translation(event.current) + '区域内的两张牌').ai = function () {
									var num = player.countCards('h', function (card) {
										return player.canUse(card, target) && get.tag(card, 'damage');
									});
									if (num > 0) return false;
									return true;
								};
								('step 6');
								if (!result.bool) {
									event.current.popup('否', 'fire');
									event.current.storage.lg_tiansumao++;
									event.goto(2);
								} else {
									player.gainPlayerCard(event.current, 'hej', 2, true);
									event.goto(2);
								}
							},
							group: ['lg_tiansumao_update', 'lg_tiansumao_damage'],
							subSkill: {
								damage: {
									popup: false,
									forced: true,
									trigger: {
										player: 'useCard',
									},
									content() {
										if (!trigger.targets) {
											event.finish();
											return;
										}
										var targets = trigger.targets;
										var target = [];
										for (var i = 0; i < targets.length; i++) {
											if (targets[i] != player && targets[i].storage.lg_tiansumao > 0) target.push(targets[i]);
										}
										if (get.tag(trigger.card, 'damage') && target.length) {
											player.popup('天遡鉾', 'water');
											player.line(target, 'water');
											for (var i = 0; i < target.length; i++) {
												target[i].damage(target[i].storage.lg_tiansumao, 'nocard');
											}
										}
									},
								},
								update: {
									popup: false,
									forced: true,
									trigger: {
										global: 'phaseBefore',
									},
									content() {
										game.countPlayer(function (current) {
											if (current != player) current.storage.lg_tiansumao = 0;
										});
									},
								},
							},
						},
						lg_tiansumao1: {
							trigger: {
								player: 'damageBegin3',
							},
							filter(event, player) {
								return event.source != undefined;
							},
							forced: true,
							content() {
								'step 0';
								trigger.source.chooseToDiscard('请选择').ai = function (card) {
									if (get.attitude(trigger.source, player) < 0) {
										if (trigger.source.needsToDiscard()) return 7 - get.value(card);
										return 6 - get.value(card);
									}
									return false;
								};
								('step 1');
								if (result.bool) {
									trigger.source.showHandcards();
								} else {
									trigger.source.addTempSkill('lg_jisi', { player: 'phaseEndStart' });
								}
							},
							ai: {
								effect: {
									target(card, player, target, current) {
										if (get.tag(card, 'damage')) {
											var bs = player.getCards('h');
											if (bs.length == 0) return 0;
											if ((player.hasSkill('jiu') || player.hasSkill('tianxianjiu')) && card.name == 'sha') return;
											if (player.countCards('h') <= 1) return 0;
											var n = 0.5;
											if (
												player.getCards('h', function (cardx) {
													var value = 0;
													var aii = get.info(cardx).ai;
													if (aii && aii.value) value = aii.value;
													else if (aii && aii.basic) value = aii.basic.value;
													return value < 6;
												}) ||
												player.needsToDiscard()
											)
												n = 0;
											return [1, n];
										}
									},
								},
							},
						},
						lg_yujinjian_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jisi: {
							trigger: {
								player: 'phaseDiscardEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_jisi.jpg',
							intro: {
								content: '「即死」<br/>状态效果:<br/>弃牌阶段结束时,若你在此阶段内弃置♣️️牌,你阵亡.',
							},
							forced: true,
							filter(event, player) {
								if (event.cards) {
									if (Array.isArray(event.cards))
										for (var i of event.cards) {
											//QQ
											if (i.suit == 'club') return true;
										}
								}
								return false;
							},
							content() {
								player.die();
							},
						},
						lg_chanazhige: {
							trigger: {
								global: 'phaseDiscardBegin',
							},
							audio: 'ext:幻颜风华/audio:2',
							filter(event, player) {
								if (player == event.player) return false;
								var num = event.player.getHistory('useCard', function (evt) {
									return evt.targets.includes(player);
								}).length;
								return num == 0 || (event.player.isAlive() && num <= player.countCards('he'));
							},
							content() {
								'step 0';
								var num = trigger.player.getHistory('useCard', function (evt) {
									return evt.targets.includes(player);
								}).length;
								event.num = num;
								if (num == 0) {
									if (player.hasSkill('lg_chanazhige')) event._result = { bool: true };
									else player.chooseBool('发动此技能？', lib.translate.lg_chanazhige_info);
								} else event.goto(2);
								('step 1');
								if (result.bool) {
									player.gain(
										get.cardPile(function (card) {
											return card.suit == 'heart';
										}),
										'gain2'
									);
								}
								event.finish();
								('step 2');
								player
									.chooseToDiscard(num, get.prompt('lg_chanazhige', trigger.player), '弃置' + get.translation(num) + '张手牌,其依次失去2点体力', 'h')
									.set('ai', function (card) {
										if (!_status.event.goon) return 0;
										var num = _status.event.parent.num;
										if (num == 1) return 8 - get.value(card);
										if (num == 2) return 6.5 - get.value(card);
										return 5 - get.value(card);
									})
									.set('goon', get.damageEffect(trigger.player, player, player) > 0);
								('step 3');
								if (result.bool) {
									player.addExpose(0.2);
									trigger.player.loseHp();
									trigger.player.loseHp();
								}
							},
						},
						lg_yongheng: {
							nobracket: true,
							usable: 1,
							trigger: {
								player: ['shaDamage', 'loseHpEnd', 'dyingBegin'],
							},
							filter(event, player) {
								if (player.previous.hp == player.next.hp && player.previous.countCards('h') == player.next.countCards('h')) return false;
								if (player.previous.hp == player.next.hp && player.previous.countCards('h') != player.next.countCards('h')) return true;
								if (player.previous.hp != player.next.hp && player.previous.countCards('h') == player.next.countCards('h')) return true;
								if (player.previous.hp != player.next.hp && player.previous.countCards('h') != player.next.countCards('h')) return true;
								return false;
							},
							forced: true,
							content() {
								'step 0';
								var num;
								if (player.previous.hp > player.next.hp) {
									num = player.previous.hp - player.next.hp;
								} else {
									num = player.next.hp - player.previous.hp;
								}
								player.draw(num);
								('step 1');
								var nh;
								if (player.previous.countCards('h') > player.next.countCards('h')) {
									nh = player.previous.countCards('h') - player.next.countCards('h');
								} else {
									nh = player.next.countCards('h') - player.previous.countCards('h');
								}
								player.recover(nh);
							},
							ai: {
								threaten: 2,
							},
						},
						lg_shenlingyongcan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'recoverBegin',
							},
							forced: true,
							filter(event, player) {
								if (player.countCards('h', 'sha') > 0) return true;
								if (player.storage.lg_shenlingyongcan && player.storage.lg_shenlingyongcan.length) {
									var num = game.countPlayer(function (current) {
										return (
											player.canUse(
												{
													name: 'sha',
												},
												current,
												false
											) &&
											lib.filter.targetEnabled2(
												{
													name: 'sha',
												},
												player,
												current
											)
										);
									});
									if (num >= 1) return true;
								}
								return false;
							},
							content() {
								'step 0';
								var list = ['重铸', '使用'];
								event.list = list;
								if (player.countCards('h', 'sha') == 0 && player.storage.lg_shenlingyongcan) {
									event.list.remove('重铸');
								}
								var num = game.countPlayer(function (current) {
									return (
										player.canUse(
											{
												name: 'sha',
											},
											current,
											false
										) &&
										lib.filter.targetEnabled2(
											{
												name: 'sha',
											},
											player,
											current
										)
									);
								});
								if (num < 1) event.list.remove('使用');
								player
									.chooseControl(event.list, 'cancel2')
									.set('ai', function (evt, player) {
										var controls = _status.event.controls;
										var num = game.countPlayer(function (current) {
											return (
												player.canUse(
													{
														name: 'sha',
													},
													current,
													false
												) &&
												lib.filter.targetEnabled2(
													{
														name: 'sha',
													},
													player,
													current
												) &&
												get.effect(
													current,
													{
														name: 'sha',
													},
													player,
													player
												) > 0
											);
										});
										var shaTemplate = {
											name: 'sha',
										};
										var num_sha = lib.card.sha.usable;
										var sha_limit = game.checkMod(shaTemplate, player, num_sha, 'cardUsable', player);
										if (player.countCards('h', 'sha') > sha_limit && controls.includes('重铸')) {
											return '重铸';
										}
										if (controls.includes('使用') && num >= 1) {
											return '使用';
										}
										if (controls.includes('重铸')) {
											return '重铸';
										}
										return controls.randomGet();
									})
									.set('prompt', '请选择一项');
								('step 1');
								player.popup(result.control);
								if (result.control == '使用') {
									game.log(player, '选择了使用');
									event.list.remove('重铸');
									player.chooseToUse(function (card, player) {
										return card.name == 'sha';
									});
									event.goto(3);
								} else if (result.control == 'cancel2') {
									event.finish();
									return;
								} else if (result.control == '重铸') {
									game.log(player, '选择了重铸');
									event.list.remove('使用');
									event.choice = result.control;
									player.chooseCard('h', true, function (card, player) {
										return card.name == 'sha';
									});
								}
								('step 2');
								if (result.bool) {
									player.lose(result.cards, ui.discardPile);
									player.draw('nodelay');
								}
								('step 3');
								player
									.chooseTarget('选择一名其他角色', true, function (card, player, target) {
										return player != target;
									})
									.set('ai', function (target) {
										return get.attitude(_status.event.player, target);
									});
								('step 4');
								if (result.bool) {
									event.target = result.targets[0];
									player.line(event.target, 'green');
									var count = game.countPlayer(function (current) {
										return (
											event.target.canUse(
												{
													name: 'sha',
												},
												current,
												false
											) &&
											lib.filter.targetEnabled2(
												{
													name: 'sha',
												},
												event.target,
												current
											)
										);
									});
									if (count < 1) event.list.remove('使用');
									if (event.target.countCards('h', 'sha') == 0) {
										event.list.remove('使用');
										event.list.remove('重铸');
									}
									//game.delay(1);
									event.target
										.chooseControl(event.list, 'cancel2')
										.set('ai', function (evt, player) {
											var controls = _status.event.controls;
											var num = game.countPlayer(function (current) {
												return (
													event.target.canUse(
														{
															name: 'sha',
														},
														current,
														false
													) &&
													lib.filter.targetEnabled2(
														{
															name: 'sha',
														},
														event.target,
														current
													) &&
													get.effect(
														current,
														{
															name: 'sha',
														},
														event.target,
														event.target
													) > 0
												);
											});
											var shaTemplate = {
												name: 'sha',
											};
											var num_sha = lib.card.sha.usable;
											var sha_limit = game.checkMod(shaTemplate, event.target, num_sha, 'cardUsable', event.target);
											if (event.target.countCards('h', 'sha') > sha_limit && controls.includes('重铸')) {
												return '重铸';
											}
											if (controls.includes('使用') && num >= 1) {
												return '使用';
											}
											if (controls.includes('重铸')) {
												return '重铸';
											}
											return controls.randomGet();
										})
										.set('prompt', '请选择一项');
								}
								('step 5');
								event.target.popup(result.control);
								if (result.control == '使用') {
									game.log(event.target, '选择了使用');
									event.target.chooseToUse(function (card, player) {
										return card.name == 'sha';
									});
									event.finish();
								} else if (result.control == 'cancel2') {
									game.log(event.target, '没有选择');
									if (event.choice == '重铸') {
										game.log(player, '视为使用');
										player.chooseUseTarget('sha', true);
									} else {
										game.log(player, '视为重铸');
										player.draw('nodelay');
									}
									event.finish();
								} else if (result.control == '重铸') {
									game.log(event.target, '选择了重铸');
									event.target.chooseCard('h', true, function (card, player) {
										return card.name == 'sha';
									});
								}
								('step 6');
								if (result.bool) {
									event.target.lose(result.cards, ui.discardPile);
									event.target.draw('nodelay');
								}
							},
						},
						lg_yinjiuzhike: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCardToBefore',
							},
							filter(event, player) {
								return event.target != player && event.card.suit == 'heart' && event.targets.length == 1;
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_yinjiuzhike'), function (card, player, target) {
										return target != trigger.target;
									})
									.set('ai', function (target) {
										if (trigger.card.name != 'wuzhong' && trigger.card.name != 'jiu' && trigger.card.name != 'tao') {
											return -get.attitude(player, target);
										} else {
											if (player.getEnemies().includes(trigger.player)) return get.attitude(player, target);
										}
										return 0;
									});
								('step 1');
								if (result.bool) {
									trigger.target = result.targets[0];
									game.log(player, '将', trigger.card, '的目标重新指定为' + get.translation(result.targets[0]));
									if (result.targets[0] == player) {
										player.loseHp();
									}
									trigger.untrigger();
									trigger.trigger('useCardToBegin');
								}
							},
						},
						lg_yinjiuzhike0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_yinjiuzhikeAfter',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_yinjiuzhike.jpg',
							mark: true,
							intro: {
								content: '吞噬进度:#%',
							},
							init(player) {
								player.storage.lg_yinjiuzhike0 = 0;
								player.markSkill('lg_yinjiuzhike0');
							},
							filter(event, player) {
								return player.storage.lg_yinjiuzhike0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_yinjiuzhike0 += 5;
								player.markSkill('lg_yinjiuzhike0');
							},
						},
						lg_buyesishennai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yinjiuzhike1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							filter(event, player) {
								return player.storage.lg_yinjiuzhike0 == 100;
							},
							forced: true,
							content() {
								player.removeSkill('lg_yinjiuzhike0');
								player.removeSkill('lg_yinjiuzhike1');
								player.removeSkill('lg_chanazhige');
								player.removeSkill('lg_shenlingyongcan');
								player.addSkill('lg_shenzuiyinjiu');
							},
						},
						lg_shenzuiyinjiu: {
							audio: 'ext:幻颜风华/audio:2',
							init(player) {
								player.storage.lg_shenzuiyinjiu = [];
							},
							mark: true,
							marktext2: '罪',
							markimage: 'extension/幻颜风华/Trace/lg_trace_yinjiuzhike.jpg',
							intro: {
								content(storage) {
									if (!storage.length) {
										return '没有记录的点数.';
									} else {
										var str = '记录的点数为' + get.cnNumber(storage[0]);
										for (var i = 1; i < storage.length; i++) {
											str += '、' + get.cnNumber(storage[i]);
										}
										str += '的牌';
										return str;
									}
								},
							},
							group: 'lg_shenzuiyinjiu_cancel',
							subSkill: {
								cancel: {
									trigger: {
										target: 'useCardToBefore',
									},
									audio: 'ext:幻颜风华/audio:2',
									forced: true,
									_priority: 15,
									check(event, player) {
										return get.effect(event.target, event.card, event.player, player) < 0;
									},
									filter(event, player) {
										if (event.player == player) return false;
										var number = event.card.number;
										if (typeof number != 'number') return false;
										if (!player.storage.lg_shenzuiyinjiu.includes(number)) return false;
										return get.type(event.card, 'trick') == 'trick';
									},
									content() {
										trigger.cancel();
										trigger.player.next.loseHp();
										trigger.player.previous.loseHp();
										var number = trigger.card.number;
										game.log(player, '因记录了点数' + get.cnNumber(number) + '取消成为', trigger.card, '的目标');
									},
								},
							},
							trigger: {
								player: 'useCard',
								target: 'useCardToBefore',
							},
							forced: true,
							filter(event, player) {
								var number = event.card.number;
								if (typeof number != 'number') return false;
								if (player.storage.lg_shenzuiyinjiu.includes(number)) return false;
								return get.type(event.card) == 'basic';
							},
							content() {
								var number = trigger.card.number;
								player.storage.lg_shenzuiyinjiu.add(number);
								game.log(player, '记录了点数' + get.cnNumber(number) + '');
								player.markSkill('lg_shenzuiyinjiu');
							},
							ai: {
								effect: {
									target(card, player, target) {
										var number = card.number;
										if (typeof number != 'number') return;
										if (get.type(card) == 'basic' && !target.storage.lg_shenzuiyinjiu.includes(number)) return [1, 0.2];
										if (target.storage.lg_shenzuiyinjiu.includes(number) && target != player && get.type(card, 'trick') == 'trick') return 'zeroplayertarget';
									},
									player(card, player, target) {
										var number = card.number;
										if (typeof number != 'number') return;
										if (get.type(card) == 'basic' && !player.storage.lg_shenzuiyinjiu.includes(number)) return [1, 0.2];
									},
								},
							},
						},
						lg_chuijinzhuanyu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'wuxieBegin',
							},
							forced: true,
							filter(event, player) {
								return (
									player.countCards('h') < player.maxHp &&
									game.hasPlayer(function (target) {
										return target.countCards('h') > 0 && player != target;
									})
								);
							},
							content() {
								'step 0';
								var num = player.maxHp;
								player.chooseTarget(
									get.prompt('lg_chuijinzhuanyu'),
									'获得至多' + get.translation(num) + '名其他角色的各一张手牌',
									[1, num],
									function (card, player, target) {
										return target.countCards('h') > 0 && player != target;
									},
									function (target) {
										var att = get.attitude(_status.event.player, target);
										if (target.hasSkill('lg_chuijinzhuanyu')) return att / 10;
										return 1 - att;
									}
								);
								('step 1');
								if (result.bool) {
									result.targets.sortBySeat();
									player.gainMultiple(result.targets);
								} else {
									event.finish();
								}
								('step 2');
								if (trigger.num <= 0) game.delay();
							},
							ai: {
								threaten: 1.6,
								expose: 0.2,
							},
							audioname2: {
								key_shiki: 'shiki_omusubi',
							},
						},
						lg_yanyuansu: {
							trigger: {
								player: 'damageBefore',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_yan.jpg',
							intro: {
								content: '「岩」<br/>元素效果:<br/>当你受到伤害时,你可以弃置一张装备牌,防止之.若你的体力值等于X,你摸一张牌,获得1点护甲(X为你装备区内的牌数).',
							},
							_priority: -10,
							filter(event, player) {
								return player.countCards('he', { type: 'equip' });
							},
							forced: true,
							content() {
								'step 0';
								var next = player.chooseToDiscard('he', '发动此技能？', function (card, player) {
									return get.type(card) == 'equip';
								});
								next.ai = function (card) {
									if (player.hp == 1 || trigger.num > 1) {
										return 9 - get.value(card);
									}
									if (player.hp == 2) {
										return 8 - get.value(card);
									}
									return 7 - get.value(card);
								};
								('step 1');
								if (result.bool) {
									trigger.cancel();
									if (player.countCards('e') == player.hp) player.changeHujia();
									if (player.countCards('e') == player.hp) player.draw();
								}
							},
						},
						lg_dixin: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseBegin',
							},
							filter(event, player) {
								return event.player != player && player.countCards('h') > 0;
							},
							forced: true,
							content() {
								'step 0';
								var next = player.chooseToDiscard('对' + get.translation(trigger.player) + '发动此技能？');
								next.ai = function (card) {
									if (get.attitude(player, trigger.player) < 0 && trigger.player.countCards('he')) return 5.5 - get.value(card);
									return 0;
								};
								('step 1');
								if (result.bool && trigger.player.countCards('he') > 0) {
									trigger.player
										.chooseToDiscard('he', true)
										.set('ai', function (card) {
											var att = get.attitude(_status.event.player, _status.event.target) / get.attitude(_status.event.player, _status.event.player);
											var eff = -get.value(card);
											if (get.type(card) == 'basic') {
												eff *= 1 - att;
											}
											return eff;
										})
										.set('target', player);
								} else {
									event.finish();
								}
								('step 2');
								if (get.type(result.cards[0]) == 'basic') {
									if (trigger.player.countDiscardableCards(trigger.player, 'he', (c) => get.type(c) != 'basic') && trigger.player.ai.shown < player.ai.shown) {
										var attSum = Math.sign(get.attitude(trigger.player, player)) + Math.sign(get.attitude(player, trigger.player));
										if (attSum > 0) {
											trigger.player.addExpose(0.1);
										}
										if (attSum < 0) {
											trigger.player.addExpose(-0.1);
										}
									}
									event.card = result.cards[0];
									player.chooseTarget('选择另一名角色获得' + get.translation(event.card), function (card, player, target) {
										return trigger.player != target;
									}).ai = function (target) {
										if (get.attitude(player, target) <= 0) return -5;
										return 6 - target.countCards('e');
									};
								} else {
									event.finish();
								}
								('step 3');
								if (result.bool) {
									result.targets[0].gain(event.card, 'gain2');
								}
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_tianxing: {
							intro: {
								content(storage) {
									if (!storage.length) return '本轮未使用过基本牌';
									else {
										var str = '本轮使用过的基本牌:' + get.translation(storage);
										return str;
									}
								},
							},
							init(player) {
								player.storage.lg_tianxing = [];
							},
							audio: 'ext:幻颜风华/audio:2',
							enable: 'chooseToUse',
							filter(event, player) {
								if (player.countDisabled() >= 5) return false;
								if (player.storage.lg_tianxing.length >= 4) return false;
								if (event.filterCard && event.filterCard({ name: 'sha' }, player, event) && !player.storage.lg_tianxing.includes('sha')) return true;
								if (event.filterCard && event.filterCard({ name: 'jiu' }, player, event) && !player.storage.lg_tianxing.includes('jiu')) return true;
								if (event.filterCard && event.filterCard({ name: 'tao' }, player, event) && !player.storage.lg_tianxing.includes('tao')) return true;
								if (event.filterCard && event.filterCard({ name: 'shan' }, player, event) && !player.storage.lg_tianxing.includes('shan')) return true;
								return false;
							},
							chooseButton: {
								dialog(event, player) {
									var list = [];
									if (event.filterCard && event.filterCard({ name: 'sha' }, player, event) && !player.storage.lg_tianxing.includes('sha')) {
										list.push(['基本', '', 'sha']);
									}
									if (event.filterCard && event.filterCard({ name: 'tao' }, player, event) && !player.storage.lg_tianxing.includes('tao')) {
										list.push(['基本', '', 'tao']);
									}
									if (event.filterCard && event.filterCard({ name: 'jiu' }, player, event) && !player.storage.lg_tianxing.includes('jiu')) {
										list.push(['基本', '', 'jiu']);
									}
									if (event.filterCard && event.filterCard({ name: 'shan' }, player, event) && !player.storage.lg_tianxing.includes('shan')) {
										list.push(['基本', '', 'shan']);
									}
									return ui.create.dialog('发动此技能？', [list, 'vcard'], 'hidden');
								},
								check(button) {
									var player = get.player();
									var card = { name: button.link[2] };
									if (card.name == 'shan') return 3;
									if (
										game.hasPlayer(function (current) {
											return player.canUse({ name: 'tao' }, current) && get.effect(current, { name: 'tao' }, player, player) > 0;
										}) &&
										card.name == 'tao'
									) {
										return 4;
									}
									return 0;
								},
								backup(links, player) {
									return {
										filterCard(card) {
											return false;
										},
										popname: true,
										selectCard: -1,
										check(card, player, target) {
											return true;
										},
										viewAs: {
											name: links[0][2],
										},
										precontent() {
											'step 0';
											var list = [];
											for (var i = 1; i < 6; i++) {
												if (player.isDisabled(i)) continue;
												list.push('equip' + i);
											}
											player
												.chooseControl(list)
												.set('ai', function (event) {
													return list.randomGet();
												})
												.set('prompt', '请选择废除一个装备栏');
											('step 1');
											player.disableEquip(result.control);
											player.storage.lg_tianxing.push(event.result.card.name);
											player.markSkill('lg_tianxing');
										},
									};
								},
								prompt(links, player) {
									return '视为使用一张' + get.translation(links[0][2]);
								},
							},
							ai: {
								order: 0.5,
								save: true,
								respondSha: true,
								respondShan: true,
								skillTagFilter(player, tag, arg) {
									if (tag == 'save' && player.storage.lg_tianxing.includes('tao') && player.storage.lg_tianxing.includes('jiu')) {
										return false;
									}
									if (tag == 'respondSha' && player.storage.lg_tianxing.includes('sha')) {
										return false;
									}
									if (tag == 'respondShan' && player.storage.lg_tianxing.includes('shan')) {
										return false;
									}
								},
								result: {
									player(player) {
										if (_status.event.type == 'dying') return get.attitude(player, _status.event.dying);
										else return 1;
									},
								},
							},
							group: ['lg_tianxing_clear'],
							subSkill: {
								clear: {
									trigger: {
										global: 'roundStart',
									},
									_priority: 17,
									forced: true,
									content() {
										player.storage.lg_tianxing = [];
										player.unmarkSkill('lg_tianxing');
									},
								},
							},
						},
						lg_tianxing1: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'shaDamage',
							},
							forced: true,
							content() {
								'step 0';
								event.targets = game
									.filterPlayer(function (current) {
										return player.getEnemies().includes(current);
									})
									.sortBySeat();
								('step 1');
								if (event.targets.length) {
									var target = event.targets.randomGet();
									player.line(target, 'nosource');
									var damage = [1];
									target.damage(damage.randomGet())._triggered = null;
								}
								('step 2');
								player.chooseControl('摸一张牌', '回复1点体力').ai = function () {
									if (player.maxHp - player.hp > 1) return '回复1点体力';
									return '摸一张牌';
								};
								('step 3');
								if (result.control == '回复1点体力') {
									var recover = [1];
									player.recover(recover.randomGet());
									player.chooseToEnable();
								} else {
									var draw = [1];
									player.draw(draw.randomGet());
								}
							},
						},
						lg_zhongli_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_qingying: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageAfter',
							},
							filter(event, player) {
								return player.maxHp - player.hp >= 1 && event.source;
							},
							check(event, player) {
								if (player.maxHp - player.hp <= 1) return get.attitude(player, event.source) > 0;
								return get.attitude(player, event.source) < 0;
							},
							content() {
								'step 0';
								var num = trigger.source.countCards('hej', { suit: 'club' });
								if (num > THCN) num = THCN;
								var THCN = trigger.source.countCards('h');
								var THC = trigger.source.getCards('h');
								var list = [];
								for (var i = 0; i < num; i++) {
									list.push(THC[i]);
								}
								player.viewCards(lib.translate[trigger.source.name] + '的手牌', list);
								('step 1');
								var num = player.maxHp - player.hp;
								event.cards = get.cards(num);
								player.viewCards('牌堆顶的' + num + '张牌', event.cards);
								player.chooseCardButton('选择其获得的牌', event.cards, true).set('ai', function (button) {
									return 1;
								});
								('step 2');
								if (result.bool) {
									player.addTempSkill('lg_bingyuansu', { player: 'equipEnd' });
									trigger.source.gain(result.links[0], 'gain2');
									event.cards.remove(result.links[0]);
									if (event.cards.length) player.gain(event.cards, 'gain2');
								} else {
									event.finish();
								}
							},
						},
						lg_zhujing: {
							trigger: {
								target: 'useCardToTargeted',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha';
							},
							logTarget: 'player',
							content() {
								'step 0';
								if (trigger.player.countCards('h', { suit: 'club' })) {
									var eff = get.effect(player, trigger.card, trigger.player, trigger.player);
									trigger.player
										.chooseToDiscard('弃置一张♣️️牌？', function (card) {
											return card.suit == 'club';
										})
										.set('ai', function (card) {
											if (_status.event.eff > 0) return 10 - get.value(card);
											return 0;
										})
										.set('eff', eff);
								} else event.goto(3);
								('step 1');
								if (result.bool) {
									var card = result.cards[0];
									if (card.name == 'sha' && player.countCards('h', { suit: 'club' })) {
										player
											.chooseToDiscard('重复此流程？', function (card) {
												return card.suit == 'club';
											})
											.set('ai', function (card) {
												return 10 - get.value(card);
											});
									} else event.finish();
								} else event.goto(3);
								('step 2');
								if (result.bool) event.goto(0);
								('step 3');
								game.log(player, '和', trigger.player, '交换了使用来源和目标角色');
								player.line(trigger.player, trigger.card.nature);
								trigger.untrigger();
								var evt = trigger.parent;
								evt.targets.remove(player);
								evt.player = player;
								evt.targets.push(trigger.player);
							},
							ai: {
								effect: {
									target(card, player, target, current) {
										if (card.name == 'sha' && get.attitude(player, target) < 0) {
											if (_status.event.name == 'lg_zhujing') return;
											var bs = player.getCards('h', { suit: 'club' });
											if (bs.length < 2) return 0;
											if (player.hasSkill('jiu') || player.hasSkill('tianxianjiu')) return;
											if (bs.length <= 3 && player.countCards('h', 'sha') <= 1) {
												for (var i = 0; i < bs.length; i++) {
													if (bs[i].name != 'sha' && get.value(bs[i]) < 7) {
														return [1, 0, 1, -0.5];
													}
												}
												return 0;
											}
											return [1, 0, 1, -0.5];
										}
									},
								},
							},
						},
						lg_binghua: {
							logTarget: 'player',
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								global: 'useCard2',
							},
							check(event, player) {
								var att = get.attitude(player, event.player);
								if (att > 0) {
									if (event.targets.filter((target) => get.effect(target, event.card, event.player, event.player) < 0).length) return true;
									if (
										game.hasPlayer(function (current) {
											return !event.targets.includes(current) && event.player.canUse(event.card, current) && get.effect(current, event.card, event.player, event.player) > 0;
										})
									) {
										return true;
									}
									return false;
								} else {
									var goon = lib.skill.lg_binghua.filterx(event, player);
									var count = event.targets.filter((target) => get.effect(target, event.card, event.player, event.player) > 0).length;
									if (!goon) {
										if (count == event.targets.length) return true;
										return false;
									} else {
										var bool = !game.hasPlayer(function (current) {
											return !event.targets.includes(current) && event.player.canUse(event.card, current) && get.effect(current, event.card, event.player, event.player) > 0;
										});
										if (count == event.targets.length && bool && !event.player.isDamaged()) return true;
										return false;
									}
								}
								return false;
							},
							filter(event, player) {
								if (!event.targets || !event.targets.length) return false;
								return event.targets.length >= 1;
							},
							filterx(event, player) {
								var info = get.info(event.card);
								if (info.allowMultiple == false) return false;
								//if(!info.enable) return false;
								if (!info.multitarget) {
									if (
										game.hasPlayer(function (current) {
											return !event.targets.includes(current) && event.player.canUse(event.card, current);
										})
									) {
										return true;
									}
								}
								return false;
							},
							content() {
								'step 0';
								var goon = lib.skill.lg_binghua.filterx(trigger, player);
								if (!goon) event.goto(3);
								('step 1');
								trigger.player
									.chooseTarget('令' + get.translation(trigger.card) + '额外指定一个目标?', function (card, player, target) {
										return !_status.event.sourcex.includes(target) && _status.event.player.canUse(_status.event.card, target);
									})
									.set('sourcex', trigger.targets)
									.set('ai', function (target) {
										var player = _status.event.player;
										return get.effect(target, _status.event.card, player, player);
									})
									.set('card', trigger.card);
								('step 2');
								if (result.bool) {
									if (!event.isMine() && !event.isOnline()) game.delayx();
									event.target = result.targets[0];
									trigger.targets.push(event.target);
									if (trigger.player.isDamaged()) {
										trigger.player.draw();
									}
									trigger.player.line(event.target);
									var evt = trigger;
									if (evt.cards.length) {
										game.log(event.target, '额外成为了', evt.card, '(', evt.cards, ')', '的目标');
									} else {
										game.log(event.target, '额外成为了', evt.card, '的目标');
									}
									event.finish();
								}
								('step 3');
								trigger.player
									.chooseTarget('一名成为' + get.translation(trigger.card) + '的目标无效,令' + get.translation(player) + '弃置一张牌', true, function (card, player, target) {
										return _status.event.sourcex.includes(target);
									})
									.set('sourcex', trigger.targets)
									.set('ai', function (target) {
										var player = _status.event.player;
										return -get.effect(target, _status.event.card, player, player);
									})
									.set('card', trigger.card);
								('step 4');
								if (result.bool) {
									if (!event.isMine() && !event.isOnline()) game.delayx();
									event.target = result.targets[0];
									trigger.targets.remove(event.target);
									player.chooseToDiscard(1, true, 'he');
									trigger.player.line(event.target);
									var evt = trigger;
									if (evt.cards.length) {
										game.log(event.target, '解除成为', evt.card, '(', evt.cards, ')', '的目标');
									} else {
										game.log(event.target, '解除成为', evt.card, '的目标');
									}
								}
							},
						},
						lg_shuangmie: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardBegin',
							},
							init(player) {
								player.storage.lg_shuangmie = [];
							},
							logTarget: 'targets',
							filter(event, player) {
								if (event.targets.length != 1 || event.targets.includes(player)) return false;
								if (!get.color(event.card) || event.card.suit != 'club') return false;
								if (event.card.name != 'sha' && get.type(event.card) != 'trick') return false;
								return get.itemtype(event.cards) == 'cards';
							},
							check(event, player) {
								var tar = event.targets[0];
								var att = get.attitude(player, tar);
								if (event.cards[0].name == 'sha') return att < 0;
								if (!tar.countCards('e') && tar.countCards('j')) return att > 0;
								if (!tar.countCards('j') && tar.countCards('e')) return att < 0;
								return false;
							},
							content() {
								'step 0';
								var num = 0;
								if (trigger.targets[0].countCards('h')) num++;
								if (trigger.targets[0].countCards('e')) num++;
								if (trigger.targets[0].countCards('j')) num++;
								if (num > 0) {
									player
										.discardPlayerCard(trigger.targets[0], num, 'hej')
										.set('filterButton', function (button) {
											for (var i = 0; i < ui.selected.buttons.length; i++) {
												if (get.position(button.link) == get.position(ui.selected.buttons[i].link)) return false;
											}
											return true;
										})
										.set('ai', function (button) {
											var tar = _status.event.getTrigger().targets[0];
											var att = get.attitude(player, tar);
											if (att > 0) {
												if (get.type(button.link) == 'delay' && button.link.name != 'lg_shuangmie') return 10;
												return -1;
											} else {
												if (get.type(button.link) == 'delay' && button.link.name != 'lg_shuangmie') return -1;
												return 1 + get.value(button.link);
											}
										});
								}
								('step 1');
								if (result.bool) {
									player.storage.lg_shuangmie.push(trigger.cards);
								}
							},
							ai: {
								expose: 0.1,
							},
							group: ['lg_shuangmie_gain'],
							subSkill: {
								gain: {
									trigger: {
										player: ['useCardAfter', 'useCardCancelled'],
									},
									forced: true,
									filter(event, player) {
										if (!player.storage.lg_shuangmie) return false;
										return player.storage.lg_shuangmie.indexOf(event.cards) >= 0;
									},
									content() {
										'step 0';
										var n = player.storage.lg_shuangmie.indexOf(trigger.cards);
										player.storage.lg_shuangmie.splice(n, 1);
										trigger.targets[0].addTempSkill('lg_dongshang', { player: 'recoverEnd' });
										trigger.targets[0].gain(trigger.cards, player, 'giveAuto');
									},
								},
							},
						},
						lg_shenlilinghua_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_dongshang: {
							trigger: {
								player: ['respond', 'useCard'],
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_dongshang.jpg',
							intro: {
								content: '「冻伤」<br/>状态效果:<br/>每当你使用/打出一张【闪】,随机弃置区域内的一张牌.若你没有手牌,你失去1点体力,受到1点无来源的冰属性伤害.',
							},
							filter(event, player) {
								return event.card && event.card.name == 'shan';
							},
							forced: true,
							content() {
								player.randomDiscard(1, 'hej');
								if (player.countCards('h') == 0) player.loseHp(1);
								if (player.countCards('h') == 0) player.damage(1, 'ice', 'nosource');
							},
							ai: {
								mingzhi: false,
								useShan: true,
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'respondShan')) {
											var shans = target.countCards('h', 'shan');
											var hs = target.countCards('h');
											if (shans > 1) return [0, 1];
											if (shans && hs > 2) return [0, 1];
											if (shans) return [0, 0];
											if (hs > 2) return [0, 0];
											if (hs > 1) return [1, 0.5];
											return [1.5, 0];
										}
									},
								},
								threaten: 0.8,
							},
						},
						lg_bingjiekuilei: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'damageBegin',
								source: 'damageBegin',
							},
							check(event, player) {
								return get.attitude(player, event.source) <= 0 || get.attitude(player, event.player) <= 0;
							},
							filter(event, player) {
								if (event.source && event.source == player && event.player.isAlive()) return event.player.countCards('h') > 0;
								if (event.source && event.player == player) return event.source && event.source.countCards('h') > 0;
								return false;
							},
							content() {
								'step 0';
								event.num = Math.min(trigger.num, 9);
								if (trigger.source == player) {
									event.goto(3);
								} else {
									event.goto(1);
								}
								('step 1');
								player.line(trigger.source, 'thunder');
								var card = trigger.source.getCards('h').randomGet();
								player.gain(card, trigger.source);
								if (get.position(card) == 'h') {
									trigger.source.$giveAuto(card, player);
								} else {
									trigger.source.$give(card, player);
								}
								if (card.suit == 'spade') trigger.source.turnOver();
								if (card.suit == 'club' && trigger.source.countCards('h') > 0) player.discardPlayerCard(1, 'h', trigger.source, true);
								if (card.suit == 'heart') player.drawTo(player.hp + player.countCards('e'));
								if (card.suit == 'diamond') player.changeHujia();
								('step 2');
								event.finish();
								('step 3');
								player.line(trigger.player, 'water');
								var card = trigger.player.getCards('h').randomGet();
								player.gain(card, trigger.player);
								if (get.position(card) == 'h') {
									trigger.player.$giveAuto(card, player);
								} else {
									trigger.player.$give(card, player);
								}
								if (card.suit == 'spade') trigger.player.turnOver();
								if (card.suit == 'club' && trigger.player.countCards('h') > 0) player.discardPlayerCard(1, 'h', trigger.player, true);
								if (card.suit == 'heart') player.drawTo(player.hp + player.countCards('e'));
								if (card.suit == 'diamond') player.changeHujia();
								('step 4');
								event.num--;
								if (event.num > 0) {
									event.goto(3);
								} else {
									event.finish();
								}
							},
							ai: {
								threaten: 2,
								expose: 0.3,
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (player.countCards('h') > 1 && get.tag(card, 'damage')) {
											if (player.hasSkillTag('jueqing', false, target)) return [1, -1.5];
											if (get.attitude(target, player) < 0) return [1, 1];
										}
									},
								},
							},
						},
						lg_bingjiekuilei0: {
							audio: 'ext:幻颜风华/At dawn:2',
							usable: 1,
							trigger: {
								player: ['damageBefore', 'turnOverBegin', 'linkBegin'],
							},
							markimage: 'extension/幻颜风华/Call/lg_call_bingjiekuilei.jpg',
							mark: true,
							intro: {
								content: '冰结傀儡<br/><br/>生命值:#%',
							},
							init(player) {
								player.storage.lg_bingjiekuilei0 = 100;
								player.markSkill('lg_bingjiekuilei0');
							},
							filter(event, player) {
								return player.storage.lg_bingjiekuilei0 > 0;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.storage.lg_bingjiekuilei0 -= 10;
								player.markSkill('lg_bingjiekuilei0');
							},
						},
						lg_dongkai: {
							usable: 1,
							trigger: {
								player: 'loseEnd',
							},
							audio: 'ext:幻颜风华/audio:3',
							forced: true,
							filter(event, player) {
								return event.cards && event.cards.length;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_dongkai'), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										var num1 = trigger.cards.length;
										var num2 = target.countCards('e');
										var num3 = target.countCards('h');
										var num4 = target.countCards('he');
										if (get.attitude(player, target) > 0 && num4 == 0) return num1;
										if (get.attitude(player, target) > 0 && num2 == 0) return 1;
										if (get.attitude(player, target) > 0 && num3 - num1 > 0) return 0.5;
										return -1;
									});
								('step 1');
								if (result.bool) {
									if (result.targets[0].countCards('he')) result.targets[0].chooseToDiscard(trigger.cards.length, 'he', true);
									result.targets[0].draw(trigger.cards.length);
								} else {
									player.getStat('triggerSkill').lg_dongkai--;
								}
							},
						},
						lg_dongkai1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_dongkaiAfter',
							},
							filter(event, player) {
								return player.countCards('h', { color: 'black' }) >= 3;
							},
							content() {
								'step 1';
								player.chooseToDiscard(3, 'h', true, { color: 'black' });
								('step 2');
								player.next.turnOver();
								player.previous.turnOver();
								player.previous.previous.turnOver();
								player.next.next.turnOver();
							},
						},
						lg_dongjie: {
							init(player, skill) {
								player.storage.lg_dongjie = [];
								player.storage.lg_dongjie_map = [];
							},
							marktext2: '冻',
							marktext: '冻',
							mark: true,
							intro: {
								content(storage) {
									if (!storage.length) {
										return '未发动过冻结机制';
									} else {
										var str = '你发动过' + get.translation(storage[0]);
										for (var i = 1; i < storage.length; i++) {
											str += '、' + get.translation(storage[i]);
										}
										str += '冻结';
										return str;
									}
								},
							},
							usable: 1,
							trigger: {
								source: 'damageSource',
							},
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							_priority: -1,
							filter(event, player) {
								if (!event.card || event.card.name != 'sha' || !event.player.isIn()) return false;
								if (player.storage.lg_dongjie_map.includes(event.player)) return false;
								if (player.storage.lg_dongjie.length >= 4) return false;
								var list = ['heart', 'diamond', 'club', 'spade'];
								for (var i = 0; i < list.length; i++) {
									var suit = list[i];
									if (!player.storage.lg_dongjie.includes(suit) && !event.player.hasSkill('lg_dongjie_' + suit)) return true;
								}
								return false;
							},
							content() {
								'step 0';
								var list = ['heart', 'diamond', 'club', 'spade'];
								var controls = [];
								for (var i = 0; i < list.length; i++) {
									var suit = list[i];
									if (!player.storage.lg_dongjie.includes(suit) && !trigger.player.hasSkill('lg_dongjie_' + suit)) controls.push(suit);
								}
								var str = '令【' + get.translation(trigger.player) + '】执行冻结机制';
								player.chooseControl(controls, ui.create.dialog(str, 'hidden')).ai = function () {
									return Math.floor(Math.random() * controls.length);
								};
								('step 1');
								if (result.control) {
									player.popup(result.control);
									player.line(trigger.player, 'green');
									game.log(player, '声明了', result.control);
									player.storage.lg_dongjie_map.push(trigger.player);
									player.storage.lg_dongjie.push(result.control);
									trigger.player.addSkill('lg_dongjie_' + result.control);
									player.markSkill('lg_dongjie');
								}
							},
							subSkill: {
								spade2: {
									marktext: '♠️️︎️',
									intro: {
										content: 'mark',
									},
								},
								heart2: {
									marktext: '♥️️︎️',
									intro: {
										content: 'mark',
									},
								},
								club2: {
									marktext: '♣️️︎️',
									intro: {
										content: 'mark',
									},
								},
								diamond2: {
									marktext: '♦️️︎',
									intro: {
										content: 'mark',
									},
								},
								heart: {
									mark: true,
									marktext2: '♥️️',
									marktext: '♥️️',
									intro: {
										content: '你不能使用或打出♥️️非装备️牌.',
									},
									mod: {
										cardEnabled(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'heart') return false;
										},
										cardUsable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'heart') return false;
										},
										cardRespondable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'heart') return false;
										},
										cardSavable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'heart') return false;
										},
										targetInRange(card) {
											if (get.type(card) != 'equip' && card.suit == 'heart') return false;
										},
									},
								},
								diamond: {
									mark: true,
									marktext2: '♦️️️',
									marktext: '♦️️️',
									intro: {
										content: '你不能使用或打出♦️️️非装备牌.',
									},
									mod: {
										cardEnabled(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'diamond') return false;
										},
										cardUsable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'diamond') return false;
										},
										cardRespondable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'diamond') return false;
										},
										cardSavable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'diamond') return false;
										},
										targetInRange(card) {
											if (get.type(card) != 'equip' && card.suit == 'diamond') return false;
										},
									},
								},
								club: {
									mark: true,
									marktext2: '♣️️',
									marktext: '♣️️',
									intro: {
										content: '你不能使用或打出♣️️非装备牌.',
									},
									mod: {
										cardEnabled(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'club') return false;
										},
										cardUsable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'club') return false;
										},
										cardRespondable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'club') return false;
										},
										cardSavable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'club') return false;
										},
										targetInRange(card) {
											if (get.type(card) != 'equip' && card.suit == 'club') return false;
										},
									},
								},
								spade: {
									mark: true,
									marktext2: '♠️️️',
									marktext: '♠️️️',
									intro: {
										content: '你不能使用或打出♠️️️非装备牌.',
									},
									mod: {
										cardEnabled(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'spade') return false;
										},
										cardUsable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'spade') return false;
										},
										cardRespondable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'spade') return false;
										},
										cardSavable(card, player) {
											if (get.type(card) != 'equip' && card.suit == 'spade') return false;
										},
										targetInRange(card) {
											if (get.type(card) != 'equip' && card.suit == 'spade') return false;
										},
									},
								},
							},
						},
						lg_sixinai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_youyazhiyi: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							prepare: 'give2',
							filterTarget(card, player, target) {
								if (player == target) return false;
								return true;
							},
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							filterCard: true,
							check(card) {
								if (card.name == 'du') return 20;
								return 7 - get.value(card);
							},
							discard: false,
							content() {
								'step 0';
								target.gain(cards, player).delay = false;
								('step 1');
								if (target.countCards('h')) {
									player.viewHandcards(target);
								}
							},
							ai: {
								result: {
									target(player, target) {
										if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') {
											return -1;
										}
										return 1;
									},
								},
								order: 2,
							},
						},
						lg_mengsebianzhi: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseBegin',
							},
							forced: true,
							filterTarget(card, player, target) {
								return target != player && target.countCards('h') > 0;
							},
							content() {
								'step 0';
								player.draw(2);
								player
									.chooseTarget(get.prompt('lg_mengsebianzhi'), function (card, player, target) {
										return target != player && target.countCards('h') > 0;
									})
									.set('ai', function () {
										return Math.random();
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									var card = target.getCards('h').randomGet();
									player.showCards(card);
									var card1 = player.getCards('h').randomGet();
									player.showCards(card1);
									if (card.suit == card1.suit) player.addTempSkill('lg_mengsebianzhi_use');
								}
							},
							subSkill: {
								use: {
									mod: {
										cardUsable(card) {
											if (get.info(card) && get.info(card).forceUsable) return;
											return Infinity;
										},
									},
									trigger: {
										source: 'damageBegin',
									},
									forced: true,
									content() {
										trigger.num++;
										if (player.countCards('e') == 0) player.init('lg_lize');
									},
								},
							},
							ai: {
								order: 11,
								result: {
									player: 1,
								},
							},
						},
						lg_lize_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_liuyun: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								if (!player.countCards('h')) return false;
								if (event.num <= 0) return false;
								return event.source && event.source.isAlive() && event.source.countCards('h');
							},
							content() {
								'step 0';
								player.chooseCard(get.prompt('lg_liuyun'), 1, 'h', '弃置一张手牌,令' + get.translation(trigger.source) + '弃置一张手牌？').ai = function (card) {
									var att = get.attitude(player, _status.event.getTrigger().source);
									if (att > 0) return -1;
									return 5.5 - get.value(card);
								};
								('step 1');
								if (result.bool) {
									event.suit1 = result.cards[0].suit;
									player.discard(result.cards[0]);
								} else event.finish();
								('step 2');
								trigger.source.chooseToDiscard('弃置一张手牌,若不为' + get.translation(event.suit1) + '你对' + get.translation(player) + '造成的伤害值-1.', true).set('ai', function (card) {
									var suit = card.suit;
									if (suit == event.suit1) {
										return 5 - get.value(card);
									} else return 4 - get.value(card);
								});
								('step 3');
								if (result.bool) {
									var suit2 = result.cards[0].suit;
									if (event.suit1 != suit2) {
										trigger.num--;
										game.log(player, '受到', trigger.source, '的伤害-1');
									}
								}
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage')) {
											if (player.countCards('h') == 1) return;
											if (!target.hasFriend()) return;
											return 0.5;
										}
									},
								},
							},
						},
						lg_chunzhenzhufu: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return player.maxHp > player.hp;
							},
							filterTarget(card, player, target) {
								return player != target && get.distance(player, target, 'attack') <= 1 && target.num('h') > 0;
							},
							filterCard: true,
							selectCard() {
								var player = _status.event.player;
								return [0, player.maxHp - player.hp];
							},
							check(card) {
								return 7 - get.value(card);
							},
							content() {
								var loseHpNum = player.maxHp - player.hp;
								if (target.num('h') >= loseHpNum) {
									var cards = target.getCards('h').randomGets(loseHpNum);
									target.$give(loseHpNum, player);
									player.gain(cards);
									player.addTempSkill('lg_chunzhenzhufu1', { player: 'phaseEnd' });
								} else {
									target.$give(target.getCards('h').length, player);
									player.gain(target.getCards('h'));
								}
							},
							ai: {
								order: 11,
								result: {
									target(player, target) {
										return get.damageEffect(target, player);
									},
								},
							},
						},
						lg_chunzhenzhufu1: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							selectTarget: [1, 3],
							filterTarget(card, player, target) {
								return target != player && target.countCards('h') > 0;
							},
							content() {
								'step 0';
								target.chooseToUse({ name: 'sha' });
								('step 1');
								if (result.bool == false) target.chooseToDiscard(true);
							},
							ai: {
								threaten: 2,
								order: 6,
								result: {
									target: 3,
								},
							},
						},
						lg_shenleqinai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_suchong: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseEnd',
							},
							forced: true,
							filter(event, player) {
								return (
									player != event.player &&
									player.hasHistory('lose', function (evt) {
										return evt.hs && evt.hs.length;
									})
								);
							},
							content() {
								'step 0';
								var num = 0;
								player.getHistory('lose', function (evt) {
									if (evt.hs) num += evt.hs.length;
								});
								num = Math.min(num, game.countPlayer());
								player.chooseTarget(get.prompt('lg_suchong'), [1, num], '令至多' + get.cnNumber(num) + '名角色各摸一张牌').set('ai', function (target) {
									return get.attitude(_status.event.player, target);
								});
								('step 1');
								if (result.bool) {
									var targets = result.targets.sortBySeat(trigger.player);
									if (targets.length == 1) {
										targets[0].draw();
										event.finish();
									} else game.asyncDraw(targets);
								} else event.finish();
								('step 2');
							},
						},
						lg_weili: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: ['chooseToRespondBegin', 'chooseToUseBegin'],
							},
							filter(event, player) {
								if (event.responded) return false;
								if (!event.filterCard || !event.filterCard({ name: 'shan' }, player, event)) return false;
								if (event.name == 'chooseToRespond' && !lib.filter.cardRespondable({ name: 'shan' }, player, event)) return false;
								if (!player.countCards('hs')) return false;
								return game.hasPlayer(function (current) {
									return current != player && current.isMaxHandcard(true);
								});
							},
							forced: true,
							checkx(event, player) {
								if (event && (event.ai || event.ai1)) {
									var ai = event.ai || event.ai1;
									var tmp = _status.event;
									_status.event = event;
									var result = ai({ name: 'shan' }, _status.event.player, event);
									_status.event = tmp;
									return result > 0;
								}
								return true;
							},
							content() {
								'step 0';
								event.targets = game.filterPlayer(function (current) {
									return current != player && current.isMaxHandcard(true);
								});
								if (!event.targets.length || event.targets.length != 1) {
									event.finish();
									return;
								}
								event.target = event.targets[0];
								var bool = lib.skill.lg_weili.checkx(trigger, player);
								player
									.chooseCard('hs', get.prompt2('lg_weili', event.target))
									.set('ai', function (card) {
										if (!_status.event.boolai) return -1;
										var player = _status.event.player;
										var target = _status.event.sourcex;
										var att = get.attitude(player, target);
										if (att > 0) {
											return 15 - get.value(card);
										}
										return 4 - get.value(card);
									})
									.set('boolai', bool)
									.set('sourcex', event.target);
								('step 1');
								if (result.bool) {
									target.gain(result.cards[0], player, 'giveAuto');
									trigger.untrigger();
									trigger.set('responded', true);
									trigger.result = { bool: true, card: { name: 'shan' } };
								}
							},
						},
						lg_fanzhongli: {
							ai: {
								directHit_ai: true,
								skillTagFilter(player, tag, arg) {
									if (!arg.card) return false;
									if (get.attitude(player, arg.target) > 0) return false;
									if (arg && arg.card.name != 'juedou') return false;
									var count = arg.target.countCards('h', 'sha');
									var count2 = game.countPlayer(function (current) {
										if (get.attitude(player, current) < 0) return false;
										return current.countCards('h', 'sha');
									});
									if (count2 >= count) return true;
									return false;
								},
								effect: {
									target(card, player, target) {
										if (card.name != 'juedou') return;
										if (
											target.hasSkillTag(
												'directHit_ai',
												true,
												{
													target: player,
													card: card,
												},
												true
											)
										)
											return 0.2;
									},
								},
							},
							audio: 'ext:幻颜风华/audio:2',
							group: 'lg_fanzhongli_draw',
							forced: true,
							trigger: {
								player: 'chooseToRespondBefore',
							},
							filter(event, player) {
								if (event.responded) return false;
								//if(!event.respondTo)return false;
								if (!event.filterCard || !event.filterCard({ name: 'sha' }, player, event)) return false;
								if (event.name == 'chooseToRespond' && lib.filter.cardRespondable({ name: 'sha' }, player, event)) return true;
								return false;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_fanzhongli'), function (card, player, target) {
										return target != player && target.countCards('he');
									})
									.set('ai', function (target) {
										var att = get.attitude(_status.event.player, target);
										var count = target.countCards('h', 'sha');
										if (att > 0 && count) return 10;
										return 0;
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									event.target = target;
									var att = get.attitude(event.target, player);
									target.chooseCard('he', { name: 'sha' }, '将一张【杀】交给' + get.translation(player) + '?').set('ai', function (card) {
										return att;
									});
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									event.target.give(result.cards, player, true);
									event.target.next.addMark('lg_fanzhongli_mark', 1);
								}
							},
							subSkill: {
								draw: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: 'drawBegin',
									},
									logTarget: 'player',
									forced: true,
									charlotte: true,
									filter(event, player) {
										return event.player.hasMark('lg_fanzhongli_mark') && !event.numFixed;
									},
									content() {
										var num = trigger.player.countMark('lg_fanzhongli_mark');
										trigger.num -= num;
										trigger.player.randomDiscard(num, 'hej');
									},
								},
								mark: {
									markimage: 'extension/幻颜风华/Trace/lg_trace_fanzhongli.jpg',
									intro: {
										name: '反重力',
										content: 'mark',
									},
								},
							},
						},
						lg_anjielina_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_poyuejianying: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'phaseDrawBegin',
							},
							init(player) {
								player.storage.lg_poyuejianying = [];
							},
							prompt(event, player) {
								var num = game.countPlayer(function (current) {
									return get.distance(player, current, 'attack') <= 1 && current.hp <= player.hp && current != player;
								});
								var name = '神里流·破月渐盈';
								var info = '<br><br>额外摸' + get.cnNumber(num) + '张牌？';
								return name + info;
							},
							filter(event, player) {
								return (
									game.countPlayer(function (current) {
										return get.distance(player, current, 'attack') <= 1 && current.hp <= player.hp && current != player;
									}) > 0
								);
							},
							content() {
								//game.rainSay(player,'发动了技能','<span style=\"color: #FFD700\">【神里流·破月渐盈】</span>');
								var num = game.countPlayer(function (current) {
									return get.distance(player, current, 'attack') <= 1 && current.hp <= player.hp && current != player;
								});
								trigger.num += num;
								game.countPlayer(function (current) {
									if (get.distance(player, current, 'attack') <= 1 && current.hp <= player.hp && current != player) {
										player.storage.lg_poyuejianying.push(current);
									}
								});
							},
							group: ['lg_poyuejianying_dis'],
							subSkill: {
								dis: {
									popup: false,
									forced: true,
									trigger: {
										player: ['phaseDiscardBegin'],
										source: ['damage'],
									},
									content() {
										'step 0';
										if (trigger.name == 'damage') {
											if (player.storage.lg_poyuejianying.includes(trigger.player)) {
												player.storage.lg_poyuejianying.remove(trigger.player);
											}
										} else {
											if (player.storage.lg_poyuejianying.length) {
												//game.rainSay(player,'技能','<span style=\"color: #FFD700\">【神里流·破月渐盈】</span>','被触发');
												player.chooseToDiscard('h', player.storage.lg_poyuejianying.length, true);
												player.storage.lg_poyuejianying = [];
											} else {
												player.storage.lg_poyuejianying = [];
											}
										}
									},
								},
							},
						},
						lg_jinghua: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'gainEnd',
							},
							check(event, player) {
								var val = 0;
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										val += get.value(i);
									}
								return get.attitude(player, event.player) < 0 && val >= 5;
							},
							prompt2(event, player) {
								return '令' + get.translation(event.player) + '弃置' + get.translation(event.cards) + ',弃置' + event.cards.length + '区域内的张牌？';
							},
							logTarget: 'player',
							filter(event, player) {
								if (player.hasSkill('lg_jinghua_temp')) return false;
								if (!event.source || event.source != player || event.source.isDead()) return false;
								if (event.player == player) return false;
								return event.cards && event.cards.length;
							},
							content() {
								'step 0';
								event.nm = trigger.cards.length;
								trigger.player.discard(trigger.cards);
								player.addTempSkill('lg_jinghua_temp', 'roundStart');
								('step 1');
								if (player.isMinHandcard(false)) {
									player.chooseBool('对' + get.translation(trigger.player) + '视为依次使用' + event.nm + '张【杀】？').set('ai', function () {
										var tri = _status.event.getTrigger();
										var eff = get.effect(tri.player, { name: 'sha' }, player, player);
										return eff > 1;
									});
								}
								('step 2');
								if (result.bool) {
								} else {
									trigger.player.chooseToDiscard('hej', event.nm, true);
									event.finish();
								}
								('step 3');
								if (event.nm > 0) {
									player.useCard({ name: 'sha' }, trigger.player);
								} else event.finish();
								('step 4');
								event.nm--;
								event.goto(3);
							},
							group: ['lg_jinghua_remove'],
							subSkill: {
								remove: {
									trigger: {
										player: 'shaMiss',
									},
									filter(event, player) {
										return event.num > 0 && player.hasSkill('lg_jinghua_temp');
									},
									_priority: 22,
									forced: true,
									content() {
										player.previous.phaseUse();
										player.phaseUse();
										player.removeSkill('lg_jinghua_temp');
									},
								},
								temp: {
									charlotte: true,
								},
							},
							ai: {
								expose: 0.3,
								effect: {
									target(card, player, target) {
										if (card.name == 'shunshou' && !target.hasSkill('lg_jinghua_temp')) return [0.5, 0, 1, -1];
									},
								},
							},
						},
						lg_jingying: {
							trigger: {
								player: 'useCardAfter',
							},
							forced: true,
							usable: 1,
							filter(event, player) {
								if (event.parent.name == 'lg_jingying') return false;
								if (event.card == event.cards[0]) {
									var type = get.type(event.card, 'trick');
									var names = [];
									if (
										get.cardPile(function (card) {
											if (get.type(card, 'trick') != type) return false;
											if (get.info(card).multitarget) return false;
											if (names.includes(card.name)) return false;
											if (player.hasUseTarget(card)) {
												return true;
											} else {
												names.add(card.name);
												return false;
											}
										})
									) {
										return true;
									}
								}
								return true;
							},
							content() {
								var type = get.type(trigger.card, 'trick');
								var names = [];
								var card = get.cardPile(function (card) {
									if (get.type(card, 'trick') != type) return false;
									if (get.info(card).multitarget) return false;
									if (names.includes(card.name)) return false;
									if (player.hasUseTarget(card)) {
										return true;
									} else {
										names.add(card.name);
										return false;
									}
								});
								if (card) {
									var info = get.info(card);
									var targets = game.filterPlayer(function (current) {
										return lib.filter.filterTarget(card, player, current);
									});
									if (targets.length) {
										targets.sort(lib.sort.seat);
										var select = get.select(info.selectTarget);
										if (select[0] == -1 || select[1] == -1) {
											player.useCard(card, targets, 'noai');
										} else if (targets.length >= select[0]) {
											var num = select[0] + Math.floor(Math.random() * (select[1] - select[0] + 1));
											player.useCard(card, targets.randomGets(num), 'noai');
										}
									}
								}
							},
						},
						lg_jingying1: {
							init(player) {
								player.storage.lg_jingying1_basic = 0;
								player.storage.lg_jingying1_trick = 0;
								player.storage.lg_jingying1_equip = 0;
								player.storage.lg_jingying1 = 0;
							},
							trigger: {
								player: 'phaseDiscardBefore',
							},
							filter(event, player) {
								return player.storage.lg_jingying1 == 0 && player.storage.lg_jingying1_basic <= 1 && player.storage.lg_jingying1_trick <= 1 && player.storage.lg_jingying1_equip <= 1;
							},
							content() {
								trigger.cancel();
							},
							group: ['lg_jingying1_start', 'lg_jingying1_use', 'lg_jingying1_new'],
							subSkill: {
								start: {
									trigger: {
										player: 'phaseBegin',
									},
									forced: true,
									popup: false,
									content() {
										player.storage.lg_jingying1_basic = 0;
										player.storage.lg_jingying1_trick = 0;
										player.storage.lg_jingying1_equip = 0;
										player.storage.lg_jingying1 = 0;
										if (trigger.skill && trigger.skill == 'lg_jingying1_new') player.storage.lg_jingying1 = 1;
									},
								},
								use: {
									trigger: {
										player: 'useCard',
									},
									filter(event, player) {
										return player.isPhaseUsing() && player.storage.lg_jingying1 == 0;
									},
									forced: true,
									popup: false,
									content() {
										var type = get.type(trigger.card, 'trick');
										if (type == 'basic') player.storage.lg_jingying1_basic += 1;
										if (type == 'trick') player.storage.lg_jingying1_trick += 1;
										if (type == 'equip') player.storage.lg_jingying1_equip += 1;
									},
								},
								new: {
									trigger: {
										player: 'phaseAfter',
									},
									filter(event, player) {
										return player.storage.lg_jingying1 == 0 && player.storage.lg_jingying1_basic >= 1 && player.storage.lg_jingying1_trick >= 1 && player.storage.lg_jingying1_equip >= 1;
									},
									forced: true,
									content() {
										player.storage.lg_jingying1 = 1;
										player.phase('nodelay');
									},
								},
							},
							ai: {
								expose: 0.2,
								threaten: 0.8,
								effect: {
									player(card, player, target, current) {
										if (!player.isPhaseUsing()) return;
										var type = get.type(card, 'trick');
										var bc = player.storage.lg_jingying1_basic;
										var tc = player.storage.lg_jingying1_trick;
										var ec = player.storage.lg_jingying1_equip;
										if (player.storage.lg_jingying1 == 0) {
											if (player.countCards('h') > player.getHandcardLimit() + 1) {
												var count = player.countCards('h') - player.getHandcardLimit() - 1;
												if (bc == 1 && tc <= 1 && ec <= 1 && type == 'basic') return [1, -count];
												if (bc <= 1 && tc == 1 && ec <= 1 && type == 'trick') return [1, -count];
												if (bc <= 1 && tc <= 1 && ec == 1 && type == 'equip') return [1, -count];
											} else if (bc == 0 && tc >= 1 && ec >= 1 && type == 'basic') return [1, 3];
											else if (bc >= 1 && tc == 0 && ec >= 1 && type == 'trick') return [1, 3];
											else if (bc >= 1 && tc >= 1 && ec == 0 && type == 'equip') return [1, 3];
											else if (player.countCards('h') <= player.getHandcardLimit()) return [1, -3];
										} else if (player.countCards('h') <= player.getHandcardLimit()) return [1, -3];
									},
								},
							},
						},
						lg_shuiyou: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							enable: 'phaseUse',
							filterTarget(card, player, target) {
								return player != target && target.countCards('he');
							},
							selectTarget: 1,
							content() {
								'step 0';
								target.chooseToDiscard([1, Infinity], '弃置任意张牌', 'he', true).set('ai', function (card) {
									var player = _status.event.player;
									if (player.getEquip('tengjia') || player.getEquip('bagua')) return 1 - get.value(card);
									if (ui.selected.cards.length >= player.countCards('he')) return -1;
									if (ui.selected.cards.length >= player.countCards('he') - 1) return 4 - get.value(card);
									if (ui.selected.cards.length >= player.countCards('he') - 2) return 5 - get.value(card);
									return 6 - get.value(card);
								});
								('step 1');
								if (result.bool) {
									event.num1 = result.cards.length;
									player.chooseToDiscard([1, Infinity], '弃置至少一张牌？', 'he').set('ai', function (card) {
										var player = _status.event.player;
										if (player.getEquip('tengjia') || player.getEquip('bagua')) return -1;
										if (player.countCards('h', 'shan') && _status.event.parent.num1 >= 2) return -1;
										if (ui.selected.cards.length > _status.event.parent.num1) return -1;
										if (ui.selected.cards.length == _status.event.parent.num1) return 5 - get.value(card);
										return 6 - get.value(card);
									});
								}
								('step 2');
								if (result.bool) {
									event.num2 = result.cards.length;
								} else event.num2 = 0;
								('step 3');
								if (event.num1 > event.num2) {
									player.useCard(
										{
											name: 'sha',
										},
										target,
										false
									);
								} else if (event.num1 < event.num2) {
									target.useCard(
										{
											name: 'sha',
										},
										player,
										false
									);
								}
							},
							ai: {
								order(name, player) {
									var cards = player.getCards('he');
									return cards.length;
								},
								result: {
									target(player, target) {
										var num = target.countCards('he');
										var num1 = player.countCards('he');
										var count = 0;
										if (player.getEquip('tengjia') || player.getEquip('bagua')) count -= 2;
										if (num1 > player.hp) count -= 1;
										if (num1 > 2) count -= 0.8;
										if (num1 <= 1 && !player.getEquip('tengjia')) count += 2 - num1;
										count += 0.7;
										if (num < player.countCards('he')) count -= 1;
										if (num == player.countCards('he')) {
											if (Math.random() > 0.5) count -= 0.8;
											else count -= 0.6;
										}
										return Math.min(0, count);
									},
								},
								threaten: 1.3,
							},
						},
						lg_shuiyou1: {
							enable: 'phaseUse',
							usable: 1,
							prompt: '发动此技能？',
							selectCard: [0, 1],
							position: 'he',
							filterCard: true,
							check() {
								return false;
							},
							content() {
								'step 0';
								if (cards.length == 0) player.draw();
								('step 1');
								player.chooseTarget(
									'交换手牌？',
									(card, player, target) => target != player && target.countCards('h') == player.countCards('h'),
									(target) => get.attitude(get.player(), target) + 11
								);
								('step 2');
								if (result && result.bool) player.swapHandcards(result.targets[0]);
							},
							ai: {
								order: 1,
								result: {
									player: 1,
								},
							},
						},
						lg_shuiyou0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_shuiyouAfter',
							},
							forced: true,
							content() {
								player.addTempSkill('lg_shuiyou1', { player: 'phaseEnd' });
							},
						},
						lg_shenlilingren_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jiyuanfan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin2',
							},
							forced: true,
							content() {
								'step 0';
								if (player.countDiscardableCards(player, 'he')) {
									var next = player.chooseToDiscard(`###${get.prompt(event.name)}###弃置一张牌`)
									if (player.countCards('h') - 1 === player.hp) {
										next.set('ai', function (card) {
											return _status.event.gain - get.value(card);
										}).set('gain', -get.damageEffect(player, trigger.source, player, trigger.nature) / 1.5);
									}
								}
								('step 1');
								if (result.bool) {
									event.goto(3);
								} else {
									player.chooseBool('###摸两张牌?###' + get.skillInfoTranslation(event.name)).set('frequentSkill', event.name);
								}
								('step 2');
								if (result.bool) {
									player.draw(2);
								} else {
									event.finish();
								}
								('step 3');
								if (player.countCards('h') === trigger.source.hp) {
									++trigger.num;
								}
							},
							ai: {
								maixie: true,
								maixie_defend: true,
							},
						},
						lg_duyiyinbaozhe: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['phaseUseEnd', 'phaseUseBegin'],
							},
							filter(event, player) {
								return event.player != player && event.player.isMinHp();
							},
							content() {
								'step 0';
								trigger.player.chooseCard('交给' + get.translation(player) + '一张手牌').ai = function (card) {
									if (get.attitude(trigger.player, player) > 0) {
										return get.value(card);
									} else {
										return -get.value(card);
									}
								};
								('step 1');
								if (result.bool) {
									player.gain(result.cards[0]);
									trigger.player.$give(1, player);
								} else {
									trigger.player.loseHp();
									trigger.player.addTempSkill('lg_jihen', { player: 'phaseBegin' });
								}
							},
						},
						lg_shuiqiaopaluxi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_duoluo: {
							usable: 1,
							trigger: {
								player: 'damageBegin4',
							},
							_priority: -3,
							forced: true,
							preHidden: true,
							filter(event, player) {
								return player.countCards('hes');
							},
							content() {
								'step 0';
								player.chooseToDiscard(get.prompt('lg_duoluo'), '弃置至少一张牌？', 'hes', [1, Infinity]).set('ai', function (card) {
									if (ui.selected.cards.length) return -1;
									var nm = _status.event.getTrigger.num * 1.5;
									return 3.5 + nm - get.value(card);
								});
								('step 1');
								if (result.bool) {
									trigger.player = player.previous;
									event.nm = result.cards.length + 1;
									game.log(player, '受到的', trigger.num, '点伤害改为由', trigger.player, '承担');
								} else event.finish();
								('step 2');
								trigger.player.chooseToDiscard('弃置牌？', 'hes', [event.nm, Infinity]).set('ai', function (card) {
									if (ui.selected.cards.length >= event.nm) return -1;
									var nm = _status.event.getTrigger.num * 1.5;
									return 3.5 + nm - get.value(card);
								});
								('step 3');
								if (result.bool) {
									trigger.player = trigger.player.previous;
									event.nm = result.cards.length + 1;
									event.goto(2);
								} else event.finish();
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage')) {
											if (target.countCards('hes') && get.attitude(player, target.next) > 0) return 0.5;
										}
									},
								},
							},
						},
						lg_shuiqiaopaluxi0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_shuiqiaopaluxi0 = 0;
								player.markSkill('lg_shuiqiaopaluxi0');
							},
							filter(event, player) {
								return player.storage.lg_shuiqiaopaluxi0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_shuiqiaopaluxi0 += 5;
								player.markSkill('lg_shuiqiaopaluxi0');
							},
						},
						lg_jihen: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: ['damageBegin', 'drawBegin'],
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_jihen.jpg',
							intro: {
								content: '「嫉恨」<br/>状态效果:<br/>当你受到伤害/摸牌时,若你的手牌数等于体力值,对应数值+1;若你的手牌数小于体力值,对应数值-1.',
							},
							forced: true,
							content() {
								if (player.countCards('h') == player.hp) trigger.num++;
								if (player.countCards('h') < player.hp) trigger.num--;
							},
						},
						lg_choushicanbai: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_choushicanbai.jpg',
							intro: {
								content: '灵力消耗:<br/>70点<br/><br/>符卡效果:<br/>出牌阶段开始时,你可以令一名其他角色进入<嫉恨>状态.若其的体力值大于你,其翻面;若其的体力值不大于你,其非锁定技失效,直到回合结束.',
							},
							filter(event, player) {
								return player.storage.lg_shuiqiaopaluxi0 > 69;
							},
							forced: true,
							content() {
								'step 0';
								player.storage.lg_shuiqiaopaluxi0 -= 70;
								player.markSkill('lg_shuiqiaopaluxi0');
								player.chooseTarget(get.prompt('lg_choushicanbai'), function (card, player, target) {
									return player != target;
								}).ai = function (target) {
									return -get.attitude(_status.event.player, target);
								};
								('step 1');
								if (result.bool) {
									result.targets[0].addSkill('lg_jihen');
									if (result.targets[0].hp > player.hp) {
										result.targets[0].turnOver(true);
									} else {
										result.targets[0].addTempSkill('fengyin');
									}
								}
							},
						},
						lg_tuzhan: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								global: 'judgeEnd',
							},
							filter(event, player) {
								if (!event.result) return false;
								if (!event.result.card) return false;
								if (event.nogain && event.nogain(event.result.card)) {
									return false;
								}
								return event.result.card.suit == 'heart' && event.player != player;
							},
							check(event, player) {
								return get.attitude(player, event.player) < 0;
							},
							content() {
								player.useCard({ name: 'sha' }, trigger.player, false);
							},
						},
						lg_luenzhijian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'shaMiss',
							},
							filter(event, player) {
								return player.hp <= player.countCards('hej', { suit: 'heart' });
							},
							content() {
								'step 0';
								player
									.chooseTarget('发动此技能', true, function (card, player, target) {
										return target.isMaxHp();
									})
									.set('ai', function (target) {
										var player = get.player();
										var n1 = get.damageEffect(target, player, target);
										var n2 = target.getUseValue({ name: 'sha' }, false);
										var n3 = target.getUseValue({ name: 'juedou' }, false);
										var att = get.attitude(player, target);
										return att * (Math.max(n2, n3) + n1);
									});
								('step 1');
								event.tg = result.targets[0];
								event.tg.damage(2);
								('step 2');
								if (event.tg.isAlive()) {
									var list = [];
									if (event.tg.hasUseTarget({ name: 'sha' }, false)) list.push(['基本', '', 'sha']);
									if (event.tg.hasUseTarget({ name: 'juedou' }, false)) list.push(['锦囊', '', 'juedou']);
									if (list.length) {
										event.tg.chooseButton(['选择使用的牌', [list, 'vcard']], true).set('ai', function (button) {
											var player = get.player();
											var card = { name: button.link[2] };
											return player.getUseValue(card);
										});
									} else event.finish();
								} else event.finish();
								('step 3');
								event.tg.chooseUseTarget({ name: result.links[0][2] }, true, false, 'nodistance');
							},
						},
						lg_kuqiulin_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_hundun1: {
							trigger: {
								player: ['useCard', 'respond'],
							},
							filter(event, player) {
								if (player.hasSkill('lg_hundun1_heart')) return false;
								if (player.hasSkill('lg_hundun1_diamond')) return false;
								if (player.hasSkill('lg_hundun1_club')) return false;
								if (player.hasSkill('lg_hundun1_spade')) return false;
								var suits = lib.suit.slice(0);
								var suit = event.card.suit;
								return suit && suits.includes(suit);
							},
							content() {
								player.addSkill('lg_hundun1_' + trigger.card.suit);
							},
							forced: true,
							subSkill: {
								heart: {
									mark: true,
									marktext2: '♥️️️',
									markimage: 'extension/幻颜风华/Call/lg_call_hundun.jpg',
									intro: {
										content: '♥️️牌不计入手牌上限.',
									},
									mod: {
										ignoredHandcard(card, player) {
											if (card.suit == 'heart') return true;
										},
										cardDiscardable(card, player, name) {
											if (name == 'phaseDiscard' && card.suit == 'heart') return false;
										},
									},
								},
								diamond: {
									mark: true,
									marktext2: '♦️️️',
									markimage: 'extension/幻颜风华/Call/lg_call_hundun.jpg',
									intro: {
										content: '♦️️牌不计入手牌上限',
									},
									mod: {
										ignoredHandcard(card, player) {
											if (card.suit == 'diamond') return true;
										},
										cardDiscardable(card, player, name) {
											if (name == 'phaseDiscard' && card.suit == 'diamond') return false;
										},
									},
								},
								club: {
									mark: true,
									marktext2: '♣️️️',
									markimage: 'extension/幻颜风华/Call/lg_call_hundun.jpg',
									intro: {
										content: '♣️️牌不计入手牌上限',
									},
									mod: {
										ignoredHandcard(card, player) {
											if (card.suit == 'club') return true;
										},
										cardDiscardable(card, player, name) {
											if (name == 'phaseDiscard' && card.suit == 'club') return false;
										},
									},
								},
								spade: {
									mark: true,
									marktext2: '♠️️️',
									markimage: 'extension/幻颜风华/Call/lg_call_hundun.jpg',
									intro: {
										content: '♠️️牌不计入手牌上限',
									},
									mod: {
										ignoredHandcard(card, player) {
											if (card.suit == 'spade') return true;
										},
										cardDiscardable(card, player, name) {
											if (name == 'phaseDiscard' && card.suit == 'spade') return false;
										},
									},
								},
							},
							popup: false,
						},
						lg_hundun: {
							mod: {
								globalFrom(from, to, current) {
									var tp = Math.max(1, Math.ceil(from.storage.lg_hundun / 2));
									return current - tp;
								},
							},
							ai: {
								halfneg: true,
							},
							forced: true,
							trigger: {
								source: 'damageEnd',
							},
							init(player) {
								player.storage.lg_hundun = 0;
							},
							intro: {
								content(content, player) {
									var num = player.storage.lg_hundun;
									var tp = Math.max(1, Math.floor(num / 2));
									return '混沌之源:<span class="purpletext">' + num + '</span><span class="bluetext"></span>';
								},
							},
							filter(event, player) {
								return event.num > 0;
							},
							content() {
								player.storage.lg_hundun += trigger.num;
								player.markSkill('lg_hundun');
								if (!trigger.card || trigger.card.name != 'sha') {
								}
							},
							group: ['lg_hundun_zhenzhu'],
							subSkill: {
								zhenzhu: {
									forced: true,
									_priority: 6,
									trigger: {
										player: 'phaseUseBegin',
									},
									filter(event, player) {
										return player.storage.lg_hundun >= 5;
									},
									content() {
										player.storage.lg_hundun = 0;
										player.unmarkSkill('lg_hundun');
										var list = ['molangzhiyin', 'buxingzhidie', 'shiyan', 'fenghun', 'tanlanjiasuo', 'fuhuazhiwu', 'anyingpingzhang', 'heianzhihe'];
										player.gain(game.createCard('lg_' + list.randomGet()), 'draw');
									},
								},
							},
						},
						lg_fuhuazhiwu1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'damageBegin',
							},
							content() {
								trigger.source.chooseToDiscard(1, true, 'h');
								trigger.source.chooseToDiscard(1, true, 'h');
							},
						},
						lg_jing: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'linkEnd',
							},
							filter(event, player) {
								return event.player != player && event.player.isLinked() && player.isLinked();
							},
							content() {
								trigger.player.damage();
							},
						},
						lg_luo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'shaBegin',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseToDiscard(get.prompt('lg_luo'), 2, 'he').ai = function (card) {
									if (game.countPlayer() > 2) return 5 - get.value(card);
								};
								('step 1');
								if (result.bool) {
									trigger.player
										.chooseControl(['此【杀】造成的伤害值-1', '令' + lib.translate[player.name] + '选择角色使用一张【杀】'], true)
										.set('ai', function (event) {
											if (get.attitude(trigger.player, player) >= 0) return '此【杀】造成的伤害值-1';
											return '令' + lib.translate[player.name] + '选择角色使用一张【杀】';
										})
										.set('prompt', '绯天·落');
								} else {
									event.finish();
								}
								('step 2');
								if (result.control == '此【杀】造成的伤害值-1') trigger.card.lg_luo = true;
								if (result.control == '令' + lib.translate[player.name] + '选择角色使用一张【杀】') {
									player.chooseTarget(function (card, player, target) {
										return player != target && trigger.player != target;
									}).ai = function (target) {
										return true;
									};
								} else {
									event.finish();
								}
								('step 3');
								if (result.bool) {
									player.line(result.targets);
									result.targets[0].chooseToUse({ name: 'sha' }, trigger.player, -1);
								} else {
									event.finish();
								}
								('step 4');
								if (!result.bool) player.gain(game.createCard('sha'), 'gain2');
							},
						},
						lg_shewu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToBefore',
							},
							_priority: 12,
							forced: true,
							filter(event, player) {
								if (player.hasSkill('lg_shewu_temp')) return false;
								if (!event.player || !event.targets || !event.targets.length) return false;
								if (event.targets.length > 1) return false;
								if (event.card.suit != 'diamond' && event.card.name != 'shan') return false;
								return event.player != player;
							},
							content() {
								'step 0';
								player.addTempSkill('lg_shewu_temp');
								('step 1');
								var translation1 = get.translation(trigger.card);
								var translation2 = get.translation(trigger.player);
								player.chooseBool(get.prompt('lg_shewu', trigger.player), '令使用' + translation2 + '的' + translation1 + '对你无效,你对' + translation2 + '使用' + translation1 + '?').ai = function (event, player) {
									var tri = _status.event.getTrigger();
									var eff = get.effect(player, tri.card, tri.player, player);
									var att = get.attitude(player, tri.player);
									return (eff < 0 && att <= 0) || (eff > 0 && att > 0);
								};
								('step 2');
								if (result.bool) {
									var pla = trigger.player;
									trigger.player = player;
									trigger.target = pla;
									player.addTempSkill('lg_shewu_mark');
								}
							},
							ai: {
								effect: {
									target(card, player, target) {
										var att = get.attitude(player, target);
										if (target.hasSkill('lg_shewu_temp')) return;
										if (card.name == 'shan' || card.suit == 'diamond') {
											if (!target.hasFriend()) return;
											if (att <= 0) {
												return 0.5;
											} else return 2;
										}
									},
								},
							},
							subSkill: {
								mark: {
									charlotte: true,
									trigger: {
										target: 'useCardToAfter',
									},
									_priority: 9,
									forced: true,
									filter(event, player) {
										if (_status.currentPhase == player || event.player == player) return false;
										if (event.card.name != 'shan' && event.card.suit != 'diamond') return false;
										var info = get.info(event.card);
										if (info.multitarget) return false;
										if (event.getParent(2).name == 'lg_shewu_mark') return false;
										return true;
									},
									content() {
										trigger.player.useCard(trigger.card, trigger.cards, player, false);
									},
									ai: {
										effect: {
											target(card, player, target) {
												if (card.name == 'shan' || card.suit == 'diamond') {
													return 2;
												}
											},
										},
									},
								},
								temp: {
									charlotte: true,
								},
							},
						},
						lg_luxueer_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jiren: {
							trigger: {
								player: 'equipEnd',
							},
							forced: true,
							charlotte: true,
							filter(event, player) {
								return player.countCards('e') >= 4;
							},
							content() {
								'step 0';
								var es = player.getCards('e');
								event.count = 1;
								player.discard(es);
								('step 1');
								event.count--;
								if (
									game.hasPlayer(function (current) {
										return current.countDiscardableCards(player, 'hej') > 0;
									})
								) {
									player.chooseTarget('弃置一名角色区域内的三张牌', true, function (card, player, target) {
										return target.countDiscardableCards(player, 'hej') > 0;
									}).ai = function (target) {
										var att = get.attitude(_status.event.player, target);
										if (target.countCards('j') && att > 0) return att * 1.5;
										return -att;
									};
								} else event.finish();
								('step 2');
								if (result.bool && result.targets && result.targets.length) {
									var target = result.targets[0];
									player.line(target, { color: [220, 90, 139] });
									player.discardPlayerCard(target, 'hej', 3, true);
									player.chooseUseTarget('指定目标', false, { name: 'sha' });
									player.chooseUseTarget('指定目标', false, { name: 'sha' });
									player.chooseUseTarget('指定目标', false, { name: 'sha' });
								}
							},
						},
						lg_zhuiling: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin3',
							},
							mark: true,
							intro: {
								content: '转换:<br/>一名其他角色使用♥️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值-1.',
							},
							filter(event, player) {
								if (!event.source) return false;
								if (!event.source.isIn()) return false;
								return event.num > 0 && player.countCards('h') > 0 && event.card && event.card.suit == 'heart' && event.card.name == 'sha';
							},
							forced: true,
							content() {
								'step 0';
								if (player.storage.lg_zhuiling) event.goto(3);
								('step 1');
								player.chooseCard('h', get.prompt('坠灵', trigger.source), '交给' + get.translation(trigger.source) + '一张手牌').set('ai', function (card) {
									return 6.5 - get.value(card);
								});
								('step 2');
								if (result.bool) {
									trigger.source.gain(result.cards[0], player, 'giveAuto');
									trigger.num--;
								}
								event.finish();
								('step 3');
								player.chooseToDiscard('h', 1, get.prompt2('lg_zhuiling')).set('ai', function (card) {
									return 7 - get.value(card);
								});
								('step 4');
								if (result.bool) {
									trigger.num--;
									player.removeSkill('lg_zhuiling');
									player.addSkill('lg_zhuiling1');
								}
							},
						},
						lg_zhuiling1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin3',
							},
							mark: true,
							intro: {
								content: '转换:<br/>一名其他角色使用♠️️【杀】对你造成伤害时,你可以交给其一张手牌.若如此做,此伤害值+1.',
							},
							filter(event, player) {
								if (!event.source) return false;
								if (!event.source.isIn()) return false;
								return event.num > 0 && player.countCards('h') > 0 && event.card && event.card.suit == 'spade' && event.card.name == 'sha';
							},
							forced: true,
							content() {
								'step 0';
								if (player.storage['lg_zhuiling1']) event.goto(3);
								('step 1');
								player.chooseCard('h', get.prompt('坠灵', trigger.source), '交给' + get.translation(trigger.source) + '一张手牌').set('ai', function (card) {
									return 6.5 - get.value(card);
								});
								('step 2');
								if (result.bool) {
									trigger.source.gain(result.cards[0], player, 'giveAuto');
									trigger.num--;
								}
								event.finish();
								('step 3');
								player.chooseToDiscard('h', 1, get.prompt2('lg_zhuiling1')).set('ai', function (card) {
									return 7 - get.value(card);
								});
								('step 4');
								if (result.bool) {
									trigger.num++;
									player.removeSkill('lg_zhuiling1');
									player.addSkill('lg_zhuiling');
								}
							},
						},
						lg_cuican: {
							init(player) {
								player.storage.lg_cuican = [1];
							},
							trigger: {
								source: 'damageBegin4',
							},
							_priority: -39,
							forced: true,
							filter(event, player) {
								if (!event.card || !event.notLink()) return false;
								return player.storage.lg_cuican && player.storage.lg_cuican.length;
							},
							content() {
								'step 0';
								player.goMad('loseEnd');
								var lt = [];
								for (var i = 0; i < player.storage.lg_cuican.length; i++) {
									lt.push(player.storage.lg_cuican[i].toString());
								}
								player
									.chooseControl(lt, true)
									.set('ai', function (event) {
										var tp = [];
										for (var i = 0; i < lt.length; i++) {
											tp.push(parseInt(lt[i]));
										}
										var att = get.attitude(player, _status.event.getTrigger().player);
										if (att > 0)
											var nm = Math.min(...tp); //拓展运算符
										else var nm = Math.max(...tp);
										return nm.toString();
									})
									.set('prompt', '对' + get.translation(trigger.player) + '进行摧残');
								('step 1');
								var nm = parseInt(result.control);
								trigger.num = nm;
								player.storage.lg_cuican.remove(nm);
							},
							group: ['lg_cuican_rec'],
							subSkill: {
								rec: {
									trigger: {
										player: ['loseAfter'],
										global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
									},
									forced: true,
									filter(event, player) {
										//if(player.equiping) return false;
										if (event.name == 'equip') return true;
										var evt = event.getl(player);
										return evt && evt.player == player && evt.es && evt.es.length;
									},
									content() {
										var nm = Math.max(0, player.countCards('e'));
										if (!player.storage.lg_cuican.includes(nm)) {
											player.storage.lg_cuican.push(nm);
										}
									},
								},
							},
						},
						lg_anyouxinsheng: {
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_anyouxinsheng_end'],
							subSkill: {
								end: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										player: 'phaseUseEnd',
									},
									filter(event, player) {
										if (!player.storage.lg_anyouxinsheng || !player.storage.lg_anyouxinsheng.length) return false;
										return true;
									},
									content() {
										'step 0';
										event.num1 = player.storage.lg_anyouxinsheng.length;
										switch (event.num1) {
											case 4:
												event.str = '令一名其他角色将手牌数补至体力上限';
												break;
											case 3:
												event.str = '对1名其他角色造成1点伤害';
												break;
											case 2:
												event.str = '令一名其他角色弃置两张♠️️牌';
												break;
											case 1:
												player.recover();
												event.goto(3);
												break;
										}
										('step 1');
										player
											.chooseTarget(get.prompt('lg_anyouxinsheng'), event.str, function (card, player, target) {
												return player != target;
											})
											.set('ai', function (target) {
												var att = get.attitude(player, target);
												if (event.num1 == 4) {
													var num = target.getHandcardLimit() - target.countCards('h');
													if (target.isTurnedOver() || num > 3) return att;
													return -att;
												} else if (event.num1 == 3) {
													var eff = get.damageEffect(target, player, player);
													return eff;
												} else {
													if (target.isLinked()) return att;
													return -att;
												}
											});
										('step 2');
										if (result.bool) {
											var target = result.targets[0];
											player.line(target, 'purple');
											if (event.num1 == 4) {
												var num = target.getHandcardLimit() - target.countCards('h');
												target.drawTo(num);
											} else if (event.num1 == 3) {
												target.damage(player, 1, 'nocard');
											} else {
												target.chooseToDiscard(2, true, 'he', { suit: 'spade' });
											}
										}
										('step 3');
										player.storage.lg_anyouxinsheng = [];
										player.unmarkSkill('lg_anyouxinsheng');
									},
								},
							},
							init(player) {
								player.storage.lg_anyouxinsheng = [];
							},
							trigger: {
								player: 'useCardEnd',
							},
							forced: true,
							filter(event, player) {
								if (_status.currentPhase != player) return false;
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										var suit = i.suit;
										if (suit && !player.storage.lg_anyouxinsheng.includes(suit)) return true;
									}
								return false;
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_anyouxinsheng.jpg',
							intro: {
								content(storage) {
									if (!storage.length) {
										return '未使用过有花色的牌';
									} else {
										var str = '你使用过的花色有:' + get.translation(storage);
										return str;
									}
								},
							},
							content() {
								for (var i = 0; i < trigger.cards.length; i++) {
									var suit = trigger.cards[i].suit;
									if (suit) player.storage.lg_anyouxinsheng.add(suit);
								}
								player.markSkill('lg_anyouxinsheng');
							},
						},
						lg_hundun_nuoya: {
							ai: {
								neg: true,
							},
							init(player) {
								if (player.isZhu) {
									player.addSkill('lg_hundun');
									player.addSkill('lg_hundun1');
									player.addSkill('lg_wujianhundun');
								}
							},
						},
						lg_nuoya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_wujianhundun: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'loseAfter',
							},
							filter(event, player) {
								if (event.type != 'discard' || event.position != ui.discardPile) return false;
								for (var i of event.cards) {
									if (i.suit == 'spade') return true;
								}
								return false;
							},
							prompt2: '发动此技能',
							check(event, player) {
								return get.attitude(player, _status.currentPhase.next) > 0;
							},
							content() {
								var card = get.cardPile(function (card) {
									return card.name == 'sha' && card.suit != 'spade';
								});
								if (card) {
									game.log(player, '将', card, '置于牌堆顶');
									card.fix();
									ui.cardPile.insertBefore(card, ui.cardPile.firstChild);
									game.updateRoundNumber();
								}
							},
						},
						lg_huanxiangdiesheng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['shaBefore'],
							},
							_priority: 999,
							content() {
								'step 0';
								if (!trigger.target.hasSkill('lg_huanxiangdiesheng_mark')) {
									trigger.target.addSkill('lg_huanxiangdiesheng_mark');
									trigger.target.storage.lg_huanxiangdiesheng_mark = 0;
									trigger.target.markSkill('lg_huanxiangdiesheng_mark');
								}
								trigger.target.storage.lg_huanxiangdiesheng_mark++;
								('step 1');
								trigger.cancel();
								if (player.stat[player.stat.length - 1].card.sha > 0) {
									player.stat[player.stat.length - 1].card.sha--;
								}
							},
							ai: {
								effect: {
									player(card, player) {
										if (player.hp > 0 && card.name == 'jiu') return [0, -1];
									},
								},
							},
							subSkill: {
								mark: {
									intro: {
										content(storage) {
											return '幻象标记数:<span class="bluetext">' + storage + '</span>';
										},
									},
									trigger: {
										player: ['damageBegin'],
									},
									forced: true,
									filter(event, player) {
										if (event.num <= 0) return false;
										return player.storage.lg_huanxiangdiesheng_mark && player.storage.lg_huanxiangdiesheng_mark > 0 && player.countCards('hej', { suit: 'heart' });
									},
									content() {
										'step 0';
										player.randomDiscard(1, 'h');
										player.loseHp();
										player.loseHp();
										if (player.hp == trigger.source.countCards('h', { suit: 'heart' })) trigger.source.recover(2);
										player.storage.lg_huanxiangdiesheng_mark--;
										('step 1');
										if (player.storage.lg_huanxiangdiesheng_mark <= 0) {
											delete player.storage.lg_huanxiangdiesheng_mark;
											player.unmarkSkill('lg_huanxiangdiesheng_mark');
											player.removeSkill('lg_huanxiangdiesheng_mark');
										}
									},
									ai: {
										effect: {
											target(card, player, target) {
												if (get.tag(card, 'damage')) {
													if (player.hasSkillTag('jueqing', false, target)) return;
													return [1, -2];
												}
											},
										},
									},
								},
							},
						},
						lg_niuqu: {
							usable: 1,
							trigger: {
								player: ['phaseJieshuBegin', 'damageEnd'],
							},
							filter(event, player) {
								if (event.name != 'phaseJieshu') {
									var history = player.getHistory('damage');
									for (var i of history) {
										if (i == event) break;
										return false;
									}
									var all = player.actionHistory;
									for (var i = all.length - 2; i >= 0; i--) {
										if (all[i].damage.length) return false;
										if (all[i].isRound) break;
									}
								}
								return (
									player.countCards('h') > 0 &&
									!player.hasCard(function (card) {
										return !lib.filter.cardDiscardable(card, player, 'lg_niuqu');
									}, 'h')
								);
							},
							check(event, player) {
								var cards = [],
									names = [];
								for (var i = 0; i < ui.discardPile.childNodes.length; i++) {
									var card = ui.discardPile.childNodes[i];
									if (get.type(card, false) == 'basic' && !names.includes(card.name)) {
										cards.push(card);
										names.push(card.name);
									}
								}
								if (!names.includes('shan') || !names.includes('tao')) return false;
								if (player.countCards('h', 'shan') < 2 && player.countCards('h', 'tao') < 1) return true;
								return false;
							},
							forced: true,
							content() {
								'step 0';
								player.discard(player.getCards('h'));
								('step 1');
								var cards = [],
									names = [];
								for (var i = 0; i < ui.discardPile.childNodes.length; i++) {
									var card = ui.discardPile.childNodes[i];
									if (get.type(card, false) == 'basic' && !names.includes(card.name)) {
										cards.push(card);
										names.push(card.name);
									}
								}
								if (cards.length) player.gain(cards, 'gain2');
							},
						},
						lg_hundunchuyong: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'dyingAfter',
							},
							filter(event, player) {
								return event.source;
							},
							content() {
								'step 0';
								game.swapSeat(player, trigger.source);
								('step 1');
								var players = game.filterPlayer(function (current) {
									return get.distance(player, current, 'attract') <= 1 && player.getEnemies().includes(current);
								});
								players.sort(lib.sort.seat);
								var num = [1, 2];
								for (var i = 0; i < players.length; i++) {
									player.line(players[i], 'fire');
									player.gainPlayerCard('h', players[i], num.randomGet(), true);
									players[i].damage()._triggered = null;
								}
							},
							ai: {
								threaten: 2,
							},
						},
						lg_baiqiangweizhifa: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'changeHp',
							},
							forced: true,
							filter(event, player) {
								return player.countCards('he') > 0;
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									filterCard: true,
									filterTarget(card, player, target) {
										return player != target;
									},
									ai1(card) {
										if (get.position(card) == 'e') return -1;
										return 5 - get.value(card);
									},
									ai2(target) {
										return -1;
									},
									prompt: '白蔷薇之罚<br/><br/>发动此技能？',
								});
								('step 1');
								if (result.bool) {
									var cards = result.cards;
									var target = result.targets[0];
									player.showCards(cards);
									target.gain(cards, player, 'log');
									target.storage.lg_baiqiangweizhifa_debuff = get.type(cards[0]);
									target.storage.lg_baiqiangweizhifa_debuff2 = player;
									if (player.countCards('j') >= 1) target.addTempSkill('lg_jisi', { player: 'die' });
									target.addSkill('lg_baiqiangweizhifa_debuff');
								}
							},
							ai: {
								order: 1,
								result: {
									target(player, target) {
										return -1;
									},
								},
							},
							group: ['lg_baiqiangweizhifa_delete'],
							subSkill: {
								debuff: {
									mark: true,
									marktext: '罚',
									mod: {
										cardEnabled(card, player, target) {
											if (get.type(card) == player.storage.lg_baiqiangweizhifa_debuff) return false;
										},
										cardUsable(card, player, target) {
											if (get.type(card) == player.storage.lg_baiqiangweizhifa_debuff) return false;
										},
										cardRespondable(card, player, target) {
											if (get.type(card) == player.storage.lg_baiqiangweizhifa_debuff) return false;
										},
										cardSavable(card, player, target) {
											if (get.type(card) == player.storage.lg_baiqiangweizhifa_debuff) return false;
										},
										playerEnabled(card, player, target) {
											var info = get.info(card);
											if (target != player.storage.lg_baiqiangweizhifa_debuff2 && (!info || !info.singleCard || !ui.selected.targets.length)) return false;
										},
									},
									intro: {
										content(type) {
											return '不能使用或打出' + get.translation(type) + '牌';
										},
									},
								},
								delete: {
									trigger: {
										player: 'phaseBefore',
									},
									forced: true,
									popup: false,
									filter(event, player) {
										return game.hasPlayer(function (current) {
											return current.hasSkill('lg_baiqiangweizhifa_debuff');
										});
									},
									content() {
										for (var i of game.players) {
											//QQ
											if (i.hasSkill('lg_baiqiangweizhifa_debuff')) {
												player.line(i);
												i.removeSkill('lg_baiqiangweizhifa_debuff');
											}
										}
									},
								},
							},
						},
						lg_cuixue: {
							nobracket: true,
							trigger: {
								player: ['damageBefore', 'loseHpBefore'],
							},
							forced: true,
							filter(event, player) {
								return event.num > 0;
							},
							content() {
								var cards = get.cards();
								var card = cards[0];
								if (card.suit == 'heart') {
									player.gain(card, 'gain2', 'log');
									trigger.num++;
									player.awakenSkill('lg_cuixue');
								} else {
									trigger.cancel();
									player.gain(cards, 'gain2', 'log');
								}
							},
							ai: {
								threaten: 2,
							},
						},
						lg_baiqiangweizhilei: {
							mod: {
								aiOrder(player, card, num) {
									var number = card.number;
									if (typeof number != 'number') return;
									var history = player.getHistory('useCard', function (evt) {
										return evt.isPhaseUsing();
									});
									if (history.length == 0) return num + 10 * (14 - number);
									var num = history[0].card.number;
									if (!num) return;
									for (var i = 1; i < history.length; i++) {
										var num2 = history[i].card.number;
										if (!num2 || num2 <= num) return;
										num = num2;
									}
									if (number > num) return num + 10 * (14 - number);
								},
							},
							filterx(event, player) {
								var history = player.getHistory('useCard', function (evt) {
									return evt.isPhaseUsing();
								});
								if (history.length < 2) return false;
								var num = history[0].card.number;
								if (!num) return false;
								for (var i = 1; i < history.length; i++) {
									var num2 = history[i].card.number;
									if (!num2 || num2 <= num) return false;
									num = num2;
								}
								return true;
							},
							filtery(event, player) {
								var history = player.getHistory('useCard', function (evt) {
									return evt.isPhaseUsing();
								});
								if (history.length < 2) return false;
								var num = history[0].card.number;
								if (!num) return false;
								for (var i = 1; i < history.length; i++) {
									var num2 = history[i].card.number;
									if (!num2 || num2 >= num) return false;
									num = num2;
								}
								return true;
							},
							trigger: {
								player: ['phaseUseEnd'],
							},
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							filter(event, player) {
								if (lib.skill.lg_baiqiangweizhilei.filterx(event, player)) return true;
								if (lib.skill.lg_baiqiangweizhilei.filtery(event, player)) return true;
								return false;
							},
							content() {
								'step 0';
								event.star = lib.skill.lg_baiqiangweizhilei.filterx(null, player);
								player
									.chooseTarget([1, 2], get.prompt('lg_baiqiangweizhilei'), '令至多两名角色各' + (event.star ? '摸一' : '弃置两') + '张牌', function (card, player, target) {
										return event.star
											? true
											: target.countCards('he', function (card) {
												return lib.filter.cardDiscardable(card, target, 'lg_baiqiangweizhilei');
											}) > 0;
									})
									.set('ai', function (target) {
										return event.star ? get.attitude(player, target) : -get.attitude(player, target);
									});
								('step 1');
								if (result.bool) {
									if (event.star) {
										game.asyncDraw(result.targets);
									} else {
										for (var i = 0; i < result.targets.length; i++) {
											result.targets[i].chooseToDiscard('he', 2, true);
										}
									}
								}
							},
						},
						lg_nikesi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_baiqiangweizhilei1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_baiqiangweizhileiBegin',
							},
							filter(event, player) {
								return player.previous.countCards('hej', { suit: 'heart' }) == game.roundNumber;
							},
							content() {
								player.chooseUseTarget('指定目标', false, { name: 'sha' });
							},
						},
						lg_liangzizhongquan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['phaseJudgeBefore'],
							},
							intro: {
								content(content, player) {
									var temp1 = player.storage.lg_liangzizhongquan;
									if (!temp1.length) {
										return '未使用牌';
									} else {
										var str = '你使用过:' + get.translation(temp1);
										return str;
									}
								},
							},
							init(player) {
								player.storage.lg_liangzizhongquan = [];
							},
							content() {
								'step 0';
								var list = [];
								for (var i = 0; i < lib.inpile.length; i++) {
									if (get.type(lib.inpile[i]) != 'basic' && get.type(lib.inpile[i]) != 'trick') continue;
									var card = { name: lib.inpile[i] };
									if (!get.tag(card, 'damage') && !player.storage.lg_liangzizhongquan.includes(lib.inpile[i])) {
										if (lib.filter.cardEnabled(card, player)) {
											list.push(['卡牌', '', lib.inpile[i]]);
										}
									}
								}
								if (list.length) {
									player.chooseButton(['发动此技能？', [list, 'vcard']]).set('ai', function (button) {
										return player.getUseValue({ name: button.link[2] });
									});
								} else event.finish();
								('step 1');
								if (result && result.bool && result.links[0]) {
									trigger.cancel();
									player.storage.lg_liangzizhongquan.push(result.links[0][2]);
									player.markSkill('lg_liangzizhongquan');
									player.chooseUseTarget({ name: result.links[0][2] }, true);
								}
							},
							group: ['lg_liangzizhongquan_draw'],
							subSkill: {
								draw: {
									trigger: {
										player: ['useCardAfter', 'useCardCancelled'],
									},
									filter(event, player) {
										return event.getParent(2).name == 'lg_liangzizhongquan';
									},
									forced: true,
									content() {
										player.chooseToDiscard(trigger.targets.length, 'h', true);
									},
								},
							},
						},
						lg_yunsui: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'phaseUseEnd',
							},
							filter(event, player) {
								var type = [];
								player.getHistory('useCard', function (evt) {
									if (evt.getParent('phaseUse') == event) type.add(get.type2(evt.card));
								});
								return type.length == player.previous.getAttackRange();
							},
							content() {
								'step 0';
								var list = [],
									except = [];
								player.getHistory('useCard', function (evt) {
									if (evt.getParent('phaseUse') == trigger) except.add(evt.card.name);
								});
								for (var i of lib.inpile) {
									if (!except.includes(i) && ['basic', 'trick'].includes(get.type(i))) list.push(i);
								}
								event.list = list;
								('step 1');
								for (var i = 0; i < event.list.length; i++) {
									var typeTip = get.type(event.list[i]);
									var name = event.list[i];
									event.list[i] = [typeTip, '', name];
								}
								player
									.chooseButton(['使用其中一张牌', [event.list, 'vcard']])
									.set('ai', function (button) {
										var card = { name: button.link[2] },
											player = _status.event.player;
										if (get.tag(card, 'damage') && player.needsToDiscard() < 2) return -1;
										if (['jiu'].includes(button.link[2])) return -1;
										if (player.hasValueTarget(card, false, true)) return player.getUseValue(card);
									})
									.set('filterButton', function (button) {
										if (button.link[2] == 'du') return false;
										if (get.tag({ name: button.link[2] }, 'damage')) {
											if (player.countDiscardableCards(player, 'he') < 2) return false;
										}
										return player.hasUseTarget(button.link[2], false, true);
									})
									.set('prompt2', '若以此法使用【杀】,你补牌');
								('step 2');
								event.card = { name: result.links[0][2] };
								if (get.type(event.card) == 'basic' && get.tag(event.card, 'damage')) {
									var num = player.previous.countCards('h', { type: 'basic' });
									player.drawTo(num);
								}
								player.chooseUseTarget(event.card, true).set('nodistance', true).set('addCount', false);
							},
							group: 'lg_yunsui_mark',
							subSkill: {
								mark: {
									markimage: 'extension/幻颜风华/Trace/lg_trace_yunsui.jpg',
									intro: {
										name: '陨碎',
										markcount(storage) {
											return storage.type.length;
										},
										content(storage) {
											var tip = '';
											if (storage.type.length) {
												tip += '你使用过的牌类别:';
												tip += get.translation(storage.type);
											}
											if (storage.name.length) {
												tip += '<br>你使用过的牌名:';
												tip += get.translation(storage.name);
											}
											return tip;
										},
									},
									trigger: {
										player: ['phaseUseBefore', 'useCard', 'phaseUseAfter'],
									},
									forced: true,
									silent: true,
									popup: false,
									filter(event, player, onrewrite) {
										if (onrewrite == 'useCard') return player.isPhaseUsing();
										return true;
									},
									content() {
										if (player.storage.lg_yunsui_mark == undefined) {
											player.storage.lg_yunsui_mark = {
												count: [],
												name: [],
											};
										}
										var onrewrite = event.triggername;
										switch (onrewrite) {
											case 'phaseUseBefore': {
												player.storage.lg_yunsui_mark.type = [];
												player.storage.lg_yunsui_mark.name = [];
												break;
											}
											case 'phaseUseAfter': {
												player.unmarkSkill('lg_yunsui_mark');
												break;
											}
											default: {
												player.storage.lg_yunsui_mark.type.add(get.type2(trigger.card));
												player.storage.lg_yunsui_mark.name.add(trigger.card.name);
												player.markSkill('lg_yunsui_mark');
											}
										}
									},
								},
							},
						},
						lg_weiouen_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yunsui1: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'phaseUseEnd',
							},
							filter(event, player) {
								var type = [];
								player.getHistory('useCard', function (evt) {
									if (evt.getParent('phaseUse') == event) type.add(get.type2(evt.card));
								});
								return type.length == player.previous.getAttackRange();
							},
							content() {
								'step 0';
								var list = [],
									except = [];
								player.getHistory('useCard', function (evt) {
									if (evt.getParent('phaseUse') == trigger) except.add(evt.card.name);
								});
								for (var i of lib.inpile) {
									if (!except.includes(i) && ['basic', 'trick'].includes(get.type(i))) list.push(i);
								}
								event.list = list;
								('step 1');
								for (var i = 0; i < event.list.length; i++) {
									var typeTip = get.type(event.list[i]);
									var name = event.list[i];
									event.list[i] = [typeTip, '', name];
								}
								player
									.chooseButton(['使用其中一张牌', [event.list, 'vcard']])
									.set('ai', function (button) {
										var card = { name: button.link[2] },
											player = _status.event.player;
										if (get.tag(card, 'damage') && player.needsToDiscard() < 2) return -1;
										if (['jiu'].includes(button.link[2])) return -1;
										if (player.hasValueTarget(card, false, true)) return player.getUseValue(card);
									})
									.set('filterButton', function (button) {
										if (button.link[2] == 'du') return false;
										if (get.tag({ name: button.link[2] }, 'damage')) {
											if (player.countDiscardableCards(player, 'he') < 2) return false;
										}
										return player.hasUseTarget(button.link[2], false, true);
									})
									.set('prompt2', '若以此法使用【杀】,你补牌');
								('step 2');
								event.card = { name: result.links[0][2] };
								if (get.type(event.card) == 'basic' && get.tag(event.card, 'damage')) {
									var num = player.previous.countCards('h', { type: 'basic' });
									player.drawTo(num);
								}
								player.chooseUseTarget(event.card, true).set('nodistance', true).set('addCount', false);
							},
							group: 'lg_yunsui1_mark',
							subSkill: {
								mark: {
									markimage: 'extension/幻颜风华/Trace/lg_trace_yunsui.jpg',
									intro: {
										name: '陨碎',
										markcount(storage) {
											return storage.type.length;
										},
										content(storage) {
											var tip = '';
											if (storage.type.length) {
												tip += '你使用过的牌类别:';
												tip += get.translation(storage.type);
											}
											if (storage.name.length) {
												tip += '<br>你使用过的牌名:';
												tip += get.translation(storage.name);
											}
											return tip;
										},
									},
									trigger: {
										player: ['phaseUseBefore', 'useCard', 'phaseUseAfter'],
									},
									forced: true,
									silent: true,
									popup: false,
									filter(event, player, onrewrite) {
										if (onrewrite == 'useCard') return player.isPhaseUsing();
										return true;
									},
									content() {
										if (player.storage['lg_yunsui1_mark'] == undefined) {
											player.storage['lg_yunsui1_mark'] = {
												count: [],
												name: [],
											};
										}
										var onrewrite = event.triggername;
										switch (onrewrite) {
											case 'phaseUseBefore': {
												player.storage['lg_yunsui1_mark'].type = [];
												player.storage['lg_yunsui1_mark'].name = [];
												break;
											}
											case 'phaseUseAfter': {
												player.unmarkSkill('lg_yunsui1_mark');
												break;
											}
											default: {
												player.storage['lg_yunsui1_mark'].type.add(get.type2(trigger.card));
												player.storage['lg_yunsui1_mark'].name.add(trigger.card.name);
												player.markSkill('lg_yunsui1_mark');
											}
										}
									},
								},
							},
						},
						lg_shalubaochang: {
							markimage: 'extension/幻颜风华/Trace/lg_trace_shalubaochang.jpg',
							_priority: -10,
							trigger: {
								target: 'shaBegin',
							},
							intro: {
								content: 'mark',
							},
							init(player) {
								player.storage.lg_shalubaochang = 0;
							},
							content() {
								player.draw(2);
								player.storage.lg_shalubaochang++;
								player.markSkill('lg_shalubaochang');
							},
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_shalubaochang_draw'],
							subSkill: {
								draw: {
									mod: {
										maxHandcard(player, num) {
											return num - player.storage.lg_shalubaochang;
										},
									},
									trigger: {
										player: 'shaMiss',
									},
									filter(event, player) {
										return player.storage.lg_shalubaochang > 0;
									},
									check(event, player) {
										return player.storage.lg_shalubaochang >= 4;
									},
									prompt2(event, player) {
										var str = '将<杀戮>标记调整至1枚？';
										if (player.storage.lg_shalubaochang >= 4) str += '且你执行一个额外的出牌阶段.';
										return str;
									},
									content() {
										var nm = player.storage.lg_shalubaochang - 1;
										player.draw(nm);
										if (nm >= 4) {
											player.phaseUse();
										}
										var num = player.storage.lg_shalubaochang - 1;
										player.storage.lg_shalubaochang -= num;
										player.unmarkSkill('lg_shalubaochang');
									},
								},
							},
						},
						lg_shengfeishizhui: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'useCard',
							},
							filter(event, player) {
								return ['heart'].includes(event.card.suit) && !get.info(event.card).notarget;
							},
							init(player) {
								player.storage.lg_shengfeishizhui = [];
								player.storage.lg_shengfeishizhuiDirectTarget = [];
								player.storage.lg_shengfeishizhuiDamageTarget = [];
								player.storage.lg_shengfeishizhuiDamageCard = [];
							},
							forced: true,
							content() {
								'step 0';
								var targets = trigger.targets;
								var cards = trigger.card;
								player
									.chooseTarget('圣妃失坠<br/><br/>对其中任意名目标发动此技能？', [1, targets.length], function (card, player, target) {
										return targets.includes(target) && target.countCards('h') > 0;
									})
									.set('ai', function (target) {
										var eff = get.effect(target, cards, player, player);
										return eff;
									});
								('step 1');
								if (!result.bool) {
									event.finish();
									return;
								}
								var targets = result.targets;
								player.popup('圣妃失坠', 'fire');
								player.storage.lg_shengfeishizhui.push(trigger.card);
								event.targets = targets;
								('step 2');
								if (event.targets.length) {
									event.current = event.targets.shift();
									player.line(event.current, 'fire');
									var target = event.current;
									var cards = trigger.card;
									player.choosePlayerCard(event.current, 'h', true).set('ai', function (button) {
										if (player == target) {
											return get.color(button.link) != get.color(cards);
										}
									});
								} else {
									trigger.directHit.addArray(
										game.filterPlayer(function (current) {
											return player.storage.lg_shengfeishizhuiDirectTarget.includes(current);
										})
									);
									event.finish();
									return;
								}
								('step 3');
								var card = result.links;
								var color = get.color(card);
								event.current.$throw(card, 1000);
								game.log(event.current, '展示了', card);
								if (color != get.color(trigger.card)) {
									player.storage.lg_shengfeishizhuiDirectTarget.push(event.current);
								} else {
									player.storage.lg_shengfeishizhuiDamageTarget.push(event.current);
									if (!player.storage.lg_shengfeishizhuiDamageCard.includes(trigger.card)) player.storage.lg_shengfeishizhuiDamageCard.push(trigger.card);
								}
								event.goto(2);
							},
							group: ['lg_shengfeishizhui_damage', 'lg_shengfeishizhui_update'],
							subSkill: {
								update: {
									popup: false,
									forced: true,
									trigger: {
										player: 'useCardEnd',
									},
									content() {
										if (player.storage.lg_shengfeishizhui.includes(trigger.card)) {
											player.storage.lg_shengfeishizhui.remove(trigger.card);
											player.storage.lg_shengfeishizhuiDamageCard.remove(trigger.card);
											for (var i = 0; i < trigger.targets.length; i++) {
												player.storage.lg_shengfeishizhuiDamageTarget.remove(trigger.targets[i]);
											}
											for (var i = 0; i < trigger.targets.length; i++) {
												player.storage.lg_shengfeishizhuiDirectTarget.remove(trigger.targets[i]);
											}
										}
									},
								},
								damage: {
									forced: true,
									popup: false,
									trigger: {
										source: 'damageBegin',
									},
									content() {
										if (trigger.card && player.storage.lg_shengfeishizhuiDamageCard.includes(trigger.card)) {
											if (player.storage.lg_shengfeishizhuiDamageTarget.includes(trigger.player)) {
												player.popup('圣妃失坠', 'thunder');
												var a = Math.floor(player.storage.lg_shalubaochang / 2);
												trigger.num += a;
											}
										}
									},
								},
							},
						},
						lg_kelinxide_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_shouhufangzhen: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filterTarget(card, player, target) {
								return target != player && !target.isMin() && player.hp == player.countCards('h', { suit: 'diamond' });
							},
							delay: false,
							content() {
								'step 0';
								var list = [];
								for (var i = 0; i < lib.inpile.length; i++) {
									if (lib.card[lib.inpile[i]].subtype == 'equip5') {
										list.push(lib.inpile[i]);
									}
								}
								if (!list.length) {
									event.finish();
									return;
								}
								event.card1 = game.createCard(list.randomGet());
								event.card2 = game.createCard(list.randomGet());
								player.$draw(event.card1);
								target.$draw(event.card2);
								('step 1');
								player.equip(event.card1);
								player.changeHujia();
								('step 2');
								target.equip(event.card2);
								target.changeHujia();
							},
							ai: {
								order: 11,
								result: {
									player: 1,
									target(player, target) {
										if (target.getEquip(5)) return 0;
										return 1;
									},
								},
							},
						},
						lg_shuoguang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'loseAfter',
							},
							filter(e, p) {
								if (!e.player.isIn()) return false;
								if (e.player == p) return false;
								if (p.countCards('h')) return false;
								if (e.player.countCards('h')) return false;
								return e.hs && e.hs.length;
							},
							check: (e, p) => get.attitude(e.player, p) > 0,
							content() {
								player.draw(2);
								trigger.player.draw(2);
							},
						},
						lg_jinshu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'useCardAfter',
							},
							forced: true,
							filter(event, player) {
								if (event.card.suit != 'diamond') return false;
								return event.cards && event.cards.filterInD().length;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_jinshu'), '将' + get.translation(trigger.cards) + '交给一名其他角色', function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										if (target.hasJudge('lebu')) return 0;
										var att = get.attitude(_status.event.player, target);
										if (att < 3) return 0;
										if (target.hasSkillTag('nogain')) att /= 10;
										return att / (1 + get.distance(player, target, 'absolute'));
									});
								('step 1');
								if (result.bool) {
									result.targets[0].gain(trigger.cards.filterInD(), 'gain2');
								}
							},
						},
						lg_amier_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_lunhui: {
							usable: 3,
							trigger: {
								player: 'useCard',
							},
							forced: true,
							filter(event, player) {
								return get.type(event.card) != 'equip' && player.countCards('h', { color: get.color(event.card) }) > 0;
							},
							content() {
								'step 0';
								var cards = player.getCards('h', { suit: trigger.card.suit });
								if (!cards.length) {
									cards = player.getCards('h', { color: get.color(trigger.card) });
								}
								if (!cards.length) {
									event.finish();
									return;
								}
								event.chosen = cards.randomGet();
								('step 1');
								var card = event.chosen;
								player.lose(card, ui.discardPile);
								player.$throw(card, 1000);
								game.log(player, '重铸了', card);
								('step 2');
								player.draw(2, 'bottom').log = false;
							},
							ai: {
								pretao: true,
							},
						},
						lg_shiqikuangsan0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: ['phaseEnd', 'phaseUseBefore'],
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_shiqikuangsan0 = 0;
								player.markSkill('lg_shiqikuangsan0');
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 240;
							},
							forced: true,
							content() {
								player.storage.lg_shiqikuangsan0 += 5;
								player.markSkill('lg_shiqikuangsan0');
							},
						},
						lg_shiqikuangsan00: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'recoverBegin',
								source: 'damageEnd',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 240;
							},
							forced: true,
							content() {
								player.storage.lg_shiqikuangsan0 += 5;
								player.markSkill('lg_shiqikuangsan0');
							},
						},
						lg_xuwu: {
							mark: true,
							ai: {
								respondShan: true,
								respondSha: true,
								save: true,
								skillTagFilter(player, tag, arg) {
									var event = _status.event;
									var cardPile = Array.from(ui.cardPile.childNodes);
									if (!cardPile.length) return false;
									cardPile = cardPile.slice(0, Math.min(3, cardPile.length));
									for (var i = 0; i < cardPile.length; i++) {
										if (tag == 'respondSha') {
											if (cardPile[i].name == 'sha') return true;
										} else if (tag == 'respondShan') {
											if (cardPile[i].name == 'shan') return true;
										} else if (tag == 'save') {
											if (cardPile[i].name == 'jiu' || cardPile[i].name == 'tao') return true;
										}
									}
									return false;
								},
							},
							hiddenCard(player, name) {
								var cardPile = Array.from(ui.cardPile.childNodes);
								if (!cardPile.length) return false;
								cardPile = cardPile.slice(0, Math.min(3, cardPile.length));
								return cardPile.some((i) => i.name == name);
							},
							filter(event, player) {
								if (event.responded || event.skill) return false;
								var cardPile = Array.from(ui.cardPile.childNodes);
								if (!cardPile.length) return false;
								cardPile = cardPile.slice(0, Math.min(3, cardPile.length));
								return cardPile.some((i) => event.filterCard && event.filterCard(i, player, event));
							},
							mod: {
								cardEnabled2(card, player) {
									if (_status.event.skill && get.itemtype(card) == 'card' && card.hasGaintag('lg_xuwu')) return false;
								},
							},
							intro: {
								mark(dialog, storage, player) {
									var cardPile = Array.from(ui.cardPile.childNodes);
									if (!cardPile.length) return '';
									cardPile = cardPile.slice(0, Math.min(3, cardPile.length));
									if (player.isUnderControl(true)) {
										dialog.addAuto(cardPile);
									} else {
										return '';
									}
								},
							},
							trigger: {
								player: ['chooseToRespondBegin', 'chooseToUseBegin'],
							},
							forced: true,
							lastDo: true,
							copy(cards) {
								var result = [];
								for (var i of cards) {
									var card = ui.create.card(ui.special);
									card.init([i.suit, i.number, i.name, i.nature]);
									//card.storage.vanish=true;
									(card.cardid = i.cardid), (card.wunature = i.wunature), (card.storage = i.storage), (card.relatedCard = i);
									result.push(card);
								}
								return result;
							},
							contentx() {
								'step 0';
								if (trigger.result.bool) {
									if (trigger.onresult) {
										trigger.onresult(trigger.result);
										delete trigger.onresult;
									}
								}
								('step 1');
								player.lose(event.cards, ui.special)._triggered = null;
								('step 2');
								for (var i of event.cards) {
									i.fix();
									i.remove();
									i.destroyed = true;
								}
							},
							content() {
								'step 0';
								var cardPile = Array.from(ui.cardPile.childNodes);
								cardPile = cardPile.slice(0, Math.min(3, cardPile.length));
								event.cards = lib.skill.lg_xuwu.copy(cardPile);
								player.directgains(event.cards, null, 'lg_xuwu');
								('step 1');
								var evt = trigger;
								var onresult = false;
								if (evt.onresult) {
									onresult = evt.onresult;
								}
								var next2 = game.createEvent('lg_xuwu_clear', false);
								next2.cards = event.cards;
								next2.player = player;
								next2._trigger = evt;
								next2.setContent(lib.skill.lg_xuwu.contentx);
								event.next.remove(next2);
								evt.after.push(next2);
								evt.onresult = function (result) {
									if (evt.after.includes(next2)) {
										evt.after.remove(next2);
										evt.next.push(next2);
									}
									if (result.cards && result.cards.length && (result.cards[0].hasGaintag('lg_xuwu') || event.cards.includes(result.cards[0]))) {
										var card2 = result.cards[0];
										result.cards[0] = result.cards[0].relatedCard;
										var cardx = result.cards[0];
										result.card = {
											name: card2.name,
											suit: card2.suit,
											number: card2.number,
											nature: get.nature(card2),
											cardid: cardx.cardid,
											wunature: cardx.wunature,
											storage: cardx.storage,
											cards: [cardx],
										};
									}
									if (onresult) onresult.apply(evt, arguments);
									delete evt.onresult;
								};
							},
						},
						lg_shiqikuangsan000: {
							audio: 'ext:幻颜风华/At dawn:2',
							usable: 1,
							trigger: {
								player: ['damageBegin', 'loseHpBegin'],
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 > 5;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.storage.lg_shiqikuangsan0 -= 10;
								player.markSkill('lg_shiqikuangsan0');
							},
						},
						lg_yizhidan: {
							trigger: {
								player: 'useCardToPlayered',
							},
							logTarget: 'target',
							filter: (e) => e.card.name == 'sha' && e.target.countCards('h'),
							check: (e, p) => get.effect(e.target, e.card, p, p) > 0,
							content() {
								'step 0';
								var card = trigger.target.getCards('h').randomGet();
								trigger.target.showCards(card, '一之弹');
								event.card = card;
								if (get.color(trigger.card) == get.color(card)) {
									trigger.parent.directHit.add(trigger.target);
									event.finish();
								}
								('step 1');
								trigger.target.discard(event.card, player, 'notBySelf');
								trigger.target.draw('bottom');
								player.storage.lg_shiqikuangsan0 -= 15;
								player.markSkill('lg_shiqikuangsan0');
							},
						},
						lg_yizhidan0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_yizhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 15;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_shengfeishizhui1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_shengfeishizhuiBegin',
							},
							forced: true,
							content() { },
						},
						lg_erzhidan: {
							trigger: {
								global: 'phaseJudgeBegin',
							},
							filter(event, player) {
								return player.countDiscardableCards(player, 'he');
							},
							forced: true,
							content() {
								'step 0';
								player.gainPlayerCard(trigger.player, 1, 'h');
								player.chooseToDiscard('二之弹<br/><br/>对' + get.translation(trigger.player) + '发动此技能?', 'he').ai = function (card) {
									if (get.attitude(player, trigger.player) > 0 && trigger.player.countCards('j', 'lebu')) return 8 - get.value(card) && card.suit == 'club';
									if (get.attitude(player, trigger.player) < 0) return 4 - get.value(card);
									return 0;
								};
								('step 1');
								if (result.bool) {
									if (result.cards[0].suit == 'club') {
										trigger.player.addTempSkill('lg_erzhidan_adjust');
										trigger.player.addTempSkill('lg_erzhidan_red');
										player.storage.lg_shiqikuangsan0 -= 30;
										player.markSkill('lg_shiqikuangsan0');
									} else {
										trigger.player.addTempSkill('lg_erzhidan_adjust');
										trigger.player.addTempSkill('lg_erzhidan_black');
										player.storage.lg_shiqikuangsan0 -= 30;
										player.markSkill('lg_shiqikuangsan0');
									}
								}
							},
							subSkill: {
								adjust: {
									trigger: {
										player: 'phaseUseBefore',
									},
									_priority: 100,
									forced: true,
									popup: false,
									content() {
										trigger.cancel();
										player.removeSkill('lg_erzhidan_adjust');
									},
								},
								red: {
									trigger: {
										player: 'phaseDrawAfter',
									},
									forced: true,
									popup: false,
									mark: true,
									intro: {
										marktext: '刻',
										content: '二之弹',
									},
									content() {
										player.phaseUse();
										player.removeSkill('lg_erzhidan_red');
									},
								},
								black: {
									trigger: {
										player: 'phaseDiscardAfter',
									},
									forced: true,
									popup: false,
									mark: true,
									intro: {
										marktext: '刻',
										content: '二之弹',
									},
									content() {
										player.phaseUse();
										player.removeSkill('lg_erzhidan_black');
									},
								},
							},
						},
						lg_erzhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_erzhidanBefore',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 30;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_sanzhidan: {
							trigger: {
								source: 'damageSource',
							},
							forced: true,
							filter(event, player) {
								if (!event.card || event.card.name != 'sha') return false;
								return game.hasPlayer(function (current) {
									return current.isDamaged() && current.isMinHp();
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_sanzhidan'), (c, p, t) => t.isDamaged() && t.isMinHp())
									.set('ai', function (target) {
										var player = get.player();
										return get.attitude(player, target);
									});
								('step 1');
								if (result.bool) {
									var t = result.targets[0];
									t.draw(3);
									player.storage.lg_shiqikuangsan0 -= 45;
									player.markSkill('lg_shiqikuangsan0');
								}
							},
						},
						lg_sanzhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_sanzhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 45;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_sizhidan: {
							trigger: {
								target: 'useCardToBefore',
							},
							_priority: 5.9,
							filter(event, player) {
								return event.player != player;
							},
							content() {
								'step 0';
								var effect = get.effect(player, trigger.card, trigger.player, player);
								player.judge(function (card) {
									switch (card.suit) {
										case 'spade':
											return -effect;
										case 'club':
											return 1;
										default:
											return 0;
									}
								});
								('step 1');
								switch (result.suit) {
									case 'spade': {
										trigger.cancel();
										player.storage.lg_shiqikuangsan0 -= 60;
										player.markSkill('lg_shiqikuangsan0');
										var hp = player.hp;
										player.init('lg_shiqikuangsan');
										player.hp = hp;
										player.update();
										ui.clear();
										break;
									}
									case 'club': {
										player.draw();
										player.phaseUse();
										player.storage.lg_shiqikuangsan0 -= 60;
										player.markSkill('lg_shiqikuangsan0');
										break;
									}
								}
							},
							ai: {
								effect: {
									target(card, player, target) {
										return 0.7;
									},
								},
								threaten: 0.8,
							},
						},
						lg_sizhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_sizhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 60;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_wuzhidan: {
							trigger: {
								global: 'judge',
							},
							content() {
								'step 0';
								var cards = get.cards(5);
								game.cardsGotoOrdering(cards);
								player.showCards(cards, '五之弹');
								event.cards = cards;
								player.chooseCardButton(cards, '五之弹', '选择一张♠️️牌？', [1, 1]).set('filterButton', function (button) {
									return button.link.suit == 'spade';
								});
								('step 1');
								if (result.bool) {
									event.link = result.links[0];
								} else {
									event.finish();
									return;
								}
								('step 2');
								player.storage.lg_shiqikuangsan0 -= 75;
								player.markSkill('lg_shiqikuangsan0');
								player
									.chooseBool(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + '打出' + get.translation(event.link) + '代替之;或你获得' + get.translation(event.link))
									.set('ai', function (card) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										var judging = _status.event.judging;
										var links = _status.event.links;
										var result = trigger.judge(links) - trigger.judge(judging);
										var attitude = get.attitude(player, trigger.player);
										if (attitude == 0 || result == 0) return false;
										if (attitude > 0) {
											return result > 0;
										} else {
											return result < 0;
										}
									})
									.set('judging', trigger.player.judging[0])
									.set('links', event.link);
								('step 3');
								if (result.bool) {
									player.respond([event.link], 'highlight', 'noOrdering');
									event._result = { bool: true, cards: [event.link] };
								} else {
									player.gain(event.link, 'gain2', 'log');
									event.finish();
									return;
								}
								('step 4');
								if (result.bool) {
									if (trigger.player.judging[0].clone) {
										trigger.player.judging[0].clone.classList.remove('thrownhighlight');
										game.broadcast(function (card) {
											if (card.clone) {
												card.clone.classList.remove('thrownhighlight');
											}
										}, trigger.player.judging[0]);
										game.addVideo('deletenode', player, get.cardsInfo([trigger.player.judging[0].clone]));
									}
									game.cardsDiscard(trigger.player.judging[0]);
									trigger.player.judging[0] = result.cards[0];
									trigger.orderingCards.addArray(result.cards);
									game.log(trigger.player, '的判定牌改为', result.cards[0]);
								}
							},
							ai: {
								tag: {
									rejudge: 1,
								},
							},
						},
						lg_wuzhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_wuzhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 75;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_liuzhidan: {
							ai: {
								moreDraw: true,
							},
							trigger: {
								player: 'phaseDiscardBefore',
							},
							nobracket: true,
							filter(event, player) {
								return player.countUsed() > 0;
							},
							content() {
								player.next.draw(Math.min(player.countUsed()));
								player.next.phaseUse();
								player.storage.lg_shiqikuangsan0 -= 90;
								player.markSkill('lg_shiqikuangsan0');
							},
							init(player) {
								player.storage.lg_liuzhidan = true;
							},
							intro: {
								content(storage, player) {
									if (_status.currentPhase == player) return '已使用' + player.countUsed() + '张牌';
								},
							},
						},
						lg_liuzhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_liuzhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 90;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_qizhidan: {
							trigger: {
								player: ['damage'],
							},
							filter(event, player) {
								return event.source && event.source != player && event.num > 0;
							},
							check(event, player) {
								if (event.source.hasSkill('lg_qizhidan_sk')) return false;
								return get.attitude(player, event.source) <= 0;
							},
							logTarget: 'source',
							prompt2(event, player) {
								return '对' + get.translation(event.source) + '发动此技能？';
							},
							_priority: 100,
							content() {
								player.storage.lg_shiqikuangsan0 -= 105;
								player.markSkill('lg_shiqikuangsan0');
								trigger.source.chooseToDiscard(2, 'h', true, { suit: 'spade' });
								trigger.source.addSkill('lg_qizhidan_sk');
								trigger.source.markSkillCharacter('lg_qizhidan_sk', player, '七之弹', '时间静止中');
							},
							ai: {
								expose: 0.3,
								maixie: true,
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (get.tag(card, 'damage')) {
											if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
											if (!target.hasFriend()) return;
											if (player.hasSkill('lg_qizhidan_sk')) return;
											return [1, 0, 1, -1];
										}
									},
								},
							},
							subSkill: {
								sk: {
									trigger: {
										player: 'phaseBefore',
									},
									onremove(player) {
										player.unmarkSkill('lg_qizhidan_sk');
									},
									forced: true,
									content() {
										player.removeSkill('lg_qizhidan_sk');
										trigger.cancel();
										player.turnOver();
									},
									charlotte: true,
								},
							},
						},
						lg_qizhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_qizhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 105;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_bazhidan: {
							trigger: {
								target: 'useCardToBefore',
							},
							_priority: 7,
							filter(event, player) {
								return event.card.suit == 'club' && event.player != player;
							},
							content() {
								player.addSkill('lg_bazhidan2');
								player.storage.lg_shiqikuangsan0 -= 120;
								player.markSkill('lg_shiqikuangsan0');
								trigger.target = trigger.player;
								trigger.player = player;
								trigger.untrigger();
								trigger.trigger('useCardToBefore');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(29% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(43% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(57% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan');
							},
							ai: {
								result: {
									target: -1,
									player: 1,
								},
							},
						},
						lg_bazhidan2: {
							trigger: {
								player: 'lg_bazhidanAfter',
							},
							forced: true,
							content() {
								trigger.target = trigger.player;
								trigger.player = player;
								trigger.untrigger();
								trigger.trigger('useCardToBefore');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(29% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan2');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(43% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan2');
								player.$skill('八之弹');
								var fellow = game.addFellow(1, 'lg_shiqikuangsan');
								fellow.style.left = 'calc(57% - 56px)';
								fellow.style.top = 'calc(44%)';
								fellow.addSkill('baiban');
								fellow.addSkill('lg_fenshen');
								fellow.classList.add('minskin');
								fellow.side = player.side;
								fellow.identity = player.identity;
								if (fellow.identity == 'zhu') fellow.identity = 'zhong';
								fellow.showIdentity();
								fellow.node.identity.dataset.color = 'zhu';
								game.log(player, '<span style="color: red">召唤了【分身】</span>');
								player.awakenSkill('lg_bazhidan2');
								player.removeSkill('lg_bazhidan2');
							},
							ai: {
								result: {
									target: -1,
									player: 1,
								},
							},
						},
						lg_fenshen: {
							nobracket: true,
							ai: {
								threaten: 4,
							},
						},
						lg_bazhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_bazhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 120;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_jiuzhidan: {
							init(player) {
								player.storage.lg_jiuzhidan_sha = [];
								player.storage.lg_jiuzhidan_trick = [];
							},
							intro: {
								content(content, player) {
									var str = '';
									if (player.storage.lg_jiuzhidan_sha.length) {
										str += '你使用杀指定过:';
										str += get.translation(player.storage.lg_jiuzhidan_sha);
										str += '</br>';
									}
									if (player.storage.lg_jiuzhidan_trick.length) {
										str += '你使用普通锦囊牌指定过:';
										str += get.translation(player.storage.lg_jiuzhidan_trick);
									}
									if (str == '') {
										str += '没有使用杀或普通锦囊牌指定过其他角色为目标';
									}
									return str;
								},
							},
							trigger: {
								player: 'useCardBefore',
							},
							filter(event, player) {
								//if(event.parent.name=='lg_jiuzhidan') return false;
								if (event.card.name != 'sha' && get.type(event.card) != 'trick') return false;
								if (event.targets.length != 1) return false;
								return game.hasPlayer(function (current) {
									if (event.targets.includes(current)) return false;
									if (event.card.name == 'sha') return player.storage.lg_jiuzhidan_sha.includes(current);
									if (get.type(event.card) == 'trick') return player.storage.lg_jiuzhidan_trick.includes(current);
									return false;
								});
							},
							_priority: 899,
							forced: true,
							content() {
								'step 0';
								event.extars = game
									.filterPlayer(function (current) {
										if (trigger.targets.includes(current)) return false;
										if (trigger.card.name == 'sha' && player.storage.lg_jiuzhidan_sha.includes(current)) {
											return true;
										} else if (get.type(trigger.card) == 'trick' && player.storage.lg_jiuzhidan_trick.includes(current)) {
											return true;
										}
										return false;
									})
									.slice(0);
								player.chooseBool(get.prompt('lg_jiuzhidan'), '令' + get.translation(event.extars) + '成为这张' + get.translation(trigger.card) + '的额外目标？').ai = function (event, player) {
									var eff = 0,
										tri = _status.event.getTrigger();
									for (var i = 0; i < event.extars.length; i++) {
										eff += get.effect(event.extars[i], tri.card, player, player);
									}
									return eff > 0;
								};
								('step 1');
								if (result.bool) {
									trigger.targets.addArray(event.extars);
								}
							},
							ai: {
								expose: 0.3,
								effect: {
									player(card, player, target) {
										if (player != target) {
											if (card.name == 'sha') {
												if (!player.storage.lg_jiuzhidan_sha.includes(target)) return [1, 2];
											}
											if (get.type(card) == 'trick') {
												if (!player.storage.lg_jiuzhidan_trick.includes(target)) return [1, 2];
											}
										}
									},
								},
							},
							group: ['lg_jiuzhidan_rec'],
							subSkill: {
								rec: {
									trigger: {
										global: 'useCardToEnd',
									},
									forced: true,
									filter(event, player) {
										if (!event.card) return false;
										if (event.player != player) return false;
										if (event.target == player) return false;
										if (event.card.name == 'sha') {
											return !player.storage.lg_jiuzhidan_sha.includes(event.target);
										}
										if (get.type(event.card) == 'trick') {
											return !player.storage.lg_jiuzhidan_trick.includes(event.target);
										}
										return false;
									},
									content() {
										if (trigger.card.name == 'sha') {
											player.storage.lg_jiuzhidan_sha.push(trigger.target);
										}
										if (get.type(trigger.card) == 'trick') {
											player.storage.lg_jiuzhidan_trick.push(trigger.target);
										}
										player.markSkill('lg_jiuzhidan');
									},
								},
							},
						},
						lg_jiuzhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_jiuzhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 135;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_jiuzhidan2: {
							nobracket: true,
							trigger: {
								global: 'discardEnd',
							},
							prompt(event, player) {
								var card = [];
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (get.color(i) == 'black') card.push(i);
									}
								return '九之弹<br/><br/>获得' + get.translation(card);
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (get.color(i) == 'black' && get.position(i) == 'd') return true;
									}
								return false;
							},
							content() {
								'step 0';
								if (trigger.delay == false) game.delay();
								('step 1');
								var cards = [];
								for (var i = 0; i < trigger.cards.length; i++) {
									if (get.color(trigger.cards[i]) == 'black' && get.position(trigger.cards[i]) == 'd') {
										if (game.me != player) {
											if (trigger.cards[i].name != 'du') {
												cards.push(trigger.cards[i]);
											}
										} else cards.push(trigger.cards[i]);
									}
								}
								if (cards.length) {
									player.gain(cards, 'log');
									player.$gain(cards);
								}
							},
						},
						lg_shizhidan: {
							nobracket: true,
							trigger: {
								player: 'phaseBegin',
							},
							forced: true,
							filter(event, player) {
								if (player.storage.lg_shizhidan.length == 0) return false;
								var card = player.getCards('h');
								for (var i = 0; i < card.length; i++) {
									if (player.storage.lg_shizhidan && player.storage.lg_shizhidan.includes(card[i])) return true;
								}
								return false;
							},
							content() {
								'step 0';
								event.cards = [];
								var card = player.getCards('h');
								for (var i = 0; i < card.length; i++) {
									if (player.storage.lg_shizhidan && player.storage.lg_shizhidan.includes(card[i])) event.cards.push(card[i]);
								}
								player
									.chooseTarget('十之弹<br/><br/>令一名其他角色获得' + get.translation(event.cards), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										if (get.attitude(player, target) > 0) {
											if (target.isMinHandcard()) return 100;
											if (target.isMinHp()) return 99;
											return 97;
										}
										return false;
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									player.line(target, 'green');
									target.gain(event.cards, player);
									player.give(event.cards, target);
									player.changeHujia(Math.min(event.cards.length));
									player.storage.lg_shiqikuangsan0 -= 150;
									player.markSkill('lg_shiqikuangsan0');
								}
							},
							ai: {
								moreDraw: true,
								threaten: 2,
							},
							group: 'lg_shizhidan_push',
							subSkill: {
								push: {
									popup: false,
									forced: true,
									trigger: {
										player: 'phaseBefore',
									},
									init(player) {
										player.storage.lg_shizhidan = [];
									},
									filter(event, player) {
										return player.countCards('h') > 0;
									},
									content() {
										'step 0';
										player.storage.lg_shizhidan = [];
										('step 1');
										var card = player.getCards('h');
										for (var i = 0; i < card.length; i++) {
											if (card[i]) player.storage.lg_shizhidan.push(card[i]);
										}
									},
								},
							},
						},
						lg_shizhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_shizhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 150;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_shiyizhidan: {
							trigger: {
								global: 'damageBegin',
							},
							check(event, player) {
								return get.attitude(player, event.player) >= 0;
							},
							logTarget: 'player',
							filter(event, player) {
								if (event.source && event.source == _status.currentPhase) return false;
								return event.player.countGainableCards(player, 'he');
							},
							content() {
								player.storage.lg_shiqikuangsan0 -= 165;
								player.markSkill('lg_shiqikuangsan0');
								trigger.cancel();
								player.swapHandcards(trigger.player);
								trigger.source.out(10);
							},
							ai: {
								threaten: 3,
							},
						},
						lg_shiyizhidan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_shiyizhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 165;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_shierzhidan: {
							nobracket: true,
							trigger: {
								player: 'phaseAfter',
							},
							_priority: 100,
							filter(event, player) {
								return !event.lg_shierzhidan;
							},
							content() {
								'step 0';
								event.players = game.filterPlayer();
								event.players.remove(player);
								event.players.sortBySeat();
								player.recover(Math.min(game.countPlayer()), 'nodelay');
								var next = player.phase('nodelay');
								next.lg_shierzhidan = true;
								('step 1');
								if (event.players.length) {
									event.current = event.players.shift();
									player.line(event.current, 'fire');
									player.addTempSkill('lg_shierzhidan1', { player: 'phaseEnd' });
									player.storage.lg_shiqikuangsan0 -= 180;
									player.markSkill('lg_shiqikuangsan0');
								} else {
									event.finish();
									return;
								}
								('step 2');
								event.current.lg_shierzhidan = {};
								event.current.lg_shierzhidan.name = event.current.name1 ? event.current.name1 : event.current.name;
								event.current.lg_shierzhidan.name2 = event.current.name2;
								event.current.lg_shierzhidan.hp = event.current.hp;
								event.current.lg_shierzhidan.maxHp = event.current.maxHp;
								event.current.lg_shierzhidan.storage = Object.assign({}, event.current.storage);
								if (event.current.disabledSlots) {
									event.current.lg_shierzhidan.disabledSlots = Object.assign({}, event.current.disabledSlots);
								}
								event.current.lg_shierzhidan.marks = Object.assign({}, event.current.marks);
								event.current.lg_shierzhidan.skills = Object.assign([], event.current.skills);
								event.current.lg_shierzhidan.forbiddenSkills = Object.assign({}, event.current.forbiddenSkills);
								event.current.lg_shierzhidan.hiddenSkills = Object.assign([], event.current.hiddenSkills);
								event.current.lg_shierzhidan.skipList = Object.assign([], event.current.skipList);
								event.current.lg_shierzhidan.disabledSkills = Object.assign({}, event.current.disabledSkills);
								event.current.lg_shierzhidan.tempSkills = Object.assign({}, event.current.tempSkills);
								event.current.lg_shierzhidan.awakenedSkills = Object.assign([], event.current.awakenedSkills);
								event.current.lg_shierzhidan.cardh = event.current.getCards('h');
								event.current.lg_shierzhidan.carde = event.current.getCards('e');
								event.current.lg_shierzhidan.cardj = event.current.getCards('j');
								event.current.lg_shierzhidan.additionalSkills = Object.assign({}, event.current.additionalSkills);
								event.current.lg_shierzhidan.actionHistory = Object.assign([], event.current.actionHistory);
								event.current.lg_shierzhidan.roundStart = _status.roundStart;
								event.current.lg_shierzhidan.className = event.current.className;
								event.current.lg_shierzhidan.stat = Object.assign([], event.current.stat);
								('step 3');
								event.goto(1);
							},
							group: ['lg_shierzhidan_end'],
							subSkill: {
								end: {
									popup: false,
									silent: true,
									charlotte: true,
									trigger: {
										player: 'phaseEnd',
									},
									_priority: 10,
									filter(event, player) {
										if (event.rain_acg) return true;
										return false;
									},
									content() {
										'step 0';
										event.players = game.filterPlayer();
										event.players.remove(player);
										event.players.sortBySeat();
										('step 1');
										if (event.players.length) {
											event.current = event.players.shift();
											player.line(event.current, 'fire');
										} else {
											event.finish();
											return;
										}
										('step 2');
										if (!event.current.lg_shierzhidan || !event.current.isAlive()) {
											event.goto(4);
										}
										('step 3');
										event.current.discard(event.current.getCards('hej'))._triggered = null;
										var current = event.current;
										var lg_shierzhidan = current.lg_shierzhidan;
										for (var mark in lg_shierzhidan.marks) {
											event.current.marks[mark] = lg_shierzhidan.marks[mark];
											event.current.markSkill(mark.skill);
										}
										event.current.name = lg_shierzhidan.name;
										event.current.name1 = lg_shierzhidan.name;
										event.current.name2 = lg_shierzhidan.name2;
										event.current.node.avatar.setBackground(lg_shierzhidan.name, 'character');
										event.current.node.avatar2.setBackground(lg_shierzhidan.name2, 'character');
										event.current.maxHp = lg_shierzhidan.maxHp;
										event.current.hp = lg_shierzhidan.hp;
										event.current.skills = lg_shierzhidan.skills;
										event.current.skipList = lg_shierzhidan.skipList;
										event.current.additionalSkills = lg_shierzhidan.additionalSkills;
										event.current.hiddenSkills = lg_shierzhidan.hiddenSkills;
										event.current.forbiddenSkills = lg_shierzhidan.forbiddenSkills;
										event.current.disabledSkills = lg_shierzhidan.disabledSkills;
										event.current.tempSkills = lg_shierzhidan.tempSkills;
										event.current.awakenedSkills = lg_shierzhidan.awakenedSkills;
										event.current.disabledSlots = lg_shierzhidan.disabledSlots;
										event.current.storage = lg_shierzhidan.storage;
										if (!event.current.storage._disableJudge) {
											game.broadcastAll(function (current) {
												current.$enableJudge();
											}, current);
										}
										event.current.stat = lg_shierzhidan.stat;
										event.current.className = lg_shierzhidan.className;
										event.current.actionHistory = lg_shierzhidan.actionHistory;
										for (var a = 0; a < lg_shierzhidan.cardh.length; a++) {
											var card = lg_shierzhidan.cardh[a];
											event.current.gain(card)._triggered = null;
										}
										for (var b = 0; b < lg_shierzhidan.carde.length; b++) {
											var card = lg_shierzhidan.carde[b];
											event.current.equip(card)._triggered = null;
										}
										for (var c = 0; a < lg_shierzhidan.cardj.length; c++) {
											var card = lg_shierzhidan.cardj[c];
											event.current.addJudge(card)._triggered = null;
										}
										event.current.update();
										game.updateRoundNumber();
										delete event.current.lg_shierzhidan;
										('step 4');
										event.goto(1);
									},
									forced: true,
								},
							},
						},
						lg_shierzhidan0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_shierzhidanBegin',
							},
							filter(event, player) {
								return player.storage.lg_shiqikuangsan0 < 180;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_shiqikuangsan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_shierzhidan1: {
							trigger: {
								global: 'damageBegin',
							},
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (!player.inRange(event.player)) return false;
								if (!event.player.countCards('h')) return false;
								return event.card;
							},
							logTarget: 'player',
							content() {
								'step 0';
								event.cardx = trigger.player.getCards('h').randomGets(3);
								trigger.player.showCards(event.cardx);
								('step 1');
								var list = [];
								for (var i = 0; i < event.cardx.length; i++) {
									if (get.type(event.cardx[i]) == get.type(trigger.card) && lib.filter.cardEnabled(event.cardx[i], player)) {
										list.push(event.cardx[i]);
									}
								}
								if (list.length <= 0) event.finish();
								else if (list.length == 1) event.cd = list[0];
								else {
									var next = player.chooseButton();
									next.set('createDialog', ['使用其中一张牌', list]);
									next.set('ai', function (button) {
										return get.buttonValue(button);
									});
								}
								('step 2');
								if (result.bool) {
									event.cd = result.links[0];
								}
								('step 3');
								if (event.cd) {
									trigger.player.lose(event.cd, ui.special);
									player.chooseUseTarget(event.cd);
									player.draw(12);
									player.phaseUse();
								}
							},
						},
						lg_xuwu1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'drawBegin',
							},
							forced: true,
							content() {
								trigger.cancel();
							},
						},
						lg_jiuzhidan11: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_jiuzhidanAfter',
							},
							forced: true,
							content() {
								player.storage.lg_shiqikuangsan0 -= 135;
								player.markSkill('lg_shiqikuangsan0');
								player.addTempSkill('lg_jiuzhidan2', { player: 'recoverEnd' });
							},
						},
						lg_kekedi: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: ['lg_yizhidanAfter', 'lg_erzhidanAfter', 'lg_sanzhidanAfter', 'lg_sizhidanAfter', 'lg_wuzhidanAfter', 'lg_liuzhidanAfter', 'lg_qizhidanAfter', 'lg_bazhidanAfter', 'lg_jiuzhidanAfter', 'lg_shizhidanAfter', 'lg_shiyizhidanAfter', 'lg_shierzhidanAfter'],
							},
							forced: true,
							content() { },
						},
						lg_shishizhicheng: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'lg_shishizhicheng00After',
							},
							forced: true,
							content() { },
						},
						lg_shishizhicheng00: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								global: 'phaseUseBegin',
							},
							prompt(event, player) {
								return '食时之城<br/><br/>对' + get.translation(event.player) + '发动此技能？';
							},
							check(event, player) {
								return get.attitude(player, event.player) < 0;
							},
							init(player) {
								player.storage.lg_shishizhicheng00 = [];
								player.storage.lg_shishizhicheng00Use = 0;
							},
							filter(event, player) {
								return event.player != player;
							},
							popup: false,
							content() {
								var target = trigger.player;
								player.popup('食时之城', 'fire');
								player.line(target, 'fire');
								player.storage.lg_shishizhicheng00.push(target);
								target.draw();
								target.chooseToDiscard(2, 'he', true, { suit: 'spade' });
							},
							ai: {
								expose: 0.1,
							},
							group: ['lg_shishizhicheng00_sha', 'lg_shishizhicheng00_use'],
							subSkill: {
								use: {
									popup: false,
									forced: true,
									trigger: {
										global: 'useCard',
									},
									content() {
										var target = trigger.player;
										if (player.storage.lg_shishizhicheng00.includes(target) && trigger.card.suit == 'club') {
											player.storage.lg_shishizhicheng00Use++;
										}
									},
								},
								sha: {
									popup: false,
									forced: true,
									trigger: {
										global: 'phaseUseEnd',
									},
									content() {
										var target = trigger.player;
										if (player.storage.lg_shishizhicheng00.includes(target)) {
											player.storage.lg_shishizhicheng00.remove(target);
											if (player.storage.lg_shishizhicheng00Use > player.getAttackRange()) {
												player.popup('食时之城', 'thunder');
												player.useCard({ name: 'sha' }, target);
											}
											player.storage.lg_shishizhicheng00Use = 0;
										}
									},
								},
							},
						},
						lg_buxiunuhuo: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'dyingBegin',
							},
							check(event, player) {
								return get.attitude(player, event.source) <= 0;
							},
							filter(event, player) {
								return event.source && event.source.isAlive() && event.source != player && event.source.countCards('h') > 0;
							},
							logTarget: 'source',
							content() {
								var card = trigger.source.getCards('h').randomGet();
								if (card) {
									player.gain(card, trigger.source);
									if (get.color(card) == 'red') {
										trigger.source.$give(card, player);
										event.redo();
									} else {
										trigger.source.$giveAuto(card, player);
									}
								}
							},
							ai: {
								maixie: true,
								maixie_hp: true,
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
										if (!target.hasFriend()) return false;
										if (get.tag(card, 'damage') && player.countCards('h') > 1) return [1, 0, 0, -1];
									},
								},
							},
						},
						lg_zengeqishi: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'equipBegin',
							},
							content() {
								'step 0';
								player.judge(function (card) {
									var num = game.countPlayer(function (current) {
										return get.distance(player, current, 'attack') <= 1 && player != current && player.getEnemies().includes(current);
									});
									if (num > 0) {
										if (get.type(card) == 'equip') return 1;
									}
									return 0;
								});
								('step 1');
								if (result.color) {
									if (result.type == 'equip') event.goto(2);
									else event.goto(4);
								}
								('step 2');
								player
									.chooseTarget('对攻击范围内的一名其他角色造成2点伤害', function (card, player, target) {
										return get.distance(player, target, 'attack') <= 1 && target != player;
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										return get.damageEffect(target, player, player);
									});
								('step 3');
								if (result.bool) {
									player.line(result.targets[0], 'thunder');
									result.targets[0].damage(2);
								} else event.finish();
								('step 4');
								var num = player.hp - player.countCards('h');
								player.draw(num);
							},
							ai: {
								moreDraw: true,
								threaten: 2,
							},
						},
						lg_kailan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_chimizhinian: {
							trigger: {
								global: 'useCard2',
							},
							audio: 'ext:幻颜风华/audio:2',
							_priority: -1,
							forced: true,
							filter(event, player) {
								if (event.player == player) return false;
								if (event.card.name != 'sha') return false;
								if (!event.targets.includes(player)) return false;
								var info = get.info(event.card);
								if (info.allowMultiple == false) return false;
								if (event.targets && !info.multitarget) {
									if (
										game.hasPlayer(function (current) {
											return current.hasSex('male') && lib.filter.targetEnabled2(event.card, event.player, current) && !event.targets.includes(current);
										})
									) {
										return true;
									}
								}
								return false;
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									position: 'hs',
									filterCard: lib.filter.cardDiscardable,
									filterTarget(card, player, target) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										if (trigger.targets.includes(target)) return false;
										if (!target.hasSex('male')) return false;
										return lib.filter.targetEnabled2(trigger.card, trigger.player, target);
									},
									ai1(card) {
										return get.value(trigger.card) - get.value(card);
									},
									ai2(target) {
										var trigger = _status.event.getTrigger();
										var player = _status.event.player;
										return get.effect(target, trigger.card, player, player);
									},
									prompt: get.prompt('lg_chimizhinian'),
								});
								('step 1');
								if (result.bool) {
									player.discard(result.cards);
									if (!event.isMine()) game.delayx();
									event.targets = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets) {
									game.log(event.targets, '额外成为了' + get.translation(trigger.card) + '的目标');
									trigger.targets.addArray(event.targets);
								}
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (target.countCards('he') == 0) return;
										if (card.name != 'sha') return;
										var min = 1;
										var friend = get.attitude(player, target) > 0;
										var vcard = { name: 'shacopy', nature: card.nature, suit: card.suit };
										var players = game.filterPlayer();
										for (var i = 0; i < players.length; i++) {
											if (player != players[i] && players[i].hasSex('male') && get.attitude(target, players[i]) < 0 && player.canUse(card, players[i], false)) {
												if (!friend) return 0;
												if (get.effect(players[i], vcard, player, player) > 0) {
													if (!player.canUse(card, players[i], false)) {
														return [0, 0.1];
													}
													min = 0;
												}
											}
										}
										return min;
									},
								},
							},
						},
						lg_zhimingchengfa: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'changeHp',
							},
							check(event, player) {
								if (player.hasSkill('lg_zhimingchengfa_temp')) return true;
								var ck = 0;
								for (var i of game.players) {
									//QQ
									if (i.isOut()) continue;
									if (i != player && get.attitude(i, player) < 0) {
										ck++;
									}
								}
								return ck > 1;
							},
							prompt2(event, player) {
								if (player.hasSkill('lg_zhimingchengfa_temp')) return '发动此技能？';
								else return '发动此技能？';
							},
							content() {
								'step 0';
								player
									.chooseTarget('获得一名角色的一张牌', 1, true, function (card, player, target) {
										return target.countCards('he');
									})
									.set('ai', function (target) {
										var att = get.attitude(player, target);
										return -att;
									});
								('step 1');
								event.tar1 = result.targets[0];
								player.gainPlayerCard(event.tar1, 1, 'he', true);
								('step 2');
								if (event.tar1 != player && !player.hasSkill('lg_zhimingchengfa_temp')) var str = '对一名角色造成1点伤害;若为' + get.translation(event.tar1) + ',你弃置两张牌.';
								else var str = '对一名角色造成1点伤害';
								player
									.chooseTarget(str, 1, true, function (card, player, target) {
										return true;
									})
									.set('ai', function (target) {
										var eff = get.damageEffect(target, player, player);
										return eff;
									});
								('step 3');
								event.tar2 = result.targets[0];
								event.tar2.damage(player, 1, 'nocard');
								if (!player.hasSkill('lg_zhimingchengfa_temp')) {
									if (event.tar1 == event.tar2 && event.tar1 != player) {
										player.chooseToDiscard(2, true, 'he');
									}
								} else {
								}
							},
						},
						lg_huilizi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xixueguizhiye1: {
							nobracket: true,
							enable: 'phaseUse',
							usable: 1,
							filterTarget(card, player, target) {
								return target.countCards('h') != target.hp;
							},
							multitarget: true,
							line: false,
							forced: true,
							content() {
								player.popup('吸血鬼之夜', 'fire');
								player.line(target, 'fire');
								if (target.countCards('h') > target.hp) {
									target.damage();
								} else {
									var num = target.hp;
									target.drawTo(num);
									player.drawTo(num);
								}
							},
							ai: {
								order: 10,
								result: {
									target(player, target) {
										return target.hp - target.countCards('h');
									},
								},
							},
						},
						lg_xixueguizhiye: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								player: 'lg_xixueguizhiye1Begin',
							},
							forced: true,
							content() { },
						},
						lg_mingyun: {
							usable: 1,
							trigger: {
								global: 'judge',
							},
							_priority: -10000000000000,
							forced: true,
							content() {
								'step 0';
								var str = get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + '操纵其的命运？';
								player
									.chooseControl('♠️️️', '♥️️️', '♣️️️', '♦️️️', '取消')
									.set('prompt', str)
									.set('ai', function () {
										var judging = _status.event.judging;
										var num = trigger.player.judging[0].number;
										var card1 = { name: judging.name, suit: 'spade', number: num };
										var card2 = { name: judging.name, suit: 'heart', number: num };
										var card3 = { name: judging.name, suit: 'club', number: num };
										var card4 = { name: judging.name, suit: 'diamond', number: num };
										var result1 = trigger.judge(card1) - trigger.judge(judging);
										var result2 = trigger.judge(card2) - trigger.judge(judging);
										var result3 = trigger.judge(card3) - trigger.judge(judging);
										var result4 = trigger.judge(card4) - trigger.judge(judging);
										var att = get.attitude(player, trigger.player);
										if (att == 0 || (result1 == 0 && result2 == 0 && result3 == 0 && result4 == 0)) return '取消';
										if (att > 0) {
											if (result1 >= Math.max(result2, result3, result4)) return '♠️️️';
											if (result2 >= Math.max(result1, result3, result4)) return '♥️️️';
											if (result3 >= Math.max(result1, result2, result4)) return '♣️️️';
											if (result4 >= Math.max(result1, result2, result3)) return '♦️️️';
										} else {
											if (result1 <= Math.min(result2, result3, result4)) return '♠️️️';
											if (result2 <= Math.min(result1, result3, result4)) return '♥️️️';
											if (result3 <= Math.min(result1, result2, result4)) return '♣️️️';
											if (result4 <= Math.min(result1, result2, result3)) return '♦️️️';
										}
									})
									.set('judging', trigger.player.judging[0]);
								('step 1');
								if (['♠️️️', '♥️️️', '♣️️️', '♦️️️'].includes(result.control)) {
									player.popup(result.control);
									game.log(player, '将判定结果的花色改为了', '#y' + result.control);
									if (result.control == '♠️️️') {
										trigger.fixedResult = {
											suit: 'spade',
											color: 'black',
											number: trigger.player.judging[0].number,
										};
									} else if (result.control == '♥️️️') {
										trigger.fixedResult = {
											suit: 'heart',
											color: 'red',
											number: trigger.player.judging[0].number,
										};
									} else if (result.control == '♣️️️') {
										trigger.fixedResult = {
											suit: 'club',
											color: 'black',
											number: trigger.player.judging[0].number,
										};
									} else if (result.control == '♦️️️') {
										trigger.fixedResult = {
											suit: 'diamond',
											color: 'red',
											number: trigger.player.judging[0].number,
										};
									}
								} else {
									event.finish();
								}
							},
							ai: {
								tag: {
									rejudge: 1,
								},
							},
						},
						lg_mingyun2: {
							usable: 1,
							trigger: {
								player: 'useCardToPlayer',
							},
							forced: true,
							filter(event, player) {
								if (event.targets.length != 1 || event.target == player || event.target.hasSkill('nodis')) return false;
								if (event.card.name != 'sha' && get.color(event.card) != 'red') return false;
								var target = event.target;
								let left = [], right = [];
								let left2 = player.previous, right2 = player.next;
								while (left2 && ![target, player].includes(left2) && right2 && ![target, player].includes(right2)) {
									left.push(left2);
									right.push(right2);
									left2 = left2.previous;
									right2 = right2.next;
								}
								if (target == left2) {
									for (var i of left) {
										if (lib.filter.targetEnabled2(event.card, player, i)) return true;
									}
								}
								if (target == right2) {
									for (var i of right) {
										if (lib.filter.targetEnabled2(event.card, player, i)) return true;
									}
								}
								return false;
							},
							content() {
								'step 0';
								var choices = [];
								var target = trigger.target;
								let left = [], right = [];
								let left2 = player.previous, right2 = player.next;
								while (left2 && ![target, player].includes(left2) && right2 && ![target, player].includes(right2)) {
									left.push(left2);
									right.push(right2);
									left2 = left2.previous;
									right2 = right2.next;
								}
								if (target == left2) {
									for (var i of left) {
										if (lib.filter.targetEnabled2(trigger.card, player, i)) {
											choices.push('');
											break;
										}
									}
								}
								if (target == right2) {
									for (var i of right) {
										if (lib.filter.targetEnabled2(trigger.card, player, i)) {
											choices.push('');
											break;
										}
									}
								}
								choices.push('cancel2');
								player.goMad('shaAfter');
								player
									.chooseControl(choices)
									.set('prompt', get.prompt('lg_mingyun2'))
									.set('prompt2', '令自己和' + get.translation(trigger.target) + '某个方向之间的所有角色均成为' + get.translation(trigger.card) + '的目标')
									.set('choices', choices)
									.set('ai', function () {
										var evt = _status.event.getTrigger();
										return lib.skill.saodi.aiJudge(evt.card, evt.player, evt.target, true);
									});
								('step 1');
								if (result.control != 'cancel2') {
									var targets = [];
									if (result.control == '') {
										var current = player.previous;
										while (current != trigger.target) {
											if (lib.filter.targetEnabled2(trigger.card, player, current)) targets.push(current);
											current = current.previous;
										}
									} else {
										var current = player.next;
										while (current != trigger.target) {
											if (lib.filter.targetEnabled2(trigger.card, player, current)) targets.push(current);
											current = current.next;
										}
									}
									event.targets = targets;
									if (!event.isMine() && !event.isOnline()) game.delayx();
								} else event.finish();
								('step 2');
								trigger.targets.addArray(targets);
							},
							ai: {
								effect: {
									player_use(card, player, target) {
										if (!target || player._lg_mingyun2_judging || ui.selected.targets.length || player == target || target.hasSkill('nodis')) return;
										if (typeof card != 'object' || (card.name != 'sha' && get.color(card) != 'red')) return false;
										player._lg_mingyun2_judging = true;
										var effect = lib.skill.saodi.aiJudge(card, player, target);
										delete player._lg_mingyun2_judging;
										if (effect > 0) return [1, effect / Math.max(0.01, get.attitude(player, player))];
									},
								},
							},
						},
						lg_feisemingyun: {
							trigger: {
								global: ['phaseUseSkipped', 'phaseDrawSkipped'],
							},
							audio: 'ext:幻颜风华/audio:2',
							forced: true,
							filter(event, player) {
								if (!player.countCards('h')) return false;
								return true;
							},
							//一名角色跳过摸牌/出牌阶段后,你可以交给一名其他角色所有手牌.若如此做,你选择一项:①其交给你所有♥️️手牌;②其交给你所有♦️️手牌
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_feisemingyun'), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										var att = get.attitude(player, target);
										var diamond = player.countCards('h', { suit: 'diamond' }) + target.countCards('h', { suit: 'diamond' });
										var heart = player.countCards('h', { suit: 'heart' }) + target.countCards('h', { suit: 'heart' });
										var hs = player.countCards('h');
										if (att <= 0) {
											return Math.max(hs - heart, hs - diamond);
										}
										return -1;
									}); //QQQ
								('step 1');
								if (result.bool) {
									var hs = player.getCards('h');
									result.targets[0].$gain2(hs);
									result.targets[0].gain(hs, player);
									game.log(result.targets[0], '获得' + hs.length + '张牌');
									event.tar = result.targets[0];
								} else {
									event.finish();
									return;
								}
								('step 2');
								player.chooseControl('♥️️', '♦️️', function (event, player) {
									if (event.tar.countCards('h', { suit: 'diamond' }) > event.tar.countCards('h', { suit: 'heart' })) return '♦️️';
									return '♥️️';
								});
								('step 3');
								if (result.control == '♥️️') {
									var cards = event.tar.getCards('h', { suit: 'heart' });
									if (cards.length) {
										player.$gain2(cards);
										player.gain(cards, event.tar);
										game.log(player, '获得' + cards.length + '张牌');
									}
								} else {
									var cards = event.tar.getCards('h', { suit: 'diamond' });
									if (cards.length) {
										player.$gain2(cards);
										player.gain(cards, event.tar);
										game.log(player, '获得' + cards.length + '张牌');
									}
								}
							},
						},
						lg_leimiliya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_leimiliya0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseEnd',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_leimiliya0 = 100;
								player.markSkill('lg_leimiliya0');
							},
							filter(event, player) {
								return player.storage.lg_leimiliya0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_leimiliya0 += 5;
								player.markSkill('lg_leimiliya0');
							},
						},
						lg_wuxinposui: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToTargeted',
							},
							filter(event, player) {
								return player.storage.lg_leimiliya0 > 39;
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_wuxinposui.jpg',
							intro: {
								content: '灵力消耗:<br/>40点<br/><br/>符卡效果:<br/>一名角色使用牌指定你为目标时,你可以回复1点体力.若如此做,其不能使用或打出手牌,直到当前回合结束.',
							},
							forced: true,
							subSkill: {
								a: {
									charlotte: true,
									mark: true,
									intro: {
										content: '吾心破碎',
									},
									mod: {
										cardEnabled2(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardUsable(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardRespondable(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardSavable(card, player) {
											if (get.position(card) == 'h') return false;
										},
									},
								},
							},
							content() {
								'step 0';
								if (trigger.player && trigger.player.isAlive() && trigger.player.isDamaged()) {
									player.chooseBool(get.prompt2('lg_wuxinposui', trigger.player), function (event, player) {
										var trigger = _status.event.getTrigger();
										var att = get.attitude(player, trigger.player);
										if (att < 0) return trigger.player.countCards('h') > Math.min(3, trigger.player.hp + 1);
										if (att > 0) return trigger.player.countCards('h') <= Math.max(3, trigger.player.hp + 1);
										return false;
									});
								} else event.finish();
								('step 1');
								if (result.bool) { }
								else event.finish();
								('step 2');
								var num = player.countCards('h', { suit: 'diamond' });
								trigger.player.needsToDiscard(2 * num);
								player.recover();
								player.storage.lg_leimiliya0 -= 40;
								player.markSkill('lg_leimiliya0');
								('step 3');
								trigger.player.addTempSkill('lg_wuxinposui_a');
							},
						},
						lg_feisemingjie: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_feisemingjie.jpg',
							intro: {
								content: '灵力消耗:<br/>15点<br/><br/>符卡效果:<br/>出牌阶段开始时,你可以选择一名其他角色.若如此做,直到你下回合开始,每当其受到伤害时,你选择一项:①从牌堆底摸两张牌;②获得一名角色区域内的两张牌.',
							},
							forced: true,
							filter(event, player) {
								return game.players.length > 1;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_feisemingjie'), true, function (card, player, target) {
										return target != player && !target.hasSkill('lg_feisemingjie_mark');
									})
									.set('ai', function (target) {
										var att = get.attitude(_status.event.player, target);
										if (att < 0) return -att + 3;
										return Math.random();
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									target.storage.lg_feisemingjie_mark = player;
									target.addSkill('lg_feisemingjie_mark');
								}
							},
							group: ['lg_feisemingjie_gain', 'lg_feisemingjie_delete'],
							subSkill: {
								mark: {
									onremove(player) {
										delete player.storage.lg_feisemingjie_mark;
									},
									intro: {
										content: '绯色冥界',
									},
								},
								delete: {
									trigger: {
										player: ['phaseBefore', 'dieBegin'],
									},
									forced: true,
									popup: false,
									_priority: 100000,
									content() {
										for (var i of game.players) {
											//QQ
											if (i.hasSkill('lg_feisemingjie_mark')) {
												i.removeSkill('lg_feisemingjie_mark');
											}
										}
									},
								},
								gain: {
									trigger: {
										global: ['damageBegin'],
									},
									forced: true,
									popup: false,
									filter(event, player) {
										return event.player.hasSkill('lg_feisemingjie_mark');
									},
									content() {
										'step 0';
										player.chooseTarget('获得一名角色区域内的两张牌', function (card, player, target) {
											return target.countCards('hej');
										}).ai = function (target) {
											var player = _status.event.player;
											var att = get.attitude(player, target);
											if (att < 0) {
												att = -Math.sqrt(-att);
											} else {
												att = Math.sqrt(att);
											}
											if (player.countCards('h') < 4 || player.countCards('h', 'shan') < 1) return false;
											return att * lib.card.guohe.ai.result.target(player, target);
										};
										('step 1');
										if (result.bool) {
											'lg_feisemingjie', result.targets;
											player.gainPlayerCard(result.targets[0], 2, true, 'hej');
											player.storage.lg_leimiliya0 -= 15;
											player.markSkill('lg_leimiliya0');
											event.finish();
										} else {
											player.draw(2, 'bottom');
											player.storage.lg_leimiliya0 -= 15;
											player.markSkill('lg_leimiliya0');
										}
									},
								},
							},
						},
						lg_feisemingjie1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_feisemingjieBegin',
							},
							filter(event, player) {
								return player.storage.lg_leimiliya0 < 15;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_feisemingjie2: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_feisemingjieAfter',
							},
							forced: true,
							content() { },
						},
						lg_jianxinkuxiu1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							mark: true,
							intro: {
								content: '转换:<br/>当你受到伤害时,你可以获得伤害来源装备区内的一张牌且展示之.若如此做,其展示并重铸与此牌点数均不同的牌.若你判定区内的牌数:大于其,你可以弃置两张♠️️牌;小于其,其废除防具栏.',
							},
							logTarget: 'source',
							filter(event, player) {
								return event.source && event.source.isIn() && event.source.countGainableCards(player, 'e');
							},
							check(event, player) {
								return get.attitude(player, event.source) < 0;
							},
							content() {
								'step 0';
								player.gainPlayerCard(trigger.source, 'e');
								('step 1');
								if (result && result.links) {
									player.showCards([result.links[0]], '坚心苦修');
									event.card = result.links[0];
								} else {
									event.finish();
								}
								('step 2');
								trigger.source.showCards(trigger.source.getCards('h'));
								('step 3');
								event.cars = trigger.source.getCards('he', function (card) {
									return card.number != event.card.number;
								});
								trigger.source.lose(event.cars);
								trigger.source.$throw(event.cars);
								game.log(trigger.source, '重铸了', event.cars);
								('step 4');
								trigger.source.draw(event.cars.length);
								if (player.countCards('j') < trigger.source.countCards('j')) trigger.source.disableEquip(2);
								if (player.countCards('j') > trigger.source.countCards('j')) player.chooseToDiscard(2, 'h', { suit: 'spade' });
								player.removeSkill('lg_jianxinkuxiu1');
								player.addSkill('lg_jianxinkuxiu');
							},
							ai: {
								maixie_defend: true,
							},
						},
						lg_jianxinkuxiu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'damageBegin',
							},
							mark: true,
							intro: {
								content: '转换:<br/>一名角色使用♠️️牌造成伤害时,你可以令其选择攻击范围内的至多三名其他角色.若如此做,这些角色各获得X点护甲(X为其装备区内的♠️️牌数).',
							},
							filter(event, player) {
								if (event.num <= 0) return false;
								if (!event.card || event.card.suit != 'spade' || !event.notLink()) return false;
								if (!event.source) return false;
								return game.hasPlayer(function (current) {
									return current != event.source && current.isDamaged() && event.source.inRange(current);
								});
							},
							check(event, player) {
								return get.attitude(player, event.source) > 0;
							},
							logTarget: 'source',
							content() {
								'step 0';
								trigger.source.chooseTarget(
									'发动此技能？',
									[1, 3],
									function (card, player, target) {
										var tri = _status.event.getTrigger();
										return tri.source != target && target.isDamaged() && tri.source.inRange(target);
									},
									function (target) {
										var tri = _status.event.getTrigger();
										var eff = get.recoverEffect(target, tri.source, tri.source);
										return eff;
									}
								);
								('step 1');
								if (result.bool) {
									var num = trigger.player.countCards('e', { suit: 'spade' });
									result.targets[0].changeHujia(num);
									player.removeSkill('lg_jianxinkuxiu');
									player.addSkill('lg_jianxinkuxiu1');
								}
							},
							ai: {
								threaten: 1.2,
								expose: 0.4,
							},
						},
						lg_pijingzhanji: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseBegin',
							},
							init(player) {
								player.storage.lg_pijingzhanji = false;
							},
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current != player && current.countCards('j') > 0;
								});
							},
							logTarget(event, player) {
								var targets = game.filterPlayer(function (current) {
									return current.countCards('j') > 0 && current != player;
								});
								return targets;
							},
							line: 'metal',
							content() {
								'step 0';
								event.num = 0;
								event.targets = game.filterPlayer(function (current) {
									return current.countCards('j') > 0 && current != player;
								});
								('step 1');
								if (event.targets.length) {
									var target = event.targets.shift();
									if (!player.storage._disableJudge) {
										for (var b of target.getCards('j')) {
											if (b) {
												target.$give(b, player, false);
												var card = player.getCards('j', { name: b.viewAs });
												if (card) {
													player.$throw(card, 1000);
													player.lose(card, ui.discardPile, 'visible');
												}
												player.addJudge({ name: b.viewAs }, b);
											}
										}
									} else {
										for (var b of target.getCards('j')) {
											if (b) {
												target.$give(b, player, false);
												player.$throw(b, 1000);
												target.lose(b, ui.discardPile, 'visible');
												event.num++;
											}
										}
									}
									event.redo();
								} else {
									var cards = [];
									player.getHistory('lose', function (evt) {
										if (evt && evt.js) cards.addArray(evt.js);
									});
									player.changeHujia(cards.length + event.num);
								}
							},
							mod: {
								maxHandcard(player, num) {
									return (num -= player.countCards('ej'));
								},
							},
							group: ['lg_pijingzhanji_update'],
							subSkill: {
								update: {
									trigger: {
										player: ['phaseBegin', 'phaseEnd'],
									},
									popup: false,
									forced: true,
									content() {
										player.storage.lg_pijingzhanji = !player.storage.lg_pijingzhanji ? true : false;
									},
								},
							},
						},
						lg_lvfa1: {
							trigger: {
								global: 'useCardToTarget',
							},
							forced: true,
							init(player) {
								player.storage.lg_lvfa1 = null;
								player.storage.lg_lvfa1_preview = null;
							},
							filter(event, player) {
								if (
									player.countDiscardableCards(player, 'he', function (card) {
										//QQQ
										return card.suit == 'spade';
									}) <= 0
								) {
									return false;
								}
								if (player.hasSkill('lg_lvfa1_off')) {
									return false;
								}
								var evt = event.parent;
								if (!player.storage.lg_lvfa1 || !player.storage.lg_lvfa1.isIn()) {
									return false;
								}
								if (!player.isIn()) {
									return false;
								}
								if (event.target != player && event.target != player.storage.lg_lvfa1) {
									return false;
								}
								if (event.target == player) {
									return !evt.targets.includes(player.storage.lg_lvfa1) && lib.filter.targetEnabled2(event.card, event.player, player.storage.lg_lvfa1);
								} else {
									return !evt.targets.includes(player) && lib.filter.targetEnabled2(event.card, event.player, player);
								}
							},
							content() {
								'step 0';
								player
									.chooseToDiscard('弃置一张♠️️牌,替换' + get.translation(trigger.card) + '的目标？', 1, 'he', function (card) {
										return card.suit == 'spade';
									})
									.set('ai', function (card) {
										var e;
										if (trigger.target == player) {
											e = get.effect(player.storage.lg_lvfa1, trigger.card, trigger.player, player) - get.effect(player, trigger.card, trigger.player, player);
										} else {
											var e2 = get.effect(player, trigger.card, trigger.player, player);
											if (e2 < 0) return -1;
											e = e2 - get.effect(player.storage.lg_lvfa1, trigger.card, trigger.player, player);
										}
										if (e < 0) {
											return -1;
										}
										return 9 - get.value(card);
									});
								('step 1');
								if (result && result.bool) {
									if (trigger.target == player) {
										var evt = trigger.parent;
										evt.triggeredTargets2.remove(player);
										evt.targets.remove(player);
										evt.targets.push(player.storage.lg_lvfa1);
										trigger.untrigger();
									} else {
										var evt = trigger.parent;
										evt.triggeredTargets2.remove(player.storage.lg_lvfa1);
										evt.targets.remove(player.storage.lg_lvfa1);
										evt.targets.push(player);
										trigger.untrigger();
									}
									player.addSkill('lg_lvfa1_off');
								}
							},
							group: ['lg_lvfa1_end'],
							subSkill: {
								off: {},
								end: {
									trigger: {
										player: 'phaseUseEnd',
									},
									_priority: 9974,
									filter(event, player) {
										return true;
									},
									forced: true,
									content() {
										'step 0';
										player.removeSkill('lg_lvfa1_off');
										player.storage.lg_lvfa1_preview = player.storage.lg_lvfa1;
										player.storage.lg_lvfa1 = null;
										('step 1');
										player
											.chooseTarget('发动此技能？', function (card, player, target) {
												return target != player.storage.lg_lvfa1_preview && target != player;
											})
											.set('ai', function (target) {
												var att = get.attitude(player, target);
												if (att > 0) {
													return -1;
												}
												if (att == 0) {
													return 0.1;
												}
												if (
													game.countPlayer(function (current) {
														return current != player && get.attitude(player, current) < 0;
													}) <= 2
												) {
													if (
														game.hasPlayer(function (current) {
															return current == game.me && current != player;
														})
													) {
														return Math.random() - 0.5;
													}
												}
												return Math.random() + 1;
											})
											.set('animate', false);
										('step 2');
										if (result && result.targets && result.targets.length) {
											player.storage.lg_lvfa1 = result.targets[0];
										}
									},
								},
							},
						},
						lg_lvfa: {
							trigger: {
								player: 'damageBegin3',
							},
							forced: true,
							filter(event, player) {
								return player.isLinked() && event.nature;
							},
							content() {
								player.storage.lg_lvfa = true;
							},
							group: 'lg_lvfa_clear',
							subSkill: {
								clear: {
									trigger: {
										player: 'damageEnd',
									},
									forced: true,
									filter(event, player) {
										return player.storage.lg_lvfa && event.nature;
									},
									content() {
										'step 0';
										delete player.storage.lg_lvfa;
										('step 1');
										var evt = _status.event.getParent('phase');
										if (evt && evt.name == 'phase') {
											//QQQ
											evt.finish();
										}
									},
								},
							},
						},
						lg_chizui_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xingxiang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'shaBegin',
							},
							init(player) {
								player.storage.lg_xingxiang = 0;
								player.storage.lg_xingxiang_cards = [];
							},
							content() {
								'step 0';
								player.storage.lg_xingxiang = 0;
								player.storage.lg_xingxiang_cards = get.cards(player.getAttackRange());
								player.showCards(player.storage.lg_xingxiang_cards);
								('step 1');
								var count = 0;
								for (var i = 0; i < player.storage.lg_xingxiang_cards.length; i++) {
									var card = player.storage.lg_xingxiang_cards[i];
									if (
										!game.hasPlayer(function (current) {
											return player.canUse(card, current);
										}) ||
										!lib.filter.cardUsable(card, player) ||
										player.getCardUsable(card) == 0
									)
										count += 1;
								}
								if (count == player.storage.lg_xingxiang_cards.length) {
									player.draw();
									event.goto(5);
								}
								('step 2');
								player
									.chooseCardButton('行相<br/><br/>使用其中一张牌', false, player.storage.lg_xingxiang_cards, 1)
									.set('ai', function (button) {
										var card = button.link;
										if (player.storage.lg_xingxiang_cards.length == 1) return 1;
										if (player.canUse(card, player) && get.effect(player, card, player, player) > 0) return player.getUseValue(card) + 100;
										var shan = 0;
										var sha = 0;
										var tao = 0;
										for (var i = 0; i < player.storage.lg_xingxiang_cards.length; i++) {
											if (player.storage.lg_xingxiang_cards[i].name == 'sha') sha += 1;
											if (player.storage.lg_xingxiang_cards[i].name == 'shan') shan += 1;
											if (player.storage.lg_xingxiang_cards[i].name == 'tao' || player.storage.lg_xingxiang_cards[i].name == 'jiu') tao += 1;
										}
										if ((tao > 0 || shan > 0) && card.name == 'sha') return (player.getUseValue(card) + 2) * 0.5;
										if ((sha > 0 || tao > 0) && card.name == 'juedou') return (player.getUseValue(card) + 2) * 0.5;
										if ((sha > 0 || tao > 0) && card.name == 'nanman' && get.attitude(player, player.next) < 0) return (player.getUseValue(card) + 2) * 0.7;
										if ((tao > 0 || shan > 0) && card.name == 'wanjian' && get.attitude(player, player.next) < 0) return (player.getUseValue(card) + 2) * 0.7;
										return player.getUseValue(card) + 2;
									})
									.set('filterButton', function (button) {
										var card = button.link;
										if (
											!game.hasPlayer(function (current) {
												return player.canUse(card, current);
											}) ||
											!lib.filter.cardUsable(card, player) ||
											player.getCardUsable(card) == 0
										)
											return false;
										return true;
									});
								('step 3');
								if (result.bool) {
									var card = result.links[0];
									player.storage.lg_xingxiang_cards.remove(card);
									player.storage.lg_xingxiang = 0;
									player.chooseUseTarget(card, false, true);
								} else {
									if (player.storage.lg_xingxiang_cards.length) {
										player.draw();
										event.goto(5);
									} else event.finish();
								}
								('step 4');
								if (player.storage.lg_xingxiang_cards.length == 0) {
									event.finish();
								} else if (player.storage.lg_xingxiang != 1) {
									if (player.storage.lg_xingxiang_cards.length) {
										player.draw();
										event.goto(5);
									} else event.finish();
								} else event.goto(1);
								('step 5');
								event.cards = player.storage.lg_xingxiang_cards;
								player.$throw(event.cards, 1000);
								game.cardsDiscard(event.cards);
								game.log(event.cards, '被置入了弃牌堆');
							},
							ai: {
								expose: 0.5,
								threaten: 1.2,
							},
							group: ['lg_xingxiang_target'],
							subSkill: {
								target: {
									popup: false,
									trigger: {
										player: 'useCardBegin',
									},
									prompt: '发动此技能？',
									filter(event, player) {
										var check = event.parent && event.parent.parent && event.parent.parent.name == 'lg_xingxiang';
										if (check == false) return false;
										var cards = player.storage.lg_xingxiang_cards;
										if (cards.length) return true;
										return false;
									},
									check(event, player) {
										var current = player;
										var good = 0;
										var bad = 0;
										var cards = [...player.storage.lg_xingxiang_cards];
										var cnt = 0;
										for (var i = 0; i < event.targets.length; i++) {
											if (get.attitude(player, event.targets[0]) >= 0) cnt += 1;
										}
										var cnt1 = 0;
										for (var i = 0; i < cards.length; i++) {
											var card = cards[i];
											if (
												!game.hasPlayer(function (current) {
													return player.canUse(card, current);
												}) ||
												!lib.filter.cardUsable(card, player) ||
												player.getCardUsable(card) == 0
											)
												cnt1 += 1;
										}
										if (cnt == 0 && cnt1 == cards.length && event.targets.length < cards.length) return false;
										while (current.next != player) {
											for (var i = 0; i < event.targets.length; i++) {
												if (event.targets[i].name == current.name) {
													if (cards.length == 0) continue;
													var card = null;
													var val = -100;
													for (var j = 0; j < cards.length; j++) {
														if (get.value(cards[j]) > val) {
															val = get.value(cards[j]);
															card = cards[j];
														}
													}
													cards.remove(card);
													if (get.attitude(player, current) > 0) good += get.value(card);
													else if (get.attitude(player, current) < 0) bad += get.value(card);
												}
											}
											current = current.next;
										}
										if (player.hp == 1) return true;
										if (player.hp == 2) return bad - good < 18;
										return bad - good < 12;
									},
									content() {
										'step 0';
										player.storage.lg_xingxiang = 1;
										event.evt = trigger.parent.parent;
										event.targets = trigger.targets;
										event.index = 0;
										('step 1');
										event.current = event.targets[event.index];
										if (player.storage.lg_xingxiang_cards.length == 0) event.finish();
										game.log(player, '令', event.current, '获得牌');
										event.current.chooseCardButton('获得其中一张牌', true, player.storage.lg_xingxiang_cards, 1).set('ai', function (button) {
											if (event.current.hp == 1 && event.current != player) return get.useful(button.link);
											if (get.attitude(event.current, player) <= 0) return get.value(button.link);
											if (player == event.current) {
												var card = button.link;
												if (
													!game.hasPlayer(function (current) {
														return player.canUse(card, current);
													}) ||
													!lib.filter.cardUsable(card, player) ||
													player.getCardUsable(card) == 0
												)
													return get.value(card) + 5;
												return get.value(card);
											}
											if (player != event.current) {
												var cur = event.current.next;
												var sub_check = false;
												while (cur != player) {
													for (var i = 0; i < event.targets.length; i++) {
														if (event.targets[i].name == cur.name && get.attitude(event.current, cur) <= 0) sub_check = true;
													}
													cur = cur.next;
												}
												if ((sub_check = true)) return get.value(button.link);
												var array = [...player.storage.lg_xingxiang_cards];
												var card = button.link;
												array.remove(card);
												if (
													!game.hasPlayer(function (current) {
														return player.canUse(card, current);
													}) ||
													!lib.filter.cardUsable(card, player) ||
													player.getCardUsable(card) == 0
												)
													return get.value(button.link);
												var has_good = 0;
												for (var i = 0; i < array.length; i++) {
													if (
														!game.hasPlayer(function (current) {
															return player.canUse(array[i], current);
														}) ||
														!lib.filter.cardUsable(array[i], player) ||
														player.getCardUsable(array[i]) == 0
													)
														continue;
													if (player.getUseValue(card) <= 0) continue;
													has_good = 1;
												}
												if (player.getUseValue(card) > 0 && has_good == 0) return get.value(button.link) / 2.0;
												return get.value(button.link);
											}
											return get.value(button.link);
										});
										('step 2');
										if (result.bool) {
											event.current.gain(result.links[0], 'gain2');
											player.storage.lg_xingxiang_cards.remove(result.links[0]);
										} else event.finish();
										('step 3');
										if (event.index == event.targets.length - 1) event.finish();
										else {
											event.index += 1;
											event.goto(1);
										}
									},
								},
							},
						},
						lg_caoyuansu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['chooseToRespondBefore', 'chooseToUseBefore'],
							},
							mark: true,
							markimage: 'extension/幻颜风华/Element/lg_element_cao.jpg',
							intro: {
								content: '「草」<br/>元素效果:<br/>一名其他角色成为【杀】的目标时,若其的体力值为全场最少或之一,你可以选择是否代替其使用一张【闪】响应此【杀】.若你选择否,其随机获得一张基本牌.',
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (event.responded) return false;
								if (
									!event.filterCard ||
									!event.filterCard(
										{
											name: 'shan',
										},
										player,
										event
									)
								)
									return false;
								var hp = player.hp;
								var players = game.filterPlayer();
								for (var i = 0; i < players.length; i++) {
									hp = Math.min(players[i].hp, hp);
								}
								if (event.player.hp != hp) return false;
								return true;
							},
							check(event, player) {
								return get.attitude(player, event.player) > 0;
							},
							content() {
								'step 0';
								var next = player.chooseToRespond('代替' + get.translation(trigger.player) + '使用一张【闪】？', {
									name: 'shan',
								});
								next.set('ai', function () {
									if (trigger.parent && trigger.parent.player && get.damageEffect(trigger.player, trigger.parent.player, player) >= 0) return false;
									return true;
								});
								next.autochoose = lib.filter.autoRespondShan;
								('step 1');
								if (result.bool) {
									event.finish();
									trigger.result = {
										bool: true,
										card: {
											name: 'shan',
										},
									};
									trigger.responded = true;
								} else trigger.player.gain(game.createCard(get.inpile('basic').randomGet()), 'draw');
							},
						},
						lg_suowenbianji: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseEnd',
							},
							filter(event, player) {
								if (!player.getHistory('sourceDamage').length) return player.countCards('h') != player.hp + player.getAttackRange();
								return player.countCards('h') > 0;
							},
							content() {
								var num = player.countCards('h');
								if (player.getHistory('sourceDamage').length) player.chooseToGuanxing(7);
								else if (num > player.hp + player.getAttackRange()) player.chooseToDiscard('h', true, num - player.hp + player.getAttackRange());
								else player.drawTo(player.hp + player.getAttackRange());
							},
						},
						lg_xinjinghuancheng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['respond', 'useCard'],
							},
							forced: true,
							filter(event, player) {
								if (game.countPlayer() < 3) return false;
								if (!event.respondTo) return false;
								//if(event.player==player)return false;
								if (player != event.respondTo[0]) return false;
								if (event.card.name != 'wuxie') {
									if (!event.getParent(3).targets || event.getParent(3).targets.length != 1) return false;
									if (event.getParent(3).card != event.respondTo[1]) return false;
									if (event.getParent(3).card.name != '' && get.type(event.getParent(3).card) != 'trick') return false;
								} else {
									if (get.type(event.getParent(2)._trigger.card) != 'trick' || event.getParent(2)._trigger.targets.length != 1) return false;
								}
								var cards = [];
								if (get.itemtype(event.respondTo[1]) == 'card') cards.push(event.respondTo[1]);
								else if (event.respondTo[1].cards) cards.addArray(event.respondTo[1].cards);
								return cards.filterInD('od').length;
							},
							content() {
								'step 0';
								player.addTempSkill('lg_xinjinghuancheng11', { player: 'phaseEndStart' });
								player
									.chooseTarget(get.prompt2('lg_xinjinghuancheng'), function (card, player, target) {
										return target != _status.event.source && target != player;
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										var att = get.attitude(player, target);
										return att;
									})
									.set('source', trigger.player);
								('step 1');
								if (result.bool) {
									var cards = [];
									if (get.itemtype(trigger.respondTo[1]) == 'card') cards.push(trigger.respondTo[1]);
									else if (trigger.respondTo[1].cards) cards.addArray(trigger.respondTo[1].cards);
									cards = cards.filterInD('od');
									result.targets[0].gain(cards, 'gain2', 'log');
								}
							},
						},
						lg_naxida_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xinjinghuancheng11: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'phaseBegin',
							},
							forced: true,
							content() {
								var n = [1, 2, 3].randomGet();
								if (n == 1) if (trigger.player.isFriendsOf(player)) trigger.player.addTempSkill('lg_xinjinghuancheng1', { player: 'phaseEndStart' });
								if (n == 2) if (trigger.player.isFriendsOf(player)) trigger.player.addTempSkill('lg_xinjinghuancheng2', { player: 'phaseEndStart' });
								if (n == 3) if (trigger.player.isFriendsOf(player)) trigger.player.addTempSkill('lg_xinjinghuancheng3', { player: 'phaseEndStart' });
							},
						},
						lg_xinjinghuancheng1: {
							trigger: {
								player: 'useCardToPlayered',
								source: 'damageSource',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_xinjinghuancheng.jpg',
							intro: {
								content: '「心景幻成」<br/>领域效果:<br/>当你使用【杀】指定其他角色为目标时,你可以对其中一个目标造成1点火焰伤害.若此【杀】造成伤害,你随机弃置一张手牌.',
							},
							forced: true,
							init(p, s) {
								p.storage[s] = [];
							},
							filter(event, player) {
								if (event.name == 'damage') return event.cards && player.storage.lg_xinjinghuancheng1.includes(event.cards);
								else return event.card && event.card.name == 'sha' && event.isFirstTarget;
							},
							content() {
								'step 0';
								if (trigger.name == 'damage') {
									player.storage.lg_xinjinghuancheng1.remove(trigger.cards);
									player.randomDiscard(1, 'h');
									event.finish();
								} else
									player
										.chooseTarget(get.prompt2('lg_xinjinghuancheng1'), function (card, player, target) {
											return _status.event.tgs.includes(target);
										})
										.set('ai', function (target) {
											var p = get.player();
											if (p.hp == 1) return 0;
											return get.damageEffect(target, p, p);
										})
										.set('tgs', trigger.targets);
								('step 1');
								if (result.bool) {
									var t = result.targets[0];
									player.storage.lg_xinjinghuancheng1.push(trigger.cards);
									t.damage('fire');
								}
							},
						},
						lg_xinjinghuancheng2: {
							trigger: {
								global: 'damageBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_xinjinghuancheng.jpg',
							intro: {
								content: '「心景幻成」<br/>领域效果:<br/>一名角色受到伤害时,你可以弃置其一张手牌.若以此法弃置手牌的为你,你将手牌数补至X(X为你的体力值与攻击范围之和).',
							},
							logTarget: 'player',
							filter(event, player) {
								if (event.player.isDead()) return false;
								if (event.player != player) return event.player.countCards('h');
								return true;
							},
							content() {
								'step 0';
								player.discardPlayerCard(trigger.player, 'h', true);
								('step 1');
								if (trigger.player == player) player.drawTo(player.hp + player.getAttackRange());
							},
						},
						lg_xinjinghuancheng3: {
							nobracket: true,
							trigger: {
								source: 'damageBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_xinjinghuancheng.jpg',
							intro: {
								content: '「心景幻成」<br/>领域效果:<br/>当你对其他角色造成伤害时,你可以令其摸一张牌.若其的手牌数小于你,你弃置其两张牌.',
							},
							check(event, player) {
								var target = event.player;
								var recover = 0;
								if (target.getEquip('baiyin') && target.isDamaged()) recover++;
								var att = get.attitude(player, target);
								if (att > 0 && recover > 0) return true;
								if (att < 0) {
									if (target.countCards('he') == 1 && recover > 0) return false;
									return true;
								}
								return false;
							},
							popup: false,
							prompt(event, player) {
								return '对' + get.translation(event.player) + '发动此技能？';
							},
							filter(event, player) {
								return event.num > 0 && event.player != player && event.player.isAlive();
							},
							content() {
								var target = trigger.player;
								player.line(target, 'water');
								if (target.countCards('h') < player.countCards('h')) player.discardPlayerCard(target, 'he', 2, true);
								else target.draw();
							},
						},
						lg_shenlizhiyuyin: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: ['damageBegin', 'loseHpBegin'],
							},
							content() {
								'step 0';
								var ph = player.countCards('h');
								var targets = game.filterPlayer((current) => current == player || current.countCards('h') >= ph).sortBySeat();
								player.line(targets, 'green');
								event.targets = targets;
								event.num = 0;
								('step 1');
								var target = targets[num];
								event.num++;
								if (target.isIn()) {
									event.target = target;
									target.chooseBool('令' + (player == target ? '你' : get.translation(player)) + '回复体力？').set('ai', () => get.attitude(_status.event.player, _status.event.parent.player) > 0);
								} else {
									event.goto(event.num < targets.length ? 1 : 3);
								}
								('step 2');
								if (result.bool) {
									target.line(player);
									player.recover();
								}
								if (num < targets.length) event.goto(1);
								('step 3');
								player
									.chooseTarget('发动此技能？', function (card, player, target) {
										return _status.event.parent.targets.includes(target) && target.countCards('h') > player.countCards('h');
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										return get.damageEffect(target, player, player);
									});
								('step 4');
								if (result.bool) {
									var target = result.targets[0];
									player.line(target, 'green');
									target.damage('thunder');
								} else event.finish();
								('step 5');
								player
									.chooseTarget('发动此技能？', function (card, player, target) {
										return _status.event.parent.targets.includes(target) && target.countCards('h') == player.countCards('h');
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										return get.attitude(player, target);
									});
								('step 6');
								if (result.bool) {
									var target = result.targets[0];
									player.line(target);
									player.addTempSkill('lg_leiyuansu', { player: 'equipEnd' });
									target.addTempSkill('lg_feiying', { player: 'phaseEndStart' });
								}
							},
						},
						lg_feiying: {
							trigger: {
								player: 'useCard',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_feiying.jpg',
							intro: {
								content: '「绯樱」<br/>状态效果:<br/>每当你使用一张♦️️牌,你可以令体力值不大于你的其他角色各摸一张牌.',
							},
							filter(event, player) {
								if (event.card.suit == 'diamond') {
									return game.hasPlayer(function (current) {
										return current.hp <= player.hp && current.isDamaged();
									});
								}
								return false;
							},
							prompt(event, player) {
								var list = game.filterPlayer(function (current) {
									return current.hp <= player.hp && current.isDamaged();
								});
								return get.prompt('lg_feiying', list);
							},
							check(event, player) {
								var list = game.filterPlayer(function (current) {
									return current.hp <= player.hp && current.isDamaged();
								});
								var num = 0;
								for (var i = 0; i < list.length; i++) {
									var eff = get.recoverEffect(list[i], player, player);
									if (eff > 0) {
										num++;
									} else {
										num--;
									}
								}
								return num > 0;
							},
							content() {
								'step 0';
								var list = game.filterPlayer(function (current) {
									return current.hp <= player.hp && current.isDamaged();
								});
								player.line(list, 'green');
								list.sort(lib.sort.seat);
								event.list = list;
								('step 1');
								if (event.list.length) {
									event.list.shift().draw();
									event.redo();
								}
							},
							ai: {
								expose: 0.3,
								threaten: 1.5,
							},
						},
						lg_shashengying: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'discardBegin',
							},
							filter(event, player) {
								var tof = game.countPlayer(function (current) {
									return current.countCards('h') != player.countCards('h');
								});
								if (tof < 1) return false;
								return event.source && event.source != player;
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_shashengying'), '<center>发动此技能？</center>', function (card, player, target) {
										return target.countCards('h') != player.countCards('h');
									})
									.set('ai', function (target) {
										if (player.isMinHandcard()) return -get.attitude(player, target);
										if (player.isMaxHandcard()) return get.attitude(player, target);
										if (get.attitude(player, target) >= 0 && target.countCards('h') < player.countCards('h')) return true;
										if (get.attitude(player, target) < 0 && target.countCards('h') > player.countCards('h')) return true;
										return false;
									});
								('step 1');
								if (result.bool && result.targets && result.targets.length) {
									event.mubiao = result.targets[0];
									if (event.mubiao.countCards('h') > player.countCards('h')) player.gainPlayerCard(event.mubiao, 1, 'h', true);
									else result.targets[0].showHandcards();
								} else event.goto(3);
								('step 2');
								if (event.mubiao.countCards('h') == event.mubiao.hp) player.next.randomDiscard(3, 'h');
								('step 3');
							},
						},
						lg_tianhuxianzhen: {
							group: ['lg_tianhuxianzhen_buff1', 'lg_tianhuxianzhen_buff2'],
							subSkill: {
								hu: {
									mark: true,
									marktext: '狐',
									intro: {
										content: '大密法·天狐显真',
									},
								},
								buff1: {
									mod: {
										targetInRange(card, player, target) {
											if (target.hasSkill('lg_tianhuxianzhen_hu')) return true;
										},
									},
								},
								buff2: {
									usable: 1,
									trigger: {
										source: 'damageBegin',
									},
									popup: false,
									forced: true,
									filter(event, player) {
										return event.player.hasSkill('lg_tianhuxianzhen_hu');
									},
									content() {
										var a = player.countCards('ej', { suit: 'diamond' });
										trigger.num += a;
									},
								},
							},
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							content() {
								'step 0';
								event.current = player.next;
								('step 1');
								player.line(event.current, 'green');
								event.current.chooseCard('he', '交给' + get.translation(player) + '一张牌？').ai = function (card) {
									if (get.attitude(event.current, player) > 0) {
										return 8 - get.value(card);
									} else {
										return -1;
									}
								};
								('step 2');
								if (result.bool == false) {
									event.current.addTempSkill('lg_tianhuxianzhen_hu');
								} else {
									player.gain(result.cards[0]);
									event.current.$give(1, player);
									event.goto(4);
								}
								('step 3');
								if (event.current.next != player) {
									event.current = event.current.next;
									event.goto(1);
								} else {
									event.finish();
								}
								('step 4');
								player.chooseBool('令' + get.translation(event.current) + '选择一项？').ai = function (event, player) {
									return get.attitude(player, event.current) > 2;
								};
								('step 5');
								if (result.bool) {
									event.current.chooseDrawRecover(2, true, function (event, player) {
										if (player.hp <= 2 && player.isDamaged()) return 'recover_hp';
										return 'draw_card';
									});
									event.goto(3);
								} else {
									event.goto(3);
								}
							},
							ai: {
								order: 7,
								result: {
									player: 2,
								},
								threaten: 1.3,
							},
						},
						lg_mifa: {
							init(player) {
								player.storage.lg_mifa = [];
							},
							intro: {
								content(storage) {
									if (!storage.length) {
										return '秘法';
									} else {
										var str = '秘法:' + get.translation(storage);
										return str;
									}
								},
							},
							trigger: {
								player: 'useCardBefore',
							},
							filter(event, player) {
								return player == _status.currentPhase && player.getHistory('useCard').length == 0;
							},
							_priority: 190,
							forced: true,
							content() {
								'step 0';
								var lt = ['♥️️️', '♦️️️', '♣️️️', '♠️️️', 'cancel2'],
									tp = get.color(trigger.card);
								if (tp != 'none') {
									var tp1 = tp + '2';
									lt.remove(get.translation(tp1));
								}
								player
									.chooseControl(lt, true)
									.set('ai', function (event) {
										return lt.randomGet();
									})
									.set('prompt', '执行秘法？');
								('step 1');
								if (result.control != 'cancel2') {
									var tp;
									switch (result.control) {
										case '♥️️️':
											tp = 'heart';
											break;
										case '♦️️️':
											tp = 'diamond';
											break;
										case '♣️️️':
											tp = 'club';
											break;
										case '♠️️️':
											tp = 'spade';
											break;
									}
									trigger.card.suit = tp; //QQQ
								} else event.finish();
							},
							ai: {
								unequip: true,
								skillTagFilter(player, tag, arg) {
									if (arg && arg.name == 'sha' && !player.countUsed('sha')) return true;
									return false;
								},
							},
							group: ['lg_mifa_record', 'lg_mifa_clear'],
							subSkill: {
								clear: {
									trigger: {
										player: ['phaseUseAfter'],
									},
									forced: true,
									filter(event, player) {
										return player.storage.lg_mifa.length;
									},
									content() {
										player.storage.lg_mifa = [];
										player.unmarkSkill('lg_mifa');
									},
								},
								record: {
									trigger: {
										player: 'useCardAfter',
									},
									forced: true,
									filter(event, player) {
										if (_status.currentPhase != player) return false;
										if (Array.isArray(event.cards))
											for (var i of event.cards) {
												//QQ
												var suit = i.suit;
												if (suit && suit != 'none' && !player.storage.lg_mifa.includes(suit)) return true;
											}
										return false;
									},
									content() {
										'step 0';
										for (var i = 0; i < trigger.cards.length; i++) {
											var suit = trigger.cards[i].suit;
											if (suit) player.storage.lg_mifa.add(suit);
										}
										player.markSkill('lg_mifa');
										('step 1');
										if (player.storage.lg_mifa.length == 4) {
											var basiclist = [];
											basiclist.push(['基本', '', 'sha']);
											basiclist.push(['基本', '', 'jiu']);
											basiclist.push(['基本', '', 'tao']);
											player.chooseButton(['使用其中一张牌？', [basiclist, 'vcard']], false).set('ai', function (button) {
												if (player.isDamaged()) {
													if (button.link[2] == 'tao') return 9;
												} else if (button.link[2] == 'sha') return 4;
												return 1;
											});
										} else event.finish();
										('step 2');
										if (result && result.bool && result.links[0]) {
											player.chooseUseTarget({ name: result.links[0][2] }, false);
										}
									},
								},
							},
						},
						lg_bachongshenzi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_pomochenghua: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'showCharacterAfter',
							},
							filter(event, player) {
								var players = game.filterPlayer();
								var check = game.hasPlayer(function (current) {
									if (current.countCards('e') == 0) return false;
									var cards = current.getCards('e');
									for (var i = 0; i < cards.length; i++) {
										var card = cards[i];
										for (var j = 0; j < players.length; j++) {
											if (players[i] == current) continue;
											if (
												!current.canUse(
													{
														name: 'sha',
													},
													players[i],
													false
												)
											)
												continue;
											if (get.subtype(card) == 'equip1' && !players[i].isDisabled(1)) return true;
											if (get.subtype(card) == 'equip2' && !players[i].isDisabled(2)) return true;
											if (get.subtype(card) == 'equip3' && !players[i].isDisabled(3)) return true;
											if (get.subtype(card) == 'equip4' && !players[i].isDisabled(4)) return true;
											if (get.subtype(card) == 'equip5' && !players[i].isDisabled(5)) return true;
										}
									}
									return false;
								});
								return check;
							},
							forced: true,
							content() {
								'step 0';
								var next = player.chooseTarget(2, function (card, player, target) {
									if (ui.selected.targets.length) {
										var current = ui.selected.targets[0];
										if (
											!ui.selected.targets[0].canUse(
												{
													name: 'sha',
												},
												target,
												false
											)
										)
											return false;
										var cards = current.getCards('e');
										for (var i = 0; i < cards.length; i++) {
											var card = cards[i];
											if (get.subtype(card) == 'equip1' && !target.isDisabled(1)) return true;
											if (get.subtype(card) == 'equip2' && !target.isDisabled(2)) return true;
											if (get.subtype(card) == 'equip3' && !target.isDisabled(3)) return true;
											if (get.subtype(card) == 'equip4' && !target.isDisabled(4)) return true;
											if (get.subtype(card) == 'equip5' && !target.isDisabled(5)) return true;
										}
										return false;
									} else {
										return (
											target.countCards('e') > 0 &&
											game.hasPlayer(function (current) {
												return target.canUse(
													{
														name: 'sha',
													},
													current,
													false
												);
											})
										);
									}
								});
								next.set('ai', function (target) {
									var player = _status.event.player;
									var att = get.attitude(player, target);
									var sgnatt = get.sgn(att);
									var players = game.filterPlayer();
									if (ui.selected.targets.length == 0) {
										var cards = target.getCards('e');
										var max = -1000;
										for (var i = 0; i < players.length; i++) {
											if (players[i] == target) continue;
											if (
												!target.canUse(
													{
														name: 'sha',
													},
													players[i],
													false
												)
											)
												continue;
											var val = get.effect(
												players[i],
												{
													name: 'sha',
												},
												target,
												player
											);
											for (var j = 0; j < cards.length; j++) {
												var card = cards[j];
												if (get.subtype(card) == 'equip1' && players[i].isDisabled(1)) continue;
												if (get.subtype(card) == 'equip2' && players[i].isDisabled(2)) continue;
												if (get.subtype(card) == 'equip3' && players[i].isDisabled(3)) continue;
												if (get.subtype(card) == 'equip4' && players[i].isDisabled(4)) continue;
												if (get.subtype(card) == 'equip5' && players[i].isDisabled(5)) continue;
												var val1 = get.effect(players[i], card, player, player) + val - get.effect(target, card, player, player);
												var att1 = get.attitude(player, target);
												var att2 = get.attitude(player, players[i]);
												if (!players[i].isEmpty(get.subtype(card))) {
													val1 -= get.effect(players[i], players[i].getEquip(get.subtype(card)), player, player);
												}
												if (att1 > 0 && att2 > 0) {
													if (card.name == 'baiyin' && target.isDamaged()) val1 += 10;
													else if (val < 0) val1 = -200;
													else if (val > 0) val1 += 5;
												}
												if (att1 > 0 && att2 < 0) {
													if (get.effect(players[i], card, player, player) < 0) val1 -= 30;
												}
												if (att1 < 0 && att2 > 0) {
													if (get.effect(target, card, player, player) < 0) val1 += 30;
												}
												if (att1 < 0 && att2 < 0) {
													if (card.name == 'baiyin' && target.isDamaged()) val1 = -100;
													else if (
														get.effect(
															players[i],
															{
																name: 'sha',
															},
															target,
															target
														) > 0
													)
														val1 -= 10;
													else val1 += 20;
												}
												if (att1 == 0 && att2 == 0) va1 = -100;
												if (att1 == 0) va1 = -100;
												if (att2 == 0 && att1 > 0) val1 -= 40;
												max = Math.max(max, val1);
											}
										}
										return max;
									}
									var cards = ui.selected.targets[0].getCards('e');
									var current = ui.selected.targets[0];
									var max = -1000;
									var val = get.effect(
										target,
										{
											name: 'sha',
										},
										current,
										player
									);
									for (var j = 0; j < cards.length; j++) {
										var card = cards[j];
										if (get.subtype(card) == 'equip1' && target.isDisabled(1)) continue;
										if (get.subtype(card) == 'equip2' && target.isDisabled(2)) continue;
										if (get.subtype(card) == 'equip3' && target.isDisabled(3)) continue;
										if (get.subtype(card) == 'equip4' && target.isDisabled(4)) continue;
										if (get.subtype(card) == 'equip5' && target.isDisabled(5)) continue;
										var val1 = get.effect(target, card, player, player) + val - get.effect(current, card, player, player);
										var att1 = get.attitude(player, current);
										var att2 = get.attitude(player, target);
										if (!target.isEmpty(get.subtype(card))) {
											val1 -= get.effect(target, target.getEquip(get.subtype(card)), player, player);
										}
										if (att1 > 0 && att2 > 0) {
											if (card.name == 'baiyin' && current.isDamaged()) val1 += 10;
											else if (val < 0) val1 = -200;
											else if (val > 0) val1 += 5;
										}
										if (att1 > 0 && att2 < 0) {
											if (get.effect(target, card, player, player) < 0) val1 -= 30;
										}
										if (att1 < 0 && att2 > 0) {
											if (get.effect(current, card, player, player) < 0) val1 += 30;
										}
										if (att1 < 0 && att2 < 0) {
											if (card.name == 'baiyin' && current.isDamaged()) val1 = -100;
											else if (
												get.effect(
													target,
													{
														name: 'sha',
													},
													current,
													current
												) > 0
											)
												val1 -= 10;
											else val1 += 20;
										}
										if (att1 == 0 && att2 == 0) va1 = -100;
										if (att1 == 0) va1 = -100;
										if (att2 == 0 && att1 > 0) val1 -= 40;
										max = Math.max(max, val1);
									}
									return max;
								});
								next.set('multitarget', true);
								next.set('targetprompt', _status.event.targetprompt || ['目标', '移至目标']);
								next.set('prompt', event.prompt || '发动此技能？');
								if (event.prompt2) next.set('prompt2', event.prompt2);
								if (event.forced) next.set('forced', true);
								('step 1');
								event.result = result;
								if (result.bool) {
									player.line2(result.targets, 'green');
									event.targets = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets.length == 2) {
									player
										.choosePlayerCard(
											'e',
											true,
											function (button) {
												var player = _status.event.player;
												var targets0 = _status.event.targets0;
												var targets1 = _status.event.targets1;
												var card = button.link;
												var val = get.effect(
													targets1,
													{
														name: 'sha',
													},
													targets0,
													player
												);
												var val1 = get.effect(targets1, card, player, player) + val - get.effect(targets0, card, player, player);
												var att1 = get.attitude(player, targets0);
												var att2 = get.attitude(player, targets1);
												if (!targets1.isEmpty(get.subtype(card))) {
													val1 -= get.effect(targets1, targets1.getEquip(get.subtype(card)), player, player);
												}
												if (att1 > 0 && att2 > 0) {
													if (card.name == 'baiyin' && targets0.isDamaged()) val1 += 10;
													else if (val < 0) val1 = -200;
													else if (val > 0) val1 += 5;
												}
												if (att1 > 0 && att2 < 0) {
													if (get.effect(targets1, card, player, player) < 0) val1 -= 30;
												}
												if (att1 < 0 && att2 > 0) {
													if (get.effect(targets0, card, player, player) < 0) val1 += 30;
												}
												if (att1 < 0 && att2 < 0) {
													if (card.name == 'baiyin' && targets0.isDamaged()) val1 = -100;
													else if (
														get.effect(
															targets1,
															{
																name: 'sha',
															},
															targets0,
															targets0
														) > 0
													)
														val1 -= 10;
													else val1 += 20;
												}
												if (att1 == 0 && att2 == 0) va1 = -100;
												if (att1 == 0) va1 = -100;
												if (att2 == 0 && att1 > 0) val1 -= 40;
												return val1;
											},
											targets[0]
										)
										.set('targets0', targets[0])
										.set('targets1', targets[1])
										.set('filterButton', function (button) {
											var targets1 = _status.event.targets1;
											var card = button.link;
											if (get.subtype(card) == 'equip1' && !targets1.isDisabled(1)) return true;
											if (get.subtype(card) == 'equip2' && !targets1.isDisabled(2)) return true;
											if (get.subtype(card) == 'equip3' && !targets1.isDisabled(3)) return true;
											if (get.subtype(card) == 'equip4' && !targets1.isDisabled(4)) return true;
											if (get.subtype(card) == 'equip5' && !targets1.isDisabled(5)) return true;
											return false;
										});
								} else {
									event.finish();
								}
								('step 3');
								if (result.bool && result.links.length) {
									var link = result.links[0];
									if (get.position(link) == 'e') {
										event.targets[1].equip(link);
									}
									event.targets[0].$give(link, event.targets[1], false);
									game.log(event.targets[0], '的', link, '被移动给了', event.targets[1]);
									event.result.card = link;
									event.result.position = get.position(link);
								} else event.finish();
								('step 4');
								event.targets[0].useCard(
									{
										name: 'sha',
									},
									event.targets[1]
								);
							},
						},
						lg_pomochenghua1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToBefore',
							},
							filter(event, player) {
								return event.card.suit == 'spade' && event.targets.length == 1;
							},
							content() {
								player.chooseToDiscard(1, 'h', true, { type: 'basic' });
								player.draw(2);
								var hp = player.hp;
								player.init('lg_geshibeizhai');
								player.hp = hp;
								player.update();
								ui.clear();
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (card.suit == 'spade') {
											if (card.name == 'jiedao') return;
											if (get.tag(card, 'multitarget')) return;
											return [0.5, 0.6];
										}
									},
								},
							},
						},
						lg_fuyue: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCard',
							},
							_priority: -5,
							filter(event, player) {
								if (event.card.name != 'sha') return false;
								if (event.player == player) return false;
								if (_status.currentPhase != event.player) return false;
								return player.countCards('e') > 0;
							},
							check(event, player) {
								return get.attitude(player, event.player) > 0;
							},
							forced: true,
							content() {
								'step 0';
								var translation = get.translation(trigger.player);
								var translation2 = get.translation(trigger.card);
								player.chooseToDiscard(1, 'e', '富岳三十六景', '弃置装备区内的一张牌？').set('ai', function (card) {
									var att = get.attitude(player, trigger.player);
									if (att > 0) {
										if (card.suit == 'spade') {
											if (trigger.player.getStat().card.sha == 1 && trigger.player.hasSha()) return 4 - get.value(card);
										}
										if (card.suit == 'club') {
											var eff = game.hasPlayer(function (current) {
												return get.effect(current, trigger.card, trigger.player, trigger.player) > 0 && trigger.player.canUse(trigger.card, current) && !trigger.targets.includes(current);
											});
											if (eff) return 6 - get.value(card);
										}
									}
									return -1;
								});
								('step 1');
								if (result.bool) {
									if (result.cards[0].suit == 'spade') {
										if (trigger.addCount !== false) {
											trigger.addCount = false;
											trigger.player.getStat().card.sha--;
											game.log(trigger.player, '#y使用的', trigger.card, '不计入出杀次数');
											event.finish();
										}
									} else if (result.cards[0].suit == 'club') {
										game.log(trigger.player, '#y使用的', trigger.card, '可以额外指定一个目标');
										trigger.player
											.chooseTarget('富岳三十六景', '令' + get.translation(trigger.card) + '额外指定一个目标？', function (card, player, target) {
												return !_status.event.sourcex.includes(target) && player.canUse(_status.event.card, target);
											})
											.set('sourcex', trigger.targets)
											.set('ai', function (target) {
												var player = _status.event.player;
												return get.effect(target, _status.event.card, player, player);
											})
											.set('card', trigger.card);
									}
								} else {
									event.finish();
								}
								('step 2');
								if (result.bool) {
									if (!event.isMine() && !_status.connectMode) game.delayx();
									event.target = result.targets[0];
								} else {
									event.finish();
								}
								('step 3');
								trigger.player.line(event.target, 'green');
								game.log(event.target, '额外成为了', trigger.card, '的目标');
								trigger.targets.push(event.target);
							},
						},
						lg_fuyue0: {
							trigger: {
								player: 'lg_fuyueAfter',
							},
							filter(event, player) {
								return player.getAttackRange() == player.countCards('h', { color: 'black' });
							},
							forced: true,
							subSkill: {
								a: {
									charlotte: true,
									mark: true,
									intro: {
										content: '你不能使用或打出手牌',
									},
									mod: {
										cardEnabled2(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardUsable(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardRespondable(card, player) {
											if (get.position(card) == 'h') return false;
										},
										cardSavable(card, player) {
											if (get.position(card) == 'h') return false;
										},
									},
								},
							},
							content() {
								'step 0';
								player.chooseTarget(get.prompt2('lg_fuyue0'), [1, 4]).set('ai', function (target) {
									var player = get.player();
									if (player == target) {
										if (!player.getFriends()) return 0;
										return !player.countCards('h') ? 1 : -1;
									}
									if (get.attitude(player, target) > 0) return 1;
									return get.attitude(player, target) < 0 &&
										player.countCards('h', function (card) {
											return card.name == 'sha' && player.canUse(card, target) && get.effect(target, card, player) > 0;
										}) &&
										target.isMinHandcard()
										? 1
										: -1;
								});
								('step 1');
								if (result.bool) {
									event.targets = result.targets;
									game.asyncDraw(event.targets);
									for (var i = 0; i < event.targets.length; i++) {
										event.targets[i].addTempSkill('lg_fuyue0_a');
									}
								}
							},
						},
						lg_geshibeizhai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xushuhuan: {
							audio: 'ext:幻颜风华/audio:3',
							usable: 1,
							trigger: {
								player: 'useCardToPlayered',
							},
							logTarget: 'target',
							filter(event, player) {
								return event.targets.length == 1 && player != event.target && event.target.countCards('h') > 1;
							},
							check(event, player) {
								var target = event.target;
								if (get.attitude(player, target) >= 0) return false;
								if (get.color(event.card) == 'none') return true;
								return Math.ceil(target.countCards('h') / 2) >= Math.ceil(player.countCards('h') / 2);
							},
							content() {
								'step 0';
								var target = trigger.target;
								event.target = target;
								var num = Math.ceil(target.countCards('h') / 2);
								if (num > 0) player.gainPlayerCard(target, 'h', num, true);
								else event.finish();
								('step 1');
								var suit = trigger.card.suit;
								if (result.bool && lib.suit.includes(suit) && player.countCards('h') > 1) {
									var bool = false;
									for (var i of result.cards) {
										if (i.suit == suit) {
											bool = true;
											break;
										}
									}
									if (!bool) event.finish();
								} else event.finish();
								('step 2');
								player.randomDiscard(3, 'hej');
							},
						},
						lg_xushu: {
							subSkill: {
								draw: {
									prompt(event, player) {
										return '进行拟似？';
									},
									trigger: {
										player: 'phaseDrawBegin2',
									},
									filter(event, player) {
										if (event.numFixed) return false;
										return player.storage.lg_xushu.length;
									},
									content() {
										'step 0';
										var list = player.storage.lg_xushu;
										var gain = [];
										var nogain = 0;
										for (var i = 0; i < list.length; i++) {
											var card = get.cardPile(function (cardx) {
												return cardx.name == list[i].name && !gain.includes(cardx);
											});
											if (card) {
												gain.push(card);
											} else {
												nogain++;
											}
										}
										if (gain.length) {
											player.gain(gain, 'draw', 'log');
										}
										if (nogain > 0) {
											player.draw(nogain);
										}
										player.storage.lg_xushu = [];
										('step 1');
										player.unmarkSkill('lg_xushu');
										trigger.changeToZero();
									},
								},
							},
							group: ['lg_xushu_draw'],
							prompt(event, player) {
								var list = [];
								var history = event.player.getHistory('useCard');
								for (var i = 0; i < history.length; i++) {
									if (history[i].card.name && history[i].isPhaseUsing()) list.add(history[i].card);
								}
								return get.prompt('lg_xushu', event.player) + '<br>拟似' + get.translation(list);
							},
							logTarget: 'player',
							init(player) {
								player.storage.lg_xushu = [];
							},
							mark: true,
							marktext2: '虚',
							markimage: 'extension/幻颜风华/Trace/lg_trace_xushu.jpg',
							intro: {
								mark(dialog, storage, player) {
									if (!storage || !storage.length) return '无';
									var list = [];
									for (var i = 0; i < storage.length; i++) {
										list.push([get.translation(get.type(storage[i])), '', storage[i].name]);
									}
									dialog.addAuto([list, 'vcard']);
								},
								markcount(storage, player) {
									return storage.length;
								},
							},
							trigger: {
								global: 'phaseUseEnd',
							},
							check(event, player) {
								var list = [];
								var history = event.player.getHistory('useCard');
								for (var i = 0; i < history.length; i++) {
									if (history[i].card.name && history[i].isPhaseUsing()) list.add(history[i].card);
								}
								return list.length >= 3;
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (player.storage.lg_xushu.length) return false;
								var history = event.player.getHistory('useCard');
								for (var i = 0; i < history.length; i++) {
									if (history[i].card.name && history[i].isPhaseUsing()) return true;
								}
								return false;
							},
							content() {
								var list = [];
								var history = trigger.player.getHistory('useCard');
								for (var i = 0; i < history.length; i++) {
									if (history[i].card.name && history[i].isPhaseUsing()) list.add(history[i].card);
								}
								player.storage.lg_xushu = list;
								player.markSkill('lg_xushu');
							},
						},
						lg_xushumoshu: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								global: 'useCardAfter',
							},
							filter(event, player) {
								if (event.card.suit != 'diamond') return false;
								if (get.itemtype(event.cards) != 'cards') return false;
								if (event.player == player) return false;
								return event.targets && event.targets.length;
							},
							content() {
								trigger.player.addMark('lg_xushumoshu_mark', 1);
							},
							group: 'lg_xushumoshu_use',
							subSkill: {
								use: {
									trigger: {
										global: 'useCard',
									},
									filter(event, player) {
										if (event.card.suit != 'club') return false;
										if (get.type(event.card) != 'trick' && event.card.name != 'sha') return false;
										return event.player.hasMark('lg_xushumoshu_mark') && event.targets.includes(player);
									},
									check(event, player) {
										return get.effect(event.player, { name: 'sha' }, player, player) > 0;
									},
									prompt2(event, player) {
										var cardname = get.translation(event.card);
										var targetname = get.translation(event.player);
										return '令' + targetname + '弃置一枚<虚数>标记？';
									},
									content() {
										trigger.player.removeMark('lg_xushumoshu_mark', 1);
										player.useCard({ name: 'sha' }, trigger.player).set('addCount', false);
									},
								},
								mark: {
									markimage: 'extension/幻颜风华/Trace/lg_trace_xushu.jpg',
									intro: {
										name: '虚数',
										content: '虚数魔术',
									},
								},
							},
						},
						lg_xushumoshu1: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								global: 'useCardAfter',
							},
							filter(event, player) {
								if (event.card.suit != 'club') return false;
								if (get.itemtype(event.cards) != 'cards') return false;
								if (event.player == player) return false;
								return event.targets && event.targets.length;
							},
							content() {
								trigger.player.addMark('lg_xushumoshu1_mark', 1);
							},
							group: 'lg_xushumoshu1_use',
							subSkill: {
								use: {
									trigger: {
										global: 'useCard',
									},
									filter(event, player) {
										if (event.card.suit != 'diamond') return false;
										if (get.type(event.card) != 'trick' && event.card.name != 'sha') return false;
										return event.player.hasMark('lg_xushumoshu1_mark') && event.targets.includes(player);
									},
									check(event, player) {
										return get.effect(event.player, { name: 'lg_moshuxishou' }, player, player) > 0;
									},
									prompt2(event, player) {
										var cardname = get.translation(event.card);
										var targetname = get.translation(event.player);
										return '令' + targetname + '弃置一枚<虚数>标记？';
									},
									content() {
										trigger.player.removeMark('lg_xushumoshu1_mark', 1);
										player.useCard({ name: 'lg_moshuxishou' }, trigger.player).set('addCount', false);
									},
								},
								mark: {
									markimage: 'extension/幻颜风华/Trace/lg_trace_xushu.jpg',
									intro: {
										name: '虚数',
										content: '虚数魔术',
									},
								},
							},
						},
						lg_moshuxishou1: {
							trigger: {
								player: 'judgeEnd',
							},
							forced: true,
							check(event, player) {
								// if(get.attitude(player,event.player)>0&&event.card.name=='lebu'&&result.suit!='heart') return true;
								return get.attitude(player, event.player) <= 0;
							},
							filter(event, player) {
								return player != event.player && event.player.countCards('he');
							},
							content() {
								player.draw();
							},
							ai: {
								order: 5,
							},
						},
						lg_moshuxishou2: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'lg_moshuxishou1After',
							},
							content() {
								player.gainPlayerCard(trigger.player, 2, 'h');
							},
						},
						lg_zhenwang_jiantongying: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_beicanmingyun: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								target: 'useCardToTarget',
								player: 'useCardToPlayer',
							},
							filter(event, player) {
								var evt = event.parent;
								if (evt.targets.length != 1) return false;
								return !player.hasSkill('lg_beicanmingyun_off') && event.card.suit == 'club' && event.player != event.target && player.countCards('h');
							},
							subSkill: {
								off: {
									charlotte: true,
								},
							},
							forced: true,
							content() {
								'step 0';
								var tp = trigger.player;
								var tt = trigger.target;
								var tc = trigger.card;
								player.chooseToDiscard('h', get.prompt('lg_beicanmingyun', tt == player ? tp : tt), [1, 4]).set('ai', function (card) {
									if (tt == player) {
										if (get.attitude(player, tp) > 0) {
											if (player.countCards('h') <= 1) {
												return 4 - get.value(card);
											}
											return -3;
										}
										if (tp.countCards('he') == 0) {
											return -3;
										}
										if (ui.selected.cards.length >= tp.countCards('he')) {
											return -3;
										}
										return 6 - get.value(card);
									} else {
										if (get.attitude(player, tt) > 0) {
											return -3;
										}
										if (tt.countCards('h') == 0) {
											return -3;
										}
										if (!_status.event.isPhaseUsing(player)) {
											if (ui.selected.cards.length >= tt.countCards('he')) {
												return -3;
											}
											return 4 - get.value(card);
										}
										if (player.countMark('lg_beicanmingyun_xing') >= 7) {
											if (ui.selected.cards.length >= tt.countCards('he')) {
												return -3;
											}
											return 4 - get.value(card);
										}
										if (card.name == 'sha') {
											return 3;
										}
										return player.getUseValue(card) > 0 ? -2 : 1;
									}
								});
								('step 1');
								if (result && result.cards && result.cards.length) {
									player.addTempSkill('lg_beicanmingyun_off');
									var tar = trigger.player == player ? trigger.target : trigger.player;
									tar.chooseToDiscard(true, 'he', result.cards.length);
								} else {
									event.finish();
								}
								('step 2');
								if (trigger.target.countCards('h') == 0) {
									trigger.parent.targets.remove(trigger.target);
									game.log(trigger.player, '使用的', trigger.card, '取消了目标:', trigger.target, '');
								}
							},
							ai: {
								expose: 2,
								threaten(player, target) {
									if (target.countCards('h') == 0) {
										return 4;
									}
									return 0.9;
								},
							},
						},
						lg_cishizhie: {
							trigger: {
								global: 'useCardEnd',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_cishizhie.jpg',
							intro: {
								content: '未发动',
							},
							audio: 'ext:幻颜风华/audio:2',
							filter(event, player) {
								if (event.player == player) return false;
								if (!event.cards || !event.cards.length || !event.cards.filterInD('od').length) return false;
								if (get.type(event.card) != 'trick') return false;
								if (event.card.suit != 'club') return false;
								return !game.hasPlayer2(function (current) {
									return current.getHistory('damage', function (card) {
										return card.card == event.card;
									}).length;
								});
							},
							content() {
								player.$skill('此世之恶的诞生');
								trigger.player.turnOver();
								player.gain(trigger.cards.filterInD('od'), 'gain2');
								player.removeSkill('lg_cishizhie');
							},
						},
						lg_cishizhie1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_cishizhieAfter',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseControl('heart2', 'diamond2', 'club2', 'spade2').set('ai', function (event) {
									var players = game.filterPlayer();
									var danger = 0;
									var friend = 0;
									for (var i = 0; i < players.length; i++) {
										if (players[i] == player) continue;
										if (get.attitude(player, players[i]) > 0) {
											friend += 1;
											if (players[i].hp <= 2) danger += 1;
										}
										if (get.attitude(player, players[i]) < 0) {
											friend -= 1;
											if (players[i].hp <= 2) danger -= 1;
										}
									}
									if (friend >= 1 || danger <= -1) {
										if (Math.random() >= 0.3) return 'heart2';
										return 'diamond2';
									} else if (friend <= -1 || danger >= 1) {
										if (Math.random() >= 0.5) return 'spade2';
										return 'club2';
									}
									var rand = Math.ceil(Math.random() * 6);
									var suit = 'heart2';
									if ([1, 4].includes(rand)) {
										suit = 'diamond2';
									} else if ([2, 5].includes(rand)) {
										suit = 'club2';
									} else if (rand == 3) {
										suit = 'spade2';
									} else {
										suit = 'heart2';
									}
									return suit;
								});
								('step 1');
								if (result.control) {
									game.log(player, '选择了' + get.translation(result.control));
									var players = game.filterPlayer();
									for (var i = 0; i < players.length; i++) {
										if (players[i] == player) continue;
										players[i].addSkill('lg_cishizhie1_' + result.control);
									}
								}
							},
							subSkill: {
								heart2: {
									charlotte: true,
									markimage: 'extension/幻颜风华/Trace/lg_trace_cishizhie.jpg',
									mark: true,
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardUsable(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardRespondable(card, player) {
											if (card.suit == 'heart') return false;
										},
										cardSavable(card, player) {
											if (card.suit == 'heart') return false;
										},
										aiValue(player, card) {
											if (card.suit == 'heart') return -1;
										},
										aiUseful(player, card) {
											if (card.suit == 'heart') return -1;
										},
									},
									intro: {
										content: '你不能使用或打出♥️️牌',
									},
									ai: {
										useful: -1,
										value: -1,
										effect: {
											player(card, player, target, current) {
												if (card.suit == 'heart') return 'zeroplayertarget';
											},
										},
									},
								},
								diamond2: {
									charlotte: true,
									markimage: 'extension/幻颜风华/Trace/lg_trace_cishizhie.jpg',
									mark: true,
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'diamond') return false;
										},
										cardUsable(card, player) {
											if (card.suit == 'diamond') return false;
										},
										cardRespondable(card, player) {
											if (card.suit == 'diamond') return false;
										},
										cardSavable(card, player) {
											if (card.suit == 'diamond') return false;
										},
										aiValue(player, card) {
											if (card.suit == 'diamond') return -1;
										},
										aiUseful(player, card) {
											if (card.suit == 'diamond') return -1;
										},
									},
									intro: {
										content: '你不能使用或打出♦️️牌',
									},
									ai: {
										useful: -1,
										value: -1,
										effect: {
											player(card, player, target, current) {
												if (card.suit == 'diamond') return 'zeroplayertarget';
											},
										},
									},
								},
								club2: {
									charlotte: true,
									markimage: 'extension/幻颜风华/Trace/lg_trace_cishizhie.jpg',
									mark: true,
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'club') return false;
										},
										cardUsable(card, player) {
											if (card.suit == 'club') return false;
										},
										cardRespondable(card, player) {
											if (card.suit == 'club') return false;
										},
										cardSavable(card, player) {
											if (card.suit == 'club') return false;
										},
										aiValue(player, card) {
											if (card.suit == 'club') return -1;
										},
										aiUseful(player, card) {
											if (card.suit == 'club') return -1;
										},
									},
									ai: {
										useful: -1,
										value: -1,
										effect: {
											player(card, player, target, current) {
												if (card.suit == 'club') return 'zeroplayertarget';
											},
										},
									},
									intro: {
										content: '你不能使用或打出♣️️牌',
									},
								},
								spade2: {
									charlotte: true,
									markimage: 'extension/幻颜风华/Trace/lg_trace_cishizhie.jpg',
									mark: true,
									mod: {
										cardEnabled(card, player) {
											if (card.suit == 'spade') return false;
										},
										cardUsable(card, player) {
											if (card.suit == 'spade') return false;
										},
										cardRespondable(card, player) {
											if (card.suit == 'spade') return false;
										},
										cardSavable(card, player) {
											if (card.suit == 'spade') return false;
										},
										aiValue(player, card) {
											if (card.suit == 'spade') return -1;
										},
										aiUseful(player, card) {
											if (card.suit == 'spade') return -1;
										},
									},
									ai: {
										useful: -1,
										value: -1,
										effect: {
											player(card, player, target, current) {
												if (card.suit == 'spade') return 'zeroplayertarget';
											},
										},
									},
									intro: {
										content: '你不能使用或打出♠️️牌',
									},
								},
							},
						},
						lg_jiantongying1_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xuancaizhixu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseDrawBefore',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget('发动此技能？', function (card, player, target) {
									return player != target;
								}).ai = function (target) {
									var hasTrick = player.hasCard(function (card) {
										return ['trick'].includes(get.type(card));
									}, 'h');
									if (get.attitude(player, target) <= 0) return 0;
									var result = Math.max(1, 5 - target.countCards('h'));
									if (player.isHealthy()) {
										if (!hasTrick) {
											if (player.hp >= player.countCards('h')) {
												return player.hasCard(function (card) {
													return get.tag(card, 'damage');
												})
													? 0
													: result;
											} else {
												return player.hasCard(function (card) {
													return get.tag(card, 'damage') && card.name != 'sha';
												})
													? 0
													: result;
											}
										}
									} else {
										var compare = target.countCards('h') + 1 >= player.countCards('h');
										if (!hasTrick && player.countCards('h') < player.hp) return compare ? 10 : result;
										if (player.hp <= 2 && compare && ((player.countCards('h') >= 2 && player.countCards('h', 'sha') <= 1) || player.countCards('h') < 2)) return 10;
										return 0;
									}
								};
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
									trigger.cancel();
									result.targets[0].recover(2);
								} else {
									event.finish();
								}
								('step 2');
								if (event.target && event.target.num('h') == player.countCards('h')) {
									event.target.gain(
										get.cardPile(function (card) {
											return card.number == '1';
										}),
										'gain2'
									);
								}
							},
						},
						lg_shensuitiankong: {
							audio: 'ext:幻颜风华/audio:2',
							ai: {
								threaten(player, target) {
									var nm = player.getDamagedHp() * 0.2;
									return 0.7 + nm;
								},
							},
							usable: 1,
							trigger: {
								player: 'useCard',
							},
							forced: true,
							filter(event, player) {
								var type = get.type(event.card);
								return type == 'trick';
							},
							content() {
								'step 0';
								var goon = false;
								var info = get.info(trigger.card);
								if (trigger.targets && !info.multitarget) {
									var players = game.filterPlayer();
									for (var i = 0; i < players.length; i++) {
										if (lib.filter.targetEnabled2(trigger.card, player, players[i]) && !trigger.targets.includes(players[i])) {
											goon = true;
											break;
										}
									}
								}
								if (goon) {
									var num1 = Math.max(1, player.getDamagedHp());
									player
										.chooseTarget('指定至多' + num1 + '名其他角色角色为' + get.translation(trigger.card) + '的额外目标？', [1, num1], function (card, player, target) {
											var trigger = _status.event.getTrigger();
											if (trigger.targets.includes(target)) return false;
											return lib.filter.targetEnabled2(trigger.card, _status.event.player, target);
										})
										.set('ai', function (target) {
											var trigger = _status.event.getTrigger();
											var player = _status.event.player;
											return get.effect(target, trigger.card, player, player);
										});
								} else {
									if (!info.multitarget && trigger.targets && trigger.targets.length > 1) {
										event.goto(3);
									}
								}
								('step 1');
								if (result.bool) {
									if (!event.isMine()) game.delayx();
									event.target = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (event.target) {
									game.log(event.target, '额外成为了' + get.translation(trigger.card) + '的目标');
									trigger.targets.addArray(event.target);
								}
								event.finish();
								('step 3');
								var num2 = Math.max(1, player.getDamagedHp());
								player
									.chooseTarget('指定至多' + num2 + '名角色取消成为' + get.translation(trigger.card) + '的目标？', [1, num2], function (card, player, target) {
										return _status.event.getTrigger().targets.includes(target);
									})
									.set('ai', function (target) {
										var trigger = _status.event.getTrigger();
										return -get.effect(target, trigger.card, trigger.player, _status.event.player);
									});
								('step 4');
								if (result.bool) {
									event.targets = result.targets;
									if (event.isMine()) {
										event.finish();
									}
									for (var i = 0; i < result.targets.length; i++) {
										trigger.targets.remove(result.targets[i]);
									}
								} else {
									event.finish();
								}
								('step 5');
								if (!player.isMinHandcard()) player.phaseDraw();
							},
						},
						lg_shinaikong_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_shimeng: {
							audio: 'ext:幻颜风华/audio:2',
							_priority: 13,
							trigger: {
								player: ['damageAfter'],
								source: ['damageAfter'],
							},
							filter(event, player) {
								if (event.player == player) {
									return player.countCards('h') < player.getDamagedHp() || (player.countCards('h') > player.getDamagedHp() && event.source);
								} else {
									return player.countCards('h') != player.hp;
								}
							},
							prompt2(event, player) {
								if (event.player == player) {
									var nm = player.countCards('h') - player.getDamagedHp();
									if (nm < 0) return '摸' + -nm + '张牌？';
									else return '弃置' + nm + '张牌,令' + get.translation(event.source) + '随机废除一个装备栏？';
								} else {
									var nm = player.countCards('h') - player.hp;
									if (nm < 0) return '摸' + -nm + '张牌？';
									else return '弃置' + nm + '张牌,令' + get.translation(event.player) + '随机废除一个装备栏？';
								}
							},
							check(event, player) {
								if (event.player == player) {
									var nm = player.countCards('h') - player.getDamagedHp();
									if (nm == -1 || nm > 0) return true;
								} else {
									var nm = player.countCards('h') - player.hp;
									if (nm == -1 || nm > 0) return true;
								}
							},
							content() {
								if (trigger.player == player) {
									var nm = player.countCards('h') - player.getDamagedHp();
									if (nm < 0) {
										player.draw(-nm);
									} else {
										player.chooseToDiscard('h', nm, true);
										trigger.source.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
									}
								} else {
									var nm = player.countCards('h') - player.hp;
									if (nm < 0) {
										player.draw(-nm);
									} else {
										player.chooseToDiscard('h', nm, true);
										trigger.player.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
									}
								}
							},
						},
						lg_zuimian: {
							audio: 'ext:幻颜风华/audio:2',
							_priority: 13,
							trigger: {
								player: ['damageAfter'],
								source: ['damageAfter'],
							},
							filter(event, player) {
								if (event.player == player) {
									return event.source && event.source.isAlive() && event.source.countCards('h');
								} else {
									return event.player.isAlive() && event.player.countCards('h');
								}
							},
							prompt2(event, player) {
								if (event.player == player) {
									return '令' + get.translation(event.source) + '展示手牌？';
								} else {
									return '令' + get.translation(event.player) + '展示手牌？';
								}
							},
							check(event, player) {
								if (event.player == player) {
									return get.attitude(player, event.source) <= 0 && event.source.countCards('h') >= 2;
								} else {
									return get.attitude(player, event.player) <= 0 && event.player.countCards('h') >= 2;
								}
							},
							content() {
								'step 0';
								if (trigger.player == player) {
									event.tar = trigger.source;
									event.cds = event.tar.getCards('h', { suit: 'heart' });
								} else {
									event.tar = trigger.player;
									event.cds = event.tar.getCards('h', function (card) {
										return card.suit != 'heart';
									});
								}
								event.tar.showHandcards();
								('step 1');
								if (event.cds.length) {
									player.chooseBool('令' + get.translation(event.tar) + '弃置' + get.translation(event.cds) + '？').ai = function (event, player) {
										var att = get.attitude(player, event.tar);
										return att <= 0;
									};
								} else {
									player.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
									event.finish();
								}
								('step 2');
								if (result.bool) {
									event.tar.discard(event.cds);
								} else {
									player.disableEquip(['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet());
								}
							},
							ai: {
								expose: 0.3,
								maixie: true,
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
										if (!target.hasFriend()) return;
										if (get.tag(card, 'damage') && player.countCards('h', { suit: 'heart' }) > 1) return [1, 1, 1, -1];
									},
								},
							},
						},
						lg_canhuncaozong: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'chooseToUse',
							log: false,
							selectCard: -1,
							filterCard() {
								return false;
							},
							filter(event, player) {
								if (player.hasSkill('lg_canhuncaozong_d')) return false;
								return game.hasPlayer(function (current) {
									if (player == current) return false;
									return current.countCards('h');
								});
							},
							viewAs: {
								name: 'sha',
							},
							prompt: ':选择【杀】的目标',
							group: ['lg_canhuncaozong_c'],
							subSkill: {
								a: {
									charlotte: true,
									silent: true,
									onremove(player) {
										if (!player.hasSkill('lg_canhuncaozong_b')) player.loseHp();
										player.removeSkill('lg_canhuncaozong_b');
									},
									trigger: {
										source: 'damageEnd',
									},
									filter(event, player) {
										if (!event.card || event.card.name != 'sha') return false;
										var evt = event.getParent(2);
										if (evt.skill == 'lg_canhuncaozong') return true;
									},
									content() {
										player.addTempSkill('lg_canhuncaozong_b');
									},
									forced: true,
									popup: false,
								},
								b: {
									charlotte: true,
								},
								c: {
									forced: true,
									trigger: {
										player: 'chooseToRespondBegin',
									},
									filter(event, player) {
										if (event.responded) return false;
										if (!event.filterCard || !event.filterCard({ name: 'sha' }, player, event)) return false;
										if (!lib.filter.cardRespondable({ name: 'sha' }, player, event)) return false;
										if (player.hasSkill('lg_canhuncaozong_d')) return false;
										return game.hasPlayer(function (current) {
											if (player == current) return false;
											return current.countCards('h');
										});
									},
									content() {
										'step 0';
										player
											.chooseTarget(get.prompt2('lg_canhuncaozong'), function (card, player, target) {
												return player != target && target.countCards('h');
											})
											.set('ai', function (target) {
												var player = _status.event.player;
												if (
													player.hp == 1 &&
													!player.countCards('h', function (card) {
														return card.name == 'tao' || card.name == 'jiu';
													})
												)
													return 0;
												return -get.attitude(player, target);
											});
										('step 1');
										if (result.bool) {
											player.addTempSkill('lg_canhuncaozong_d');
											event.target = result.targets[0];
										} else event.finish();
										('step 2');
										player.line(event.target, 'green');
										player.choosePlayerCard('h', true, event.target);
										('step 3');
										player.addTempSkill('lg_canhuncaozong_a', { player: 'respondAfter' });
										event.target.lose(result.links, ui.special);
										trigger.untrigger();
										trigger.responded = true;
										trigger.result = { bool: true, card: { name: 'sha' }, cards: result.links };
									},
									ai: {
										respondSha: true,
										skillTagFilter(player) {
											if (player.hasSkill('lg_canhuncaozong_d')) return false;
											if (
												!game.hasPlayer(function (current) {
													if (player == current) return false;
													return current.countCards('h');
												})
											)
												return false;
										},
										effect: {
											target(card, player, target) {
												if (target.hasSkill('lg_canhuncaozong_d')) return;
												if (target.hp < 2) return;
												if (
													!game.hasPlayer(function (current) {
														if (target == current) return false;
														return current.countCards('h') && get.attitude(current, target) < 0;
													})
												)
													return;
												if (card.name == 'juedou') return [0, 0.3];
											},
										},
									},
								},
								d: {
									charlotte: true,
								},
							},
							precontent() {
								'step 0';
								player.addTempSkill('lg_canhuncaozong_d');
								('step 1');
								player
									.chooseTarget('发动此技能', true, function (card, player, target) {
										return player != target && target.countCards('h');
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										return -get.attitude(player, target);
									});
								('step 2');
								event.target = result.targets[0];
								player.line(event.target, 'green');
								player.choosePlayerCard('h', true, event.target);
								('step 3');
								event.target.lose(result.links, ui.special);
								event.result.cards = result.links;
								player.addTempSkill('lg_canhuncaozong_a', { player: ['shaAfter', 'shaCancelled'] });
							},
							ai: {
								respondSha: true,
								skillTagFilter(player) {
									if (player.hasSkill('lg_canhuncaozong_d')) return false;
									if (
										!game.hasPlayer(function (current) {
											if (player == current) return false;
											return current.countCards('h');
										})
									)
										return false;
								},
								basic: {
									useful: [5, 1],
									value: [5, 1],
								},
								order() {
									if (_status.event.player.hasSkillTag('presha', true, null, true)) return 10;
									return 3.1;
								},
								result: {
									player(player, target) {
										if (player.hp < 2) return -10;
										if (player.hp == 2) return player.countCards('h', 'tao') ? 1 : -4;
										return 0.1;
									},
									target(player, target) {
										if (player.hasSkill('jiu') && !target.getEquip('baiyin')) {
											if (get.attitude(player, target) > 0) {
												return -6;
											} else {
												return -3;
											}
										}
										return -1.5;
									},
								},
								tag: {
									respond: 1,
									respondShan: 1,
									damage(card) {
										if (card.nature == 'poison') return;
										return 1;
									},
									natureDamage(card) {
										if (card.nature) return 1;
									},
									fireDamage(card, nature) {
										if (card.nature == 'fire') return 1;
									},
									thunderDamage(card, nature) {
										if (card.nature == 'thunder') return 1;
									},
									poisonDamage(card, nature) {
										if (card.nature == 'poison') return 1;
									},
									jy_duDamage(card, nature) {
										if (card.nature == 'jy_du') return 1;
									},
									jy_xieDamage(card, nature) {
										if (card.nature == 'jy_xie') return 1;
									},
								},
								yingbian(card, player, targets, viewer) {
									if (get.attitude(viewer, player) <= 0) return 0;
									var base = 0,
										hit = false;
									if (get.cardtag(card, 'yingbian_hit')) {
										hit = true;
										if (
											targets.filter(function (target) {
												return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
											})
										)
											base += 5;
									}
									if (get.cardtag(card, 'yingbian_all')) {
										if (
											game.hasPlayer(function (current) {
												return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
											})
										)
											base += 5;
									}
									if (get.cardtag(card, 'yingbian_damage')) {
										if (
											targets.filter(function (target) {
												return (
													get.attitude(player, target) < 0 &&
													(hit ||
														!target.mayHaveShan() ||
														player.hasSkillTag(
															'directHit_ai',
															true,
															{
																target: target,
																card: card,
															},
															true
														)) &&
													!target.hasSkillTag('filterDamage', null, {
														player: player,
														card: card,
														jiu: true,
													})
												);
											})
										)
											base += 5;
									}
									return base;
								},
								canLink(player, target, card) {
									if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
									if (
										target.mayHaveShan() &&
										!player.hasSkillTag(
											'directHit_ai',
											true,
											{
												target: target,
												card: card,
											},
											true
										)
									)
										return false;
									if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
									return true;
								},
							},
						},
						lg_lalaiye_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xiemozhizhui: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							filter(event, player) {
								if (event.card && event.card.name == 'sha') return false;
								return event.source; //QQQ
							},
							content() {
								'srep 0';
								event.count = Math.min(trigger.num, 9);
								trigger.cancel();
								('step 1');
								event.count--;
								trigger.source.loseHp();
								trigger.source.chooseUseTarget({ name: 'juedou' }, true, false);
								('step 2');
								if (event.count > 0) event.goto(1);
							},
						},
						lg_nixi: {
							mod: {
								globalFrom(from, to, distance) {
									if (from.hp < 1) return distance - 3;
								},
							},
							forced: true,
							trigger: {
								player: 'dyingBegin',
							},
							filter(event, player) {
								return player.countCards('h') && event.source;
							},
							content() {
								'step 0';
								var num = trigger.source.countCards('he', { suit: 'club' });
								player.drawTo(2 * num);
								('step 1');
								player.chooseToUse('使用一张牌？');
								('step 2');
								if (result.bool && player.countCards('h') > 0 && player.hp < 1) event.goto(1);
							},
							ai: {
								threaten: 1.1,
							},
						},
						lg_pannizhe: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'dyingBegin',
							},
							forced: true,
							callback() {
								'step 0';
								player.gain(card, 'gain2', 'log');
								('step 1');
								var num = Math.ceil(player.hp / 2);
								var evt = event.getParent(2);
								if (event.judgeResult.bool == false) {
									player.damage(num, 'nocard', evt.player);
								}
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_pannizhe'), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										return get.damageEffect(target, _status.event.player, _status.event.player);
									});
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
									player.chooseControl('heart', 'diamond', 'club', 'spade').set('ai', function (event) {
										switch (Math.floor(Math.random() * 6)) {
											case 0:
												return 'heart';
											case 1:
											case 4:
											case 5:
												return 'diamond';
											case 2:
												return 'club';
											case 3:
												return 'spade';
										}
									});
								} else {
									event.finish();
								}
								('step 2');
								game.log(player, '选择了' + get.translation(result.control + 2));
								event.choice = result.control;
								target.popup(event.choice);
								var next = target.judge(function (card) {
									if (card.suit != event.choice) return -1;
									return 0;
								});
								next.callback = lib.skill.lg_pannizhe.callback;
								next.judge2 = function (result) {
									return result.bool;
								};
							},
						},
						lg_guxing_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_huangshi: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'roundStart',
							},
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							check(event, player) {
								var num = 0;
								var a = player.countCards('h', { suit: 'spade' });
								var b = player.countCards('h', { suit: 'club' });
								var c = player.countCards('h', { suit: 'heart' });
								var d = player.countCards('h', { suit: 'diamond' });
								var nh = a + b + c + d;
								if (a > 0) num++;
								if (b > 0) num++;
								if (c > 0) num++;
								if (d > 0) num++;
								if (num == 1 && nh > 2) return false;
								if (num == 2 && nh > 4) return false;
								if (num == 3 && nh > 6) return false;
								if (num == 4 && nh > 8) return false;
								return true;
							},
							forced: true,
							content() {
								'step 0';
								var a = player.countCards('h', { suit: 'spade' });
								var b = player.countCards('h', { suit: 'club' });
								var c = player.countCards('h', { suit: 'heart' });
								var d = player.countCards('h', { suit: 'diamond' });
								if (a > 1) player.discardPlayerCard('h', a - 1, player, true, { suit: 'spade' });
								if (b > 1) player.discardPlayerCard('h', b - 1, player, true, { suit: 'club' });
								if (c > 1) player.discardPlayerCard('h', c - 1, player, true, { suit: 'heart' });
								if (d > 1) player.discardPlayerCard('h', d - 1, player, true, { suit: 'diamond' });
								('step 1');
								var num = player.countCards('h');
								player.draw(num);
							},
							ai: {
								moreDraw: true,
								threaten: 2,
							},
						},
						lg_huangshizhanji: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return event.player != player && event.num > 0 && event.player.isAlive() && event.player.countCards('h') > 0 && player.countCards('h') > 0;
							},
							check(event, player) {
								return get.attitude(player, event.player) < 0 && player.countCards('h') > 1;
							},
							_priority: 5,
							content() {
								'step 0';
								player.chooseToCompare(trigger.player);
								('step 1');
								if (result.bool && trigger.player.countGainableCards(player, 'hej')) {
									player.discardPlayerCard(trigger.player, true, 'hej');
								}
							},
						},
						lg_fantuanshijian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'JudgeBegin',
							},
							filter(event, player) {
								return player.hp != player.countCards('h');
							},
							forced: true,
							content() {
								player.recover();
							},
						},
						lg_gongzhutuxi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseUseAfter',
							},
							filter(event, player) {
								return !player.isMinHp();
							},
							forced: true,
							content() {
								'step 0';
								var hs1 = game.filterPlayer(function (current) {
									return current.getHistory('damage').length;
								});
								var tgs = game.filterPlayer(function (current) {
									return current.hasSkill('lg_gongzhutuxi_mark') && current.storage.lg_gongzhutuxi_mark && current.storage.lg_gongzhutuxi_mark > 0;
								});
								if (!player.storage.lg_gongzhutuxi) {
									tgs.remove(hs1);
								}
								if (tgs.length) {
									var func = function (tar, his) {
										var nm = 0;
										for (var i = 0; i < his.length; i++) {
											for (var j = 0; i < his[i].targets.length; j++) {
												if (tar == his[i].targets[j]) nm++;
											}
										}
										return nm;
									};
									var str = '发动此技能';
									if (player.storage.lg_gongzhutuxi) str = '发动此技能';
									player
										.chooseTarget(get.prompt('lg_gongzhutuxi'), str, function (card, player, target) {
											return tgs.includes(target);
										})
										.set('ai', function (target) {
											var eff = get.damageEffect(target, player, player);
											return eff;
										});
								} else event.finish();
								('step 1');
								if (result.bool) {
									var tar = result.targets[0];
									var nm = tar.storage.lg_gongzhutuxi_mark;
									tar.damage(player, nm, 'nocard');
								}
							},
							ai: {
								damage: true,
								expose: 0.5,
							},
							group: ['lg_gongzhutuxi_rec'],
							subSkill: {
								rec: {
									trigger: {
										player: 'useCardToTargeted',
									},
									filter(event, player) {
										if (!player.isPhaseUsing()) return false;
										if (!event.target) return false;
										return event.target != player;
									},
									_priority: -12,
									forced: true,
									content() {
										if (!trigger.target.hasSkill('lg_gongzhutuxi_mark')) {
											trigger.target.addTempSkill('lg_gongzhutuxi_mark');
											trigger.target.storage.lg_gongzhutuxi_mark = 0;
											trigger.target.storage.lg_gongzhutuxi_mark1 = player;
										}
										trigger.target.storage.lg_gongzhutuxi_mark++;
										trigger.target.markSkill('lg_gongzhutuxi_mark');
									},
								},
								mark: {
									mark: true,
									onremove(player) {
										player.unmarkSkill('lg_gongzhutuxi_mark');
										delete player.storage.lg_gongzhutuxi_mark;
									},
									intro: {
										content(storage, player, skill) {
											var pla = player.storage.lg_gongzhutuxi_mark1;
											var nm = player.storage.lg_gongzhutuxi_mark;
											return '' + get.translation(pla) + '对你使用过的牌数: ' + nm;
										},
									},
								},
							},
						},
						lg_peikelimu_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_heiying: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'discardAfter',
							},
							forced: true,
							content() {
								'step 0';
								event.cc = [0, 0, 0];
								for (var i = 0; i < trigger.cards.length; i++) {
									switch (trigger.cards[i].original) {
										case 'h':
											event.cc[0]++;
											break;
										case 'e':
											event.cc[1]++;
											break;
										case 'j':
											event.cc[2]++;
											break;
									}
								}
								event.nm = 0;
								('step 1');
								if (event.cc[event.nm] != 0) {
									var tp = event.cc[event.nm];
									switch (event.nm) {
										case 0:
											event.mk = 'h';
											event.str = '手牌区';
											break;
										case 1:
											event.mk = 'e';
											event.str = '装备区';
											break;
										case 2:
											event.mk = 'j';
											event.str = '判定区';
											break;
									}
									player.chooseTarget(get.prompt('lg_heiying'), '令至多' + tp + '名其他角色各将其' + event.str + '内的一张牌置于牌堆顶.', [1, tp], function (card, player, target) {
										return player != target && target.countCards(event.mk);
									}).ai = function (target) {
										var att = get.attitude(player, target);
										if (event.mk != 'j') return -att;
										return -att;
									};
								} else event.goto(7);
								('step 2');
								if (result.bool) {
									var tars = result.targets;
									event.tars = tars.sort(lib.sort.seat);
								} else event.goto(7);
								('step 3');
								if (event.tars.length) {
									var target = event.tars.shift();
									event.current = target;
								} else event.goto(7);
								('step 4');
								event.current.chooseCard('将' + event.str + '内的一张牌置于牌堆顶', event.mk, 1, true).set('ai', function (card) {
									return 8 - get.value(card);
								});
								('step 5');
								if (result && result.cards) {
									event.cd = result.cards[0];
									event.current.$throw(event.cd, 1000);
									event.current.lose(event.cd);
								}
								('step 6');
								if (event.cd) {
									event.cd.fix();
									ui.cardPile.insertBefore(event.cd, ui.cardPile.firstChild);
								}
								event.goto(3);
								('step 7');
								if (event.nm < 2) {
									event.nm++;
									event.goto(1);
								} else event.finish();
							},
							ai: {
								nodiscard: true,
								expose: 0.3,
							},
						},
						lg_heiying1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'lg_heiyingAfter',
							},
							check(event, player) {
								return player.isTurnedOver() || player.maxHp - player.hp >= 2;
							},
							content() {
								'step 0';
								player.turnOver();
								('step 1');
								var num = game.roundNumber;
								if (player.isTurnedOver()) {
									player.drawTo(num);
								} else {
									player.randomDiscard(1, 'he');
								}
							},
						},
						lg_molitunshi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseUseBegin',
							},
							filter(event, player) {
								return player.countCards('h') > 0 && event.player != player && event.player.countCards('h') > 0;
							},
							check(event, player) {
								var att = get.attitude(player, event.player);
								var cards = player.getCards('h');
								if (att < 0) {
									for (var i = 0; i < cards.length; i++) {
										if (get.value(cards[i]) < 5 && cards[i].number > Math.min(12, 6 + event.player.countCards('h'))) return true;
									}
									return false;
								} else if (att > 0) {
									for (var i = 0; i < cards.length; i++) {
										if (get.value(cards[i]) < 8 && cards[i].number < Math.min(12, 5 + event.player.countCards('h'))) return true;
									}
									return false;
								}
								for (var i = 0; i < cards.length; i++) {
									if (cards[i].name == 'du') return true;
								}
								return false;
							},
							content() {
								'step 0';
								event.target = trigger.player;
								('step 1');
								player.chooseToCompare(event.target).ai = function (card) {
									if (get.attitude(player, event.target) > 0) {
										return 6 - get.value(card);
									}
									return card.number;
								};
								('step 2');
								if (!result.bool) {
									event.target.draw();
									player.storage.lg_molitunshi_card = result.target;
									event.goto(3);
								} else event.finish();
								('step 3');
								event.list = ['重复', '不重复'];
								player.chooseControl(event.list, true).set('prompt', '重复此流程？').ai = function () {
									//console.log(player.storage.lg_molitunshi_card);
									var att = get.attitude(player, event.target);
									if (att < 0) {
										if (player.storage.lg_molitunshi_card.number > Math.min(12, 6 + event.target.countCards('h'))) return '继续';
										return '不重复';
									} else if (att > 0) {
										if (player.storage.lg_molitunshi_card.number < Math.min(12, 5 + event.target.countCards('h'))) return '继续';
										return '不重复';
									}
									return '不重复';
								};
								('step 4');
								if (result.control == '重复') {
									var next = player
										.chooseToCompare(event.target)
										.set('fixedResult', true)
										.set('ai', function (card) {
											if (get.attitude(player, event.target) > 0) {
												return 6 - get.value(card);
											}
											return card.number;
										});
									next.fixedResult = {};
									next.fixedResult[player.playerid] = player.storage.lg_molitunshi_card;
								} else event.finish();
								('step 5');
								if (!result.bool) {
									event.target.draw();
									player.storage.lg_molitunshi_card = result.target;
									event.goto(3);
								} else event.finish();
							},
							ai: {
								expose: 0.7,
								threaten: 1.2,
							},
						},
						lg_jiantongying2_nei: {
							ai: {
								neg: true,
							},
							init(player) {
								if (player.identity == 'nei') {
									player.addSkill('lg_xushukongjian');
								}
							},
						},
						lg_jiantongying2_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xushukongjian: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							filterTarget(card, player, target) {
								return target.countCards('h') > 0 && target != player;
							},
							filterCard(card, player, target) {
								return true;
							},
							selectCard: 1,
							selectTarget: [1, 1],
							discard: false,
							lose: false,
							content() {
								'step 0';
								targets[0]
									.chooseCard('h', 1, '展示一张手牌', true)
									.set('ai', function (card) {
										if (card.suit == _status.event.cardx.suit) return 2;
										return 1;
									})
									.set('cardx', cards[0]);
								('step 1');
								if (result.bool) {
									player.$compare(cards[0], targets[0], result.cards[0]);
									game.log(player, '展示了', cards[0]);
									game.log(targets[0], '展示了', result.cards[0]);
									if (cards[0].suit == result.cards[0].suit) {
										targets[0].loseHp();
									} else {
										targets[0].chooseToDiscard(2, 'he', '弃置两张牌;或令' + get.translation(player) + '摸一张牌').set('ai', function (card) {
											return -1;
										});
									}
								}
								('step 2');
								if (result.bool == false) player.draw();
							},
							ai: {
								order: 9,
								result: {
									target: 0.5,
								},
							},
						},
						lg_yuwen: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							position: 'he',
							filterCard(card) {
								return card.suit == 'club';
							},
							viewAs: {
								name: 'tao',
							},
							viewAsFilter(player) {
								if (!player.countCards('he', { suit: 'club' })) return false;
							},
							prompt: '将一张♣️️牌当【桃】使用',
							check(card) {
								return 7 - get.value(card);
							},
							ai: {
								threaten: 1.4,
								order: 9,
								basic: {
									order: 7.2,
									useful: 4.5,
									value: 9.2,
								},
								result: {
									target: 2,
									target_use(player, target) {
										// if(player==target&&player.hp<=0) return 2;
										if (player.hasSkillTag('nokeep', true, null, true)) return 2;
										var nd = player.needsToDiscard();
										var keep = false;
										if (nd <= 0) {
											keep = true;
										} else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
											keep = true;
										}
										var mode = get.mode();
										if (target.hp >= 2 && keep && target.hasFriend()) {
											if (target.hp > 2 || nd == 0) return 0;
											if (target.hp == 2) {
												if (
													game.hasPlayer(function (current) {
														if (target != current && get.attitude(target, current) >= 3) {
															if (current.hp <= 1) return true;
															if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
														}
													})
												) {
													return 0;
												}
											}
										}
										if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
										var att = get.attitude(player, target);
										if (att < 3 && att >= 0 && player != target) return 0;
										var tri = _status.event.getTrigger();
										if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
											if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
												var num = game.countPlayer(function (current) {
													if (current.identity == 'fan') {
														return current.countCards('h', 'tao');
													}
												});
												if (num > 1 && player == target) return 2;
												return 0;
											}
										}
										if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
											if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
												return 0;
											}
										}
										if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
											return 0;
										}
										return 2;
									},
								},
								tag: {
									draw: 2,
									recover: 1,
									save: 1,
								},
							},
						},
						lg_menghuanzhiyu: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseBegin',
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget('发动此技能？', [0, Infinity], function (card, player, target) {
										return target != player && target.countCards('hej') > 0;
									})
									.set('ai', function (target) {
										if (player.getFriends().includes(target)) {
											if (target.countCards('j') > 0) return 100;
											if (target.getEquip('baiyin') && target.maxHp - target.hp > 0) return 99;
										} else {
											if (target.countCards('e') > 0) {
												if (target.maxHp - target.hp > 0 && target.countCards('e') == 1 && target.getEquip('baiyin')) return false;
												if (!target.hasSkillTag('equipDraw') || !target.hasSkillTag('receiveEquip')) return 98;
												return -100;
											}
											if (target.countCards('h') > 0) {
												if (target.hasSkill('nohDamage') || target.hasSkillTag('noh') || target.hasSkillTag('loseDraw')) return -100;
												return 97;
											}
											if (target.countCards('j') > 0) {
												if (target.countCards('he') == 0) return -100;
												return 1;
											}
										}
										return false;
									});
								('step 1');
								if (result.bool) {
									player.line(result.targets, 'white');
									event.targets = result.targets;
									event.targets.sort(lib.sort.seat);
									event.gained = event.targets.length;
								} else {
									event.finish();
								}
								('step 2');
								if (event.targets.length) {
									player.gainPlayerCard(event.targets.shift(), 'hej', true);
									event.redo();
								}
								('step 3');
								player.chooseToDiscard('he', event.gained, true);
								if (event.gained == player.hp) player.recover();
							},
							ai: {
								order: 7.5,
								threaten: 2,
								result: {
									player: 1,
								},
							},
						},
						lg_baonue: {
							shaRelated: true,
							trigger: {
								player: 'useCardToPlayered',
							},
							filter(event, player) {
								if (event.targets.length != 1 || !['sha', 'juedou'].includes(event.card.name)) return false;
								var evt2 = event.getParent('phaseUse');
								if (evt2.player != player) return false;
								return (
									player
										.getHistory('useCard', function (evt) {
											return (evt.card.name == 'sha' || evt.card.name == 'juedou') && evt.getParent('phaseUse') == evt2;
										})
										.indexOf(event.parent) == 0
								);
							},
							forced: true,
							content() {
								'step 0';
								player.chooseControl('暴虐①', '暴虐②', 'cancel2').set('prompt', get.prompt2('lg_baonue'));
								('step 1');
								if (result.control && result.control != 'cancel2') {
									var nd = Math.max(0, trigger.target.countCards('h', { suit: ['club'] }));
									if (result.control == 'draw_card') {
										player.drawTo(nd + 1);
									} else {
										var trigger2 = trigger.parent;
										if (typeof trigger2.baseDamage != 'number') {
											trigger2.baseDamage = 1;
										}
										trigger2.baseDamage += nd;
									}
								}
							},
						},
						lg_shensheng: {
							forced: true,
							forceDie: true,
							usable: 1,
							trigger: {
								player: ['dyingAfter', 'linkBegin'],
							},
							content() {
								'step 0';
								event.targets = player.getEnemies().sortBySeat();
								('step 1');
								if (event.targets.length) {
									player.line(event.targets.shift().getDebuff(false).addExpose(0.1), 'green');
									event.redo();
								}
								('step 2');
							},
							ai: {
								threaten: 2,
								expose: 0.2,
								effect: {
									player(card, player) {
										if (_status.currentPhase != player) return;
										if (_status.event.name != 'chooseToUse' || _status.event.player != player) return;
										var num = player.needsToDiscard();
										if (num > 2 || num == 1) return;
										if (get.type(card) == 'basic' && num != 2) return;
										if (get.tag(card, 'gain')) return;
										if (get.value(card, player, 'raw') >= 7) return;
										if (player.hp <= 2) return;
										if (!player.hasSkill('jilue') || player.storage.renjie == 0) {
											return 'zeroplayertarget';
										}
									},
								},
							},
						},
						lg_shangyu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'drawBegin',
							},
							filter(event, player) {
								return player.hp == player.getAttackRange();
							},
							content() {
								'step 0';
								var cards = get.cards(4);
								game.cardsGotoOrdering(cards);
								player.showCards(cards, '伤愈');
								var cardsx = [];
								for (var i = 0; i < cards.length; i++) {
									if (get.type(cards[i]) == 'basic') cardsx.push(cards[i]);
								}
								event.cards = cardsx;
								if (event.cards.length) player.chooseBool('获得' + get.translation(cardsx) + '？').set('ai', lib.filter.all);
								else event.finish();
								('step 1');
								if (result.bool) player.gain(event.cards, 'gain2');
							},
						},
						lg_menglong: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'recoverBegin',
							},
							filter(event, player) {
								if (!player.countCards('h')) return false;
								return game.hasPlayer(function (current) {
									if (player == current) return false;
									return current.countCards('h');
								});
							},
							check(event, player) {
								if (
									!player.countCards('h', function (card) {
										return 6 - get.value(card);
									})
								)
									return false;
								return game.hasPlayer(function (current) {
									if (!current.countCards('h')) return false;
									return get.attitude(player, current) < 0;
								});
							},
							content() {
								'step 0';
								event.hc = player.getCards('h');
								event.ts = [];
								event.i = 0;
								('step 1');
								var hc = event.hc;
								var ts = event.ts;
								var fc = event.i > 0 ? false : true;
								player.chooseCardTarget({
									prompt: '朦胧<br/><br/>与一名其他角色交换任意张手牌',
									selectCard: [1, Infinity],
									filterCard(card) {
										return hc.includes(card);
									},
									forced: fc,
									complexCard: true,
									complexTarget: true,
									complexSelect: true,
									filterTarget(card, player, target) {
										if (player == target) return false;
										if (ts.includes(target)) return false;
										return target.countCards('h') > ui.selected.cards.length - 1;
									},
									ai1(card) {
										return 6 - get.value(card);
									},
									ai2(target) {
										var player = get.player();
										return -get.attitude(player, target);
									},
								});
								('step 2');
								if (result.bool) {
									event.cs1 = result.cards;
									event.target = result.targets[0];
									player.line(event.target, 'green');
									var att = get.attitude(player, event.target);
									event.target.chooseCard('选择交换的手牌', 'h', true, event.cs1.length).set('ai', function (card) {
										if (att > 0) return get.value(card);
										return 6 - get.value(card);
									});
									event.i++;
									event.ts.push(event.target);
									for (var i = 0; i < event.cs1.length; i++) {
										event.hc.remove(event.cs1[i]);
									}
								} else event.finish();
								('step 3');
								event.cs2 = result.cards;
								player.lose(event.cs1, ui.special);
								event.target.lose(event.cs2, ui.special);
								player.gain(event.cs2, event.target, 'giveAuto');
								event.target.gain(event.cs1, player, 'giveAuto');
								('step 4');
								if (event.hc.length) {
									var ts = event.ts;
									if (
										game.hasPlayer(function (current) {
											if (player == current) return false;
											if (ts.includes(current)) return false;
											return current.countCards('h');
										})
									)
										event.goto(1);
								}
							},
						},
						lg_suixiang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'phaseBegin',
							},
							init(player) {
								player.storage.lg_suixiang = false;
							},
							filter(event, player) {
								if (event.player.getEquip(1)) return false;
								if (player.storage.lg_suixiang) return false;
								return true;
							},
							check(event, player) {
								if (event.player == player) return true;
								return false;
							},
							content() {
								'step 0';
								player.awakenSkill('lg_suixiang');
								trigger.player.getStat().card.sha--;
								player.storage.lg_suixiang = true;
								('step 1');
								if (player.countCards('he') > 0) {
									player.randomDiscard('h');
								}
								('step 2');
								var list = [];
								for (var i = 0; i < lib.inpile.length; i++) {
									var name = lib.inpile[i];
									var card = { name: name };
									var subtype = get.subtype(card);
									if (subtype && subtype == 'equip1') {
										list.push(['武器', '', name]);
									}
								}
								var dialog = ui.create.dialog('选择一张武器牌', [list, 'vcard'], 'hidden');
								player.chooseButton(dialog, true).set('ai', function (button) {
									var card = { name: button.link[2] };
									var value = get.value(card);
									if (trigger.player.hasSkill('wusheng') && card.name == 'zhuge') value += 10;
									if (trigger.player.hasSkill('lg_baonue') && card.name == 'zhuge') value += 10;
									if (trigger.player.hasSkill('paoxiao') && card.name == 'zhuge') value += 10;
									return value;
								});
								('step 3');
								if (result.bool) {
									var card = game.createCard(result.links[0][2]);
									trigger.player.equip(card, true).set('delay', true);
									trigger.player.storage.lg_suixiangwuqi = card;
									trigger.player.addSkill('lg_suixiang_end');
								}
							},
							subSkill: {
								end: {
									group: ['lg_suixiang_die'],
									onremove(player) {
										var card = player.storage.lg_suixiangwuqi;
										ui.special.appendChild(card);
										delete player.storage.lg_suixiangwuqi;
									},
									trigger: {
										player: 'phaseEnd',
									},
									forced: true,
									popup: false,
									content() {
										player.removeSkill('lg_suixiang_end');
									},
								},
								die: {
									trigger: {
										player: 'die',
									},
									forceDie: true,
									forced: true,
									popup: false,
									content() {
										player.removeSkill('lg_suixiang_end');
									},
								},
							},
						},
						lg_yuxiang1: {
							trigger: {
								player: 'shaDamage',
							},
							forced: true,
							content() {
								'step 0';
								var list = [];
								var list1 = get.inpile('equip1');
								for (var i = 0; i < list1.length; i++) {
									var card = { name: list1[i] };
									var info = get.info(card);
									if (info.skills) {
										list.push(['武器', '', list1[i]]);
									}
								}
								var dialog = ui.create.dialog('选择其中一张武器牌', [list, 'vcard'], 'hidden');
								player.chooseButton(dialog, true).set('ai', function (button) {
									var card = { name: button.link[2] };
									var value = get.value(card);
									if (player.hasSkill('lg_baonue') && card.name == 'zhuge') value += 10;
									if (player.hasSkill('wusheng') && card.name == 'zhuge') value += 10;
									if (player.hasSkill('lg_cuican') && card.name == 'zhuge') value += 10;
									if (player.hasSkill('paoxiao') && card.name == 'zhangba') value += 10;
									return value;
								});
								('step 1');
								if (result.bool) {
									var card2 = { name: result.links[0][2] };
									var info = get.info(card2);
									if (info.skills) {
										for (var i = 0; i < info.skills.length; i++) {
											// if(!player.hasSkill(info.skills[i]))player.addSkill(info.skills[i]);
										}
									}
									player.storage.lg_yuxiang1 = { name: result.links[0][2], card: card2, skills: info.skills || [] };
									var card = { name: result.links[0][2] };
									game.log(player, '声明了', card);
									player.popup(result.links[0][2], 'fire');
									player.removeSkill('lg_yuxiang1');
								}
							},
						},
						lg_zhenwang_kana: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_suixiang0: {
							trigger: {
								global: 'shaDamage',
							},
							forced: true,
							content() {
								player.storage.lg_suixiang = false;
								player.markSkill('lg_suixiang');
								player.enableSkill('lg_suixiang_awake');
								player.awakenedSkill.remove('lg_suixiang');
							},
						},
						lg_zhuanshunjishi: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'shaBegin',
							},
							_priority: 6,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current != player && current.countCards('h');
								});
							},
							prompt2(event, player) {
								return '发动此技能？';
							},
							check(event, player) {
								if (player.hp < 2) return false;
								var num = game.countPlayer(function (current) {
									var att = get.attitude(player, current);
									return current != player && current.countCards('h') && att <= 0;
								});
								return num >= 2;
							},
							content() {
								'step 0';
								player.turnOver();
								('step 1');
								player
									.chooseTarget(
										'获得至多三名其他角色的各一张手牌',
										[1, 3],
										function (card, player, target) {
											return target != player && target.countCards('h');
										},
										true
									)
									.set('ai', function (target) {
										var att = get.attitude(player, target);
										return att <= 0;
									});
								('step 2');
								if (result.bool) {
									for (var i = 0; i < result.targets.length; i++) {
										player.gainPlayerCard('获得' + get.translation(result.targets[i]) + '的一张手牌.', 'h', result.targets[i], true);
									}
								} else event.finish();
								('step 3');
								if (player.countCards('h') >= 3) {
									player.chooseCard('h', 3, '将三张手牌置于牌堆顶', true).set('ai', function (card) {
										var val = get.value(card);
										return 6 - val;
									});
								} else event.finish();
								('step 4');
								if (result.bool) {
									event.cardss = result.cards.slice(0);
									player.lose(event.cardss, ui.special);
									player.$throw(event.cardss, 1000, 'nobroadcast');
								} else event.finish();
								('step 5');
								for (var i = event.cardss.length - 1; i >= 0; i--) {
									event.cardss[i].fix();
									ui.cardPile.insertBefore(event.cardss[i], ui.cardPile.firstChild);
								}
								game.log(player, '将', event.cardss.length, '张牌置于牌堆顶');
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_diaoling: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCard',
							},
							filter(event, player) {
								return event.targets.length > 1 && event.player != player;
							},
							check(event, player) {
								if (player.hp == 1 && event.targets.length > player.hp) return false;
								return true;
							},
							content() {
								'step 0';
								player.drawTo(trigger.targets.length);
								player.chooseToDisable();
								('step 1');
								if (trigger.targets.length > player.hp) player.loseHp();
							},
						},
						lg_xilide_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_linliezhihui: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCardToTargeted',
							},
							filter(event, player) {
								return get.distance(player, event.target) <= 1;
							},
							check(event, player) {
								return get.attitude(player, event.target) >= 0;
							},
							content() {
								'step 0';
								if (trigger.target != player) {
									player.chooseCard(true, 'he', '交给' + get.translation(trigger.target) + '一张牌').set('ai', function (card) {
										if (get.position(card) == 'e') return -1;
										if (card.name == 'shan') return 1;
										if (get.color(card) == get.color(trigger.card)) return 1;
										return 0;
									});
								} else {
									event.finish();
								}
								('step 1');
								trigger.target.gain(result.cards, player, 'give');
								event.card = result.cards[0];
								('step 2');
								if (get.color(event.card) == get.color(trigger.card)) trigger.player.chooseToDiscard(2, true, 'h') && player.recover();
							},
							ai: {
								threaten: 1.1,
							},
						},
						lg_yuexiahuanhun: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return event.player.isAlive() && event.player.countCards('hej') > 0 && event.player != player;
							},
							logTarget: 'player',
							content() {
								var num = 0;
								if (trigger.player.countCards('h')) num++;
								if (trigger.player.countCards('e')) num++;
								if (trigger.player.countCards('j')) num++;
								if (num > 0) {
									player.discardPlayerCard(trigger.player, num, 'hej', true).set('filterButton', function (button) {
										for (var i = 0; i < ui.selected.buttons.length; i++) {
											if (get.position(button.link) == get.position(ui.selected.buttons[i].link)) return false;
										}
										return true;
									});
								}
							},
						},
						lg_zaibian: {
							init(player) {
								if (!player.storage.lg_zaibian) player.storage.lg_zaibian = 0;
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_zaibian.jpg',
							intro: {
								content: '灾变',
							},
							group: ['lg_zaibian_gong', 'lg_zaibian_die', 'lg_zaibian_ao', 'lg_zaibian_draw'],
							subSkill: {
								die: {
									trigger: {
										global: 'dieAfter',
									},
									forced: true,
									popup: false,
									forced: true,
									filter(event, player) {
										return player.isAlive();
									},
									content() {
										player.storage.lg_zaibian++;
									},
								},
								gong: {
									trigger: {
										source: 'damageEnd',
									},
									forced: true,
									popup: false,
									forced: true,
									content() {
										player.storage.lg_zaibian += trigger.num;
									},
								},
								ao: {
									trigger: {
										player: 'dyingBegin',
									},
									forced: true,
									popup: false,
									forced: true,
									_priority: -100000,
									filter(event, player) {
										return player.storage.lg_zaibian > 0;
									},
									content() {
										player.storage.lg_zaibian--;
										trigger.cancel();
										player.getStat().card.sha--;
									},
								},
								draw: {
									trigger: {
										player: ['phaseDrawBegin', 'recoverBegin'],
									},
									forced: true,
									popup: false,
									forced: true,
									filter(event, player) {
										return player.storage.lg_zaibian > 0;
									},
									content() {
										var num = Math.min(5, player.storage.lg_zaibian);
										trigger.num += num;
									},
								},
							},
						},
						lg_yuexiahuanhun1: {
							trigger: {
								player: ['damageAfter', 'lg_yuexiahuanhunAfter'],
							},
							filter(event, player) {
								if (game.online) {
									return true;
								}
								var suits = ['heart', 'club', 'spade', 'diamond'];
								var cards = player.getCards('he');
								for (var i = 0; i < cards.length; i++) {
									if (suits.includes(cards[i].suit)) suits.remove(cards[i].suit);
								}
								return suits.length;
							},
							check(event, player) {
								return true;
							},
							content() {
								player.showHandcards();
								var suits = ['heart', 'club', 'spade', 'diamond'];
								event.cards = player.getCards('he');
								if (Array.isArray(event.cards))
									for (var i of event.cards) {
										//QQ
										if (suits.includes(i.suit)) suits.remove(i.suit);
									}
								if (suits.length) player.draw(suits.length);
							},
						},
						lg_keer_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_jielika_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yuanshengxing: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								if (!player.countCards('h', { suit: 'diamond' })) return false;
								return event.nature;
							},
							content() {
								'step 0';
								player
									.chooseToDiscard('h', get.prompt2('lg_yuanshengxing', trigger.player), function (card, player) {
										if (card.suit != 'diamond') return false;
										return lib.filter.cardDiscardable.apply(this, arguments);
									})
									.set('ai', function (card) {
										var att = get.attitude(player, trigger.player);
										if (att < 0) {
											if (
												trigger.player.hasSkillTag('filterDamage', null, {
													player: player,
													card: trigger.card,
												})
											)
												return -1;
											return 9 - get.value(card);
										}
										return -1;
									});
								('step 1');
								if (result.bool) {
									trigger.num++;
								}
							},
						},
						lg_yuanshengye: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							forced: true,
							filter(event, player) {
								if (!player.countCards('h', { suit: 'club' })) return false;
								return event.nature;
							},
							content() {
								'step 0';
								player
									.chooseToDiscard('h', get.prompt2('lg_yuanshengye', trigger.player), function (card, player) {
										if (card.suit != 'club') return false;
										return lib.filter.cardDiscardable.apply(this, arguments);
									})
									.set('ai', function (card) {
										var att = get.attitude(player, trigger.player);
										if (att < 0) {
											if (
												trigger.player.hasSkillTag('filterDamage', null, {
													player: player,
													card: trigger.card,
												})
											)
												return -1;
											return 9 - get.value(card);
										}
										return -1;
									});
								('step 1');
								if (result.bool) {
									trigger.num--;
								}
							},
						},
						lg_xingyetonggu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return event.player.isLinked() || event.player.isTurnedOver() || event.player.countCards('e');
							},
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							logTarget: 'player',
							forced: true,
							content() {
								'step 0';
								if (trigger.player.isLinked()) {
									player.draw(2);
								}
								('step 1');
								if (trigger.player.isTurnedOver()) {
									trigger.num++;
								}
								('step 2');
								if (trigger.player.countCards('e')) {
									player.gainPlayerCard(trigger.player, 'hej', true);
								}
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_yipusi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_chunjingqingyu: {
							trigger: {
								player: 'phaseDiscardEnd',
							},
							forced: true,
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							_priority: -100,
							filter(event, player) {
								return event.cards && event.cards.length;
							},
							content() {
								'step 0';
								var num = trigger.cards.length;
								player.chooseTarget('获得至多' + num + '名其他角色区域内的各一张牌？', [1, num], function (card, player, target) {
									return target.countCards('hej') > 0 && target != player;
								}).ai = function (target) {
									if (get.attitude(player, target) > 0 && target.countCards('j') > 0) {
										return 15;
									}
									return -get.attitude(player, target);
								};
								('step 1');
								if (result.bool) {
									event.targets = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (targets && targets.length) {
									player.line(targets, 'white');
									for (var i = 0; i < targets.length; i++) {
										player.gainPlayerCard('hej', targets[i], true);
									}
								}
							},
							ai: {
								expose: 0.2,
							},
						},
						lg_zhuguang: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: ['loseHpBegin', 'recoverBegin'],
							},
							filter(event, player) {
								return player.countCards('he');
							},
							forced: true,
							content() {
								'step 0';
								var next = player.chooseToDiscard('he', get.prompt('烛光'));
								var check = lib.skill.beige.checkx(trigger, player);
								next.set('ai', function (card) {
									//    if(get.type(card)==get.type(trigger.card))
									//            return 1;
									if (_status.event.goon) return 8 - get.value(card);
									return 0;
								});
								next.set('goon', check);
								('step 1');
								if (result.bool) {
									player.judge();
								} else {
									event.finish();
								}
								('step 2');
								switch (result.card.suit) {
									case 'heart':
										player.draw();
										break;
									case 'heart':
										player.recover();
										break;
									case 'diamond':
										player.draw(3);
										break;
									case 'club':
										player.discard(player.getCards('ej'));
										break;
									case 'club':
										player.recover(2);
										break;
									case 'spade':
										player.gain(player.getCards('ej'));
										break;
									case 'spade':
										player.link();
										break;
								}
							},
							ai: {
								expose: 0.3,
							},
						},
						lg_shangyuanyounai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_chunjingqingyu1: {
							trigger: {
								player: 'phaseDiscardEnd',
							},
							forced: true,
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							_priority: -100,
							filter(event, player) {
								return event.cards && event.cards.length;
							},
							content() {
								'step 0';
								var num = trigger.cards.length;
								player.chooseTarget('获得至多' + num + '名其他角色区域内的各一张牌？', [1, num], function (card, player, target) {
									return target.countCards('hej') > 0 && target != player;
								}).ai = function (target) {
									if (get.attitude(player, target) > 0 && target.countCards('j') > 0) {
										return 15;
									}
									return -get.attitude(player, target);
								};
								('step 1');
								if (result.bool) {
									event.targets = result.targets;
								} else {
									event.finish();
								}
								('step 2');
								if (targets && targets.length) {
									player.line(targets, 'white');
									for (var i = 0; i < targets.length; i++) {
										player.gainPlayerCard('hej', targets[i], true);
									}
								}
							},
							ai: {
								expose: 0.2,
							},
						},
						lg_dichui: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'recoverBegin',
							},
							forced: true,
							filter(event, player) {
								return player.isMaxHandcard(true);
							},
							content() {
								player.draw();
							},
						},
						lg_youqu: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'showCharacterAfter',
							},
							content() {
								'step 0';
								player.draw(2);
								('step 1');
								if (Array.isArray(result) && result.length > 1) {
									var color = get.color(result[0], player);
									for (var i = 1; i < result.length; i++) {
										if (get.color(result[i], player) != color) {
											if (player.countCards('h')) player.previous.loseHp();
											break;
										}
									}
								}
							},
						},
						lg_luofangtianhua: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							filter(event, player) {
								return event.source && event.source != player && player.countGainableCards(event.source, 'hej') >= 1;
							},
							check(event, player) {
								return get.attitude(player, event.source) >= 0;
							},
							content() {
								'step 0';
								var tp = trigger.source;
								var p = player;
								trigger.source.chooseBool('弃置其区域内的一张牌？').set('ai', function () {
									return get.attitude(tp, p) > 0;
								});
								('step 1');
								if (result.bool) {
									var tp1 = trigger.source;
									var p1 = player;
									trigger.source.discardPlayerCard('hej', player, 1, true).set('ai', function (button) {
										if (get.position(button.link) == 'h') {
											return get.attitude(tp1, p1);
										}
										if (get.position(button.link) == 'j') {
											return 20 * get.attitude(tp1, p1);
										}
										return -get.value(button.link) * get.attitude(tp1, p1);
									});
								} else {
									event.finish();
								}
								('step 2');
								player.randomDiscard('he');
								trigger.source.randomDiscard('he');
							},
							ai: {
								effect: {
									target(card, player, target, current) {
										if (get.tag(card, 'damage') && target.countGainableCards(player, 'hej') >= 1) {
											if (get.attitude(player, target) > 0 && player != target) {
												return 'zeroplayertarget';
											}
										}
									},
								},
							},
						},
						lg_shengjieliaoluan: {
							ai: {
								threaten: 1.2,
							},
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_shengjieliaoluan_gain', 'lg_shengjieliaoluan_lose'],
							subSkill: {
								gain: {
									trigger: {
										global: ['equipAfter'],
									},
									filter(event, player) {
										if (!event.player.isAlive()) return false;
										if (event.player == player) return false;
										return player.countCards('e') != event.player.countCards('e');
									},
									prompt2(event, player) {
										if (player.countCards('e') < event.player.countCards('e')) {
											return '你可以令' + get.translation(event.player) + '依次弃置三张牌.';
										} else if (player.countCards('e') > event.player.countCards('e')) {
											return '你可以令' + get.translation(event.player) + '依次摸三张牌.';
										}
									},
									check(event, player) {
										var att = get.attitude(player, event.player);
										if (player.countCards('e') < event.player.countCards('e')) {
											return att <= 0;
										} else if (player.countCards('e') > event.player.countCards('e')) {
											return att > 0;
										}
										return false;
									},
									logTarget: 'player',
									content() {
										'step 0';
										if (player.countCards('e') < trigger.player.countCards('e')) {
											trigger.player.chooseToDiscard('he', 1, true);
											trigger.player.chooseToDiscard('he', 1, true);
											trigger.player.chooseToDiscard('he', 1, true);
											player.gain(
												get.cardPile(function (card) {
													return get.type(card, 'basic') == 'basic';
												}),
												'gain2'
											);
											var hp = player.hp;
											player.init('lg_xilide1');
											player.hp = hp;
											player.update();
											ui.clear();
										}
										('step 1');
										if (player.countCards('e') > trigger.player.countCards('e')) {
											trigger.player.draw();
											trigger.player.draw();
											trigger.player.draw();
											player.gain(
												get.cardPile(function (card) {
													return get.type(card, 'basic') == 'basic';
												}),
												'gain2'
											);
											var hp = player.hp;
											player.init('lg_xilide1');
											player.hp = hp;
											player.update();
											ui.clear();
										}
									},
									ai: {
										expose: 0.3,
									},
								},
								lose: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										global: ['loseAfter'],
									},
									filter(event, player) {
										if (!event.player.isAlive()) return false;
										if (event.player == player) return false;
										if (player.countCards('e') == event.player.countCards('e')) return false;
										return event.es && event.es.length;
									},
									prompt2(event, player) {
										if (player.countCards('e') < event.player.countCards('e')) {
											return '你可以令' + get.translation(event.player) + '回复1点体力.';
										} else if (player.countCards('e') > event.player.countCards('e')) {
											return '你可以令' + get.translation(event.player) + '失去1点体力.';
										}
									},
									check(event, player) {
										var att = get.attitude(player, event.player);
										if (player.countCards('e') < event.player.countCards('e')) {
											return att > 0;
										} else if (player.countCards('e') > event.player.countCards('e')) {
											return att <= 0;
										}
										return false;
									},
									logTarget: 'player',
									content() {
										'step 0';
										if (player.countCards('e') < trigger.player.countCards('e')) {
											trigger.player.recover();
											trigger.player.addTempSkill('lg_shishen', { player: 'linkBegin' });
										}
										('step 1');
										if (player.countCards('e') > trigger.player.countCards('e')) {
											trigger.player.loseHp();
											trigger.player.addTempSkill('lg_shishen', { player: 'linkBegin' });
										}
									},
									ai: {
										expose: 0.3,
									},
								},
							},
						},
						lg_shishen: {
							trigger: {
								player: 'damageBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_shishen.jpg',
							intro: {
								content: '「失神」<br/>状态效果:<br/>当你受到伤害时,伤害来源获得你的一张牌,重铸你装备区内的所有牌.',
							},
							filter(event, player) {
								return event.source != undefined && player.countCards('he');
							},
							forced: true,
							content() {
								var num = player.countCards('e');
								player.line(trigger.source, 'green');
								trigger.source.gainPlayerCard('he', player, true);
								player.draw(num);
								player.chooseToDiscard(999, true, 'e')._triggered = null;
							},
						},
						lg_zhu_xilide: {
							ai: {
								neg: true,
							},
							init(player) {
								if (player.identity == 'zhu') {
									player.addSkill('lg_fanxingwanxiang');
								}
							},
						},
						lg_xilide1_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_fanxingwanxiang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'discardBegin',
							},
							init(player) {
								player.storage.lg_fanxingwanxiang = [];
							},
							onremove(player) {
								player.storage.lg_fanxingwanxiang = [];
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget('获得一名其他角色区域内的一张牌', function (card, player, target) {
										return target.countGainableCards(player, 'hej') && target != player;
									})
									.set('ai', function (target) {
										var att = get.attitude(_status.event.player, target);
										if (att > 0) return Math.sqrt(att) / 10;
										return 5 - att;
									});
								('step 1');
								if (result.targets && result.targets.length) {
									var tar = result.targets[0];
									player.gainPlayerCard(tar, 'hej', true);
									if (!player.storage.lg_fanxingwanxiang.includes(tar)) player.storage.lg_fanxingwanxiang.push(tar);
								}
							},
							group: ['lg_fanxingwanxiang_end'],
							subSkill: {
								end: {
									audio: 'ext:幻颜风华/audio:2',
									trigger: {
										player: 'dyingAfter',
									},
									forced: true,
									content() {
										player.draw();
										player.previous.draw();
										player.next.draw();
									},
								},
							},
						},
						lg_shengjieliaoluan1: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								global: 'discardBegin',
							},
							forced: true,
							content() { },
						},
						lg_xukong0: {
							usable: 1,
							trigger: {
								player: ['chooseToRespondBegin', 'chooseToUseBegin'],
							},
							forced: true,
							popup: false,
							max: 6,
							filter(event, player) {
								return _status.currentPhase != player;
							},
							_priority: 101,
							content() {
								var cards = [];
								var max = Math.min(ui.cardPile.childNodes.length, lib.skill.lg_xukong0.max);
								for (var i = 0; i < max; i++) {
									var card = ui.cardPile.childNodes[i];
									if (trigger.filterCard(card, player, trigger)) {
										cards.push(card);
									}
								}
								if (cards.length) {
									player.gain(cards, 'draw');
									game.log(player, '获得了' + get.cnNumber(cards.length) + '张牌');
								}
							},
							ai: {
								respondSha: true,
								respondShan: true,
								effect: {
									target(card, player, target, effect) {
										if (get.tag(card, 'respondShan')) return 0.7;
										if (get.tag(card, 'respondSha')) return 0.7;
									},
								},
							},
							hiddenCard(player, name) {
								if (_status.currentPhase == player) return false;
								var max = Math.min(ui.cardPile.childNodes.length, lib.skill.lg_xukong0.max);
								for (var i = 0; i < max; i++) {
									var card = ui.cardPile.childNodes[i];
									if (card.name == name) return true;
								}
								return false;
							},
						},
						lg_xukong: {
							trigger: {
								player: 'phaseDrawBefore',
							},
							forced: true,
							content() {
								'step 0';
								player.chooseTarget(get.prompt('lg_xukong'), 1, function (card, player, target) {
									return target.countCards('hej') > 0;
								}).ai = function (target) {
									if (player.countCards('h') > 2) return -get.attitude(player, target);
									return;
								};
								('step 1');
								if (result.bool) {
									player.line(result.targets);
									player.gainPlayerCard(result.targets[0], 1, 'hej', true);
									trigger.cancel();
								} else {
									event.finish();
								}
								('step 2');
							},
						},
						lg_fuxian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageAfter',
							},
							forced: true,
							filter(event, player) {
								return event.card && event.card.name == 'sha';
							},
							content() {
								'step 0';
								player.chooseToDiscard(get.prompt('lg_fuxian'), 1, 'h', { type: 'trick' }).ai = function (card) {
									if (get.attitude(player, trigger.player) < 0) return 1;
									return 0;
								};
								('step 1');
								if (result.bool) player.gainPlayerCard(trigger.player, true, 'h');
							},
						},
						lg_zisuiwuji: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							selectCard: -1,
							filterCard() {
								return false;
							},
							usable: 1,
							filter(event, player) {
								return game.hasPlayer((target) => lib.skill.lg_zisuiwuji.filterTarget(null, player, target));
							},
							filterTarget(card, player, target) {
								var isMin = target.isMinHandcard();
								var isMax = target.isMaxHandcard();
								var isMinTarget = game.findPlayer((Target) => Target != target && Target.isMinHandcard());
								var isMaxTarget = game.findPlayer((Target) => Target != target && Target.isMaxHandcard());
								var hs = target.countCards('h');
								if (isMin && isMaxTarget) {
									return isMaxTarget.countCards('h') - hs > 0;
								}
								if (isMax && isMinTarget) {
									return isMinTarget.countCards('h') - hs < 0;
								}
								return false;
							},
							content() {
								var num = lib.skill.lg_zisuiwuji.ai.result.target(player, target);
								if (num > 0) {
									target.draw(num);
								} else if (num < 0) {
									num = -num;
									var count = target.getCards('h', function (i) {
										return lib.filter.cardDiscardable(i, target, event.name);
									});
									if (count.length <= num) {
										target.discard(count);
									} else {
										target.chooseToDiscard('h', num, true, lib.filter.cardDiscardable);
									}
								}
							},
							ai: {
								order: 9,
								result: {
									target(player, target) {
										var isMin = target.isMinHandcard();
										var isMax = target.isMaxHandcard();
										var isMinTarget = game.findPlayer((Target) => Target != target && Target.isMinHandcard());
										var isMaxTarget = game.findPlayer((Target) => Target != target && Target.isMaxHandcard());
										var hs = target.countCards('h');
										if (isMin && isMaxTarget) {
											return isMaxTarget.countCards('h') - hs;
										}
										if (isMax && isMinTarget) {
											return isMinTarget.countCards('h') - hs;
										}
										return 0;
									},
								},
								threaten: 1,
							},
						},
						lg_zisuiwuji1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_zisuiwujiBegin',
							},
							filter(event, player) {
								return !player.isMinHandcard();
							},
							forced: true,
							content() {
								var num = game.countGroup();
								player.drawTo(num);
							},
						},
						lg_hetiya_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xinlingqinzhan: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['recoverAfter', 'loseHpEnd'],
							},
							filter(event, player) {
								return event.player != player && player.countCards('h');
							},
							forced: true,
							content() {
								'step 0';
								var translation1 = get.translation(trigger.player);
								var cards = player.getCards('h');
								player.chooseCardButton('交给' + translation1 + '任意张手牌', false, cards, [1, cards.length]).set('ai', function (button) {
									var card1 = button.link;
									var trigger = _status.event.getTrigger();
									var player = _status.event.player;
									var att = get.attitude(player, trigger.player);
									if (att <= 0) {
										if (card1.name == 'du') return 10;
										return -1;
									} else {
										if (player.isDamaged() && ui.selected.buttons.length == 2) {
											return 6;
										}
										if (ui.selected.buttons.length == 1) {
											return 6 - get.value(card1);
										}
										if (ui.selected.buttons.length >= 2) {
											return 2 * ui.selected.buttons.length - get.value(card1);
										}
									}
								});
								('step 1');
								if (result.bool) {
									var togive = result.links.slice(0);
									trigger.player.gain(togive, 'gain2');
									if (togive.length >= 2 && player.isDamaged()) {
										trigger.player
											.chooseControl('令其摸两张牌', '取消')
											.set('prompt', '是否令其摸两张牌？')
											.set('ai', function () {
												if (get.attitude(trigger.player, player) > 0) return '令其摸两张牌';
												return '取消';
											});
									} else event.finish();
								} else event.finish();
								('step 2');
								if (result.control == '令其摸两张牌') {
									player.draw(2);
								} else event.finish();
							},
							ai: {
								expose: 0.9,
							},
						},
						lg_zhiling: {
							usable: 1,
							trigger: {
								global: ['dyingAfter', 'respondBegin'],
							},
							forced: true,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									if (current.hasSkill('lg_zhiling_unmark')) return false;
									return !current.hasSkill('lg_zhiling_mark');
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_zhiling'), function (card, player, target) {
										return !target.hasSkill('lg_zhiling_mark') && !target.hasSkill('lg_zhiling_unmark');
									})
									.set('ai', function (target) {
										return -get.attitude(_status.event.player, target);
									});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									target.addSkill('lg_zhiling_mark');
								}
							},
							subSkill: {
								unmark: {
									mark: true,
									markimage: 'extension/幻颜风华/Trace/lg_trace_zhiling.jpg',
									intro: {
										content: '指令',
									},
								},
								mark: {
									init(player, skill) {
										player.storage.lg_zhiling_mark = 0;
									},
									onremove(player) {
										delete player.storage.lg_zhiling_mark;
									},
									trigger: {
										player: 'useCardEnd',
									},
									popup: false,
									forced: true,
									content() {
										var damage = 0;
										player.storage.lg_zhiling_mark++;
										player.markSkill('lg_zhiling_mark');
										var num = trigger.card.number;
										if (num && num % 6 == 0) damage++;
										if (player.storage.lg_zhiling_mark % 6 == 0) damage++;
										if (damage > 0) {
											player.next.next.damage();
											player.turnOver();
											player.chooseToDiscard(555, true, 'e');
										}
									},
									markimage: 'extension/幻颜风华/Trace/lg_trace_zhiling.jpg',
									mark: true,
									intro: {
										content: '指令',
									},
								},
							},
						},
						lg_beilusi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xinlingqinzhan1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_xinlingqinzhanAfter',
							},
							filter(event, player) {
								return player.hp < player.countCards('h');
							},
							forced: true,
							content() {
								var num = player.countCards('h', { suit: 'spade' });
								var nv = player.hp;
								player.recover(num);
								player.draw(nv);
							},
						},
						lg_chaoliangqidian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								return player != _status.currentPhase && player.countCards('h') > player.maxHp;
							},
							_priority: 3.14159,
							forced: true,
							content() {
								trigger.num++;
							},
						},
						lg_xinghexunhang: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'dyingBegin',
							},
							filter(event, player) {
								return event.source != undefined;
							},
							_priority: 6,
							forced: true,
							checkx(event, player) {
								var att1 = get.attitude(player, event.player);
								var att2 = get.attitude(player, event.source);
								return att1 > 0 && att2 <= 0;
							},
							content() {
								'step 0';
								var c = trigger.source.hp;
								player.drawTo(c);
								('step 1');
								var kk = trigger.source.getAttackRange();
								var next = player.chooseToDiscard('h', kk, get.prompt('lg_xinghexunhang'));
								var check = lib.skill.beige.checkx(trigger, player);
								next.set('ai', function (card) {
									if (_status.event.goon) return 8 - get.value(card);
									return 0;
								});
								next.set('goon', check);
								('step 2');
								if (result.bool) {
									trigger.source.damage(kk);
								}
							},
							ai: {
								maixie_defend: true,
								effect: {
									target(card, player, target) {
										if (player.countCards('h') > 1 && get.tag(card, 'damage')) {
											if (player.hasSkillTag('jueqing', false, target)) return [1, -1.5];
											if (get.attitude(target, player) < 0) return [1, 1];
										}
									},
								},
							},
						},
						lg_suyuan: {
							mode: ['identity'],
							init(player) {
								player.storage.lg_suyuan = false;
							},
							intro: {
								content: 'limited',
							},
							limited: true,
							enable: 'phaseUse',
							filter(event, player) {
								if (player.storage.lg_suyuan) return false;
								return (
									game.countPlayer(function (current) {
										return current.identity != 'zhu' && current.identity != 'mingzhong';
									}) > 1
								);
							},
							selectTarget: 2,
							complexSelect: true,
							multitarget: true,
							filterCard() {
								return false;
							},
							selectCard: -1,
							filterTarget(card, player, current) {
								return current.identity != 'zhu' && current.identity != 'mingzhong';
							},
							ai: {
								order: 1,
								result: {
									target(player, target) {
										var att = get.attitude(player, target);
										if (ui.selected.targets.length) {
											if (ui.selected.targets[0].identity == target.identity) return 0;
											if (att < 0 && target.hp > 2 && target.countCards('he') >= 4) return -1;
											return 0;
										} else {
											if (
												!game.hasPlayer(function (targetx) {
													var att = get.attitude(player, targetx);
													if (att < 0 && targetx.hp > 2 && targetx.countCards('he') >= 4) {
														return targetx.identity != 'zhu' && targetx.identity != 'mingzhong';
													}
													return false;
												})
											)
												return 0;
											if (att > 0 && target.hp == 1) return 1;
											return 0;
										}
									},
								},
								expose: 0.4,
								threaten: 3,
							},
							content() {
								game.broadcastAll(
									function (player, target, shown, shown2) {
										var identity = player.identity;
										player.identity = target.identity;
										if (shown || player == game.me) {
											player.setIdentity();
										}
										target.identity = identity;
										if (shown2 || target == game.me) {
											target.setIdentity();
										}
									},
									targets[0],
									targets[1],
									targets[1].identityShown,
									targets[0].identityShown
								);
								player.storage.lg_suyuan = true;
								player.awakenSkill('lg_suyuan');
							},
							mark: true,
						},
						lg_shikongyueqian: {
							audio: 'ext:幻颜风华/audio:2',
							group: 'lg_shikongyueqian_begin',
							subSkill: {
								begin: {
									trigger: {
										global: ['washCard', 'cardsDiscardBegin', 'loseBegin', 'gainBegin', 'loseAsyncBegin', 'addToExpansionBegin', 'equipBegin', 'addJudgeBegin', 'cardsGotoOrderingBegin', 'cardsGotoSpecialBegin'],
									},
									forced: true,
									lastDo: true,
									popup: false,
									content() {
										var discardPile = Array.from(ui.discardPile.childNodes || []);
										var cardPile = Array.from(ui.cardPile.childNodes || []);
										var func = function (card) {
											var type = get.subtype(card, false);
											return type == 'equip1';
										};
										discardPile = discardPile.filter(func);
										cardPile = cardPile.filter(func);
										trigger.lg_shikongyueqian = {
											discardPile: discardPile,
											cardPile: cardPile,
										};
									},
								},
							},
							trigger: {
								global: ['cardsDiscardEnd', 'loseEnd', 'gainEnd', 'loseAsyncEnd', 'addToExpansionEnd', 'equipEnd', 'addJudgeEnd', 'cardsGotoOrderingEnd', 'cardsGotoSpecialEnd'],
							},
							forced: true,
							popup: false,
							firstDo: true,
							content() {
								'step 0';
								if (!trigger.lg_shikongyueqian) {
									event.finish();
									return;
								}
								var discardPile = Array.from(ui.discardPile.childNodes || []);
								var cardPile = Array.from(ui.cardPile.childNodes || []);
								var func = function (card) {
									var type = get.subtype(card, false);
									return type == 'equip1';
								};
								discardPile = discardPile.filter(func);
								cardPile = cardPile.filter(func);
								event.discardPile = discardPile;
								event.cardPile = cardPile;
								if (event.cardPile.length != trigger.lg_shikongyueqian.cardPile.length) {
									player.chooseBool(get.prompt('lg_shikongyueqian'), '摸一张牌,回复1点体力？').set('ai', function () {
										return true;
									});
								} else {
									event.goto(2);
								}
								('step 1');
								if (result.bool) {
									player.draw();
									player.recover();
									var hp = player.hp;
									player.init('lg_gelier');
									player.hp = hp;
									player.update();
									ui.clear();
								}
								('step 2');
								if (event.discardPile.length == trigger.lg_shikongyueqian.discardPile.length) {
									event.finish();
									return;
								}
								('step 3');
								event.count = 1;
								('step 4');
								player
									.chooseTarget(get.prompt('lg_shikongyueqian'), '弃置一名其他角色的一张牌', function (card, player, target) {
										if (player == target) return false;
										return target.countDiscardableCards(player, 'he');
									})
									.set('ai', function (target) {
										return -get.attitude(_status.event.player, target);
									});
								('step 5');
								if (result.bool) {
									player.line(result.targets[0], 'green');
									player.discardPlayerCard(result.targets[0], 'he', true);
									event.count--;
								} else event.finish();
								('step 4');
								if (event.count) event.goto(4);
							},
							mark: true,
							intro: {
								content(storage, player) {
									var discardPile = Array.from(ui.discardPile.childNodes);
									var cardPile = Array.from(ui.cardPile.childNodes);
									var func = function (card) {
										var type = get.subtype(card, false);
										return type == 'equip1';
									};
									discardPile = discardPile.filter(func);
									cardPile = cardPile.filter(func);
									var str = '牌堆中的武器牌数:' + cardPile.length + '<br>';
									str += '弃牌堆中的武器牌数:' + discardPile.length;
									return str;
								},
							},
							mod: {
								globalFrom(from, to, current) {
									var cardPile = Array.from(ui.cardPile.childNodes);
									var func = function (card) {
										var type = get.subtype(card, false);
										return type == 'equip1';
									};
									cardPile = cardPile.filter(func);
									return current - cardPile.length;
								},
								globalTo(from, to, current) {
									var discardPile = Array.from(ui.discardPile.childNodes);
									var func = function (card) {
										var type = get.subtype(card, false);
										return type == 'equip1';
									};
									discardPile = discardPile.filter(func);
									return current + discardPile.length;
								},
							},
							ai: {
								threaten: 0.8,
							},
						},
						lg_mishujiguan: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							filter(event, player) {
								return player.countCards('h') > player.hp;
							},
							filterCard: true,
							filterTarget: true,
							check(card) {
								return 7 - get.value(card);
							},
							content() {
								'step 0';
								player.judge();
								('step 1');
								if (result.color == 'black') target.gain(game.createCard(get.inpile('equip').randomGet()), 'draw');
								else target.changeHujia();
							},
							ai: {
								order: 8,
								result: {
									target(player, target) {
										if (target.canMoveCard(true)) return 3;
										return 1;
									},
								},
							},
						},
						lg_shikongjiexian: {
							audio: 'ext:幻颜风华/audio:2',
							mod: {
								targetInRange(card, player, target, now) {
									if (card.suit == 'spade') return true;
								},
							},
							trigger: {
								global: 'useCardAfter',
							},
							_priority: 9,
							filter(event, player) {
								if (event.player == player) return false;
								if (get.type(event.card) != 'basic') return false;
								if (!event.targets.includes(player)) return false;
								if (event.card) {
									return get.itemtype(event.cards) == 'cards' && get.position(event.cards[0], true) == 'o';
								}
								return false;
							},
							content() {
								player.gain(trigger.cards, 'gain2');
								player.randomDiscard('hej');
							},
							ai: {
								effect: {
									target(card, player, target, current) {
										if (get.type(card) == 'basic') return [1, 2];
									},
								},
							},
						},
						lg_pulan_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_sisha: {
							mod: {
								cardUsable(card, player, num) {
									if (player.isMinHandcard(false)) return Infinity;
								},
								targetInRange(card, player, target, now) {
									if (player.isMinHp(false)) return true;
								},
							},
						},
						lg_moshenchengjie: {
							audio: 'ext:幻颜风华/audio:4',
							trigger: {
								player: 'changeHp',
							},
							content() {
								var cards = get.cards(player.previous.countCards('hej', { color: 'red' }));
								cards.sort(function (a, b) {
									return get.color(b).length - get.color(a).length;
								});
								player.addToExpansion(cards, 'gain2').gaintag.add('lg_moshenchengjie');
								player.addTempSkill('lg_moshenchengjie_gain', 'loseHpEnd');
							},
							onremove(player, skill) {
								var cards = player.getExpansions(skill);
								if (cards.length) player.loseToDiscardpile(cards);
							},
							intro: {
								content: 'expansion',
								markcount: 'expansion',
							},
							subSkill: {
								gain: {
									audio: 'ext:幻颜风华/audio:4',
									trigger: {
										player: 'useCardAfter',
									},
									charlotte: true,
									filter(event, player) {
										return player.hasCard((card) => card.hasGaintag('lg_moshenchengjie'), 'x');
									},
									content() {
										'step 0';
										var cards = player.getExpansions('lg_moshenchengjie');
										var dialog = ['获得其中一张牌'];
										var reds = [],
											blacks = [];
										for (var i of cards) (get.color(i) == 'red' ? reds : blacks).push(i);
										if (reds.length) {
											dialog.push('<div class="text center">红色牌</div>');
											dialog.push(reds);
										}
										if (blacks.length) {
											dialog.push('<div class="text center">黑色牌</div>');
											dialog.push(blacks);
										}
										player.chooseButton(dialog, true).set('ai', function (button) {
											var player = _status.event.player;
											var color = get.color(button.link),
												cards = player.getExpansions('lg_moshenchengjie');
											var num1 = cards.filter((card) => get.color(card) == color).length,
												num2 = cards.length - num1;
											if (num1 >= num2) return get.value(button.link);
											return 0;
										});
										('step 1');
										if (result.bool) {
											player.gain(result.links, 'gain2');
										} else event.finish();
										('step 2');
										var map = { red: 0, black: 0 },
											cards = player.getExpansions('lg_moshenchengjie');
										for (var i of cards) {
											var color = get.color(i, false);
											if (map[color] != undefined) map[color]++;
										}
										if (map.red == map.black) player.swapHandcards(player.previous);
										else player.draw(2);
									},
									onremove(player) {
										var cards = player.getExpansions('lg_moshenchengjie');
										if (cards.length) player.loseToDiscardpile(cards);
									},
								},
							},
						},
						lg_qianliuyi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_lunmubianyu: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							popup: false,
							trigger: {
								global: 'useCard',
							},
							filter(event, player) {
								return event.player != player && event.targets && event.targets.includes(player) && ['basic', 'trick'].includes(get.type(event.card));
							},
							init(player) {
								player.storage.lg_lunmubianyu = 0;
							},
							check(event, player) {
								var eff = get.effect(player, event.card, event.player, player);
								if (eff > 0) return false;
								return true;
							},
							content() {
								'step 0';
								player.popup('魔神·轮墓边狱', 'thunder');
								player.line(trigger.target, 'white');
								var target = trigger.player;
								target
									.chooseToUse({ name: 'sha' }, '魔神·轮墓边狱<br/><br/>对' + get.translation(player) + '使用一张【杀】')
									.set('targetRequired', true)
									.set('complexSelect', true)
									.set('filterTarget', function (card, player, target) {
										if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
										return lib.filter.filterTarget.apply(this, arguments);
									})
									.set('sourcex', player);
								('step 1');
								if (!result.bool) {
									trigger.targets.remove(player);
									player.turnOver();
								}
							},
							mod: {
								maxHandcard(player, num) {
									return (num -= player.storage.lg_lunmubianyu);
								},
							},
							group: ['lg_lunmubianyu_use'],
							subSkill: {
								use: {
									trigger: {
										player: ['phaseDiscardBegin'],
										global: 'useCard',
									},
									popup: false,
									forced: true,
									content() {
										if (trigger.name != 'useCard') {
											if (player.countCards('h') >= player.getHandcardLimit()) {
												player.popup('魔神·轮墓边狱', 'thunder');
											}
										} else {
											if (['trick', 'delay'].includes(get.type(trigger.card)) && trigger.targets && trigger.targets.includes(player)) {
												player.popup('魔神·轮墓边狱', 'thunder');
												player.storage.lg_lunmubianyu++;
											}
										}
									},
								},
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (player != target && ['trick', 'basic'].includes(get.type(card)) && get.attitude(player, target) <= 0) {
											if (player.countCards('h', 'sha') == 0 || !player.canUse({ name: 'sha' }, target)) return 'zeroplayertarget';
										}
									},
								},
							},
						},
						lg_lunmubianyu1: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'lg_lunmubianyuBegin',
							},
							forced: true,
							content() { },
						},
						lg_shenyuanzhitong: {
							audio: 'ext:幻颜风华/audio:2',
							logTarget(event, player) {
								var targets = [];
								var evt = event.parent;
								for (var i = event.num + 1; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) targets.push(evt.targets[i]);
								}
								return targets;
							},
							check(event, player) {
								var num = 0,
									init = true;
								var evt = event.parent;
								for (var i = event.num + 1; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) {
										var eff = get.effect(evt.targets[i], event.card, player, player);
										if (init) {
											if (eff > 0) return false;
										}
										num += eff;
										init = false;
									}
								}
								return num < 0;
							},
							trigger: {
								global: 'useCardToEnd',
							},
							filter(event, player) {
								var evt = event.parent;
								if (evt.targets.length - event.num <= 1) return false;
								for (var i = event.num + 1; i < evt.targets.length; i++) {
									if (!evt.excluded.includes(evt.targets[i])) return true;
								}
								return false;
							},
							content() {
								player.showHandcards();
								trigger.parent.excluded.addArray(game.filterPlayer());
							},
						},
						lg_qianliuyi1_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_aoshagong: {
							audio: 'ext:幻颜风华/audio:3',
							enable: 'phaseUse',
							usable: 1,
							filterTarget(card, player, target) {
								return target != player;
							},
							content() {
								'step 0';
								event.list = [];
								var bool1 = false;
								for (var i = 0; i < lib.inpile.length; i++) {
									var name = lib.inpile[i];
									if (get.type(name) == 'trick') {
										if (player.canUse({ name: name }, target, false)) bool1 = true;
										event.list.push(['锦囊', '', name]);
									}
								}
								var bool2 = player.canUse({ name: 'sha', nature: 'poison' }, target, false);
								if (bool1 && bool2) {
									target
										.chooseControl(function () {
											return 0;
										})
										.set('choiceList', ['视为' + get.translation(player) + '对你使用一张普通锦囊牌.', '视为' + get.translation(player) + '对你使用一张【杀】.'])
										.set('ai', function () {
											return 0;
										});
								} else if (bool1) {
									event.directindex = 0;
								} else if (bool2) {
									event.directindex = 1;
								} else {
									event.finish();
								}
								('step 1');
								if (result && typeof event.directindex != 'number') {
									event.directindex = result.index;
								}
								if (event.directindex == 1) {
									var next = player.useCard({ name: 'sha', nature: 'poison' }, target, false, 'noai');
									next.card.lg_aoshagong = true;
									next.card.lg_aoshagong_fire = target;
									event.finish();
								} else {
									player.chooseButton(
										['鏖杀公:<br/>选择使用的普通锦囊牌', [event.list, 'vcard']],
										function (button) {
											return _status.event.player.getUseValue({ name: button.link[2], nature: button.link[3] });
										},
										function (button) {
											return _status.event.player.canUse({ name: button.link[2], nature: button.link[3] }, target);
										}
									);
								}
								('step 2');
								if (result.bool) {
									var next = player.useCard({ name: result.links[0][2] }, target, false, 'noai');
									next.card.lg_aoshagong = true;
									next.card.lg_aoshagong_fire = target;
								}
							},
							group: 'lg_aoshagong_fire',
							subSkill: {
								fire: {
									trigger: {
										global: 'damageEnd',
									},
									filter(event, player) {
										return event.card && event.nature && event.nature == 'poison' && event.card.lg_aoshagong && event.card.lg_aoshagong_fire == event.player;
									},
									forced: true,
									content() {
										player.gain(
											get.cardPile(function (card) {
												return card.suit == 'diamond';
											}),
											'gain2'
										);
										player.getStat().skill.lg_aoshagong--;
									},
								},
							},
						},
						lg_zuihouzhijian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'shaMiss',
							},
							forced: true,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current.countCards('h');
								});
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_zuihouzhijian'), function (card, player, target) {
										return target.countCards('h');
									})
									.set('ai', function (target) {
										var player = get.player();
										if (get.attitude(player, target) < 0) return 1;
										if (player == target) {
											if (
												player.countCards('h', function (card) {
													return card.name == 'sha' && player.getUseValue(card) > 0;
												})
											)
												return 0.1;
										}
										return -1;
									});
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
								} else event.finish();
								('step 2');
								var next = player.discardPlayerCard('h', event.target, true);
								if (event.target == player)
									next.set('ai', function (button) {
										var player = get.player();
										var card = button.link;
										if (card.name == 'sha') return player.getUseValue(card);
										return 0;
									});
								('step 3');
								var card = result.links[0];
								if (card.name == 'sha' && player.hasUseTarget(card)) player.chooseUseTarget(card);
							},
						},
						lg_shixiang_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_molangzhiyin: {
							trigger: {
								player: 'useCardAfter',
							},
							filter(event, player) {
								if (event.card.name != 'sha') return false;
								if (event.parent.name == 'lg_molangzhiyin') return false;
								var enemies = player.getEnemies();
								return game.hasPlayer(function (current) {
									return enemies.includes(current) && !event.targets.includes(current) && player.canUse('sha', current, false);
								});
							},
							content() {
								var enemies = player.getEnemies();
								enemies.remove(trigger.targets);
								if (enemies.length) {
									player.useCard({ name: 'sha' }, enemies.randomGet().addExpose(0.2));
								}
							},
						},
						lg_xiansuo: {
							trigger: {
								global: 'roundStart',
							},
							filter(event, player) {
								return game.roundNumber <= 26;
							},
							forced: true,
							content() {
								'step 0';
								var cards = [];
								var num = game.roundNumber;
								if (num > 13) {
									var list = [];
									var map = {};
									for (var i = 1; i <= 13; i++) {
										for (var j = 1; j <= 13; j++) {
											if (i + j == num && !map[j]) {
												list.push([i, j]);
												map[i] = true;
											}
										}
									}
									list = list.randomSort();
									while (list.length) {
										var f = list.shift();
										var card = get.cardPile(function (x) {
											return !cards.includes(x) && x.number == f[0];
										});
										if (card) {
											cards.add(card);
										} else {
											cards = [];
											continue;
										}
										var card = get.cardPile(function (x) {
											return !cards.includes(x) && x.number == f[1];
										});
										if (card) {
											cards.add(card);
										} else {
											cards = [];
											continue;
										}
										if (cards.length == 2) {
											player.gain(cards, 'gain2');
											event.cards = cards;
											break;
										}
									}
								} else {
									var cards = [];
									var i = 2;
									while (i) {
										i--;
										var card = get.cardPile(function (x) {
											return !cards.includes(x) && x.number == num;
										});
										if (card) cards.add(card);
									}
									if (cards.length) {
										player.gain(cards, 'gain2');
										event.cards = cards;
									}
								}
								('step 1');
								while (event.cards.length) {
									var card = event.cards.shift();
									if (player.hasUseTarget(card) && player.getCards('h').includes(card)) player.chooseUseTarget(card, false, 'nodistance');
								}
							},
						},
						lg_baliushu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'changeHp',
							},
							filter(event, player) {
								return player.countCards('h');
							},
							forced: true,
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_baliushu'), function (card, player, target) {
										return player != target;
									})
									.set('ai', function (target) {
										var player = get.player();
										return -get.attitude(player, target);
									});
								('step 1');
								if (result.bool) {
									event.target = result.targets[0];
								} else event.finish();
								('step 2');
								event.target.chooseBool('猜测' + get.translation(player) + '有没有【闪】？').set('ai', function (event, player) {
									if (Math.random() * player.countCards('h') > 1) return true;
									else return false;
								});
								('step 3');
								var b1 = player.countCards('h', 'shan') > 0;
								var b2 = result.bool;
								if (b2 == true) {
									event.target.popup('有', 'fire');
									game.log(event.target, '选择了有');
								} else {
									event.target.popup('没有', 'thunder');
									game.log(event.target, '选择了没有');
								}
								if (b1 != b2) {
									event.target.chooseToDiscard(2, true, 'h');
								} else player.phase('nodelay');
							},
						},
						lg_jiashetuilun: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filterTarget(card, player, target) {
								return player != target && target.countCards('h') > 0 && get.distance(player, target, 'attack') <= 1;
							},
							content() {
								'step 0';
								player.chooseControl('heart2', 'diamond2', 'club2', 'spade2').set('ai', function (event) {
									switch (Math.floor(Math.random() * 6)) {
										case 0:
											return 'heart2';
										case 1:
										case 4:
										case 5:
											return 'diamond2';
										case 2:
											return 'club2';
										case 3:
											return 'spade2';
									}
								});
								('step 1');
								game.log(player, '选择了' + get.translation(result.control));
								event.choice = result.control;
								player.popup(event.choice);
								event.card = target.getCards('h').randomGet();
								target.showCards(event.card);
								('step 2');
								if (event.card.suit + '2' != event.choice) {
									player.draw();
									event.finish();
								}
								if (event.card.suit + '2' == event.choice) {
									player.gain(event.card, target);
									target.$give(event.card, player);
								}
								('step 3');
								var list = [];
								for (var i in lib.card) {
									if (get.type(i) == 'trick') list.push(game.createCard(i));
								}
								player.chooseCardButton(list).set('ai', function (button) {
									if (button.link.name == 'wuzhong') return 1;
									return 0;
								});
								('step 4');
								if (result.bool) {
									game.broadcastAll(
										function (card1, card2) {
											card1.init([card1.suit, card1.number, card2.name]);
										},
										event.card,
										result.links[0]
									);
								} else {
									event.finish();
								}
							},
							ai: {
								order: 11,
								result: {
									player(player) {
										if (player.countCards('h') > 1) return 1;
									},
								},
							},
						},
						lg_zhenxiangjielu: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return player.countCards('h') > 0;
							},
							filterTarget(card, player, target) {
								return player != target;
							},
							content() {
								'step 0';
								player.chooseCard('h', true);
								('step 1');
								event.card = result.cards[0];
								target.chooseControl('equip', 'basic', 'trick', 'delay').set('ai', function (event) {
									switch (Math.floor(Math.random() * 6)) {
										case 0:
											return 'equip';
										case 1:
										case 4:
										case 5:
											return 'basic';
										case 2:
											return 'trick';
										case 3:
											return 'delay';
									}
								});
								('step 2');
								game.log(target, '选择了' + get.translation(result.control));
								event.choice = result.control;
								target.popup(event.choice);
								('step 3');
								target.gain(event.card, player);
								player.$give(event.card, target);
								('step 4');
								if (get.type(event.card) != event.choice) target.damage(2)._triggered = null;
								if (get.type(event.card) == event.choice) player.swapHandcards(target);
							},
							ai: {
								order: 1,
								result: {
									target(player, target) {
										var eff = get.damageEffect(target, player);
										if (eff >= 0) return 1 + eff;
										var value = 0,
											i;
										var cards = player.getCards('h');
										for (var i = 0; i < cards.length; i++) {
											value += get.value(cards[i]);
										}
										value /= player.countCards('h');
										if (target.hp == 1) return Math.min(0, value - 7);
										return Math.min(0, value - 5);
									},
								},
							},
						},
						lg_shushouwuce: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['phaseDrawBegin', 'phaseUseBegin'],
							},
							init(player) {
								player.storage.lg_shushouwuce = 1;
							},
							check(event, player) {
								return true;
							},
							filter(event, player) {
								if (!player.storage.lg_shushouwuce) return false;
								return true;
							},
							content() {
								'step 0';
								event.temp = get.cards(player.storage.lg_shushouwuce);
								player.showCards(event.temp);
								('step 1');
								for (var i = 0; i < event.temp.length; i++) {
									if (
										game.hasPlayer(function (current) {
											return player.canUse(event.temp[i], current);
										})
									) {
										player.chooseUseTarget(event.temp[i], true, true);
										event.temp.splice(i--, 1);
									}
								}
								player.gain(event.temp);
								('step 2');
								player.storage.lg_shushouwuce++;
								if (player.countCards('h') == player.getAttackRange()) player.addTempSkill('lg_tuilun', { player: 'phaseBegin' });
								trigger.cancel();
							},
						},
						lg_fuermosi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_tuilun: {
							trigger: {
								global: 'judgeBegin',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_tuilun.jpg',
							intro: {
								content: '「推论」<br/>状态效果:<br/>一名角色的判定牌生效前,你可以猜测判定牌的花色.若你猜对,你执行一个额外的出牌阶段;若你没猜对,你可以将一张牌置于牌堆顶.',
							},
							content() {
								'step 0';
								player.chooseControl('heart2', 'diamond2', 'club2', 'spade2').set('ai', function (event) {
									switch (Math.floor(Math.random() * 6)) {
										case 0:
											return 'heart2';
										case 1:
										case 4:
										case 5:
											return 'diamond2';
										case 2:
											return 'club2';
										case 3:
											return 'spade2';
									}
								});
								('step 1');
								game.log(player, '选择了' + get.translation(result.control));
								var choice = result.control;
								player.popup(choice);
								var card = get.cards()[0];
								player.showCards(card);
								if (card.suit + '2' == choice) {
									player.phaseUse();
									event.finish();
								} else {
									player.chooseCard(1, 'he').set('ai', function (card) {
										return -1;
									});
								}
								('step 2');
								if (result.bool) {
									player.lose(result.cards[0], ui.special);
									ui.cardPile.insertBefore(result.cards[0], ui.cardPile.firstChild);
								} else {
									event.finish();
								}
							},
						},
						lg_bingruo: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							forced: true,
							_priority: 10,
							trigger: {
								source: 'damageBegin',
							},
							filter(event, player) {
								if (!event.player.getEquips(5)) return false;
								return event.card;
							},
							content() {
								player.line(trigger.player, 'fire');
								trigger.num--;
							},
						},
						lg_juedao: {
							audio: 'ext:幻颜风华/audio:3',
							trigger: {
								global: 'damageAfter',
							},
							filter(event, player) {
								return event.card && event.card.name == 'sha' && event.source && _status.currentPhase == event.source;
							},
							check(event, player) {
								if (event.source == undefined) return false;
								return (player.countCards('h') > 2 && get.attitude(player, event.source) < 0) || (player.countCards('h') <= 2 && get.attitude(player, event.source) >= 0);
							},
							content() {
								player.chooseToDiscard(1, '弃置一张装备牌', 'he', true, { type: 'equip' });
								player.draw();
								trigger.source.chooseToDiscard(1, '弃置一张装备牌', 'he', true, { type: 'equip' });
								trigger.source.draw();
								var evt = _status.event;
								for (var i = 0; i < 10; i++) {
									if (evt && evt.getParent) evt = evt.parent;
									if (evt.name == 'phaseUse') {
										evt.skipped = true;
										break;
									}
								}
							},
						},
						lg_wumingsanduantu: {
							audio: 'ext:幻颜风华/audio:2',
							usable: 1,
							trigger: {
								player: 'useCardBefore',
							},
							_priority: 990,
							filter(event, player) {
								if (event.card.name != 'sha') return false;
								var hs = player.getCards('h', function (cardx) {
									return !event.cards.includes(cardx);
								});
								return hs.length > 1;
							},
							forced: true,
							content() {
								'step 0';
								var hs = player.getCards('h', function (cardx) {
									var tri = _status.event.getTrigger();
									return !tri.cards.includes(cardx);
								});
								player
									.chooseCardButton('无明三段突:<br/><br/>选择至多三张手牌？', [1, 3], hs)
									.set('filterButton', function (button) {
										return true;
									})
									.set('ai', function (button) {
										return 6 - get.value(button.link);
									});
								('step 1');
								if (result.bool) {
									event.cds = result.links.slice(0);
									player.chooseToDiscard(1, '弃置一张♣️️牌', 'he', true, { suit: 'club' });
								} else event.finish();
								('step 2');
								event.dam = 0;
								event.ext = 0;
								for (var i = 0; i < event.cds.length; i++) {
									if (get.subtype(event.cds[i]) == 'equip1') {
										var info = get.info(event.cds[i]);
										if (info.skills) {
											player.addAdditionalSkill('lg_wumingsanduantu', info.skills);
											trigger.gainskill = true;
										}
									} else if (event.cds[i].suit == 'club' || event.cds[i].suit == 'club') {
										event.dam++;
									} else if (event.cds[i].suit == 'heart' || event.cds[i].name == 'heart') {
										event.ext++;
									}
								}
								('step 3');
								if (event.dam > 0) {
									trigger.exDamage = event.dam;
								}
								if (event.ext > 0) {
									player
										.chooseTarget('令这张' + get.translation(trigger.card) + '额外指定' + event.ext + '个目标?', [1, event.ext], false, function (card, player, target) {
											var trigger = _status.event.getTrigger();
											return !trigger.targets.includes(target) && trigger.player.canUse(trigger.card, target, false);
										})
										.set('ai', function (target) {
											var trigger = _status.event.getTrigger();
											var pla = trigger.player;
											return get.effect(target, trigger.card, pla, pla);
										});
								}
								('step 4');
								if (result.bool) {
									if (!event.isMine() && !_status.connectMode) game.delayx();
									event.tars = result.targets;
								} else event.finish();
								('step 5');
								player.line(event.tars, 'green');
								for (var i = 0; i < event.tars.length; i++) {
									trigger.targets.push(event.tars[i]);
								}
							},
							group: ['lg_wumingsanduantu_clear', 'lg_wumingsanduantu_damage'],
							subSkill: {
								clear: {
									trigger: {
										global: ['useCardAfter', 'useCardCancelled'],
									},
									_priority: 2,
									filter(event, player) {
										if (!event.card || event.card.name != 'sha') return false;
										return event.gainskill == true;
									},
									forced: true,
									content() {
										player.removeAdditionalSkill('lg_wumingsanduantu');
										game.log(player, '失去了武器技能');
									},
								},
								damage: {
									trigger: {
										player: 'shaBegin',
									},
									_priority: 92,
									filter(event, player) {
										if (!event.card || event.card.name != 'sha' || !event.notLink()) return false;
										return typeof event.parent.exDamage == 'number' && event.parent.exDamage > 0;
									},
									forced: true,
									content() {
										trigger.baseDamage += trigger.parent.exDamage;
									},
								},
							},
						},
						lg_chongtianzongsi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_yuxia: {
							audio: 'ext:幻颜风华/audio:2',
							group: ['lg_yuxia_after', 'lg_yuxia_debuff'],
							subSkill: {
								after: {
									trigger: {
										player: 'useCardAfter',
									},
									filter(event, player) {
										return event.lg_yuxia && event.lg_yuxia.isIn() && event.lg_yuxia.countCards('h');
									},
									popup: false,
									forced: true,
									_priority: -1,
									content() {
										var history = trigger.lg_yuxia.getHistory('sourceDamage', function (evt) {
											return evt.card == trigger.card;
										});
										var num = 0;
										for (var i = 0; i < history.length; i++) {
											num += history[i].num;
										}
										num = num * 1;
										if (num > trigger.lg_yuxia.countCards('h')) num = trigger.lg_yuxia.countCards('h');
										if (num !== 0) {
											var a = player.getAttackRange();
											player.next.drawTo(a);
											trigger.lg_yuxia.chooseToDiscard(num, true);
										}
									},
								},
								debuff: {
									filter(event, player) {
										if (event.card) {
											return event.getParent(2).lg_yuxia && event.getParent(2).lg_yuxia.isIn() && event.source != event.getParent(2).lg_yuxia;
										}
										return false;
									},
									trigger: {
										player: 'damageBefore',
										source: 'damageBefore',
									},
									popup: false,
									forced: true,
									_priority: -1,
									content() {
										trigger.source = trigger.getParent(2).lg_yuxia;
									},
								},
							},
							trigger: {
								player: 'useCard',
							},
							forced: true,
							filter(event, player) {
								if (!event.targets || !event.targets.length) return false;
								if (lib.config) return get.tag(event.card, 'damage');
								if (['sha', 'juedou', 'huogong', 'nanman', 'wanjian', 'chuqibuyi'].includes(event.card.name)) return true;
								return false;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt2('lg_yuxia'), function (card, player, target) {
										return target != player;
									})
									.set('ai', function (target) {
										var player = _status.event.player;
										var att = get.attitude(player, target);
										if (att < 0) return target.countCards('he');
										return 0;
									});
								('step 1');
								if (result.bool) {
									trigger.lg_yuxia = result.targets[0];
								}
							},
						},
						lg_mengjingyuxianshi: {
							audio: 'ext:幻颜风华/audio:2',
							enable: ['chooseToUse'],
							filterCard: true,
							selectCard() {
								var player = _status.event.player;
								if (!player.getStat().skill.lg_mengjingyuxianshi) var num1 = 1;
								else var num1 = player.getStat().skill.lg_mengjingyuxianshi + 1;
								return num1;
							},
							position: 'he',
							viewAs: {
								name: 'sha',
							},
							filter(event, player) {
								var num1 = player.getStat().skill.lg_mengjingyuxianshi + 1;
								if (player.countCards('he') < num1) return false;
								return true;
							},
							prompt: '发动此技能？',
							check(card) {
								return 6 - get.useful(card);
							},
							ai: {
								order: 9,
								respondSha: true,
								skillTagFilter(player) {
									return player.getStat().skill.lg_mengjingyuxianshi + 1 < player.countCards('he');
								},
								yingbian(card, player, targets, viewer) {
									if (get.attitude(viewer, player) <= 0) return 0;
									var base = 0,
										hit = false;
									if (get.cardtag(card, 'yingbian_hit')) {
										hit = true;
										if (
											targets.filter(function (target) {
												return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
											})
										)
											base += 5;
									}
									if (get.cardtag(card, 'yingbian_all')) {
										if (
											game.hasPlayer(function (current) {
												return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
											})
										)
											base += 5;
									}
									if (get.cardtag(card, 'yingbian_damage')) {
										if (
											targets.filter(function (target) {
												return (
													get.attitude(player, target) < 0 &&
													(hit ||
														!target.mayHaveShan() ||
														player.hasSkillTag(
															'directHit_ai',
															true,
															{
																target: target,
																card: card,
															},
															true
														)) &&
													!target.hasSkillTag('filterDamage', null, {
														player: player,
														card: card,
														jiu: true,
													})
												);
											})
										)
											base += 5;
									}
									return base;
								},
								canLink(player, target, card) {
									if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
									if (
										target.mayHaveShan() &&
										!player.hasSkillTag(
											'directHit_ai',
											true,
											{
												target: target,
												card: card,
											},
											true
										)
									)
										return false;
									if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
									return true;
								},
								basic: {
									useful: [5, 3, 1],
									value: [5, 3, 1],
								},
								result: {
									target(player, target, card, isLink) {
										var eff = (function () {
											if (!isLink && player.hasSkill('jiu')) {
												if (
													!target.hasSkillTag('filterDamage', null, {
														player: player,
														card: card,
														jiu: true,
													})
												) {
													if (get.attitude(player, target) > 0) {
														return -7;
													} else {
														return -4;
													}
												}
												return -0.5;
											}
											return -1.5;
										})();
										if (
											!isLink &&
											target.mayHaveShan() &&
											!player.hasSkillTag(
												'directHit_ai',
												true,
												{
													target: target,
													card: card,
												},
												true
											)
										)
											return eff / 1.2;
										return eff;
									},
								},
								tag: {
									respond: 1,
									respondShan: 1,
									damage(card) {
										if (card.nature == 'poison') return;
										return 1;
									},
									natureDamage(card) {
										if (card.nature) return 1;
									},
									fireDamage(card, nature) {
										if (card.nature == 'fire') return 1;
									},
									thunderDamage(card, nature) {
										if (card.nature == 'thunder') return 1;
									},
									poisonDamage(card, nature) {
										if (card.nature == 'poison') return 1;
									},
									jy_duDamage(card, nature) {
										if (card.nature == 'jy_du') return 1;
									},
									jy_xieDamage(card, nature) {
										if (card.nature == 'jy_xie') return 1;
									},
								},
							},
							group: ['lg_mengjingyuxianshi_give'],
							subSkill: {
								give: {
									trigger: {
										player: 'useCard',
									},
									filter(event, player) {
										if (event.skill != 'lg_mengjingyuxianshi') return false;
										return get.itemtype(event.cards) == 'cards';
									},
									_priority: 20,
									forced: true,
									content() {
										'step 0';
										if (player.stat[player.stat.length - 1].card.sha > 0) {
											player.stat[player.stat.length - 1].card.sha--;
										}
										('step 1');
										if (!player.isMinHandcard()) player.next.turnOver();
										if (!player.isMinHandcard()) player.next.randomDiscard('hej');
										player.chooseTarget(get.prompt('lg_mengjingyuxianshi'), '弃置目标区域内的各一张牌,令其获得' + get.translation(trigger.cards) + '？', function (card, player, target) {
											var trigger = _status.event.getTrigger();
											return trigger.targets.includes(target);
										}).ai = function (target) {
											var trigger = _status.event.getTrigger();
											var att = get.attitude(player, target);
											if (att > 0) var num1 = trigger.cards.length;
											else num1 = -trigger.cards.length;
											if (target.countDiscardableCards(player, 'j') && target.countCards('j')) {
												if (att > 0) num1++;
												num1--;
											}
											if (target.countDiscardableCards(player, 'h') && target.countCards('h')) {
												if (att > 0) num1--;
												num1++;
											}
											if (target.countDiscardableCards(player, 'e') && target.countCards('e')) {
												if (att > 0) num1--;
												num1++;
											}
											return num1;
										};
										('step 2');
										if (result.bool) {
											event.tar = result.targets[0];
											var num = 0;
											if (event.tar.countCards('h')) num++;
											if (event.tar.countCards('e')) num++;
											if (event.tar.countCards('j')) num++;
											if (num > 0) {
												player
													.discardPlayerCard(event.tar, num, 'hej')
													.set('filterButton', function (button) {
														for (var i = 0; i < ui.selected.buttons.length; i++) {
															if (get.position(button.link) == get.position(ui.selected.buttons[i].link)) return false;
														}
														return true;
													})
													.set('ai', function (button) {
														var att = get.attitude(player, event.tar);
														if (att > 0) {
															if (get.type(button.link) == 'delay' && button.link.name != '') return 10;
															return -1;
														} else {
															if (get.type(button.link) == 'delay' && button.link.name != '') return -1;
															return 1 + get.value(button.link);
														}
													});
											}
										} else event.finish();
										('step 3');
										if (result.bool) {
											event.tar.gain(trigger.cards, player, 'giveAuto');
										}
									},
									ai: {
										expose: 0.2,
									},
								},
							},
						},
						lg_guangmingyuheian: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								target: 'useCardToTarget',
							},
							check(event, player) {
								return get.effect(player, event.card, event.player, player) < 0;
							},
							prompt2(event, player) {
								return '令' + get.translation(event.player) + '使用的' + get.translation(event.card) + '无效？';
							},
							filter(event, player) {
								if (event.player == player) return false;
								return event.targets.length == 1 && event.cards.length == 1 && event.getParent(2).name != 'lg_guangmingyuheian_timeout' && get.position(event.cards[0], true) == 'o' && event.card.name == event.cards[0].name;
							},
							content() {
								if (player.next.countCards('h') == 0) player.init('lg_bayunzi');
								trigger.targets.remove(player);
								trigger.parent.triggeredTargets2.remove(player);
								trigger.untrigger();
								var card = trigger.cards[0];
								player.addToExpansion(card, 'gain2').gaintag.add('lg_guangmingyuheian');
								if (!player.storage.lg_guangmingyuheian) player.storage.lg_guangmingyuheian = [[], []];
								player.storage.lg_guangmingyuheian[0].push(card);
								player.storage.lg_guangmingyuheian[1].push(trigger.player);
								// game.cardsGotoSpecial(card);
								// player.$gain2(card,false);
								// game.log(player,'将',card,'无效');
								// if(!player.storage.lg_guangmingyuheian) player.storage.lg_guangmingyuheian=[[],[]];
								// player.storage.lg_guangmingyuheian[0].push(card);
								// player.storage.lg_guangmingyuheian[1].push(trigger.player);
								// player.markSkill('lg_guangmingyuheian');
								// game.delayx();
							},
							intro: {
								markcount(storage) {
									return storage[0].length;
								},
								mark(dialog, storage, player) {
									dialog.addAuto(storage[0]);
									dialog.addText(get.translation(storage[1]));
								},
								onunmark(storage, player) {
									player.storage.lg_guangmingyuheian = [[], []];
								},
							},
							ai: {
								threaten: 0.98,
							},
							group: 'lg_guangmingyuheian_timeout',
							subSkill: {
								timeout: {
									trigger: {
										player: 'discardBegin',
									},
									forced: true,
									filter(event, player) {
										return player.storage.lg_guangmingyuheian && player.storage.lg_guangmingyuheian[0].length;
									},
									content() {
										var list = player.storage.lg_guangmingyuheian,
											card = list[0].shift(),
											source = list[1].shift();
										// if(source&&source.isIn()&&source.canUse(card,player,false)) source.useCard(card,player,false);
										// else game.cardsDiscard(card);
										// if(list[0].length) event.redo();
										// else player.unmarkSkill('lg_guangmingyuheian');
										if (player.getExpansions('lg_guangmingyuheian').includes(card)) {
											if (source && source.isIn() && source.canUse(card, player, false)) source.useCard(card, player, false);
											else player.loseToDiscardpile(card);
										}
										if (list[0].length) event.redo();
									},
								},
							},
						},
						lg_jiejie: {
							intro: {
								content(storage, player, skill) {
									var str = '本轮游戏,你与' + get.translation(player.storage.lg_jiejie_a) + '使用:</br>';
									str += '【杀】造成的伤害值:' + player.storage.lg_jiejie[0] + '</br>';
									str += '【桃】回复的体力值:' + player.storage.lg_jiejie[1] + '</br>';
									str += '【酒】额外的伤害值:' + player.storage.lg_jiejie[2];
									return str;
								},
							},
							init(player) {
								player.storage.lg_jiejie = [1, 1, 1];
							},
							trigger: {
								global: 'roundStart',
							},
							forced: true,
							_priority: 7,
							content() {
								'step 0';
								player.storage.lg_jiejie = [1, 1, 1];
								player.unmarkSkill('lg_jiejie');
								('step 1');
								player.chooseTarget(
									get.prompt2('lg_jiejie'),
									1,
									function (card, player, target) {
										return player != target;
									},
									function (target) {
										return get.attitude(player, target);
									}
								);
								('step 2');
								if (result.bool) {
									player.storage.lg_jiejie_a = result.targets[0];
									event.nm = 3;
								} else event.finish();
								('step 3');
								var lt = [];
								for (var i = 0; i <= event.nm; i++) {
									lt.push(i.toString());
								}
								player
									.chooseControl(lt, true)
									.set('ai', function (event) {
										if (player.hp == 1) return '0';
										if (player.hasUsableCard('sha')) return '2';
										return '1';
									})
									.set('prompt', '你与' + get.translation(player.storage.lg_jiejie_a) + '触发结界？');
								('step 4');
								if (result.control != 0) {
									player.storage.lg_jiejie[0] = parseInt(result.control);
									event.nm -= parseInt(result.control);
								} else player.storage.lg_jiejie[0] = 0;
								('step 5');
								if (event.nm > 0) {
									var lt = [];
									for (var i = 0; i <= event.nm; i++) {
										lt.push(i.toString());
									}
									player
										.chooseControl(lt, true)
										.set('ai', function (event) {
											if (player.isHealthy()) return '0';
											if (player.getDamagedHp() >= 2 && event.nm >= 2) return '2';
											return '1';
										})
										.set('prompt', '你与' + get.translation(player.storage.lg_jiejie_a) + '触发结界？');
								} else {
									player.storage.lg_jiejie[1] = 0;
									player.storage.lg_jiejie[2] = 0;
									event.goto(7);
								}
								('step 6');
								if (result.control != 0) {
									player.storage.lg_jiejie[1] = parseInt(result.control);
									event.nm -= parseInt(result.control);
								} else player.storage.lg_jiejie[1] = 0;
								('step 7');
								player.storage.lg_jiejie[2] = event.nm;
								player.markSkill('lg_jiejie');
							},
							group: ['lg_jiejie_change', 'lg_jiejie_t'],
							subSkill: {
								change: {
									trigger: {
										global: ['taoBefore', 'jiuBefore', 'shaBefore'],
									},
									filter(event, player) {
										if (event.player == player || event.player == player.storage.lg_jiejie_a) return true;
										return false;
									},
									firstDo: true,
									_priority: 999,
									forced: true,
									content() {
										if (trigger.name == 'sha') {
											var nm = player.storage.lg_jiejie[0] - 1;
											trigger.baseDamage += nm;
										} else if (trigger.name == 'tao') {
											var nm = player.storage.lg_jiejie[1] - 1;
											trigger.baseDamage += nm;
										} else if (trigger.name == 'jiu') {
											var nm = player.storage.lg_jiejie[2] - 1;
											trigger.baseDamage += nm;
										}
									},
								},
								t: {
									trigger: {
										global: ['recoverBegin'],
									},
									filter(event, player) {
										if (event.player != player && event.player != player.storage.lg_jiejie_a) return false;
										var evt = event.parent;
										if (evt.name != 'tao') return false;
										return evt.baseDamage == 0;
									},
									firstDo: 999,
									forced: true,
									content() {
										trigger.num = 0;
									},
								},
							},
						},
						lg_zhiqiuyuquqiu: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'shaDamage',
							},
							content() {
								'step 0';
								event.cards = get.cards();
								player.showCards(event.cards, '牌堆顶的牌');
								('step 1');
								event.s = event.cards.suit;
								var suit = event.s;
								ui.cardPile.insertBefore(event.cards[0], ui.cardPile.firstChild);
								game.updateRoundNumber();
								event.p = '一张' + get.translation(suit + '2') + '牌？';
								var pro = '弃置场上的' + event.p;
								if (
									game.hasPlayer(function (current) {
										return (
											current.countDiscardableCards(player, 'ej', function (card) {
												return card.suit == suit;
											}) > 0
										);
									})
								)
									player
										.chooseTarget(pro, function (card, player, target) {
											return (
												target.countDiscardableCards(player, 'ej', function (card) {
													return card.suit == suit;
												}) > 0
											);
										})
										.set('ai', function (target) {
											var player = get.player();
											var att = get.attitude(player, target);
											if (
												target.countDiscardableCards(player, 'j', function (card) {
													return card.suit == suit;
												}) > 0
											)
												return att;
											return -att;
										});
								else event.finish();
								('step 2');
								if (result.bool) {
									var suit = event.s;
									player.line(result.targets[0], 'green');
									var pro = '弃置' + get.translation(result.targets[0]) + event.p;
									player.discardPlayerCard(pro, result.targets[0], 'ej', true).set('filterButton', function (button) {
										return button.link.suit == suit;
									});
								}
							},
						},
						lg_zhiqiuyuquqiu1: {
							audio: 'ext:幻颜风华/audio:1',
							trigger: {
								player: 'shaMiss',
							},
							content() {
								'step 0';
								event.cards = get.cards();
								player.showCards(event.cards, '牌堆顶的牌');
								('step 1');
								event.s = get.color(event.cards);
								var color = event.s;
								ui.cardPile.insertBefore(event.cards[0], ui.cardPile.firstChild);
								game.updateRoundNumber();
								event.p = '一张' + get.translation(color + '2') + '牌？';
								var pro = '弃置场上的' + event.p;
								if (
									game.hasPlayer(function (current) {
										return (
											current.countDiscardableCards(player, 'ej', function (card) {
												return get.color(card) == color;
											}) > 0
										);
									})
								)
									player
										.chooseTarget(pro, function (card, player, target) {
											return (
												target.countDiscardableCards(player, 'ej', function (card) {
													return get.color(card) == color;
												}) > 0
											);
										})
										.set('ai', function (target) {
											var player = get.player();
											var att = get.attitude(player, target);
											if (
												target.countDiscardableCards(player, 'j', function (card) {
													return get.color(card) == color;
												}) > 0
											)
												return att;
											return -att;
										});
								else event.finish();
								('step 2');
								if (result.bool) {
									var color = event.s;
									player.line(result.targets[0], 'green');
									var pro = '弃置' + get.translation(result.targets[0]) + event.p;
									player.discardPlayerCard(pro, result.targets[0], 'ej', true).set('filterButton', function (button) {
										return get.color(button.link) == color;
									});
								}
							},
						},
						lg_huanxiang: {
							mark: true,
							marktext: '幻',
							intro: {
								content(num, p, s) {
									var o1 = get.translation(num[0].p) || '幻象中',
										s1 = '使用者:' + o1 + '<br>';
									var ss = get.translation(num[0].s);
									var o2 = ss == 'none' || !ss ? '幻象中' : ss;
									var s2 = '花色:' + o2 + '<br>';
									var o3 = num[0].n || '幻象中',
										s3 = '点数:' + o3;
									return s1 + s2 + s3;
								},
								nocount: true,
							},
							init(p, s) {
								p.storage[s] = [
									{ p: null, s: 'none', n: null },
									{ p: null, s: 'none', n: null },
								];
							},
							trigger: {
								player: ['useCard', 'respond'],
							},
							prompt(event) {
								var tg = lib.skill.lg_huanxiang.logTarget(event, event.player);
								return '使用者为' + get.translation(tg) + ',' + get.prompt('lg_huanxiang');
							},
							logTarget(event, player) {
								var rec = player.storage.lg_huanxiang;
								return event.name == 'useCard' ? rec[1].p : rec[0].p;
							},
							filter(event, player) {
								var rec = player.storage.lg_huanxiang;
								var pre = event.name == 'useCard' ? rec[1] : rec[0],
									now = event.name == 'useCard' ? rec[0] : { p: event.player, s: event.card.suit, n: event.card.number };
								return pre.p && pre.p.isIn() && ((now.s && now.s != 'none' && now.s == pre.s) || (now.n && now.n == pre.n));
							},
							check(event, player) {
								return get.attitude(player, lib.skill.lg_huanxiang.logTarget(event, player)) < 0;
							},
							content() {
								'step 0';
								lib.skill.lg_huanxiang.logTarget(trigger, player).chooseToDisable();
							},
							mod: {
								aiOrder(player, card, num) {
									if (_status.event.type == 'dying' && get.attitude(player, _status.event.dying) < 0) return;
									var rec = player.storage.lg_huanxiang;
									var pre = rec[0],
										now = { p: player, s: card.suit, n: card.number };
									if (pre.p && pre.p.isIn() && get.attitude(player, pre.p) < 0 && ((now.s && now.s != 'none' && now.s == pre.s) || (now.n && now.n == pre.n))) return num + 10;
								},
							},
							ai: {
								effect: {
									player(card, player, target) {
										if (_status.event.type == 'dying' && get.attitude(player, _status.event.dying) < 0) return;
										var rec = player.storage.lg_huanxiang;
										var pre = rec[0],
											now = { p: player, s: card.suit, n: card.number };
										if (pre.p && pre.p.isIn() && get.attitude(player, pre.p) < 0 && ((now.s && now.s != 'none' && now.s == pre.s) || (now.n && now.n == pre.n))) return [1, 3];
									},
								},
							},
							group: 'lg_huanxiang_a',
							subSkill: {
								a: {
									trigger: {
										global: 'useCard',
									},
									silent: true,
									charlotte: true,
									_priority: 0.028169014084507043,
									content() {
										'step 0';
										var pre = player.storage.lg_huanxiang[0];
										player.storage.lg_huanxiang[0] = { p: trigger.player, s: trigger.card.suit, n: trigger.card.number };
										player.storage.lg_huanxiang[1] = pre;
									},
									forced: true,
									popup: false,
								},
							},
						},
						lg_bayunzi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_bayunzi0: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								global: 'changeHp',
							},
							markimage: 'extension/幻颜风华/Trace/lg_trace_lingli.jpg',
							mark: true,
							intro: {
								content: '拥有#点灵力',
							},
							init(player) {
								player.storage.lg_bayunzi0 = 0;
								player.markSkill('lg_bayunzi0');
							},
							filter(event, player) {
								return player.storage.lg_bayunzi0 < 100;
							},
							forced: true,
							content() {
								player.storage.lg_bayunzi0 += 5;
								player.markSkill('lg_bayunzi0');
							},
						},
						lg_boyuli: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'loseAfter',
								global: 'gainAfter',
							},
							mark: true,
							markimage: 'extension/幻颜风华/Trace/lg_trace_boyuli.jpg',
							intro: {
								content: '灵力消耗:<br/>35点<br/><br/>符卡效果:<br/>一名其他角色获得/弃置你的牌后,你可以从牌堆中获得相同名称的牌.若牌堆中没有相同名称的牌,你加1点体力上限.',
							},
							filter(event, player) {
								var evt = event;
								if (event.name == 'lose') {
									if (event.type != 'discard') return false;
									evt = event.parent;
								}
								if (evt[event.name == 'gain' ? 'bySelf' : 'notBySelf'] != true) return false;
								var evtx = event.getl(player);
								return evtx && evtx.cards2 && evtx.cards2.length;
							},
							prompt2(event, player) {
								var evt = event.getl(player),
									origins = evt.cards2.map(function (i) {
										return get.name(i, evt.hs.includes(i) ? player : false);
									});
								return '从牌堆中获得' + get.translation(origins) + '？';
							},
							content() {
								var num = 0,
									cards = [],
									evt = trigger.getl(player),
									origins = evt.cards2.map(function (i) {
										return get.name(i, evt.hs.includes(i) ? player : false);
									});
								for (var i of origins) {
									var card = get.cardPile2(function (card) {
										return card.name == i && !cards.includes(card);
									});
									if (card) cards.push(card);
									else num++;
								}
								if (cards.length) player.gain(cards, 'gain2');
								if (num > 0) player.gainMaxHp();
							},
						},
						lg_boyuli2: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_boyuliAfter',
							},
							forced: true,
							content() {
								player.storage.lg_bayunzi0 -= 35;
								player.markSkill('lg_bayunzi0');
							},
						},
						lg_boyuli1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_boyuliBegin',
							},
							filter(event, player) {
								return player.storage.lg_bayunzi0 < 35;
							},
							forced: true,
							content() {
								trigger.cancel();
								player.popup('灵力不足', 'fire');
							},
						},
						lg_zuishengzhimeng: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'phaseEnd',
							},
							forced: true,
							filter(event, player) {
								if (!player.countCards('he')) return false;
								var history = player.getHistory('useCard'),
									map = {};
								for (var i of history) {
									if (get.type2(i.card) == 'basic') {
										if (!map[i.card.name]) map[i.card.name] = true;
										else return true;
									}
								}
								return false;
							},
							content() {
								'step 0';
								player.chooseCardTarget({
									prompt: get.prompt('lg_zuishengzhimeng'),
									prompt2: '发动此技能？',
									filterCard: lib.filter.cardDiscardable,
									filterTarget: true,
									ai1(card) {
										return 8 - get.value(card);
									},
									ai2(target) {
										if (target.hasJudge('lebu')) return -1;
										var player = _status.event.player;
										if (get.attitude(player, target) > 4) {
											return get.threaten(target) / Math.sqrt(target.hp + 1) / Math.sqrt(target.countCards('h') + 1);
										}
										return -1;
									},
								});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									player.discard(result.cards);
									target.draw(3);
								}
							},
						},
						lg_shehua: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							filterTarget(card, player, target) {
								return player != target;
							},
							filterCard(card, player, event) {
								event = event || _status.event;
								if (typeof event != 'string') event = event.parent.name;
								var mod = game.checkMod(card, player, event, 'unchanged', 'cardDiscardable', player);
								if (mod != 'unchanged') return mod;
								return true;
							},
							discard: false,
							lose: false,
							delay: false,
							selectCard: [1, Infinity],
							line: 'fire',
							position: 'he',
							check(card) {
								var player = _status.event.player;
								if (
									game.hasPlayer(function (target) {
										return get.damageEffect(player, target, target) > 0 || (get.attitude(player, target) < 0 && target.countCards('he', { color: 'red' }) == 0);
									})
								) {
									var tar = game.filterPlayer(function (target) {
										return get.damageEffect(player, target, target) > 0 || (get.attitude(player, target) < 0 && target.countCards('he', { color: 'red' }) == 0);
									});
									if (ui.selected.cards && ui.selected.cards.length >= tar[0].countCards('he')) return 0;
								}
								if (get.color(card) == 'red') return 7 - get.value(card);
								return 5 - get.value(card);
							},
							content() {
								'step 0';
								event.targets = [];
								event.meblack = 0;
								event.tablack = 0;
								for (var a of cards) {
									if (get.color(a) == 'red') event.meblack++;
								}
								player.discard(cards);
								('step 1');
								target.chooseToDiscard(cards.length, 'he', true);
								('step 2');
								if (result.cards && result.cards.length) {
									for (var a of result.cards) {
										if (get.color(a) == 'red') event.tablack++;
									}
								}
								('step 3');
								if (event.meblack == event.tablack) {
									event.finish();
									return;
								} else {
									if (event.meblack > event.tablack) {
										event.targets.push(player);
										event.targets.push(target);
									} else {
										event.targets.push(target);
										event.targets.push(player);
									}
								}
								('step 4');
								event.targets[1].draw();
							},
							ai: {
								order: 6,
								result: {
									target(player, target) {
										if (target.countCards('he', { color: 'red' }) == 0 && get.attitude(player, target) < 0) return -1;
										return get.damageEffect(target, player, player);
									},
								},
							},
						},
						lg_nailin_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_qiangzhiqingjie: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: 'damageBegin',
							},
							filter(event, player) {
								return event.source && event.source.isAlive() && event.source != player && (event.source.countCards('h') || player.countCards('h'));
							},
							check(event, player) {
								if (get.attitude(player, event.source) <= 0) {
									var cardlength = player.countCards('h');
									for (var i = 0; i < player.getCards('h').length; i++) {
										if (get.value(player.getCards('h')[i]) > 7) {
											cardlength--;
										}
									}
									if (Math.random < 0.5 && cardlength == event.source.countCards('h')) cardlength--;
									return cardlength < event.source.countCards('h');
								} else {
									if (_status.currentPhase == event.source) {
										if (event.source.countUsed('sha') <= 0) return false;
										return event.source && event.source.needsToDiscard();
									} else {
										if (event.source.hp < player.hp) {
											return player.countCards('h') - event.source.countCards('h');
										}
									}
								}
							},
							content() {
								player.swapHandcards(trigger.source);
							},
							ai: {
								effect: {
									target(card, player, target) {
										if (player.countCards('h') <= target.countCards('h')) return;
										if (get.tag(card, 'damage') && get.attitude(player, target) < 0) return [1, player.countCards('h') - target.countCards('h') - 1];
									},
								},
							},
						},
						lg_wuyu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCard',
							},
							mark: true,
							intro: {
								content: '未发动',
							},
							filter(event, player) {
								if (event.player == player) return false;
								if (!event.card) return false;
								if (event.targets.length == 0) return false;
								var targets = event.targets;
								for (var i = 0; i < targets.length; i++) {
									if (targets[i] == player) return false;
								}
								var card = event.card;
								var type = get.type(card, 'trick');
								//if(type!='basic' && type!='trick') return false;
								var cards = player.getCards('he');
								for (var i = 0; i < cards.length; i++) {
									if (get.type(cards[i], 'trick') == type) return true;
								}
								return false;
							},
							check(event, player) {
								var effect = 0;
								var targets = event.targets;
								for (var i = 0; i < targets.length; i++) {
									effect += get.effect(targets[i], event.card, event.player, player);
								}
								if (effect >= 0) return false;
								var card = event.card;
								var type = get.type(card, 'trick');
								var cards = player.getCards('h');
								for (var i = 0; i < cards.length; i++) {
									if (get.type(cards[i], 'trick') != type) continue;
									if ((event.card.name == 'tao' || event.card.name == 'jiu') && event.targets[0].hp == 0) return true;
									if (event.card.name == 'sha' && event.targets[0].hp == 1) return true;
									if ((cards[i].name == 'jiu' || cards[i].name == 'tao') && player.hp == 1) continue;
									if (get.type(cards[i], 'trick') == 'equip') {
										if (get.subtype(cards[i]) == 'equip2' && player.hp <= 2) continue;
										if (get.value(cards[i]) < get.value(event.card)) return true;
									}
									if (get.value(cards[i]) < get.value(event.card)) return true;
									if (get.value(cards[i]) == get.value(event.card) && Math.random() > 0.5) return true;
								}
								return false;
							},
							content() {
								'step 0';
								player.$skill('无欲', 'legend', 'thunder');
								player.chooseToDiscard('弃置一张类别相同的牌？', 1, 'he', function (card, player) {
									return get.type(card, 'trick') == get.type(trigger.card, 'trick');
								}).ai = function (card) {
									if (
										player.hp == 1 &&
										card.name == 'du' &&
										player.countCards('h', {
											name: 'tao',
										}) == 0 &&
										player.countCards('h', {
											name: 'jiu',
										}) == 0
									)
										return 0;
									return 20 - get.value(card);
								};
								('step 1');
								if (result.bool) {
									trigger.player.chooseToDiscard(3, true, 'h');
									player.chooseToDiscard(3, 'he');
									trigger.cancel();
									player.removeSkill('lg_wuyu');
									game.log(player, '令', trigger.player, '的', trigger.card, '无效');
								} else event.finish();
							},
							ai: {
								threaten: 1.3,
								expose: 0.5,
							},
						},
						lg_miyu: {
							nobracket: true,
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'recoverBegin',
							},
							mark: true,
							intro: {
								content: '未发动',
							},
							forced: true,
							filter(event, player) {
								return player.countCards('h', { suit: 'club' }) > 0;
							},
							init(player) {
								player.storage.lg_miyu = 1;
							},
							content() {
								'step 0';
								player.$skill('蜜语', 'legend', 'thunder');
								event.players = trigger.player;
								var num = trigger.player.maxHp - trigger.player.hp - trigger.num;
								player
									.chooseCard('<span style=\"color: \">蜜语</span>:弃置至多' + get.cnNumber(num) + '张<span style=\"color: \">♣️️</span>牌？', 'he', [1, num], function (card) {
										return card.suit == 'club';
									})
									.set('ai', function (card) {
										if (player.getEnemies().includes(event.players)) return false;
										return true;
									});
								('step 1');
								if (result.bool) {
									var target = event.players;
									player.line(event.players, 'white');
									player.discard(result.cards);
									var num = result.cards.length;
									trigger.num += num;
									player.storage.lg_miyu--;
								}
							},
							group: 'lg_miyu_draw',
							subSkill: {
								draw: {
									trigger: {
										global: 'recoverEnd',
									},
									filter(event, player) {
										return player.storage.lg_miyu < 1;
									},
									popup: false,
									forced: true,
									content() {
										event.target = [];
										event.target.push(player);
										event.target.push(trigger.player);
										game.asyncDraw(event.target, trigger.num);
										player.storage.lg_miyu++;
									},
								},
							},
							ai: {
								moreDraw: true,
								threaten: 2,
								expose: 0.1,
							},
						},
						lg_zhelinai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_miyu1: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'lg_miyuAfter',
							},
							forced: true,
							content() {
								player.removeSkill('lg_miyu');
							},
						},
						lg_zhuorelinghun: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'changeHp',
							},
							prompt(event, player) {
								return '对' + get.translation(event.player) + '发动此技能？';
							},
							check(event, player) {
								return get.attitude(player, event.player) > 0;
							},
							filter(event, player) {
								return event.player.isAlive() && event.player.hp > player.hp;
							},
							content() {
								event.card = get.cardPile(function (card) {
									return get.type(card) == 'equip' && !trigger.player.isDisabled(get.subtype(card));
								});
								if (event.card) {
									trigger.player.chooseUseTarget(event.card, 'noanimate', 'nopopup', true);
								} else {
									event.finish();
								}
							},
						},
						lg_gaoguihongyan: {
							trigger: {
								player: 'shaMiss',
							},
							forced: true,
							audio: 'ext:幻颜风华/audio:2',
							content() {
								'step 0';
								player.chooseTarget(get.prompt2('lg_gaoguihongyan'), lib.filter.notMe).set('ai', function (target) {
									var player = _status.event.player;
									if (player.countCards('h') > player.maxHp) return 0;
									var att = get.attitude(player, target);
									if (att <= 0 || target.hasSkillTag('nogain')) return 0;
									if (target.maxHp - target.countCards('h') >= 2) return att;
									return att / 2;
								});
								('step 1');
								if (result.bool) {
									var target = result.targets[0];
									event.target = target;
									target.draw();
								} else event.finish();
								('step 2');
								var num = target.countCards('h') - target.hp;
								if (target.countCards('h') > target.hp) player.draw(num);
								('step 3');
								if (player.countCards('h') > player.hp) target.damage(2, 'fire');
							},
							ai: {
								expose: 0.25,
							},
						},
						lg_qiunai_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_xinyue: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								player: ['useCard', 'respondAfter'],
							},
							forced: true,
							filter(event, player) {
								if (player == _status.currentPhase) return false;
								if (event.cards) {
									if (Array.isArray(event.cards))
										for (var i of event.cards) {
											//QQ
											if (i.suit == 'heart') return true;
										}
								}
								return false;
							},
							content() {
								'step 0';
								player
									.chooseTarget(get.prompt('lg_xinyue'), function (card, player, target) {
										return player != target && target.countCards('he') > 0;
									})
									.set('autodelay', trigger.name == 'respond' ? 0.5 : 1).ai = function (target) {
										return -get.attitude(player, target);
									};
								('step 1');
								if (result.bool) {
									player.gainPlayerCard(result.targets[0], true);
								}
							},
							ai: {
								threaten: 0.7,
							},
						},
						lg_xianyue: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								source: 'damageAfter',
							},
							forced: true,
							filter(event, player) {
								return event.card && event.card.name == 'sha';
							},
							content() {
								'step 0';
								player.chooseToDiscard(get.prompt('lg_xianyue'), 2, 'he', { color: 'red' }).ai = function (card) {
									if (get.attitude(player, trigger.player) < 0) return 1;
									return 0;
								};
								('step 1');
								if (result.bool) trigger.player.hp--;
							},
						},
						lg_manyue: {
							logTarget: 'player',
							check(event, player) {
								var num = 0;
								for (var i = 0; i < event.targets.length; i++) {
									var juese = event.targets[i];
									var eff = get.effect(juese, event.card, event.player, player);
									num += eff;
								}
								return num < 0;
							},
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'useCard',
							},
							filter(event, player) {
								//if(event.card.name=='wuxie')return false;
								//if(!event.targets||!event.targets.length)return false;
								if (event.player == player) return false;
								if (get.type(event.card) != 'trick' && get.type(event.card) != 'delay') return false;
								return event.card.suit == 'heart';
							},
							content() {
								'step 0';
								trigger.player.judge(function (card) {
									if (get.color(card) == 'red') return -1;
									return 0;
								}).judge2 = function (result) {
									return result.bool;
								};
								('step 1');
								if (result.bool == false) {
									//trigger.targets.length=0;
									trigger.all_excluded = true;
									trigger.excluded.addArray(game.filterPlayer());
									trigger.player.randomDiscard('h');
									trigger.player.next.randomDiscard('h');
									trigger.player.previous.randomDiscard('h');
								}
							},
						},
						lg_helage_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_gaoxiaochongji: {
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							usable: 1,
							filter(event, player) {
								return game.hasPlayer(function (current) {
									return current.countCards('ej');
								});
							},
							filterTarget(card, player, target) {
								return target.countCards('ej');
							},
							content() {
								'step 0';
								player.choosePlayerCard(target, 'ej', true).set('ai', function (button) {
									var att = get.attitude(player, target);
									var val = get.value(button.link);
									if (att > 0) {
										if (get.type(button.link) == 'equip') return 5 - val;
										return 20;
									} else {
										if (get.type(button.link) == 'equip') return val;
										return -20;
									}
								});
								('step 1');
								event.cds = result.links.slice(0);
								('step 2');
								player.useCard({ name: 'sha' }, event.cds, target);
								if (player.countCards('h', { suit: 'diamond' }) == player.getAttackRange()) player.chooseToEnable();
							},
							ai: {
								expose: 0.3,
								order: 9,
								result: {
									target(player, target) {
										return -2;
									},
								},
							},
						},
						lg_bitanglianfa: {
							mod: {
								targetInRange(card, player, target) {
									if (!player.countCards('e')) {
										return true;
									}
								},
							},
							audio: 'ext:幻颜风华/audio:2',
							enable: 'phaseUse',
							filter(event, player) {
								return player.countDisabled() < 5;
							},
							filterTarget(card, player, target) {
								return player != target;
							},
							selectTarget: 1,
							content() {
								'step 0';
								var list = [];
								for (var i = 1; i < 6; i++) {
									if (player.isDisabled(i)) continue;
									list.push('equip' + i);
								}
								if (!list.length) event.finish();
								else {
									event.list = list;
									var next = player.chooseControl(list);
									next.prompt = '选择一个装备栏废除';
									next.ai = function () {
										if (list.includes('equip2')) return 'equip2';
										if (list.includes('equip3')) return 'equip3';
										if (list.includes('equip5')) return 'equip5';
										if (list.includes('equip4')) return 'equip4';
										return 'equip1';
									};
								}
								('step 1');
								if (result.control) {
									var num = player.countCards('h') - player.getAttackRange();
									player.disableEquip(result.control);
									player.useCard({ name: 'sha' }, target, false);
									if (player.countCards('h', { suit: 'diamond' }) > player.getAttackRange()) player.draw(num);
								} else event.finish();
							},
							ai: {
								order: 6,
								result: {
									target(player, target) {
										var eff = get.effect(target, { name: 'sha' }, player, target);
										if (player.countDisabled() >= 4) return 0;
										return eff;
									},
								},
							},
						},
						lg_fengdi_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_pozhanbaichu: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: ['shaBegin', 'juedouBegin'],
							},
							forced: true,
							filter(event, player) {
								return event.target == player;
							},
							content() {
								trigger.player.randomDiscard('h');
							},
						},
						lg_xunci: {
							audio: 'ext:幻颜风华/audio:2',
							trigger: {
								global: 'shaMiss',
							},
							_priority: 6,
							filter(event, player) {
								return event.player != player && event.player.isAlive();
							},
							logTarget: 'player',
							check(event, player) {
								return get.attitude(player, event.player) <= 0;
							},
							content() {
								'step 0';
								var list = ['sha', 'juedou'];
								player.chooseButton(['迅刺', [list, 'vcard']], true).set('ai', function (button) {
									var player = _status.event.player;
									var players = game.filterPlayer();
									if (button.link[2] == 'sha') {
										for (var i = 0; i < players.length; i++) {
											if (player.canUse('sha', players[i]) && (player.getEquip(1) || !players[i].getEquip(2)) && get.attitude(player, players[i]) < 0) {
												return 3 + Math.random();
											}
										}
										return 0;
									}
									if (button.link[2] == 'juedou') {
										for (var i = 0; i < players.length; i++) {
											if (player.canUse('juedou', players[i]) && (player.countCards('h', 'sha') > 0 || players[i].countCards('h') < 2) && get.attitude(player, players[i]) < 0) {
												return 2 + Math.random();
											}
										}
										return 0;
									}
									return 0;
								});
								('step 1');
								if (result.bool) {
									var card = result.links[0][2];
									player.useCard({ name: card }, trigger.player, false);
								}
							},
							ai: {
								expose: 0.2,
								threaten: 1.5,
							},
						},
						lg_jinbenshun_zhenwang: {
							audio: 'ext:幻颜风华/At dawn:2',
							trigger: {
								player: 'dieBegin',
							},
							forced: true,
							content() { },
						},
						lg_huanjing: {
							trigger: {
								player: 'phaseBefore',
							},
							forced: true,
							filter(event, player) {
								return event.parent.name != 'lg_huanjing';
							},
							intro: {
								content: '幻境',
							},
							content() {
								'step 0';
								var handcards1, handcards2, judges, equips, viewAs, i, j;
								event.data = [];
								event.cardPile = [];
								for (var i = 0; i < game.players.length; i++) {
									viewAs = [];
									handcards1 = [];
									handcards2 = [];
									judges = [];
									equips = [];
									for (j = 0; j < i.node.handcards1.childNodes.length; j++) handcards1.push(i.node.handcards1.childNodes[j]);
									for (j = 0; j < i.node.handcards2.childNodes.length; j++) handcards2.push(i.node.handcards2.childNodes[j]);
									for (j = 0; j < i.node.judges.childNodes.length; j++) {
										viewAs.push(i.node.judges.childNodes[j].viewAs);
										judges.push(i.node.judges.childNodes[j]);
									}
									for (j = 0; j < i.node.equips.childNodes.length; j++) equips.push(i.node.equips.childNodes[j]);
									event.data.push({
										player: i,
										handcards1: handcards1,
										handcards2: handcards2,
										judges: judges,
										equips: equips,
										viewAs: viewAs,
										value: handcards1.length + handcards2.length + equips.length - judges.length,
									});
								}
								for (var i = 0; i < ui.cardPile.childElementCount; i++) {
									event.cardPile.push(ui.cardPile.childNodes[i]);
								}
								('step 1');
								player.markSkill('lg_huanjing');
								player.addSkill('lg_huanjing_end');
								player.phase('lg_huanjing');
								('step 2');
								player.removeSkill('lg_huanjing_end');
								('step 3');
								game.animate.window(1);
								('step 4');
								player.unmarkSkill('lg_huanjing');
								var storage = event.data;
								for (var i = 0; i < storage.length; i++) {
									var current = storage[i].player;
									if (current.isAlive()) {
										current.removeEquipTrigger();
										var cards = current.getCards('hej');
										for (var j = 0; j < cards.length; j++) {
											cards[j].discard();
										}
									}
								}
								('step 5');
								var storage = event.data;
								var current;
								var i, j;
								for (var i = 0; i < storage.length; i++) {
									current = storage[i].player;
									if (current.isAlive()) {
										for (j = 0; j < storage[i].handcards1.length; j++) {
											if (storage[i].handcards1[j].parentNode == ui.discardPile || storage[i].handcards1[j].parentNode == ui.cardPile) {
												current.node.handcards1.appendChild(storage[i].handcards1[j]);
											} else {
												current.node.handcards1.appendChild(game.createCard(storage[i].handcards1[j]));
											}
										}
										for (j = 0; j < storage[i].handcards2.length; j++) {
											if (storage[i].handcards2[j].parentNode == ui.discardPile || storage[i].handcards2[j].parentNode == ui.cardPile) {
												current.node.handcards2.appendChild(storage[i].handcards2[j]);
											} else {
												current.node.handcards2.appendChild(game.createCard(storage[i].handcards2[j]));
											}
										}
										for (j = 0; j < storage[i].equips.length; j++) {
											if (storage[i].equips[j].parentNode == ui.discardPile || storage[i].equips[j].parentNode == ui.cardPile) {
												storage[i].equips[j].style.transform = '';
												current.equip(storage[i].equips[j]);
											} else {
												current.equip(game.createCard(storage[i].equips[j]));
											}
										}
										for (j = 0; j < storage[i].judges.length; j++) {
											if (storage[i].judges[j].parentNode == ui.discardPile || storage[i].judges[j].parentNode == ui.cardPile) {
												storage[i].judges[j].style.transform = '';
												storage[i].judges[j].viewAs = storage[i].viewAs[j];
												if (storage[i].judges[j].viewAs && storage[i].judges[j].viewAs != storage[i].judges[j].name && storage[i].judges[j].classList.contains('fullskin')) {
													storage[i].judges[j].classList.add('fakejudge');
													storage[i].judges[j].node.background.innerHTML = lib.translate[storage[i].judges[j].viewAs + '_bg'] || get.translation(storage[i].judges[j].viewAs)[0];
												}
												current.node.judges.appendChild(storage[i].judges[j]);
											}
										}
										current.update();
									}
								}
								var data = {};
								for (var i of game.players) {
									//QQ
									data[i.dataset.position] = {
										h: get.cardsInfo(i.getCards('h')),
										e: get.cardsInfo(i.getCards('e')),
										j: get.cardsInfo(i.getCards('j')),
									};
								}
								game.addVideo('skill', event.player, ['lg_huanjing', data]);
								game.animate.window(2);
								while (ui.cardPile.childElementCount) {
									ui.cardPile.firstChild.discard();
								}
								for (var i = 0; i < event.cardPile.length; i++) {
									if (event.cardPile[i].parentNode == ui.discardPile) {
										ui.cardPile.appendChild(event.cardPile[i]);
									} else {
										ui.cardPile.appendChild(game.createCard(event.cardPile[i]));
									}
								}
								ui.updatehl();
							},
							subSkill: {
								end: {
									trigger: {
										source: 'damageEnd',
									},
									_priority: 9,
									silent: true,
									content() {
										var evt = _status.event.getParent('lg_huanjing');
										if (evt && evt.name == 'lg_huanjing') {
											_status.event = evt;
											game.resetSkills();
										}
									},
									ai: {
										jueqing: true,
									},
									forced: true,
									popup: false,
								},
							},
						},
					},
				};
				lib.config.all.characters.add('幻颜风华');
				lib.config.characters.add('幻颜风华');
				for (var i in QQQ.character) {
					QQQ.character[i][4].add(`ext:幻颜风华/image/${i}.jpg`)
				}
				lib.translate['幻颜风华_character_config'] = `幻颜风华`;
				return QQQ;
			});
			//—————————————————————————————————————————————————————————————————————————————数据操作相关自定义函数
			const numfunc = function () {
				if (!lib.number) {
					lib.number = [];
					for (var i = 1; i < 14; i++) {
						lib.number.add(i);
					}
				} //添加lib.number
				window.sgn = function (bool) {
					if (bool) return 1;
					return -1;
				};//true转为1,false转为-1
				window.numberq0 = function (num) {
					if (isNaN(Number(num))) return 0;
					return Math.abs(Number(num));
				};//始终返回正数(取绝对值)
				window.numberq1 = function (num) {
					if (isNaN(Number(num))) return 1;
					return Math.max(Math.abs(Number(num)), 1);
				};//始终返回正数且至少为1(取绝对值)
				window.number0 = function (num) {
					if (isNaN(Number(num))) return 0;
					return Math.max(Number(num), 0);
				};//始终返回正数
				window.number1 = function (num) {
					if (isNaN(Number(num))) return 1;
					return Math.max(Number(num), 1);
				};//始终返回正数且至少为1
				window.deepClone = function (obj, visited = new WeakMap()) {
					if (obj === null || typeof obj !== 'object' || obj instanceof window.Element) {
						return obj;
					}
					if (visited.has(obj)) {
						return visited.get(obj);
					}
					if (Array.isArray(obj)) {
						return obj.map((item) => deepClone(item, visited));
					}
					const clonedObj = {};
					visited.set(obj, clonedObj);
					for (let key in obj) {
						if (obj.hasOwnProperty(key)) {
							clonedObj[key] = deepClone(obj[key], visited);
						}
					}
					return clonedObj;
				}; //深拷贝对象
				window.factorial = function (num) {
					num = Math.round(num);
					if (num < 0) {
						return 0;
					}
					if (num < 2) {
						return 1;
					}
					let result = 1;
					for (let i = 2; i <= num; i++) {
						result *= i;
					}
					return result;
				}; //阶乘
				window.isPrime = function (num) {
					if (num === 2 || num === 3) return true;
					if (num < 2 || num % 2 === 0 || num % 3 === 0) return false;
					for (let i = 5; i * i <= num; i += 6) {
						if (num % i === 0 || num % (i + 2) === 0) return false;
					}
					return true;
				}; // 质数
			};
			numfunc();
			game.import('card', function (lib, game, ui, get, ai, _status) {
				const QQQ = {
					name: '幻颜风华',
					connect: true,
					card: {
						lg_duanshe: {
							fullskin: true,
							type: '罗德岛',
							enable: true,
							filterTarget: true,
							cardcolor: 'blue',
							cardnature: 'water',
							content() {
								'step 0';
								target.damage('nosource');
								('step 1');
								target.addTempSkill('lg_duanshe1', { player: 'phaseEnd' });
							},
							ai: {
								value: [4, 1],
								useful: 2,
								order: 2,
								result: {
									target(player, target) {
										if (target.hasSkillTag('nofire')) return 1.5;
										if (target.hasSkillTag('maixie_hp')) return 0;
										if (target.hp == 1) return -1;
										return -1 / Math.sqrt(target.hp + 1);
									},
								},
								tag: {
									damage: 1,
									fireDamage: 1,
									natureDamage: 1,
								},
							},
							selectTarget: 1,
						},
						lg_daijin: {
							type: '罗德岛',
							enable: true,
							filterTarget: true,
							content() {
								'step 0';
								target.addSkill('lg_paoying1');
							},
							ai: {
								value: 6,
								useful: [3, 1],
								result: {
									target(player, target) {
										if (target.hasSkillTag('noh')) return 0.1;
										switch (target.countCards('h')) {
											case 0:
												return 0.5;
											case 1:
												return 0;
											case 2:
												return -1.5;
											default:
												return -1;
										}
									},
								},
								order: 8,
								tag: {
									loseCard: 1,
									discard: 1,
								},
							},
							selectTarget: 1,
							fullskin: true,
						},
						lg_moliyongdong: {
							type: '异界',
							enable: true,
							filterTarget: true,
							cardcolor: 'blue',
							cardnature: 'thunder',
							content() {
								'step 0';
								if (target.countCards('he') < 1) {
									event.directfalse = true;
								} else {
									target.chooseToDiscard(1, 'he', { suit: 'club' }).ai = function (card) {
										if (target.hasSkillTag('nofire')) return 0;
										if (get.damageEffect(target, player, target, 'ice') >= 0) return 0;
										if (player.hasSkillTag('notricksource')) return 0;
										if (target.hasSkillTag('notrick')) return 0;
										if (card.name == 'tao') return 0;
										if (target.hp == 1 && card.name == 'jiu') return 0;
										if (target.hp == 1 && get.type(card) != 'basic') {
											return 10 - get.value(card);
										}
										return 8 - get.value(card);
									};
								}
								('step 1');
								if (event.directfalse || !result.bool) {
									target.damage('ice');
								}
							},
							ai: {
								basic: {
									order: 4,
									value: 7,
									useful: 2,
								},
								result: {
									target(player, target) {
										if (target.hasSkillTag('nofire')) return 0;
										if (get.damageEffect(target, player, player) < 0 && get.attitude(player, target) > 0) {
											return -2;
										}
										var nh = target.countCards('he');
										if (target == player) nh--;
										switch (nh) {
											case 0:
											case 1:
												return -2;
											case 2:
												return -1.5;
											case 3:
												return -1;
											default:
												return -0.7;
										}
									},
								},
								tag: {
									damage: 1,
									fireDamage: 1,
									natureDamage: 1,
									discard: 1,
									loseCard: 1,
									position: 'he',
								},
							},
							selectTarget: 1,
							fullimage: true,
						},
						lg_qiangjiyaoshui: {
							type: '药水',
							subtype: '药水',
							enable: true,
							filterTarget: true,
							content() {
								if (target.isMinHandcard()) {
									target.addTempSkill('lg_qiangji', { player: 'phaseEndStart' });
								} else {
									target.draw(3);
								}
							},
							ai: {
								basic: {
									order: 6,
									value: [6, 1],
									useful: [4, 1],
								},
								result: {
									target(player, target) {
										if (target.isMinHandcard()) return 2;
										return 1;
									},
								},
							},
							selectTarget: 1,
							fullskin: true,
						},
						lg_xunjieyaoshui: {
							type: '药水',
							subtype: '药水',
							enable: true,
							filterTarget: true,
							content() {
								'step 0';
								target.chooseToDiscard('h', 3, true).delay = false;
								('step 1');
								if (target.countCards('e') == 0) target.addTempSkill('lg_xunjie', { player: 'phaseEndStart' });
							},
							ai: {
								value: 6,
								useful: [3, 1],
								result: {
									target(player, target) {
										if (target.hasSkillTag('noh')) return 0.1;
										switch (target.countCards('h')) {
											case 0:
												return 0.5;
											case 1:
												return 0;
											case 2:
												return -1.5;
											default:
												return -1;
										}
									},
								},
								order: 8,
								tag: {
									loseCard: 1,
									discard: 1,
								},
							},
							selectTarget: 1,
							fullskin: true,
						},
						lg_mihuoyaoshui: {
							type: '药水',
							subtype: '药水',
							enable: true,
							filterTarget(card, player, target) {
								return target != player && target.countCards('h');
							},
							content() {
								'step 0';
								player.gainPlayerCard(target, 'h', 3, true, 'visible').set('ai', function (button) {
									return get.value(button.link);
								});
								('step 1');
								target.addTempSkill('lg_mihuo', { player: 'phaseEndStart' });
							},
							ai: {
								basic: {
									order: 8,
									value: 9.5,
									useful: [5, 1],
								},
								result: {
									target(player, target) {
										if (target.getEquip(4)) return -2;
										return -1;
									},
								},
							},
							selectTarget: 1,
							fullskin: true,
						},
						lg_tanlanjiasuo: {
							type: '混沌',
							enable: true,
							wuxieable: true,
							filterTarget(card, player, target) {
								return target != player && target.countGainableCards(player, 'e');
							},
							content() {
								'step 0';
								var es = target.getGainableCards(player, 'e');
								if (es.length) {
									player
										.choosePlayerCard('e', target, true)
										.set('es', es)
										.set('filterButton', function (button) {
											return _status.event.es.includes(button.link);
										});
								} else {
									event.finish();
								}
								('step 1');
								if (result.bool) {
									target.$give(result.links[0], player);
									target.lose(result.links[0], ui.special);
									event.card = result.links[0];
								} else {
									event.finish();
								}
								('step 2');
								if (event.card && get.position(event.card) == 's') {
									player.equip(event.card);
								}
							},
							ai: {
								basic: {
									order: 9,
									value: 6,
									useful: 4,
								},
								result: {
									target: -1,
								},
								tag: {
									loseCard: 1,
									gain: 1,
								},
							},
							selectTarget: 1,
							image: `ext:幻颜风华/image/lg_tanlanjiasuo.jpg`,
						},
						lg_anyingpingzhang: {
							enable: true,
							type: '混沌',
							toself: true,
							filterTarget(card, player, target) {
								return player == target;
							},
							selectTarget: -1,
							modTarget: true,
							content() {
								'step 0';
								target.changeHujia(2);
								('step 1');
								if (target.countCards('he')) {
									target.chooseToDiscard('he', 2, true);
								}
							},
							ai: {
								order: 8.5,
								value: 7,
								useful: 3,
								result: {
									target: 1,
								},
							},
							fullimage: true,
						},
						lg_heianzhihe: {
							type: '混沌',
							enable(event, player) {
								var list = player.getEnemies();
								for (var i = 0; i < list.length; i++) {
									if (list[i].countCards('e')) {
										return true;
									}
								}
								return false;
							},
							filterTarget(card, player, target) {
								return target == player;
							},
							selectTarget: -1,
							content() {
								var list = target.getEnemies();
								var equips = [];
								for (var i = 0; i < list.length; i++) {
									equips.addArray(list[i].getCards('e'));
								}
								equips = equips.randomGets(2);
								if (equips.length == 2) {
									var target1 = get.owner(equips[0]);
									var target2 = get.owner(equips[1]);
									if (target1 == target2) {
										target1.discard(equips);
										player.line(target1);
									} else {
										target1.discard(equips[0]).delay = false;
										target2.discard(equips[1]);
										player.line(target1);
										player.line(target2);
									}
								} else if (equips.length) {
									var target1 = get.owner(equips[0]);
									target1.discard(equips[0]);
									player.line(target1);
								}
							},
							ai: {
								basic: {
									order: 9,
									value: [6, 1],
									useful: [4, 1],
								},
								result: {
									target: 1,
								},
								tag: {
									multitarget: 1,
									multineg: 1,
								},
							},
							fullimage: true,
						},
						lg_fuhuazhiwu: {
							type: 'equip',
							subtype: 'equip2',
							ai: {
								basic: {
									equipValue: 7.5,
									order: 1,
									useful: 2,
									value: 1,
								},
								result: {
									target(player, target, card) {
										return get.equipResult(player, target, card.name);
									},
								},
							},
							skills: ['lg_fuhuazhiwu1'],
							enable: true,
							selectTarget: -1,
							filterTarget(card, player, target) {
								return target == player;
							},
							modTarget: true,
							allowMultiple: false,
							content() {
								if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
							},
							toself: true,
							fullimage: true,
						},
						lg_moshuxishou: {
							type: '降临',
							enable: true,
							filterTarget(card, player, target) {
								return target != player && target.countCards('h');
							},
							content() {
								'step 0';
								player.gainPlayerCard(target, 'h', true, 'visible').set('ai', function (button) {
									return get.value(button.link);
								});
								('step 1');
								target.addTempSkill('lg_moshuxishou1', { player: 'recoverEnd' });
							},
							ai: {
								basic: {
									order: 8,
									value: 9.5,
									useful: [5, 1],
								},
								result: {
									target(player, target) {
										if (target.getEquip(4)) return -2;
										return -1;
									},
								},
							},
							selectTarget: 1,
							fullimage: true,
						},
						lg_fenghun: {
							type: '混沌',
							enable: true,
							filterTarget(card, player, target) {
								return target.hujia || !target.hasSkill('fengyin');
							},
							content() {
								target.randomDiscard('e');
								target.addTempSkill('fengyin', { player: 'phaseAfter' });
								// if(target.hujia){
								//     target.changeHujia(-1);
								// }
							},
							ai: {
								value: [4.5, 1],
								useful: [4, 1],
								result: {
									target(player, target) {
										var threaten = get.threaten(target, player, true);
										if (target.hasSkill('fengyin')) {
											return 0;
										}
										if (target.hasSkillTag('maixie_hp')) {
											threaten *= 1.5;
										}
										return -threaten;
									},
								},
								order: 9.5,
							},
							selectTarget: 1,
							fullimage: true,
						},
						lg_buxingzhidie: {
							type: '混沌',
							enable: true,
							filterTarget(card, player, target) {
								return target == player;
							},
							selectTarget: -1,
							content() {
								'step 0';
								event.num = game.countPlayer();
								player.drawTo(event.num);
								('step 1');
								player.chooseToDiscard(true, event.num, 'he');
								player.next.loseHp();
								player.previous.loseHp();
							},
							ai: {
								value: 6,
								useful: [4, 1],
								result: {
									player(player) {
										var num = player.countCards('he');
										if (num <= 1) return 0;
										if (num <= 3 && !player.needsToDiscard()) return 0;
										return 1;
									},
								},
								order: 7,
							},
							fullimage: true,
						},
						lg_shiyan: {
							type: '混沌',
							enable: true,
							cardnature: 'fire',
							filterTarget(card, player, target) {
								return target.hp <= player.hp;
							},
							content() {
								'step 0';
								target.damage(2, 'fire');
								('step 1');
								if (target.isIn()) {
									target.changeHujia();
								}
							},
							ai: {
								basic: {
									order: 1.8,
									value: [5, 1],
									useful: [4, 1],
								},
								result: {
									target: -1,
								},
								tag: {
									damage: 1,
									thunderDamage: 1,
									natureDamage: 1,
								},
							},
							selectTarget: 1,
							fullimage: true,
						},
						lg_molangzhiyin: {
							type: 'equip',
							subtype: 'equip1',
							distance: {
								attackFrom: -2,
							},
							skills: ['lg_molangzhiyin'],
							ai: {
								basic: {
									equipValue: 4,
									order: 1,
									useful: 2,
									value: 1,
								},
								result: {
									target(player, target, card) {
										return get.equipResult(player, target, card.name);
									},
								},
							},
							enable: true,
							selectTarget: -2,
							filterTarget(card, player, target) {
								return target == player;
							},
							modTarget: true,
							allowMultiple: false,
							content() {
								if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
							},
							toself: true,
							fullimage: true,
						},
					},
					translate: {
						lg_duanshe: '断舍',
						lg_duanshe_info: '对一名其他角色造成1点无来源伤害.其下回合的出牌阶段开始时,将手牌中的装备牌均置入弃牌堆.',
						lg_daijin: '泡影',
						lg_daijin_info: '对一名其他角色使用.其下次跳过摸牌阶段后,减1点体力上限,失去1点体力.',
						lg_moliyongdong: '魔力涌动',
						lg_moliyongdong_info: '对一名其他角色使用,其选择一项:①弃置一张♣️️牌;②你对其造成1点冰属性伤害.',
						lg_qiangjiyaoshui: '强击药水',
						lg_qiangjiyaoshui_info: '令一名角色摸三张牌.若其的手牌数为全场最少或之一,改为其使用♠️️【杀】造成的伤害值+1,直到下回合结束.',
						lg_xunjieyaoshui: '迅捷药水',
						lg_xunjieyaoshui_info: '令一名角色弃置三张手牌.若其的装备区内没有牌,其不能成为延时锦囊牌的目标,直到下回合结束.',
						lg_mihuoyaoshui: '迷惑药水',
						lg_mihuoyaoshui_info: '观看并获得一名其他角色的三张手牌.若如此做,每当其受到伤害时,执行一个额外的弃牌阶段,直到下回合结束.',
						lg_tanlanjiasuo: '贪婪枷锁',
						lg_tanlanjiasuo_info: '对其他角色使用,将一名其他角色装备区内的一张牌移至你的对应区域.',
						lg_anyingpingzhang: '暗影屏障',
						lg_anyingpingzhang_info: '对你使用,获得2点护甲,弃置等量的牌.',
						lg_heianzhihe: '黑暗之核',
						lg_heianzhihe_info: '对敌方角色使用,随机弃置敌方角色装备区内的两张牌.',
						lg_fuhuazhiwu: '腐化之雾',
						lg_fuhuazhiwu_info: '当你受到伤害时,你可以令伤害来源依次弃置两张手牌.',
						lg_moshuxishou: '魔术吸收',
						lg_moshuxishou_info: '对其他角色使用.观看并获得一名其他角色的一张手牌,直到其回复体力为止.每当其的判定牌生效后,其摸一张牌,你可以获得其的两张手牌.',
						lg_fenghun: '封魂',
						lg_fenghun_info: '对其他角色使用.令一名其他角色随机弃置装备区内的一张牌,非锁定技失效,直到回合结束.',
						lg_buxingzhidie: '不幸之蝶',
						lg_buxingzhidie_info: '对你使用.将手牌数补至X,弃置等量的牌,令距离1以内的其他角色各失去1点体力(X为场上存活的角色数).',
						lg_shiyan: '蚀炎',
						lg_shiyan_info: '对一名体力值不大于你的其他角色造成2点火焰伤害,其获得1点护甲.',
						lg_molangzhiyin: '魔狼之印',
						lg_molangzhiyin_info: '当你使用【杀】结算后,你可以随机对另一名敌方角色视为使用一张【杀】.',
					},
				};
				for (const i in QQQ.card) {
					const info = QQQ.card[i];
					if (!info.image) {
						if (info.fullskin) {
							info.image = `ext:幻颜风华/image/${i}.png`;
						}
						else {
							info.image = `ext:幻颜风华/image/${i}.jpg`;
						}
					}
					lib.inpile.add(i);
					if (info.mode && !info.mode.includes(lib.config.mode)) continue;
					lib.card.list.push([lib.suits.randomGet(), lib.number.randomGet(), i]);
				}
				lib.config.all.cards.add('幻颜风华');
				lib.config.cards.add('幻颜风华');
				lib.translate.幻颜风华_card_config = '幻颜风华';
				return QQQ;
			});
		},
		package: {
			intro: "恶魔也不过迷途羔羊,因爱神的光辉而受伤.<br/> 无法欺骗美丽的心灵,厌恶天堂烂漫的假象.<br/> 骄傲如巨龙掌权天空,自信凌驾于神的权能.<br/> 如今血染自由的羽翼,选择披上魔鬼的伪装.<br/> 那罪恶竟是如此耀眼,连黑暗都不是敌手吗？<br/> 若爱神的光辉就受伤,天下都是迷途的羔羊.<br/><br/><br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br></span>",
			author: '尘',
			version: '3.3_幻颜风华',
		},
	};
});
