import { lib, game, ui, get, ai, _status } from '../../noname.js'
game.import('extension', function (lib, game, ui, get, ai, _status) {
    return {
        name: '作者包动漫',
        content(config, pack) {
            //-----------------------------势力------------------------------//
            lib.group.push('zzb_ling');
            lib.translate.zzb_ling = '<span class=greentext>零</span>';
            lib.group.push('zzb_chuang');
            lib.translate.zzb_chuang = '创';
            lib.group.push('zzb_nv');
            lib.translate.zzb_nv = '女';
            lib.group.push('zzb_yi');
            lib.translate.zzb_yi = '异';
            lib.group.push('zzb_wu');
            lib.translate.zzb_wu = '无';
            lib.group.push('zzb_dou');
            lib.translate.zzb_dou = '斗';
            lib.group.push('zzb_yao');
            lib.translate.zzb_yao = '<font color=800>妖</font>';
            lib.group.push('zzb_teng');
            lib.translate.zzb_teng = '<font color=#F0F>疼</font>';
            lib.group.push('zzb_yu');
            lib.translate.zzb_yu = '<span class=yellowtext>域</span>';
            lib.group.push('zzb_ren');
            lib.translate.zzb_ren = '<font color=#f00>忍</font>';
            lib.group.push('zzb_rong');
            lib.translate.zzb_rong = '<span class=bluetext>荣</span>';
            lib.group.push('zzb_zi');
            lib.translate.zzb_zi = '自';
        },
        precontent() {
            game.import('character', function (lib, game, ui, get, ai, _status) {
                const QQQ = {
                    name: '作者包动漫',
                    connect: true,
                    character: {
                        zzb_fsmryi: ['female', 'qun', 4, ['jm_dx'], []],
                        zzb_xmfser: ['female', 'qun', 4, ['jm_dx', 'xm_lxw'], []],
                        zzb_jmfssa: ['female', 'qun', 3, ['jm_dx', 'jm_lxw', 'jm_js'], []],
                        zzh_yedonger: ['female', 'zzb_zi', 3, ['dong_jiang', 'dong_lin'], []],
                        zzb_yeqiuer: ['female', 'zzb_zi', 4, ['qiu_yi', 'qiu_so'], []],
                        zzz_bofengshuimen: ['male', 'zzb_ren', 5, ['fei_ls', 'fei_yi', 'fei_er', 'fei_lin'], ['des:波风水门,日本漫画<火影忍者>系列及衍生作品中的角色.火之国木叶隐村的四代目火影,木叶三忍之一自来也的弟子,主角漩涡鸣人的父亲.实力强大,开发了螺旋丸,为保护村子使用尸鬼封尽封印九尾而牺牲.  在第四次忍界大战中一度被大蛇丸以秽土转生的形式复活,与同被复活的三位火影一起前往战场支援忍者联军.  使用之前封印的阴九尾查克拉变身的九喇嘛模式帮助鸣人,与十尾人柱力带土和斑的对战中不幸被求道玉与六道禅杖切断双臂导致无法回复.  后因鸣人被抽走尾兽将剩余的九尾查克拉传输给鸣人,但在传输过程中不幸被黑绝将阴性九尾查克拉吸收,大战结束后,灵魂回归净土']],
                        zzb_yeqier: ['female', 'zzb_zi', 3, ['fu_si'], []],
                        zzb_kaidie: ['male', 'zzb_rong', 4, ['kai_mo', 'mo_kai'], ['des:古老的魔道家族,流动着神秘力量的血脉传承,都是因为<罪>而获得的.当年轻人追溯着疯狂血缘的来历了解到这个事实后,变得面目全非. 他抛开家乡离去……只留下可怕的传说.当一个家族获得不属于自身的力量,终究是要偿还的.而他背负起了罪恶,去终结罪恶. 好些年里,令人颤栗的魔刃如同幽灵漂泊于勇士之地,引发同样身为魔道家族后人们的恐慌.可所有毫无意义的战斗都不能填补灵魂的空虚,只会令绝望与日俱增.他终究消失了,在前往东方的路途上.他想去追溯魔道根源,也许可以令自己摆脱无尽宿命的折磨. 他就这样步入滚滚黄沙深处——大片统称为<西域>的土地.而那里,正经历着改变所有人命运的剧变. 大漠中的绿洲,稀有珍贵的泉水,深达地下的石井……围绕它们所建立起来的诸国,在漫长的时光为了水源彼此攻讦,相互纷争不断,直到大唐铁骑的来临才有所改变.前所未有强盛的帝国建立起都护府,打开关市,从丝绸之路运来茶和布匹,调解了冲突和争夺.大漠中因此平静数十年之久. 可那前往东方的剑士路过时,看到的是毁灭的迹象.王庭沦陷了;都护府沦陷了;当地平民哭号着,唐国的士兵倒于路边奄奄一息,他们都认为对方才是背叛者. 冷漠的剑士没兴趣了解谁对谁错,但魔道的泛滥令他厌恶,让他想起昼夜折磨他的噩梦.于是所有人逃离沦陷的城市时,他逆行步入灾厄深处.成群结队的魔物自剑下哀嚎着倒下,可危险的气息越来越浓烈:他想,有个家伙,非常擅长魔道的家伙,在窥视着.他要找出他,他有着这样的自信和骄傲. 随之四周变化为熟悉的景象:他的过去,他的宿命,他的噩梦,他的每一次战斗,那幕后邪恶的家伙无法正面与剑士对抗,就要使用幻术令他自绝于痛苦和绝望.这是魔道之刃与魔道之法的对决.他挥出了剑!剑光带着力量和意志斩破邪恶的迷雾,有什么东西发出惨叫和怒吼. 幻术消散了.废墟中,剑士立刻明白为何那家伙死命阻止他:小小的少年,恐惧哭泣的魔种混血少年全身笼罩在刻印的法阵中,会被用来作为祭品唤醒某种强大的东西. <哥哥.>少年撕心裂肺的哭喊着.<哥哥.>记忆中刻意想要忘掉的声音,同样呢喃<哥哥.><哥哥.>剑士的记忆飘渺到很久以前,为强盗挟持的女孩伸手向他求援.<哥哥.><哥哥.> 冰封的心瞬间瓦解.饱吸生命的恐怖魔物没有抓住它渴求的最后祭品,少年被抛往远处.反倒是踏进法阵的剑士自己遭迷雾拖入黑暗.某种有生命的物体挣扎着,牢牢包裹他,欲将他吞噬. <哥哥.><哥哥.><哥哥.> 啜泣的声音越来越远,却清晰入心.身体被撕裂,意志越发清醒.濒临死亡的剑士嘴角泛起冷笑,这邪恶的生物似乎不清楚,自己才是他们中间更可怕,更恐怖的那个. 他再次挥剑. 穿过大漠的风吹动着高扬的旗帜,凤鸟的图案鲜明如火.它傲然的矗立着,纵使经过七日七夜不断的战斗,宣示着长城一角始终难攻不破. 第八天,围困这堡垒的魔种骚动起来,那与他们作对的绯红身影,从它们的来路发起了攻击.最终的战斗从夜晚持续到黎明,数量悬殊的双方始终无法取得决定性胜利:直到一个人,一个活生生的人,旁若无物,摇摇晃晃走进伤痕累累的战场. 绯红的巡守者自战场中间捡到了异乡剑士.有生命的魔铠在她眼前快速退却,露出苍白的面庞和伤痕累累的身躯,手里紧紧抓着一把剑.周围是堆砌如山的魔种尸体. <从哪里来？>也不知道他能否听懂. <忘记了.>拙劣的通用语回应. <名字呢？> <忘……> <铠.>女性将领利落的打断他.<就叫你铠吧.快起来,别装死.> 异乡人露出无奈的苦笑. 绯红的身影头也不回.<你很强,我们需要你这样的人.留下来吧.也许会后悔.反正你什么都忘了,后悔也无所谓吧.> 突然被取名为铠的剑士望着手里的剑.剑上的斑斑点点,让他想起绝境中的沙地,生长的花. 铠吗？似乎不错.忘掉锐利的、只会伤人的剑,从此以守护的铠之名存在. 他撑起身体,慢慢跟了上去. 前方,是延绵到天尽头的长城. 以绝望挥剑,着逝者为铠']],
                        zzb_kaihuang: ['male', 'zzb_ren', 5, ['si_zhan', 'ba_men'], ['des:迈特·凯,日本漫画<火影忍者>及其衍生作品中的角色,火之国木叶隐村的上忍,号称<木叶高傲的苍蓝猛兽>,第三班李洛克、日向宁次和天天的指导老师和小队队长.  他是一位永远把<青春>二字挂在嘴边的热血男人,和旗木卡卡西是好友和对手,称卡卡西为<永远的对手>.虽然不擅长忍术与幻术,但凯与小李不同,凯可以使用忍术,不过凯更擅长体术,是一位体术高手,并以此在各种任务及战役中极为活跃,特别是第四次忍界大战,更是被宇智波斑赞誉为:<体术最强!>']],
                        zzb_kaishen: ['male', 'zzb_zi', 4, ['ba_buff', 'kai_kai', 'kai_er', 'kai_yi', 'kai_san'], []],
                        zzb_leimu: ['female', 'zzb_ling', 3, ['leimu_np', 'leimu_wr', 'gui_hua'], ['des:雷姆,轻小说<Re:从零开始的异世界生活>及其衍生作品的主要角色,在罗兹沃尔的宅邸中一手担当全部杂务的双胞胎女仆中的妹妹,小时候家人被魔女教所杀,姐姐角被斩断,从而憎恨魔女教,初识昴因其身上有魔女气味不待见昴,之后解开误会被昴拯救,认定昴是她的英雄,一心一意的相信并照顾昴,看似毒舌冷漠,其实内心很坚强,很温柔']],
                        zzb_yasina: ['female', 'zzb_yu', 4, ['jian_zzcj', 'jian_sctc', 'jian_xxlg', 'jian_smsm'], ['des:血盟骑士团副团长,在SAO世界与桐人结婚(新婚度蜜月时暂时退团),有惊艳的外貌.在艾恩葛朗特75层桐人与茅场晶彦决斗时,为桐人牺牲,完成了攻略.(本身未死,而是被转移到ALO中囚禁)被须乡伸之囚禁在ALfheim online里面.在小说第4卷被桐人救出,现实中正式成为桐谷和人的恋人']],
                        zzb_meipulu1: ['female', 'zzb_teng', 4, ['beng_shi', 'jing_shi', 'tian_shi', 'jue_juefang', 'jue_jijia'], ['des:能让所有攻击失效,以致死毒的技能彻底蹂躏怪物和玩家!那不寻常的战斗英姿,被称之为<移动要塞>或<最终魔王>.而那位玩家的真面目,居然是一名菜鸟美少女! 想要隐瞒什么的梅普露,在朋友莎莉的推荐下,刚刚开始玩游戏.缺乏游戏常识的她,把属性点点在防御力上点满了,尽管一开始被小喽啰怪物耍得团团转,然而…… 不……痛!？ 即使被怪物拳打脚踢也毫无损伤,更走运的是,还得到了一击必杀的反击技能! 非比寻常的同伴们加入,梅普露也渐渐变强.毫发无伤的大冒险,正式拉开序幕!']],
                        zzb_tushanhonghong: ['female', 'zzb_yao', 4, ['hh_jyzz', 'hh_zsxy', 'hh_jyzs'], ['des:幼年时曾经误杀了自己的救命恩人而一度陷入低潮. 在救了东方月初后,内心有所放开,但因为心结不肯接受东方月初的表白. 东方月初为了她的梦想离开涂山五十年,最后因某件变故,涂山红红面对自己的内心,与东方月初在苦情巨树下许下了来世再见的愿望 ']],
                        zzb_kakaxi: ['male', 'zzb_ren', 4, ['shu_xing', 'kkx_qns', 'kkx_fuzhi', 'shen_wei'], ['des:旗木卡卡西,日本漫画<火影忍者>及其衍生作品中的男性角色.火之国木叶隐村的精英上忍,原木叶暗部成员,四代目火影波风水门的弟子,第七班队长,漩涡鸣人、宇智波佐助、春野樱的老师.年仅12岁就成为上忍的天才忍者,后左眼移植宇智波带土的写轮眼,因使用写轮眼复制了上千种忍术而被称为<拷贝忍者>、<写轮眼卡卡西>,其名号响彻各国.  第四次忍界大战中,写轮眼不幸被宇智波斑夺去,所幸被鸣人使用阴阳遁将左眼复原.带土临死前通过查克拉将写轮眼再次赋予卡卡西而可以短暂使用完整的万花筒写轮眼力量,能够开启完全体须佐能乎,并借此在最终决战与第七班三位弟子一起将大筒木辉夜封印.战争结束后成为了六代目火影,数年后卸任,由鸣人当第七代火影,和迈特凯两人启程旅行,去寻找曾经的回忆']],
                        zzb_shenweikkx: ['male', 'zzb_ren', 3, ['zy_sw', 'yy_sw', 'sw_ylj', 'sw_lq'], []],
                        zzb_yuanshiluna: ['female', 'zzb_rong', 4, ['luna_pifu', 'ln_yueguang', 'xing_yue', 'ln_yuedun'], ['des:大陆上存在古老的魔道家族,他们继承了古代魔种的血液,能比正常人类更轻易获得魔力.而这种力量也让他们背负着残酷的宿命. 露娜就出生在这样的家族. 她的家族最擅长的事,就是将自然之力赋予在武器上.在成年礼上,露娜被选作继承人,并得到了寄托家族力量的徽章. 按照法则,整个家族中能够继承这种力量的只有一个后裔.当继承仪式之后,她的七个兄弟姐妹本应过着平常人的生活.但惨剧在当夜发生了. 月光冰冷的照耀着大地,她的长兄,她最敬爱的亲人,杀掉了父母,亲人,以及所有的兄弟姐妹. <小妹,你不是我的对手.>那个面目全非的人说. <为什么要这样做？哥哥,想成为继承人,我可以让给你.为什么连父亲,母亲,连家人都要杀掉？> <小妹,记得吗？你十一岁时,闯入村庄的杀手挟持了你,我将他们全部击倒的事？> <是的,我记得……> <其实,我并非想救你,不过是单纯无法控制自己而已.> 魔道能赋予人力量,也能让人疯狂.露娜意识到,她的哥哥,已无法控制自己. <你很美丽,小妹,我指的是,你越来越强了.我对继承人的位置没兴趣,我就是单纯想击败你而已.> <哥哥……> <为什么还不开始？你还在迟疑？> <哥哥,我对你充满敬仰,想成为你这样的强者……哥哥,我无法忘记你教导我的一切,就像无法忽视月光.> <说废话干嘛!拔剑啊!那些小事,我统统忘了.> <但我不会忘记.杀了我,我愿意把生命还给你.> 兄长收起了他的刀. <没意思.>他说.<跟不反抗的人决斗,没意思.> 他拾起她的剑,轻松折断,离开. 露娜擦干了最后的眼泪.魔道的宿命,是一种多么恐怖的东西.不知不觉间,哥哥替她背负了这份罪恶. 只要变得更强,总有一天能再见面吧.我会找到你,做一个了结. <燃烧的剑,燃烧的心!>~露娜']],
                        zzb_haofan: ['male', 'zzb_chuang', 3, ['hf_motou', 'hf_ddbc', 'hf_haofan'], ['des:啊啊啊啊啊啊啊啊啊啊~好烦……']],
                        zzb_yechuner: ['female', 'zzb_zi', 3, ['zzb_wwhc', 'zzb_sjrc', 'chun_tian'], []],
                        zzb_yexiaer: ['female', 'zzb_zi', 4, ['xia_tian', 'yan_ri', 'xia_ri', 'yong_zhuang'], []],
                        zzb_shali: ['female', 'zzb_teng', 5, ['zzb_fenshenshu', 'zzb_fengrenshu', 'zzb_erdaoliu', 'zzb_zhiyushu'], ['des:在第二话中,女主的好闺蜜<莉莎>终于可以和女主一起玩游戏了.她的游戏角色名字叫<莎莉>,就是真名倒过来念,起名有点随意哈哈哈.  莎莉给自己的角色定位为<回避盾>,就是速度超快型,专门吸引敌人的火力,回避攻击,使对方攻击无效化.莎莉和梅普露在收集鱼鳞的水池下,发现了一个洞穴.莎莉最终打败了洞穴中的怪鱼boss,获得宝箱一个,里面当然有新装备啦.之后游戏宣布开启第二层世界,两人就组队继续冒险咯']],
                        zzb_aimiliya: ['female', 'zzb_ling', 4, ['amly_bjzh', 'amly_jl', 'amly_pake', 'ji_du'], ['des:艾米莉娅,是日本轻小说<Re:从零开始的异世界生活>及其衍生作品中的女主角,有著银髮和蓝紫瞳的半精灵少女,搭档为精灵帕克.因其为混血的银髮半精灵,和曾经险些毁灭大陆的嫉妒魔女相同,故被许多人所厌恶.曾搭救了被小混混围殴的男主角菜月昴,性格十分的老好人,本人却不肯坦率地承认这点,有时则会些许的天然呆.是男主角菜月昴不断死亡所想要拯救的对象']],
                        zzb_jidumonv: ['female', 'zzb_ling', 5, ['amly_jidu', 'jd_mn', 'amly_jdzy', 'amly_swhg'], []],
                        zzb_tongren: ['male', 'zzb_yu', 4, ['tr_bd', 'tr_edl', 'tr_sfz', 'tr_xbqlz'], ['des:刀剑神域的男主角.名副其实的重度网络游戏玩家,拥有超群的反射神经和洞察力.因为完全潜行正式版的SAO而被卷入死亡游戏,并以此为开端,牵扯进各种的虚拟世界事件. 出生没多久父母就因车祸去世,和人虽然也受了重伤但保住了性命,之后被桐谷家(母亲妹夫的家庭)收为养子.6岁就会自己组电脑,10岁时就发现自己的电子户口被修改过并发觉自己的身世,令养父母十分惊讶.五官看起来像少女一样,态度却非常冷淡,给人一种捉摸不定的印象. 因为在封测时期掌握了很多SAO的情报,所以等级提升速度很快,被称为<封弊者>,在攻略组中是数一数二的强者']],
                        zzb_tushanyaya: ['female', 'zzb_yao', 5, ['han_bing', 'tsyy_bf', 'tsyy_wjjh', 'tsyy_jwth'], ['des:涂山雅雅,是<狐妖小红娘>中登场角色之一,女主涂山苏苏和涂山容容的姐姐,九尾天狐,身份是现妖盟盟主.外表特征是暴走时眼睛会变红色,留有深棕色头发,穿着一袭红衣(后因红红改为蓝色).  　　目前为涂山法力最强大者.之前由于对涂山苏苏就是涂山红红的观点表示怀疑,所以态度并不友善,但心里十分思念涂山红红.  　　腰间有一个无尽酒壶,喝了酒之后妖力会大增.被涂山的黑狐说她心中只有涂山红红和东方月初']],
                        zzb_tangsan: ['male', 'zzb_dou', 6, ['ts_lyc', 'ts_htc', 'ts_aq'], ['des:唐三,唐家三少所著异世大陆类玄幻小说<斗罗大陆>系列的男主角.前世为唐门外门弟子,因偷学内门绝学<玄天宝录>,为唐门所不容,跳崖明志,却来到了另一个世界——斗罗大陆[1].  初代史莱克七怪之一,年龄排行第三,简称小三,外号千手修罗,斗罗封号<千手>,昊天斗罗唐昊和十万年蓝银皇阿银之子,成神后传承海神与修罗神双神位,斗罗神界委员会五大神王之一,众神之战后与诸神王一同建立大神圈,为掌管大神圈的十二神王之一']],
                        zzb_xlstangsan: ['male', 'zzb_dou', 4, ['xlts_xlj', 'xlts_sz', 'xlts_ssly', 'xlts_shenpan', 'xlts_xlz'], []],
                        zzb_hstangsan: ['male', 'zzb_dou', 4, ['hsts_hzd', 'hsts_wdfb', 'hsts_hshh', 'hsts_yqbf'], []],
                        zzb_yase: ['male', 'zzb_rong', 3, ['ys_sg', 'ys_sj', 'ys_sd', 'ys_sp', 'ys_ys'], ['des:长久以来,崇尚英勇,荣耀与美德的圣骑士们守护着勇士之地.他们每年秋季都会举行武道大会,并演变为一大盛事.人们白天比武,夜晚饮酒作乐,欢庆丰收.最后的胜利者将加入圣骑士团,成为其中的一员. 然而,随着帝国与同盟的战争常年不熄,英勇的圣骑士相继牺牲,圣骑士团的力量逐渐衰落,进而陷入争吵和分裂.这件事被敌对者所利用,策划着要将圣骑士们一举抹杀. 这一年的武道大会如期举行,人们从四面八方涌向勇士之地.此时同盟的军队发动了突袭.他们如暴风般席卷了防卫空虚的城镇和村庄,又像闪电一样离开,当圣骑士团赶到时,只留下焚烧后的废墟与悲泣的人们. 这样的惨剧在短短数天内反复上演了三次.勇士之地陷入了恐慌中.圣骑士团疲于奔命却无能为力.紧接着,更加大胆的第四次袭击,直指圣骑士团的所在之地.如果让他们得逞,圣骑士团数百年来的荣耀会彻底的丧失. 骑士们星夜奔回时,却看到与预想完全不同的景象:神圣的殿堂依然庄严高耸,鲜血和头颅都来自卑鄙的袭击者.独自一人完成这丰功伟绩的,是位远道而来的青年旅人.而他手中竟然持着被称为<王者之剑>的誓约胜利之剑.这把剑原本插在圣堂供奉的巨石中,据说是由湖中仙女敬献给远古最伟大的亚瑟王. 得救的人们讲述了当时的情景:袭击者们冲入圣地,人们四散逃窜.旅人原本的铁剑在砍杀中折断.他看到了巨石中的圣剑,轻松拔出它,并击退所有敌人. 圣骑士团轰动了.拔出誓约胜利之剑的人将获得圣骑士们的效忠,这古老的条约代代相传.他们将拯救了圣地的青年围在中间,举剑向他宣誓忠诚! 亚瑟率领下,圣骑士团开始伟大的复兴.在他们的支持下,亚瑟集合了勇士之地的力量,将创造新的理想乡作为自己的信仰.这位王者将他的剑指向了过去的袭击者们.这些强盗将为血的回忆付出代价. <永不背叛!>~亚瑟']],
                        zzb_hayase: ['male', 'zzb_rong', 5, ['ys_ha', 'ys_qs', 'ys_ah'], []],
                        zzb_dtmhaofan: ['male', 'zzb_chuang', Infinity, ['zzb_jjhf', 'zzb_jjts', 'zzb_jjtl'], ['des:认真起来的好烦!!!']],
                        zzb_xia: ['female', 'zzb_teng', 4, ['xia_yy', 'xia_xf', 'xia_ps', 'xia_xu'], []],
                        zzb_caiyuemao: ['male', 'zzb_ling', 5, ['cym_sw', 'cym_hg', 'cym_pt', 'cym_mao'], ['des:菜月昴(486)是轻小说<Re:从零开始的异世界生活>[1]及其衍生作品中的主人公.为人正直善良,有着在逆境中边叫苦边抵抗的品格.穿着与异世界格格不入的运动服.经常锻炼,有着良好的体格,从现代日本的便利店买完泡面就莫名其妙穿越到异世界.  被<嫉妒魔女>莎缇拉深爱,拥有权能<死亡回归>.喜欢爱蜜莉雅,深信她是自己在异世界的女主角,为了守护爱蜜莉雅的笑容和走向理想的Happy Ending而不断在死亡中轮回.  自我定位为<爱蜜莉雅的骑士>,被雷姆定义自己的<英雄>,将上述两人称为<心中不可撼动的第一位和第二位>.被魔女教徒们称为<贤者的候补>,与加菲尔·汀泽尔并称<守护爱蜜莉雅的双壁']],
                        zzb_dongfangyuechu: ['male', 'zzb_yao', 4, ['dfyc_yy', 'dfyc_xk', 'dfyc_dzxy'], ['des:东方月初,中国漫画<狐妖小红娘>及其衍生作品中的主要人物之一.  一气道盟中有名的后起之秀,后晋升盟主,成为道界最强之人.能力超群,能使用狐族法术.幼年时曾被涂山红红救下,一直称红红为妖仙姐姐.原本打算在七夕向她表白却未能如愿,想要实现涂山红红的某个梦想']],
                        zzb_mingren: ['male', 'zzb_ren', 4, ['mr_lxw', 'mr_sy', 'mr_xm', 'mr_fs', 'mr_hg'], ['des: 目录 木叶村第七代火影漩涡鸣人 146.6万 57" 一分钟了解漩涡鸣人 78.1万 50" <火影忍者>从开篇到博人传:不同时期的漩涡鸣人! 43.2万 3\'44" 鸣人五次流泪瞬间,分别代表亲情,友情,师徒之情,唯独没有爱情 20.2万 2\'25" 鸣人被这位大姐揍扁了,偏偏大姐还把他忘了,鸣人气得直冒烟 16万 1\'29" >     漩涡鸣人 日本漫画<火影忍者>系列男主角 本词条是多义词,共2个义项 展开 特色词条 | 本词条按照特色词条指南编辑并维护 贡献维护者 tst505、安迪布兰顿大人  漩涡鸣人,日本漫画<火影忍者>及其衍生作品中的男主角.火之国木叶隐村的忍者,第四代火影波风水门和漩涡玖辛奈之子,六道仙人次子阿修罗的查克拉转世者.刚出生时父母为保护村子而牺牲,并将尾兽<九尾>封印在鸣人体内.成为孤儿的鸣人从小被村民歧视,但在唯一认同他的老师海野伊鲁卡以及第三代火影猿飞日斩的鼓励下有了要成为火影的梦想,让所有人都认同他的存在.成为忍者后,和旗木卡卡西、宇智波佐助以及春野樱组成第七班进行各种任务.  为实现梦想,和守护伙伴们的羁绊,鸣人不断修炼变强,作为木叶<三忍>之一自来也的弟子,在追求梦想的过程中不断突破自我,贯彻了自身的忍道,获得人们的认可.最后与忍者联军以及宇智波佐助还有九尾一同终结了战争,为忍者世界带来和平,并实现自己成为火影(第七代火影)和忍界英雄的梦想']],
                        zzb_xrmsmingren: ['male', 'zzb_ren', 4, ['xm_lxw', 'xm_wy', 'xm_jm', 'xm_fs', 'xm_lj'], []],
                        zzb_jsmingren: ['male', 'zzb_ren', 5, ['jm_lxw', 'jm_js', 'jm_sg', 'jm_fs', 'jm_dx'], []],
                        zzb_dtmyile: ['male', 'zzb_ren', 5, ['yl_lm', 'yl_ld', 'yl_qd', 'yl_yc', 'yl_cslm'], ['des:一乐大叔是民间高手,潜伏在木叶,S级任务执行过268次是幕后的BOSS.一直为鸣人提供查克拉.佩恩超神罗天征对他毫发无损,直到忍界大战结束还经营着拉面店,有传言说一乐是最强的六道']],
                        zzb_sunwukong: ['male', 'zzb_rong', 4, ['hz_pf', 'hz_bz', 'hz_bj', 'hz_jg', 'hz_md'], ['des:<人类历史上黑暗的一天!> <它像突如其来的飓风扫过凡间,半座城市因此颤栗.与此相对,奴隶们开始欢呼起解放,自由,以及诸如此类的字眼.> <当权者恐惧着,召唤出同样拥有强大力量的魔种与之对抗.然而,它的长笑贯穿晴空,如意金箍棒所及之处,枷锁碎裂.魔种们高喊着它的名字,纷纷倒戈. 是的,它并非孤身战斗,越来越多的奴隶加入它的麾下.它们浩浩荡荡,势不可挡,人们几乎以为大陆会在一夜之间颠覆.魔道的时代,将就此终止吗？> ——<竹书纪年,灾难的一天> 这是有史记载以来第一次魔种起义.关于那只猴子的故事,就此戛然而止.它死了吗？被俘虏了吗？最终的命运如何？一切都成为问号,只于史学家,或者孩童的睡前故事里流传. <什么齐天大圣,没用的猴子罢了.> <它是传奇.> <失败者不配被历史铭记.> <有这样一个齐天大圣,它率领你们,保护你们.之后,你就无所畏惧.> 时间又翻过多久呢……几百年？几千年？昔日的当权者埋进坟墓.旅人们自青山脚下走说笑着走过,毫不在意路旁的青石,以及青石前默默矗立的僧侣. 沉睡,沉睡了多久? 是谁在呼唤我？ <和平又安宁的时代,不需要我的存在.> 西方,西方的风暴将袭来. <危机,超越了人类与魔种的界限.跟我一起,寻找新的道路,去抵达根源吧.> 路在哪里？我曾经竭尽全力的探索过,往前,往前,依旧只能看到虚无和黑暗. 我失败了,我不后悔. 我是齐天大圣,我不会死. 回应着呼唤与呢喃,大地开始剧烈的颤抖.就像千百年前诞生时一样,冲破枷锁和束缚.它的身影如此高大,矗立于天地之间. 大圣,归来. <取经之路,就在脚下.>']],
                        zzb_mdsunwukong: ['male', 'zzb_rong', 3, ['md_jgb', 'md_rm', 'md_fk', 'md_mq'], []],
                        zzb_yelinger: ['female', 'zzb_zi', 4, ['zzb_lg', 'zzb_ng', 'zzb_jieg', 'szzb_shoug'], []],
                        zzb_huoyuhao: ['male', 'zzb_dou', 3, ['hyh_lm', 'hyh_bbx', 'hyh_tc', 'hyh_sl'], ['des:星罗帝国白虎公爵戴浩与霍云儿的儿子,斗罗大陆史上最强大的极限斗罗;最强大的魂导师[1];星罗帝国世袭侯爵;唐门主要成员之一;与恩师死灵圣法神、亡灵天灾伊莱克斯一同开创了魂灵体系,创立了传灵塔;史莱克学院极限单兵计划的唯一成功者.<斗罗大陆外传唐门英雄传>中成为掌管大神圈的十二神王之一']],
                        zzb_qingxuzhishen: ['male', 'zzb_dou', 4, ['qxzs_ns', 'qxzs_bhht', 'qxzs_lhcj', 'qxzs_hdzl'], []],
                        zzb_tangwulin: ['male', 'zzb_dou', 5, ['twl_jlw', 'twl_jlz'], ['des:唐舞麟,是唐家三少所著异世大陆类玄幻系列小说<斗罗大陆>之中的人物,也是<斗罗大陆Ⅲ龙王传说>中的男主角.大神圈至高神王海神、修罗神唐三与修罗神剑鞘小舞之子.  一百二十级以上超神(一级神祇),斗罗封号<龙皇>,曾任唐门门主,史莱克学院海神阁阁主,<龙王传说>史莱克七怪队长']],
                        'zzb_c.c': ['female', 'zzb_wu', 3, ['CCcc', 'cc_djqy', 'cc_code', 'cc_ba'], ['des:C.C.,日本动画<CODE GEASS 反叛的鲁路修>、<Code Geass 反叛的鲁路修R2>及其衍生作品的第一女主角,并贯穿在其余<CODE GEASS 反叛的鲁路修>系列中.[1][2]她赋予了鲁鲁修·V·布里塔尼亚GEASS能力,因为有与V.V.相同的CODE的力量,亦被称作<不老不死的魔女>.和鲁鲁修是<共犯>,被枢木朱雀称为<鲁鲁修的后盾>,认为她能在精神上保护鲁鲁修,是当鲁鲁修众叛亲离时唯一至始至终没有背叛他的人']],
                        zzb_zilaiye: ['male', 'zzb_ren', 4, ['zly_xr', 'zly_yl', 'zly_tlzs', 'zly_hj'], ['des:自来也,日本漫画<火影忍者>及其衍生作品中的男性角色.火之国木叶隐村的<三忍>之一,三代目火影猿飞日斩的弟子,四代目火影波风水门、长门、弥彦、小南、七代目火影漩涡鸣人的师父,被鸣人称为一生中最敬重的人.他指导鸣人修行,在鸣人成长的道路上起到重要作用.后到雨忍村刺探情报,结果不幸死于<晓>首领佩恩之手']],
                        zzb_yefan: ['male', 'zzb_zi', 4, ['zzb_pf', 'zzb_bf', 'zzb_ff', 'zzb_cf'], []],
                        zzb_shaosiming: ['female', 'zzb_nv', 3, ['zzb_xn', 'xj_gy', 'xj_yr'], ['des:少司命,中国3D武侠动画<秦时明月>系列中的职位,掌管五行派系中的木部,与云中君、大司命、湘君、湘夫人同为阴阳家五大长老之一.  动画系列中已登场的唯一一位任这个职位的人物,是一位年轻女性:令人闻风丧胆的死亡使者之一.性情冷漠,有着与年龄不相符的高深武功.总是以面纱遮面,传说她美若天仙,但这世上还没有人见过她面纱之下的真正面目.在动画页游特别篇<秦时明月之罗生堂下>中作为女主角']],
                        zzb_bailixuance: ['male', 'zzb_rong', 4, ['blxc_gs', 'blxc_kr', 'blxc_xl', 'blxc_my'], ['des:玄策不会忘记那个日子:来历不明的马贼冲破边关的城镇,然而齐心协力的守卫军和民众守住城门.率先进入城镇的马贼走投无路,挟持了无力反抗的老弱们作为逃离的砝码.    那时候自己多么害怕啊.可哭喊声刺痛小小男子汉的心灵,他推倒藏身的水缸,冲了出去.    之后的记忆已不太清晰……那些不是普通的马贼……他们最后都死于首领之手……哥哥没有赶到,谁也没有赶到.他被首领选中,作为祭品去唤醒某种强大的东西.所有人四散逃窜,在绝望和恐惧中,少年眼睁睁看着无名剑士代替自己卷入邪恶迷雾.    直到周围一切归于寂静,圆月安静照耀着亘古不变的戈壁,那个男人带走了他.    好些年来,他和自己单方面称之为师父的这个人,生存于几近干涸的月眼海旁.经年累月的残忍训练使他成长为出色的暗夜行走者,可称得上伙伴的仅有手中的飞镰.    师父蛰伏着,自过去部下手中取得情报,时不时消失又归来.他不信任任何人,永远独自行动.如此风格影响下,这个游荡在戈壁的小疯子也惯于以一己之身<惹是生非>.    自灾厄之后幸存的人们零星聚居,竭力在残酷环境和魔种的威胁下谋取生存.自然,有人的地方,总不会缺少各种欺压和争斗.    这个小疯子就是法外之地不公的克星.他起初仅仅挑战强于己身的魔种,很快便学会了穿梭于戈壁绿洲之间,去嘲弄、对抗依仗力量玩弄他人命运的混蛋:劫掠的马贼、横行霸道的游民首领、丝绸之路的生财者以及试图占地为王的跳梁小丑们.这种疯狂的乐趣使他得以宣泄痛苦,去报复旧日悲剧的制造者.    ……直到遇上那强大的对手.    她的武技足够强大,雕刻瓣鳞花的大剑刀锋绽放,令魔种溃散;她的意志足够强大,玄策竟然产生面对严格家长般的心理压力;这就是长城守卫军吗？她如何能做到毫不在意背负的污名,单刀直入剥开玄策的天真.    知道吗？你的师父也是<幽灵>,徘徊于长城的<幽灵>.    知道吗？昔日悲剧的背后另有主谋.    知道吗？有个人一直在寻找你.    多少次他在圆月的照耀下,遥望长城的方向.月光点亮漫长的,通往故乡的道路.最痛恨的哥哥,最挂念的哥哥,是否也在月光之路的另一头,遥望戈壁上的自己和没有实现的约定呢？    引领这名叫花木兰的敌人,面对师父的刹那,玄策就知道他们并非初次相会.显然,经历暗夜中的无数较量后,木兰选择了主动出击.她试图说服固执的昔日王族,彻底揪出幕后者.    <玄策,你想回去吗？>师父问.<那就跟她回去吧.不过,先让我试试看你是否会哭着鼻子逃回来.>    风沙骤起的戈壁,令人惶恐.    飞扬跋扈的钩锁激起沙石,携带着少年的怒火.他不知道如何正确表达自己的感情,也不知道如何按捺住会再度被抛弃的、会再度要失去的痛苦.    内心的嘶吼化作自由伸缩的飞镰,攻击再攻击,却完全无法命中——师父自隐匿中现身时,短刃牢牢架在少年的脖子上.    <不肖弟子.>    <你……终于承认是我师父了吗？>少年突然大喊.    <不,我不需要弟子,也不需要同类.>    遮面的男子发出喟叹,松开手臂.    疯狂自少年血红的双目中褪却,锁链松弛着坠地.他眼睁睁目送着那苛刻养大自己的身影,消失在风沙中,仿佛一去不返.    <我是不吉利的人吗……所有人最后都会离开我.>少年喃喃自语.    <他没有抛弃你.他只是选择独自去面对恐惧.>木兰轻声说.她很清楚,风沙深处隐藏着难以想象的恐惧.    <你们不是敌人吗!你怎么敢断定师父在想什么!>    <大概因为,我们都有着自己要守护的故乡吧.>    <全场醒目担当!> ']],
                        zzb_bailishouyue: ['male', 'zzb_rong', 4, ['blsy_jm', 'blsy_kf', 'blsy_mz', 'blsy_tt'], ['des:<会照顾好母亲和弟弟的.> 共5张 背景故事漫画 父亲奄奄一息倒在长城之下时,少年浑身颤抖着接过那杆枪. <会一直、一直守护弟弟的.> 母亲临终前竭尽全力将两个儿子的手交握在一起,少年坚定做出男子汉的承诺. 无父无母的两个孩子,就这样顽强生活在长城之畔的镇子上.少年带着弟弟,以作零工为生.关市开启是人们最快活的日子,四面八方的商人和货物汇集着.少年穿梭其中,眼明手快,笑脸迎人,商人们也乐意关照他,慷慨给出更多赏金.闲暇时候,哥哥会将弟弟寄托到好心邻家,只身外出狩猎.他熟悉远近所有水草丰茂之地,无论野羚抑或大雁,最终都变成猎物满载而归. 唯一让人烦恼的,大概是如何教导弟弟这件事了.少年会很认真听邻居阿妈传授教育三个孙子的心得,会努力钻研厨艺好让挑食的弟弟不耽误长身体,会亲手为弟弟雕刻木人和玩偶,甚至挑战起缝制衣物这样比射中一百米外猎物还要高难度的技能. 可脸蛋圆圆的,失去父母却被哥哥照顾得很好的弟弟,渐渐成长为心灵敏感又胆小的孩子,怕惊雷,怕嘲笑,怕跟陌生人说话,甚至不敢告诉哥哥,孩子们之间也会排斥和挑衅魔种混血.少年初次外出狩猎归来的那天,年幼的弟弟可怜兮兮坐在家的门槛上,两眼肿如桃子般. <玄策,我回来了.今晚有大餐咯.> 男孩并没有如预想扑到怀里,反倒猛地朝外跑去. <玄策!> 路上的人纷纷回头,惊讶望着迈起小短腿跑得飞快的男孩和跟在后面高声呼唤的少年穿过半个镇子. 男孩子一头扑到长满蒿草的土堆上.那是父母安睡的地方. <连哥哥也丢下我了!>他拼尽全部愤怒控诉着,反倒显得那样可怜. <不会的!>少年轻轻蹲在弟弟面前,摸着他的头:<哥哥没有丢下你,永远不会丢下你.我们约定.> <拉钩,约定.> 为向弟弟赔礼道歉,饱餐后的夜幕下,哥哥雕刻起小木片,灵巧的手下很快出现雏形. <这是大雁.大雁秋去春回,是再远也会回家的动物.> <这是爱哭的玄策.>肿眼睛的小孩形象活灵活现. <这是哥哥.>玄策也拿出自己的作品,隐约有双手双脚的木人. 精致的小人和粗糙的小人放在一起,好像手牵着手. <拉钩,约定.兄弟,永远不分离!> 命运终究令人猝不及防.次年春天,四面八方的商旅们聚集于关市的日子,来历不明的马贼队伍,非人的马贼队伍突袭了人群,集市瞬时陷入火海.最初的混乱过去,但凡有点气力的乡亲纷纷汇聚起来,他们要协助守卫军关上那扇大门,他们要守住家乡. 少年犹豫着.他应该加入,可弟弟该怎么办. <你,去吧.>玄策站在比自己还高的水缸里,明明尾巴害怕得摇来摇去,包着泪水的眼巴巴看着哥哥.<玄策会乖乖的,玄策在家等你.谁叫都不出来.> <嗯,就这么约定.>少年想了想,又嘱咐:<别怕.> <不怕,一点都不怕.> 如雨的飞箭下,他和同伴们死命撑着城门的支柱.他们关上大门,将贼人的队伍一分为二,守卫军追捕着城内的贼子,乡民们的任务就是守住这扇大门.守住城门,就守住了弟弟.而他唯一的愿望正是守护住弟弟. 可当四周安静下来,残垣断壁的家中却找不到弟弟的身影.邻居七嘴八舌述说着,拼凑出前因后果……走投无路的贼人们劫持无力反抗的老弱们,作为逃离的砝码.本来躲在水缸中的玄策,冲了上去…… 院落的一角,碎裂的小木人静静躺着.玄策那时候该多么恐惧呀,但自己没有遵守住约定. 不久,长城守卫军中多出一个安静的身影,他的射击技术精妙无比,深谙戈壁上的生存与厨技之道.令上司头疼的却是他对任务太过积极.他总朝更远的地方搜寻,越来越远.他坚信弟弟在某个地方等待着他,他也会在家乡迎接着弟弟的归来. 为了提醒自己,他改名守约. 守约,言出必果. <今天的长城也很和平.>']],
                        zzb_sulie: ['male', 'zzb_rong', 5, ['sl_bq', 'sl_fy', 'sl_lj'], ['des:青年时代的苏烈于科举中拔得头筹之时,似乎便注定了人生的坦途:出身世家望族,才华横溢又深得老师赏识,前途无量.然而同窗们大跌眼镜的是,他选择了投笔从戎.  自幼生活于长安,见惯东市和西市的繁华,无数次想象来自远方的珍奇异物,如何经过漫长的丝绸之路被送到长安.碧眼的异乡商人,讲述着惊心动魄引人入胜的旅途故事.摇曳的驼铃,汗血的宝马,绿洲之上的古老城池……还有长城,守护一路繁荣的长城,遥遥看到它的屹立,就能让长途跋涉的旅人们心安.对此心驰神往的青年,放弃仕途,作为长城守卫军一员在边塞度过十年时光. 离开故乡长安的十年里,曾经握笔的手生满老茧.与意气风发的诗人饮过送别的美酒,也从沙漠中挖来瓣鳞花精心栽培.他愈发坚定相信,长城才是自己生命的羁绊与归宿. 彼时商旅往来长城频繁,但小范围的纷争时常发生.苏烈向戍边的他国将领提议放下干戈.对方耳闻他的宽厚,信任这份诚意而欣然接受,双双去掉警备.自此边民们可以在固定的日子举行关市互通有无,那些年的长城内外畜牧遍野,繁盛尤似关内. 直到令他终身悔恨的不幸发生. 盖着朱红印章的密令,用高高在上不容置疑的口吻,质问关市开放乃通敌行为,命他将功赎罪.  苏烈不解而愤慨,一连好几封奏章抗议,皆石沉大海.反倒催促行动的密令道道紧逼.贪图功劳的监军急不可待,私领随从偷袭参加关市的戈壁之民,好为平步青云邀功.苏烈策马赶去为时已晚,昔日繁华的市集徒留废墟与硝烟.深深的痛苦与愧疚灼烧着心灵——尤其听闻旧日缔约的对方将领也下落不明. 毫无疑问,袭击破裂了长久的信任,长城两侧的氛围骤然紧张.而上峰大堆的军功赏赐,明晃晃嘲笑着他的古板,使他如芒在背. 辜负信任. 辜负和平的期望. 是自己的过错. 抱着难以遏制的悔恨,终于,大漠马贼冲击大唐边城的战斗中,奉命援助的苏烈挡在摇摇欲坠的城门前,钢刀早已卷刃,面对蜂拥的敌人,他大吼着挥起粗围的撑木迎击而上. 要赎罪才行,哪怕是用生命. 身躯轰然倒下. 不知过去多久,苏烈从昏迷中醒来.一群流民拼凑出为数不多的食物,努力挽留他的生命. <是守卫军的人吗？>浑身灰扑扑的小孩好奇心满满:<长大了,我也想加入.站在长城之上……>他摆出舞剑的姿势. <不,……你们认错了……>苏烈从喉咙中艰难的挤出几个字.内心的声音在呐喊……为什么自己仍然活着,没有守护住从少年时便珍视的、向往的东西,不得不厚颜苟活着.自己……不配拥有这名号!  从这天起,昔日世家子弟,曾经长城守卫军的猛将,彻底抛弃所有.他混迹于流民之中,俨然成为领头人,教他们读书识字,狩猎耕种乃至武技兵法.当动荡和冲突发生,那魁梧的身影便带着衣衫褴褛的伙伴,出其不意的出现,援救危难中的人们.偶尔在月色下,他会想起和友人诀别的那杯酒,想起或许此生再也回不去的长安. 这是他的赎罪. 苏烈这个人,恐怕早就作为牺牲者的一员,被世人遗忘吧. 可命运总是出其不意,时时勾连起苏烈与长城之间的羁绊.那绯红身影的出现,断然结束了他的自我放逐. <你,不是长城守卫军吗？> <我没有资格.> <那不更应该像个守卫军的样子,堂堂正正担起该担的责任吗？>她说.<至少设法弄弄清楚,当年发出袭击密令的主使者,真正的面目!> 宽大的手掌猛然握紧.遥远暮霭中,起伏的长城傲然耸立,犹如十多年前所望的第一眼那样. 长城在,故乡就在']],
                        zzb_huamulan: ['female', 'zzb_rong', 4, ['hml_dj', 'hml_cj', 'hml_zfdf'], ['des:长城,连绵不绝的长城,横亘在北方广大的荒漠上.坚壁割断了大沙海,守护着背后的东方帝国. 一面是无垠富庶的平原,一面是苍茫的不毛之地,使得长城的存在成为分界线.它的背后,象征着文明与和平,令人心驰神往. 当东方帝国陷入分裂时,长城的防卫一度衰弱.为了填充漫长的防线,守卫者除了军人,还加入了临时武装的拓荒者和走投无路,愿以劳役换取生存的人们. 这一年,长城守卫迎来新的守卫者.分配了粗糙的装备和武器后,这群新兵被赶到堡垒中. <长城耸立,你们活着.长城倒下,你们去死.>长官冷酷的说.<不要妄想逃跑和背叛!>他特别强调了后者. <有人背叛过吗？>好奇的年轻人问. 回答他的是可怕的沉默. <从前有个家伙.>老兵们站岗时无聊的八卦.<主动要求来守长城.是不是很奇怪？> <他很厉害.> <上任长官力排众议,对他委以重任.> <可是不久,长城的防线接二连三被攻破了.> <大家都怀疑他.只有上任长官信任他的忠诚.> <他逃跑了.长官的尸体次日被发现.> <后来,仍有人见过他.据说,他从未远离,一直徘徊在长城外.> 没多久,号角吹响,狼烟燃起.守卫们面对百倍,千倍于己的敌人陷入绝望. 年轻人被入侵的士兵围在角落里,瑟瑟发抖. 哇,没想到死前还能英雄一把.年轻人闭上眼睛,乱挥铁剑冲上去了. 他踉踉跄跄扑了个空,差点绊倒在地.惨叫声此起彼伏,想象中的武器始终没有落到身上. 他睁开眼睛,看到一地狼藉以及……转身离去,持剑战士的身影. 还没有死透的敌人从地上一跃而起. 小心啊!年轻人想提醒他,可喉咙发不出声音. 电光火石之间,剑刃擦过. 静如影,疾如风. 金属的撞击声中,身影掠过. 不动如山,迅烈如火. 偷袭者重重跌倒在地. 战士的头盔裂开,被她扔到地上.发丝飘散出来. 女人! <想活命吗？紧跟着我!> 前方是无际的长城,以及无际的敌人. <姐可是传说!>']],
                        zzb_yeduer: ['female', 'zzb_zi', 4, ['zzb_ds', 'zzb_dshi', 'zzb_dsh', 'zzb_dsi'], []],
                        zzb_peien: ['male', 'zzb_ren', 4, ['pe_wx', 'pe_tz', 'pe_tx', 'pe_pi'], ['des:捕捉人力柱、收集尾兽、暗中活跃的晓.它的领导者正是佩恩,让人迷惑的非凡样貌线索,就是眼中显现的<轮回眼>.佩恩自己公开表明<经历痛苦才有成长<.当他以>神<的身份来到这个世界.这是和平还是破坏']],
                        zzb_changmen: ['male', 'zzb_ren', 5, ['cm_pi', 'pe_tx', 'cm_wd'], ['des:长门,日本漫画<火影忍者>及其衍生作品中的角色.第二次忍界大战中雨隐村的孤儿,拥有漩涡一族的血统,以及年幼时期被宇智波斑移植的轮回眼,实力强大.在认识小南和弥彦后跟随自来也学习忍术.一生经历了父母双亡及弥彦之死两大痛楚后,被<宇智波斑(宇智波带土)>蛊惑,决定在痛苦的轮回中孕育和平.  在摧毁木叶事件中,被漩涡鸣人感化,重拾少年时期的梦想,后使用<外道·轮回天生之术>复活了佩恩袭击木叶一战中死去的人,在将自己的意志托付给鸣人后力尽而亡.  第四次忍界大战中被药师兜以<秽土转生>形式复活与宇智波鼬一起行动,之后被宇智波鼬、漩涡鸣人和奇拉比联手封印']],
                        zzb_tushanrongrong: ['female', 'zzb_yao', 4, ['tsrr_dzxy', 'tsrr_wyz', 'tsrr_hlzs'], ['des:涂山容容,中国漫画<狐妖小红娘>及其衍生作品中的主要角色之一.  算无遗策的涂山二当家,有千面妖容的称号,被称为涂山的<最强智囊>.负责涂山收入,随身携带算盘.保护涂山苏苏,并逐步进行涂山苏苏和白月初再世情缘的计划']],
                        zzb_fengbaobao: ['female', 'zzb_yi', 3, ['fbb_csbl', 'fdd_mr', 'fbb_sbs'], ['des:冯宝宝,[1][2]中国网络漫画<一人之下>及其衍生作品中的女主角.华北地区临时工,外表三无、邋遢的炁功高手.对过去的记忆有缺失,三观不同于常人,一直在追寻自己的身世']],
                        zzb_yunyun: ['female', 'zzb_nv', 3, ['zzb_xn', 'yy_fzl', 'yy_fzj'], ['des:云韵,天蚕土豆所著异世大陆类玄幻小说<斗破苍穹>及其衍生作品中的角色,曾化名云芝.加玛帝国十大强者排名第三,三星斗皇强者,云岚宗第九代宗主,纳兰嫣然的老师,师从云岚宗第八代宗主云山']],
                        zzb_yanlingjishui: ['female', 'zzb_nv', 3, ['zzb_xn', 'ylj_hms', 'ylj_ss'], []],
                        zzb_yanlingji: ['female', 'zzb_nv', 3, ['zzb_xn', 'ylj_hms', 'ylj_sh'], ['des:焰灵姬,是中国动画<天行九歌>系列中的原创女性角色,是赤眉龙蛇天泽的下属.  来自百越神秘组织的一位柔情如水,热情似火的女子,有着操纵火焰的能力.来自百越的一名柔情似水,热情似火的神秘女子.小时候一场大火烧毁了焰灵姬的家园导致她家破人亡,其中有一个弟弟生死不明[2] .因为天赋异禀精通火系法术善于施展火焰攻击,后来被喜欢招揽各路奇人异士的<赤眉龙蛇>收入麾下,成为恐惧杀手之一,并开始对韩国复仇 ']],
                        zzb_yanlingjixin: ['female', 'zzb_nv', 3, ['zzb_xn', 'ylj_hms', 'ylj_hlz'], []],
                        zzb_libai: ['male', 'zzb_rong', 4, ['lb_jy', 'lb_qjj', 'lb_slzb', 'lb_ql'], ['des:巍峨的长安城,数百年间屹立不倒.但长安的门户,守卫严密的朱雀门却镌刻着一道剑痕,那是一个青年醉后以长剑所书的诗句<欲上青天揽明月>,轰动整个长安城.当治安官狄仁杰欲以破坏长安的罪名逮捕他时,爱才的女帝拒绝了.女帝甚至下令保留朱雀门上饱含剑意的诗痕.数日之间,这名一人一剑,直入长安的青年<剑仙>之名传遍长安.他就是李白. 彼时的李白,年少轻狂,拒绝了女帝入朝为官的邀请后,开始试剑天下的旅途.当他初次见到滔滔黄河时,心中的剑意迸发而出,奔流到海不复回.从那时起,没有机关的师承,没有魔道的秘法,没有魔种的血脉的李白,仅仅依靠自己和手中的剑,成为帝国强者中的第一人,乃真正的天纵之才.他会给每个败于己的对手赋诗,因此,诗名和剑名也一同流传开来.后来,甚至有人视之为荣耀,为得诗篇而求一败,令人哭笑不得. 就在李白的剑意到达巅峰之后不久,旅途也来到了云中漠地.很少有人知道,生活在长安的李白,出生于云中漠地的海市蜃楼之下.他怀着剑仙荣耀归来,却发现幼年记忆里充满异域风情的繁华城池已经不复存在.被贩为奴隶的公主,向他倾诉自己的遭遇:帝国的铁骑越过长城,踏平了整个云中漠地.荒废的城池很快被黄沙掩埋.李白想要救出她,少女却选择了从屈辱中自我了断. 鲜血激起了李白的侠义之心.他第二次单剑闯入长安,质问女帝讨要征平云中漠地的说法.一夜长安风云变色,大明宫也在剑仙之剑下黯然无光.有史以来从未曾被外力攻破的长安城,第一次因为一个普通人而动摇. 没有人知道最后发生了什么事.李白自长安城中全身而退.他和女帝的密谈,被视为禁忌,不见于史官的笔下. 只有李白自己清楚,他的骄傲被挫败了,在最强的巅峰.从那之后,他开始自我放逐,从寂寞的旅途中寻求新的意义,陪伴他的,除了剑,还多了酒. 人人都以为剑仙就此一蹶不振.但长安的府衙中,狄仁杰查看着关于李白的行踪报告,露出难以捉摸的冷笑. <元芳,你怎么看？> 不等密探回答,他立刻自言自语:<再次出鞘的时候,会更加惊天动地吧.这家伙,太过骄傲,又太过寂寞了.> 而狄仁杰所预言的这一天,在数年之后到来. 这是长安城平常的一天.晨钟回响在上空,自云中漠地的旅人远途而来,正抬首打量朱雀门上的剑痕;热闹的长乐坊中,五陵少年们因前所未有的美妙琴声而骚动;感业寺的银杏树依旧枝繁叶茂.唯有狄仁杰手下的密探隐入黑暗,紧张注视着那个白衣潇洒,酒剑相伴的男子身影. 剑仙李白,三入长安了. 这次长安城又将怎样被动摇呢？ <大河之剑天上来!>']],
                        zzb_dianwei: ['male', 'zzb_rong', 4, ['dw_jn', 'dw_hy', 'dw_kb', 'dw_sx'], ['des:疯狂,疯狂吞噬了身体. 这不是属于人的时代. 若要生存,须先化身野兽. 身躯如山的壮汉趴在军帐之中,他未来的主人正估量着他会有多少忠心,以及这忠心的价值. <狂化,是携带魔种基因的人体产生的特殊变异.>黑袍男人用冷静的声音讲述.<能够在最短的时间内,快速提升心,技,体三者之力.当然,代价是丧失理智.狂化者在战斗结束后能够短暂清醒.但整体来说,是不可逆转的.> <我只需要忠仆,有用的忠仆……不,是忠犬.>枭雄宣布. 壮汉浑身颤抖.没有痛觉的野兽在乱世中无论如何都可以活下去,但娇弱的女婴不能.而自己,是自己害死了她的父亲,也是恩重如山的老师. 被当成野兽鄙视和唾骂的日子,因为与老师的相遇得以摆脱.老师的怜悯和耐心教导,让他成为人.还有初次的建功立业!在老师的鼓励下,才能以一己之力挽救一座城市.没错,自己能像正常人一样拥有理智吧,甚至还能像真正的战士般去争取荣耀. 这个期望被一场疯狂打破.幸存的只有…… 怀里小小的婴儿无忧无虑的笑着,纯洁得令人心碎. 如果必须借由至亲至爱之人的生命让自己清醒,那还不如一直沉迷在疯狂中,直到毁灭. 很轻易就做出决定,这具残躯卖给枭雄又如何？能让老师的骨血顺利成长的话…… 但还有一个最后的请求: <请用沉重的铁甲束缚我吧.> 这是惩罚,也是赎罪. 英雄,末路. 取而代之的是…… <身体里沉睡的野兽,觉醒了!>']],
                        zzb_shiming: ['male', 'zzb_wu', 4, ['zzb_sm', 'zzb_js', 'zzb_nt'], ['des:师傅在上,威震三国;师傅在旁,制定无名!']],
                    },
                    characterSort: {
                        作者包动漫: {
                            zzb_zuozhe: ['zzb_haofan', 'zzb_dtmhaofan'],
                            zzb_hy: ['zzz_bofengshuimen', 'zzb_kaihuang', 'zzb_kakaxi', 'zzb_shenweikkx', 'zzb_mingren', 'zzb_xrmsmingren', 'zzb_jsmingren', 'zzb_dtmyile', 'zzb_zilaiye', 'zzb_peien', 'zzb_changmen'],
                            zzb_zz: ['zzh_yedonger', 'zzb_yeqiuer', 'zzb_yeqier', 'zzb_kaishen', 'zzb_yechuner', 'zzb_yexiaer', 'zzb_yelinger', 'zzb_yefan', 'zzb_yeduer'],
                            zzb_wzry: ['zzb_kaidie', 'zzb_yuanshiluna', 'zzb_yase', 'zzb_sunwukong', 'zzb_mdsunwukong', 'zzb_bailixuance', 'zzb_bailishouyue', 'zzb_sulie', 'zzb_huamulan', 'zzb_libai', 'zzb_dianwei'],
                            zzb_dldl: ['zzb_tangsan', 'zzb_xlstangsan', 'zzb_hstangsan', 'zzb_huoyuhao', 'zzb_qingxuzhishen', 'zzb_tangwulin'],
                            zzb_djsy: ['zzb_yasina', 'zzb_tongren'],
                            zzb_clksdysjsh: ['zzb_leimu', 'zzb_aimiliya', 'zzb_jidumonv', 'zzb_caiyuemao'],
                            zzb_ywtptjqdfyl: ['zzb_meipulu1', 'zzb_shali', 'zzb_xia'],
                            zzb_hyxhl: ['zzb_tushanhonghong', 'zzb_tushanyaya', 'zzb_dongfangyuechu', 'zzb_tushanrongrong'],
                            zzb_xjns: ['zzb_shaosiming', 'zzb_yunyun', 'zzb_yanlingjishui', 'zzb_yanlingji', 'zzb_yanlingjixin'],
                            zzb_yrzx: ['zzb_fengbaobao'],
                        },
                    },
                    skill: {
                        dong_jiang: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['dong_jiang_a'],
                            forced: true,
                            marktext: '东',
                            intro: {
                                name: '东降',
                                content: '你拥有#层东降',
                            },
                            trigger: {
                                player: 'phaseDiscardEnd',
                            },
                            filter(event, player) {
                                if ((event.name = 'phaseDiscard')) {
                                    return event.cards && event.cards.length;
                                }
                                return true;
                            },
                            content() {
                                'step 0';
                                player.addMark('dong_jiang', trigger.cards.length);
                                player.markSkill('dong_jiang');
                                game.log(player, '你获得了一层东降');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 0;
                                    },
                                    content() {
                                        player.addMark('dong_jiang', trigger.num);
                                    },
                                },
                            },
                        },
                        dong_yi: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('dong_jiang') > 0;
                                return player.hp <= 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return card.suit != 'spade';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.recover(3 - player.hp);
                                    player.draw();
                                    player.removeMark('dong_jiang', 1);
                                }
                            },
                        },
                        dong_er: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaBefore',
                            },
                            filter(event, player) {
                                return player.countMark('dong_jiang') > 0;
                                return event.card && event.card.name == 'sha';
                            },
                            check(event, target) {
                                if (target.hp > 1) return true;
                                else return false;
                            },
                            content() {
                                'step 0';
                                player.removeMark('dong_jiang');
                                player.judge(function (card) {
                                    return card.suit != 'heart';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.draw();
                                    trigger.directHit = true;
                                }
                            },
                        },
                        dong_san: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return player.countMark('dong_jiang') > 0;
                            },
                            content() {
                                'step 0';
                                var a = trigger.source;
                                player.discardPlayerCard('he', a, true).set('promot', '弃置伤害来源一张牌');
                                ('step 1');
                                player.draw();
                                player.removeMark('dong_jiang', 1);
                            },
                        },
                        dong_si: {
                            audio: 'ext:作者包动漫/audio:1',
                            forced: true,
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return get.type(event.card) == 'trick';
                                return player.countMark('dong_jiang') > 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                player.removeMark('dong_jiang', 1);
                            },
                        },
                        dong_lin: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBefore',
                            },
                            forced: true,
                            derivation: ['dong_yi', 'dong_er', 'dong_san', 'dong_si', 'dong_mie'],
                            filter(event, player) {
                                return player.countMark('dong_jiang') > 0;
                            },
                            content() {
                                'step 0';
                                var x = player.countMark('dong_jiang');
                                if (x >= 0) player.addSkill('dong_yi');
                                if (x >= 0) player.addSkill('dong_er');
                                if (x >= 0) player.addSkill('dong_san');
                                if (x >= 0) player.addSkill('dong_si');
                                ('step 1');
                                if (player.countMark('dong_jiang') >= 10) {
                                    player.removeSkill('dong_lin');
                                    player.addSkill('dong_mie');
                                }
                            },
                        },
                        dong_mie: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget: true,
                            selectTarget: 1,
                            filter(event, player) {
                                return player.countMark('dong_jiang') > 0;
                            },
                            content() {
                                'step 0';
                                player.loseHp();
                                player.draw();
                                player.removeMark('dong_jiang', 3);
                                ('step 1');
                                target.loseMaxHp();
                                target.discard();
                            },
                        },
                        qiu_yi: {
                            group: ['qiu_yi_a'],
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '秋义',
                                content: '你拥有#层秋义',
                            },
                            trigger: {
                                player: 'loseEnd',
                            },
                            filter(event, player) {
                                return player != _status.currentPhase && get.itemtype(event.cards) == 'cards';
                            },
                            forced: true,
                            marktext: '秋',
                            content() {
                                'step 0';
                                player.addMark('qiu_yi', 1);
                                player.markSkill('qiu_yi');
                                game.log(player, '你获得了一层秋义');
                                ('step 1');
                                if (player.countMark('qiu_yi') == 0) {
                                    player.unmarkSkill('qiu_yi');
                                }
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    filter(event, player) {
                                        return event.num > 0;
                                    },
                                    forced: true,
                                    content() {
                                        player.addMark('qiu_yi', trigger.num);
                                    },
                                },
                            },
                        },
                        qiuyi_yi: {
                            audio: 'ext:作者包动漫/audio:1',
                            filter(event, player) {
                                return player.countMark('qiu_yi') > 0;
                                return player.countCards('he', { suit: 'heart' }) > 0;
                            },
                            enable: 'chooseToUse',
                            round: 1,
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            position: 'he',
                            viewAs: {
                                name: 'wuzhong',
                            },
                            prompt: '将一张♥️️当无中生有使用',
                            onuse(result, player) {
                                player.removeMark('qiu_yi', 1);
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            ai: {
                                threaten: 1.5,
                                basic: {
                                    order: 1,
                                    useful: 1,
                                    value: 8,
                                },
                                result: {
                                    target(player, target) {
                                        var num = target.hp - target.countCards('h') - 2;
                                        if (num > -1) return -0.01;
                                        if (target.hp < 3) num--;
                                        if (target.isTurnedOver()) num /= 2;
                                        var dist = get.distance(player, target, 'absolute');
                                        if (dist < 1) dist = 1;
                                        return num / Math.sqrt(dist);
                                    },
                                },
                                tag: {
                                    skip: 'phaseUse',
                                    draw: 2,
                                },
                            },
                            group: ['qiuyi_yi_roundcount'],
                        },
                        qiu_so: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return player.countMark('qiu_yi') > 0;
                            },
                            forced: true,
                            derivation: ['qiuyi_yi', 'qiuyi_er', 'qiuyi_sa', 'qiuyi_si', 'lianying', 'chuidiao'],
                            content() {
                                'step 0';
                                player.addSkill('qiuyi_yi');
                                player.addSkill('qiuyi_er');
                                player.addSkill('qiuyi_sa');
                                player.addSkill('qiuyi_si');
                                ('step 1');
                                if (player.countMark('qiu_yi') >= 5) {
                                    player.loseMaxHp();
                                    player.addSkill('chuidiao');
                                    player.addSkill('lianying');
                                    player.removeSkill('qiu_so');
                                }
                            },
                        },
                        qiuyi_er: {
                            audio: 'ext:作者包动漫/audio:1',
                            filter(event, player) {
                                return player.countMark('qiu_yi') > 0;
                                return player.countCards('he', { suit: 'diamond' }) > 0;
                            },
                            enable: 'chooseToUse',
                            filterCard(card) {
                                return card.suit == 'diamond';
                            },
                            position: 'he',
                            viewAs: {
                                name: 'guohe',
                            },
                            prompt: '将一张♦️️当过河拆桥使用',
                            onuse(result, player) {
                                player.removeMark('qiu_yi', 1);
                            },
                            ai: {
                                basic: {
                                    order: 9,
                                    useful: 1,
                                    value: 5,
                                },
                                result: {
                                    target(player, target) {
                                        var att = get.attitude(player, target);
                                        var nh = target.countCards('h');
                                        if (att > 0) {
                                            var js = target.getCards('j');
                                            if (js.length) {
                                                var jj = js[0].viewAs ? { name: js[0].viewAs } : js[0];
                                                if (jj.name == 'guohe' || js.length > 1 || get.effect(target, jj, target, player) < 0) {
                                                    return 3;
                                                }
                                            }
                                            if (target.getEquip('baiyin') && target.isDamaged() && get.recoverEffect(target, player, player) > 0) {
                                                if (target.hp == 1 && !target.hujia) return 1.6;
                                                if (target.hp == 2) return 0.01;
                                                return 0;
                                            }
                                        }
                                        var es = target.getCards('e');
                                        var noe = es.length == 0 || target.hasSkillTag('noe');
                                        var noe2 =
                                            es.filter(function (esx) {
                                                return get.value(esx, target) > 0;
                                            }).length == 0;
                                        var noh = nh == 0 || target.hasSkillTag('noh');
                                        if (noh && (noe || noe2)) return 0;
                                        if (att <= 0 && !target.countCards('he')) return 1.5;
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    loseCard: 1,
                                    discard: 1,
                                },
                            },
                        },
                        qiuyi_sa: {
                            audio: 'ext:作者包动漫/audio:1',
                            filter(event, player) {
                                return player.countMark('qiu_yi') > 0;
                                return player.countCards('he', { suit: 'club' }) > 0;
                            },
                            enable: ['chooseToUse', 'chooseToRespond'],
                            filterCard(card) {
                                return card.suit == 'club';
                            },
                            position: 'he',
                            viewAs: {
                                name: 'shan',
                            },
                            prompt: '将一张♣️️当闪使用',
                            onuse(result, player) {
                                player.removeMark('qiu_yi', 1);
                            },
                            ai: {
                                respondshan: true,
                                order: 3,
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        qiuyi_si: {
                            audio: 'ext:作者包动漫/audio:1',
                            filter(event, player) {
                                return player.countMark('qiu_yi') > 0;
                                return player.countCards('he', { suit: 'spade' }) > 0;
                            },
                            enable: ['chooseToUse', 'chooseToRespond'],
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            position: 'he',
                            viewAs: {
                                name: 'tao',
                            },
                            prompt: '将一张♠️️当桃使用',
                            onuse(result, player) {
                                player.removeMark('qiu_yi', 1);
                            },
                            ai: {
                                save: true,
                                basic: {
                                    order(card, player) {
                                        if (player.hasSkillTag('pretao')) return 5;
                                        return 2;
                                    },
                                    useful: [8, 6.5, 5, 4],
                                    value: [8, 6.5, 5, 4],
                                },
                                result: {
                                    target: 2,
                                    target_use(player, target) {
                                        // if(player==target&&player.hp<=0) return 2;
                                        if (player.hasSkillTag('nokeep', true, null, true)) return 2;
                                        var nd = player.needsToDiscard();
                                        var keep = false;
                                        if (nd <= 0) {
                                            keep = true;
                                        } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                            keep = true;
                                        }
                                        var mode = get.mode();
                                        if (target.hp >= 2 && keep && target.hasFriend()) {
                                            if (target.hp > 2 || nd == 0) return 0;
                                            if (target.hp == 2) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        if (target != current && get.attitude(target, current) >= 3) {
                                                            if (current.hp <= 1) return true;
                                                            if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                        }
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                        if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                        var att = get.attitude(player, target);
                                        if (att < 3 && att >= 0 && player != target) return 0;
                                        var tri = _status.event.getTrigger();
                                        if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                                var num = game.countPlayer(function (current) {
                                                    if (current.identity == 'fan') {
                                                        return current.countCards('h', 'tao');
                                                    }
                                                });
                                                if (num > 1 && player == target) return 2;
                                                return 0;
                                            }
                                        }
                                        if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                                return 0;
                                            }
                                        }
                                        if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                            return 0;
                                        }
                                        return 2;
                                    },
                                },
                                tag: {
                                    recover: 1,
                                    save: 1,
                                },
                            },
                        },
                        fei_ls: {
                            audio: 'ext:作者包动漫/audio:3',
                            intro: {
                                name: '飞雷神',
                                content: '你拥有#层飞雷神',
                            },
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            marktext: '飞',
                            logTarget: 'player',
                            content() {
                                'step 0';
                                trigger.player.addMark('fei_ls', 1);
                                player.addMark('fei_ls', 1);
                                player.markSkill('fei_ls');
                                game.log(player, '你获得了一层飞雷神标记');
                                ('step 1');
                                if (player.countMark('fei_ls') == 0) {
                                    player.unmarkSkill('fei_ls');
                                }
                            },
                        },
                        fei_yi: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            round: 3,
                            filter(event, player) {
                                return player.countMark('fei_ls') > 1;
                            },
                            content() {
                                'step 0';
                                player.removeMark('fei_ls', 1);
                                player.markSkill('fei_ls');
                                game.log(player, '你移除了两层飞雷神');
                                ('step 1');
                                trigger.cancel();
                                ('step 2');
                                player.recover();
                            },
                            group: ['fei_yi_roundcount'],
                        },
                        fei_er: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return target.countMark('fei_ls') > 0 && target != player;
                            },
                            content() {
                                'step 0';
                                var chat = ['飞雷神的标记是不会消失的', '飞雷神第二段', '飞雷神之术,洗累'].randomGet();
                                player.say(chat);
                                ('step 1');
                                target.damage();
                                target.removeMark('fei_ls', 4);
                            },
                            group: ['fei_er_roundcount'],
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -5;
                                        if (target == player) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        fei_lin: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return target.countMark('fei_ls') > 0 && target != player;
                            },
                            filter(event, player) {
                                return player.countMark('fei_ls') >= 5;
                            },
                            content() {
                                'step 0';
                                player.removeMark('fei_ls', 10);
                                player.draw(2);
                                ('step 1');
                                target.chooseToDiscard('h', 2, true);
                                target.chooseToDiscard('e', 4, true);
                                target.turnOver();
                                ('step 2');
                                if (player.countMark('fei_ls') == 0) {
                                    player.unmarkSkill('fei_ls');
                                }
                            },
                            group: ['fei_lin_roundcount'],
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp >= 1) return -5;
                                        if (target == player) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        fu_si: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            derivation: ['jue_ze', 'jue_zhe', 'nan_shuang', 'nv_shuang'],
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            content() {
                                'step 0';
                                trigger.source.loseMaxHp(1);
                                ('step 1');
                                player.chooseControl('叶双儿', '叶爽儿').set('ai', function (event, player) {
                                    if (player.countCards('he') < 1) {
                                        return '叶爽儿';
                                    }
                                    return '叶双儿';
                                });
                                ('step 2');
                                if (result.control == '叶双儿') {
                                    player.draw(2), (player.maxHp = 3);
                                    player.hp = player.maxHp;
                                    player.addSkill('nan_shuang');
                                    player.addSkill('nv_shuang');
                                    player.node.avatar.setBackgroundImage('extension/作者包动漫/image/zzb_yeshuanger1.jpg');
                                    player.removeSkill('fu_si');
                                } else {
                                    player.draw(2);
                                    player.maxHp = 4;
                                    player.recover(99);
                                    player.addSkill('jue_ze');
                                    player.addSkill('jue_zhe');
                                    player.node.avatar.setBackgroundImage('extension/作者包动漫/image/zzb_yeshuanger2.jpg');
                                    player.removeSkill('fu_si');
                                }
                            },
                        },
                        jue_ze: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.recover();
                                        break;
                                    case 'spade':
                                        trigger.source.loseMaxHp();
                                        break;
                                    default:
                                        player.draw(2);
                                }
                            },
                        },
                        jue_zhe: {
                            audio: 'ext:作者包动漫/audio:2',
                            group: ['jue_zhe_a'],
                            intro: {
                                name: '抉择',
                                content: '你拥有#层抉择',
                            },
                            trigger: {
                                global: 'loseMaxHpEnd',
                            },
                            forced: true,
                            marktext: '抉',
                            content() {
                                player.addMark('jue_zhe', 1);
                                player.markSkill('jue_zhe');
                                game.log(player, '你获得了一层抉择');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filter(event, player) {
                                        return player.countMark('jue_zhe') > 0;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('jue_zhe', 1);
                                        ('step 1');
                                        player.draw(2);
                                        player.recover(5);
                                        ('step 2');
                                        if (player.countMark('jue_zhe') == 0) {
                                            player.unmarkSkill('jue_zhe');
                                        }
                                    },
                                    ai: {
                                        order: 8,
                                        result: {
                                            player(player, target, card) {
                                                if (player.hp < 2) return 5;
                                                return 2;
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        nan_shuang: {
                            audio: 'ext:作者包动漫/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h') > 0 && target.maxHp > 0;
                            },
                            filter(event, player) {
                                return player.countCards('h');
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    target.loseMaxHp();
                                } else {
                                    player.draw(2);
                                }
                            },
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player, target);
                                    },
                                },
                            },
                        },
                        nv_shuang: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: 'phaseUseEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.color) {
                                    case 'red':
                                        player.addTempSkill('xiangle', { player: 'phaseUseBegin' });
                                        break;
                                    case 'black':
                                        player.addTempSkill('weimu', { player: 'phaseUseBegin' });
                                        break;
                                }
                                ('step 2');
                                player.addTempSkill('ganglie', { player: 'phaseUseBegin' });
                            },
                        },
                        mo_kai: {
                            audio: 'ext:作者包动漫/audio:2',
                            group: ['mo_kai_a'],
                            intro: {
                                name: '魔铠',
                                content: '你拥有#层魔铠',
                            },
                            trigger: {
                                player: ['damageAfter', 'recoverAfter', 'losehpAfter'],
                                source: 'damageAfter',
                            },
                            forced: true,
                            marktext: '魔',
                            derivation: ['mokai_a', 'mokai_b', 'mokai_c', 'mokai_d', 'mokai_e', 'mokai_f'],
                            content() {
                                'step 0';
                                var chat = ['以绝望挥剑,铸逝者为铠', '迎接铠爹的愤怒吧'].randomGet();
                                player.say(chat);
                                ('step 1');
                                player.addMark('mo_kai', 1);
                                player.markSkill('mo_kai');
                                game.log(player, '你获得了一层魔铠');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('mo_kai') >= 6;
                                    },
                                    content() {
                                        'step 0';
                                        player.node.avatar.setBackgroundImage('extension/作者包动漫/image/铠爹附体.jpg');
                                        ('step 1');
                                        var n = player.countMark('mo_kai');
                                        if (n >= 6) player.addSkill('mokai_a');
                                        if (n >= 6) player.addSkill('mokai_b');
                                        if (n >= 6) player.addSkill('mokai_c');
                                        if (n >= 6) player.addSkill('mokai_d');
                                        if (n >= 6) player.addSkill('mokai_e');
                                        if (n >= 6) player.addSkill('mokai_f');
                                        ('step 2');
                                        player.draw();
                                    },
                                },
                            },
                        },
                        mokai_a: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'JudgeBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('mo_kai') > 0;
                            },
                            content() {
                                player.skip('phaseJudge');
                            },
                        },
                        mokai_b: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            position: 'he',
                            filterCard(card) {
                                return get.type(card) != 'trick';
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'trick' }) > 0 && player.countMark('mo_kai') > 0;
                            },
                            viewAs: {
                                name: 'sha',
                            },
                            prompt: '将一张非锦囊牌当杀使用或打出',
                            onuse(result, player) {
                                player.removeMark('mo_kai', 1);
                                player.markSkill('mo_kai');
                            },
                            ai: {
                                respondsha: true,
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) return player.getCardUsable('sha') > 1 ? 3 : 3.1;
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        if (!isLink && player.hasSkill('jiu')) {
                                            if (
                                                !target.hasSkillTag('filterDamage', null, {
                                                    player: player,
                                                    card: card,
                                                    jiu: true,
                                                })
                                            ) {
                                                if (get.attitude(player, target) > 0) {
                                                    return -7;
                                                } else {
                                                    return -4;
                                                }
                                            }
                                            return -0.5;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                            },
                        },
                        mokai_c: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'usaCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card.name == 'sha' && player.countCards('he', 'sha') > 0;
                            },
                            content() { },
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return +3;
                                },
                            },
                        },
                        kai_mo: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('mo_kai') <= 5;
                            },
                            content() {
                                'step 0';
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/zzb_kaidie.jpg');
                                ('step 1');
                                player.draw();
                                player.removeSkill('mokai_a');
                                player.removeSkill('mokai_b');
                                player.removeSkill('mokai_c');
                                player.removeSkill('mokai_d');
                                player.removeSkill('mokai_e');
                                player.removeSkill('mokai_f');
                            },
                        },
                        mokai_d: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            _priority: 10,
                            trigger: {
                                source: 'damageAfter',
                            },
                            filter(event, player) {
                                return player.countMark('mo_kai') > 0;
                            },
                            check(event, player) {
                                if (player.hp <= 1) return true;
                                if (player.countMark('mo_kai') > 1) return true;
                                else return false;
                            },
                            content() {
                                player.recover();
                                player.removeMark('mo_kai', 1);
                                player.markSkill('mo_kai');
                            },
                            group: ['mokai_d_roundcount'],
                        },
                        mokai_f: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            _priority: 10,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && player.countMark('mo_kai') > 0; //QQQ
                            },
                            content() {
                                trigger.num += 1;
                                player.removeMark('mo_kai', 2);
                                player.markSkill('mo_kai');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player(player, target, card) {
                                        if (player.countMark('mo_kai') > 1) return true;
                                        if (get.attitude(player, target) < 0 && target.hp > 0) return 1;
                                        if (get.attitude(player, target) > 0 && target.hp > 0) return -1;
                                        return 2;
                                    },
                                },
                            },
                        },
                        mokai_e: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                return player.countMark('mo_kai') > 0 && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                trigger.target.chooseToDiscard('e', 2, true);
                                trigger.target.chooseToDiscard('h', 1, true);
                                ('step 1');
                                player.removeMark('mo_kai', 2);
                                player.markSkill('mo_kai');
                                ('step 2');
                                if (player.countMark('mo_kai') == 0) {
                                    return player.unmarkSkill('mo_kai');
                                }
                            },
                        },
                        ba_men: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'changeHp',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                if (player.hp < 6) {
                                    player.addSkill('bamen_a');
                                }
                                ('step 1');
                                if (player.hp < 5) {
                                    player.addSkill('bamen_b');
                                }
                                ('step 2');
                                if (player.hp < 4) {
                                    player.addSkill('bamen_c');
                                }
                                ('step 3');
                                if (player.hp < 3) {
                                    player.addSkill('bamen_d');
                                }
                                ('step 4');
                                if (player.hp > 2) {
                                    player.removeSkill('bamen_d');
                                }
                                ('step 5');
                                if (player.hp > 3) {
                                    player.removeSkill('bamen_c');
                                }
                                ('step 6');
                                if (player.hp > 4) {
                                    player.removeSkill('bamen_b');
                                }
                                ('step 7');
                                if (player.hp > 5) {
                                    player.removeSkill('bamen_a');
                                }
                            },
                        },
                        bamen_c: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaBegin',
                            },
                            check(event, target) {
                                if (target.hp > 1) return true;
                                else return false;
                            },
                            content() {
                                trigger.directHit = true;
                            },
                        },
                        bamen_a: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(1, function (card, target, player) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(target, player);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    var targets = result.targets;
                                    player.line(targets, trigger.card.nature);
                                    trigger.targets.addArray(targets);
                                }
                            },
                        },
                        bamen_d: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            check(event, target) {
                                if (target.hp > 0) return true;
                                else return false;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha'; //QQQ
                            },
                            content() {
                                'step 0';
                                trigger.num += 2;
                                ('step 1');
                                player.loseMaxHp();
                            },
                        },
                        bamen_b: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                player.gainMaxHp();
                            },
                        },
                        ba_buff: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['ba_buff_a'],
                            trigger: {
                                player: ['shaBefore', 'juedouBefore'],
                            },
                            forced: true,
                            content() {
                                trigger.target.getDebuff();
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: ['shanAfter', 'jiuAfter'],
                                    },
                                    forced: true,
                                    content() {
                                        player.getBuff();
                                    },
                                },
                            },
                        },
                        kai_yi: {
                            audio: 'ext:作者包动漫/audio:1',
                            mark: true,
                            forced: true,
                            init(player) {
                                player.storage.kai_yi = 0;
                            },
                            intro: {
                                content: '已累积受到#次伤害',
                            },
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                if (player.storage.kai_yi == 2) return event.num > 0;
                                return true;
                            },
                            content() {
                                if (player.storage.kai_yi < 2) {
                                    player.storage.kai_yi++;
                                } else if (trigger.num > 0) {
                                    trigger.num--;
                                    player.storage.kai_yi = 0;
                                }
                            },
                        },
                        kai_er: {
                            audio: 'ext:作者包动漫/audio:1',
                            mark: true,
                            forced: true,
                            _priority: 5,
                            popup: false,
                            init(player) {
                                player.storage.kai_er = 0;
                            },
                            intro: {
                                content: '已累积摸#次牌',
                            },
                            trigger: {
                                player: 'drawBegin',
                            },
                            content() {
                                if (player.storage.kai_er < 2) {
                                    player.storage.kai_er++;
                                } else {
                                    trigger.num += 2;
                                    player.storage.kai_er = 0;
                                }
                            },
                        },
                        kai_san: {
                            audio: 'ext:作者包动漫/audio:1',
                            mark: true,
                            forced: true,
                            init(player) {
                                player.storage.kai_san = 0;
                            },
                            intro: {
                                content: '已累积回复#点体力',
                            },
                            trigger: {
                                player: 'recoverBegin',
                            },
                            content() {
                                if (player.storage.kai_san < 2) {
                                    player.storage.kai_san++;
                                } else {
                                    trigger.num++;
                                    player.storage.kai_san = 0;
                                }
                            },
                        },
                        kai_kai: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            content() {
                                player.recover(9);
                                player.loseMaxHp();
                            },
                        },
                        si_zhan: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['gainMaxHpAfter', 'loseMaxHpAfter'],
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                                player.changeHujia();
                            },
                        },
                        leimu_wr: {
                            audio: 'ext:作者包动漫/audio:3',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                var num = 2;
                                if (!player.countCards('h')) {
                                    num = 4;
                                }
                                player.draw(num);
                            },
                        },
                        gui_hua: {
                            audio: 'ext:作者包动漫/audio:2',
                            intro: {
                                name: '鬼化',
                                content: '你拥有#层鬼化',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            group: ['gui_hua_a'],
                            forced: true,
                            marktext: '鬼',
                            derivation: ['bing_ji', 'chui_ji', 'gui_ji', 'hua_gui'],
                            content() {
                                player.addMark('gui_hua', 1);
                                player.markSkill('gui_hua');
                                game.log(player, '你获得了一层鬼化');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: ['phaseUseBegin', 'phaseJieshuBegin'],
                                    },
                                    _priority: 10,
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('gui_hua') >= 4;
                                    },
                                    content() {
                                        'step 0';
                                        player.maxHp = 6;
                                        player.hp = 6;
                                        player.draw(2);
                                        ('step 1');
                                        player.node.avatar.setBackgroundImage('extension/作者包动漫/image/蕾姆鬼化.jpg');
                                        ('step 2');
                                        player.addSkill('bing_ji');
                                        player.addSkill('chui_ji');
                                        player.addSkill('gui_ji');
                                        player.addSkill('hua_gui');
                                        ('step 3');
                                        player.removeSkill('leimu_wr');
                                        player.removeSkill('leimu_np');
                                        player.removeSkill('gui_hua');
                                    },
                                },
                            },
                        },
                        leimu_np: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            selectTarget: 1,
                            filter(event, player, target) {
                                return player.countCards('hj') > 1;
                            },
                            content() {
                                target.gainPlayerCard('hj', 2, player, true);
                            },
                            ai: {
                                order: 6,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card, isLink) {
                                        //QQQ
                                        if (target.hp > 0) return 4;
                                        if (player.countCards('hj') > 1) return 4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        chui_ji: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var num = [0, 0, 2].randomGet();
                                trigger.num += num;
                            },
                        },
                        bing_ji: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterTarget(event, player, target) {
                                return target != player;
                            },
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filter(event, player, target) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            content() {
                                target.damage();
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 1,
                                result: {
                                    target(player, target) {
                                        if (target.hp > 0) return -4;
                                        if (target == player) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        gui_ji: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            selectTarget: 1,
                            filter(event, player, target) {
                                return player.countMark('gui_hua') > 0 && target != player;
                            },
                            content() {
                                'step 0';
                                target.turnOver();
                                target.chooseToDiscard(99, 'he', true);
                                ('step 1');
                                player.removeMark('gui_hua', 1);
                                player.markSkill('gui_hua');
                                player.turnOver();
                                player.draw(2);
                                player.changeHujia();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target) {
                                        if (target.hp > 0) return -4;
                                        if (target == player) return false;
                                        return 4;
                                    },
                                },
                            },
                            group: ['gui_ji_roundcount'],
                        },
                        hua_gui: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            group: ['hua_gui_a'],
                            filter(event, player) {
                                return player.countMark('gui_hua') > 0;
                            },
                            content() {
                                'step 0';
                                player.removeMark('gui_hua', 1);
                                ('step 1');
                                if (player.countMark('gui_hua') == 0) {
                                    player.unmarkSkill('gui_hua');
                                }
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    filter(event, player) {
                                        return player.countMark('gui_hua') <= 0;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        player.maxHp = 3;
                                        player.removeSkill('bing_ji');
                                        player.removeSkill('chui_ji');
                                        player.removeSkill('gui_ji');
                                        ('step 1');
                                        player.addSkill('leimu_np');
                                        player.addSkill('leimu_wr');
                                        player.addSkill('gui_hua');
                                        ('step 2');
                                        player.node.avatar.setBackgroundImage('extension/作者包动漫/image/zzb_leimu.jpg');
                                        ('step 3');
                                        player.removeSkill('hua_gui');
                                    },
                                },
                            },
                        },
                        jian_zzcj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                player.gainPlayerCard('he', true, trigger.target);
                            },
                        },
                        jian_xxlg: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha'; //QQQ
                            },
                            content() {
                                'step 0';
                                var a = [1, 2, 3, 4, 5];
                                trigger.player.isDisabled(a);
                                ('step 1');
                                var n = ['equip1', 'equip2', 'equip3', 'equip4', 'equip5'].randomGet();
                                trigger.player.disableEquip(n);
                            },
                        },
                        jian_sctc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaMiss',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                trigger.target.chooseToDiscard('h', true);
                                trigger.target.chooseToDiscard('e', true);
                            },
                        },
                        jian_smsm: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            filter(event, player) {
                                return event.card.name == 'sha';
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                trigger.target.judge(function (card) {
                                    if (card.suit != 'heart') return 2;
                                    return -2;
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.player.chooseToDiscard(1, true, function (card) {
                                        return get.type(card) == 'basic';
                                    });
                                } else {
                                    trigger.cancel();
                                }
                            },
                        },
                        beng_shi: {
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                            },
                        },
                        jing_shi: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source != player;
                            },
                            content() {
                                trigger.source.goMad({ player: 'phaseUseBegin' });
                            },
                        },
                        jue_juefang: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            nobracket: true,
                            derivation: ['jf_jiandun', 'jf_duye', 'jf_huwei', 'jf_luehua'],
                            content() {
                                'step 0';
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/梅普露绝防.jpg');
                                ('step 1');
                                player.maxHp = 4;
                                player.hp = player.maxHp;
                                player.draw(Math.min(player.hp, 20));
                                player.removeSkill('jue_jijia');
                                player.removeSkill('tian_shi');
                                player.removeSkill('beng_shi');
                                player.removeSkill('jing_shi');
                                ('step 2');
                                player.addSkill('jf_jiandun');
                                player.addSkill('jf_duye');
                                player.addSkill('jf_huwei');
                                player.addSkill('jf_luehua');
                                player.removeSkill('jue_juefang');
                            },
                        },
                        jue_jijia: {
                            audio: 'ext:作者包动漫/audio:1',
                            forced: true,
                            nobracket: true,
                            derivation: ['jj_jijia', 'jj_jineng', 'ji_jipao'],
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return player.hp < 2;
                            },
                            content() {
                                'step 0';
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/梅普露机甲.jpg');
                                ('step 1');
                                player.hp = player.maxHp;
                                player.addSkill('jj_jijia');
                                player.addSkill('jj_jineng');
                                player.addSkill('ji_jipao');
                                ('step 2');
                                player.removeSkill('jue_juefang');
                                player.removeSkill('tian_shi');
                                player.removeSkill('beng_shi');
                                player.removeSkill('jing_shi');
                                player.removeSkill('jue_jijia');
                            },
                        },
                        tian_shi: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['tian_shi_a'],
                            intro: {
                                name: '天使',
                                content: '你拥有#层天使',
                            },
                            forced: true,
                            marktext: '天',
                            nobracket: true,
                            derivation: ['ts_shengguang', 'ts_yuyu', 'ts_shengyu', 'ts_shengjin'],
                            trigger: {
                                global: ['taoAfter', 'wuzhongAfter'],
                            },
                            content() {
                                player.addMark('tian_shi', 1);
                                player.markSkill('tian_shi');
                                game.log(player, '你获得了一层天使');
                            },
                            subSkill: {
                                a: {
                                    audio: 1,
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('tian_shi') >= 8;
                                    },
                                    content() {
                                        'step 0';
                                        player.node.avatar.setBackgroundImage('extension/作者包动漫/image/梅普露天使.jpg');
                                        ('step 1');
                                        player.draw(2);
                                        player.maxHp = 5;
                                        player.recover();
                                        player.addSkill('ts_shengguang');
                                        player.addSkill('ts_yuyu');
                                        player.addSkill('ts_shengyu');
                                        player.addSkill('ts_shengjin');
                                        ('step 2');
                                        player.removeSkill('beng_shi');
                                        player.removeSkill('jing_shi');
                                        player.removeSkill('jue_jijia');
                                        player.removeSkill('jue_juefang');
                                        player.removeSkill('tian_shi');
                                    },
                                },
                            },
                        },
                        jj_jijia: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.nature) return true;
                                return false;
                            },
                            content() {
                                trigger.cancel();
                            },
                        },
                        jj_jineng: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.nature) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player.chooseControl('回复一点体力', '摸两张牌').set('ai', function (event, player) {
                                    if (player.hp < 3) {
                                        return '回复一点体力';
                                    }
                                    return '摸两张牌';
                                });
                                ('step 1');
                                if (result.control == '回复一点体力') {
                                    player.recover();
                                } else {
                                    player.draw(2);
                                }
                            },
                        },
                        ji_jipao: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            filter(event, player) {
                                return event.card.name == 'huogong';
                            },
                            forced: true,
                            content() {
                                var n = ['fire', 'thunder'].randomGet();
                                trigger.targets[0].damage(n);
                                trigger.targets[0].chooseToDiscard('e', true);
                            },
                        },
                        jf_jiandun: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            content() {
                                player.changeHujia(2);
                            },
                        },
                        jf_duye: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'loseHpAfter',
                            },
                            forced: true,
                            content() {
                                player.recover(player.max - player.hp);
                            },
                        },
                        jf_luehua: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'die',
                            },
                            filter(event, player, target) {
                                return targeg != player;
                            },
                            forced: true,
                            content() {
                                player.changeHujia(2);
                                player.draw(player);
                            },
                        },
                        jf_huwei: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'useCard',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.player != player && event.targets.length == 1 && event.targets[0] != player;
                            },
                            logTarget: 'player',
                            check(event, player) {
                                return get.effect(event.targets[0], { name: 'sha' }, event.player, player) <= get.effect(player, { name: 'sha' }, event.player, player);
                            },
                            content() {
                                'step 0';
                                player.draw();
                                trigger.targets = [player];
                                var next = game.createEvent('twtijin_discard', null, trigger.parent);
                                next.player = player;
                                next.target = trigger.player;
                                next.setContent(function () { });
                            },
                        },
                        ts_shengguang: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filterCard: true,
                            selectCard: 1,
                            filterTarget: true,
                            selectTarget: [1, 9],
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                target.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        target.recover();
                                        break;
                                    default:
                                        target.draw(2);
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp > 0) return 4;
                                        if (target == player && player.hp > 0) return 4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ts_shengyu: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.hp > 2;
                            },
                            content() {
                                'step 0';
                                player.loseHp();
                                ('step 1');
                                target.changeHujia();
                            },
                            ai: {
                                order: 4,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp > 0) return 4;
                                        if (player == target && player.hp < 3) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        ts_yuyu: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard('he', function (card) {
                                    return get.type(card) == 'equip';
                                });
                                next.ai = function (card) {
                                    if (player.hp > 1) {
                                        return 6 - get.value(card);
                                    }
                                    if (player.hp == 1) {
                                        return 8 - get.value(card);
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                }
                            },
                        },
                        ts_shengjin: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            content() {
                                'step 0';
                                trigger.source.disableEquip(1);
                                trigger.source.disableEquip(2);
                                trigger.source.disableEquip(3);
                                trigger.source.disableEquip(4);
                                trigger.source.disableEquip(5);
                                ('step 1');
                                trigger.source.addSkill('ts_shengyuan');
                            },
                        },
                        ts_shengyuan: {
                            intro: {
                                content: '你的手牌上限-2',
                            },
                            mark: true,
                            mod: {
                                maxHandcard(player, num) {
                                    return (num -= 2);
                                },
                            },
                        },
                        hh_jyzs: {
                            audio: 'ext:作者包动漫/audio:2',
                            group: ['hh_jyzs_a'],
                            trigger: {
                                player: 'shaBefore',
                            },
                            filter(event, player) {
                                return get.color(event.card) == 'red';
                            },
                            forced: true,
                            content() {
                                trigger.directHit = true;
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    forced: true,
                                    nobdacket: true,
                                    content() {
                                        trigger.cancel();
                                    },
                                },
                            },
                        },
                        hh_jyzz: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'useCard',
                            },
                            forced: true,
                            firstDo: true,
                            filter(event, player, card) {
                                if (get.color(event.card) != 'black') return false;
                                return (event.card.name == 'nanman' && player != event.player) || (event.card.name == 'wanjian' && player != event.player) || (event.card.name == 'taoyuan' && player.hp < player.maxHp) || event.card.name == 'wugu';
                            },
                            content() {
                                player.draw();
                            },
                            mod: {
                                targetEnabled(card) {
                                    if ((get.type(card) == 'trick' || get.type(card) == 'delay') && get.color(card) == 'black') return false;
                                },
                            },
                        },
                        hh_zsxy: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.gainMaxHp(2);
                                player.hp = player.maxHp;
                                player.changeHujia();
                                ('step 1');
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/涂山苏苏.jpg');
                                ('step 2');
                                player.addSkill('hh_daimeng');
                                player.addSkill('hh_dmzs');
                                player.removeSkill('hh_jyzz');
                                player.removeSkill('hh_jyzs');
                                player.removeSkill('hh_zsxy');
                            },
                        },
                        hh_daimeng: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player, target) {
                                return target != player && event.source != undefined;
                            },
                            content() {
                                var card = game.createCard('lebu');
                                trigger.source.addJudge(card);
                                trigger.source.$draw(card);
                            },
                        },
                        kkx_qns: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            nodracked: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha'; //QQQ
                            },
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'spade':
                                        trigger.player.loseMaxHp();
                                        break;
                                    default:
                                        trigger.player.chooseToDiscard('he', true);
                                }
                            },
                        },
                        kkx_tudun: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' });
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseToDiscard('he', function (card, player) {
                                        return get.type(card) == 'equip';
                                    })
                                    .set('ai', function (card) {
                                        //QQQ
                                        if (player.hp > 1) {
                                            return 6 - get.value(card);
                                        }
                                        if (player.hp <= 1) {
                                            return 9 - get.value(card);
                                        }
                                    });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                }
                            },
                        },
                        kkx_fengdun: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard(card) {
                                return card.name == 'shan';
                            },
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            content() {
                                target.chooseToDiscard('e', true);
                                target.chooseToDiscard('h', true);
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0 && target.countCards('he') > 0) return -4;
                                        if (target != player && player.countCards('h', 'shan') < 2) return false;
                                        return 4;
                                    },
                                },
                            },
                        },
                        kkx_shuidun: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            filter(event, player) {
                                return player.countCards('h', { type: 'trick' }) > 0;
                            },
                            check(event, target) {
                                if (target.hp > 0) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('h', function (card, player) {
                                    return get.type(card) == 'trick';
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.num += 1;
                                }
                            },
                        },
                        shu_xing: {
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                'step 0';
                                trigger.num += 1;
                                player.addSkill('kkx_leiqie');
                                player.addSkill('kkx_tudun');
                                player.addSkill('kkx_shuidun');
                                player.addSkill('kkx_fengdun');
                                ('step 1');
                                player.removeSkill('shu_xing');
                            },
                        },
                        kkx_fuzhi: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget: true,
                            selectTarget: 1,
                            filter(event, target, player) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                var chat = ['你会的,我也会', '写轮眼,复制'].randomGet();
                                player.say(chat);
                                ('step 1');
                                var skill = target.skills.randomGet();
                                player.addTempSkill(skill, { player: 'phaseUseBegin' });
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        if (target == player) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        kkx_leiqie: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: ['chooseToRespond', 'chooseToUse'],
                            position: 'h',
                            filterCard(card) {
                                return card.name == 'sha' && !card.nature;
                            },
                            viewAs: {
                                name: 'sha',
                                nature: 'thunder',
                            },
                            prompt: '将一张杀当雷杀使用或打出',
                            check(card) {
                                return 9 - value(card);
                            },
                            ai: {
                                respondSha: true,
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) return player.getCardUsable('sha') > 1 ? 3 : 3.1;
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        if (!isLink && player.hasSkill('jiu')) {
                                            if (
                                                !target.hasSkillTag('filterDamage', null, {
                                                    player: player,
                                                    card: card,
                                                    jiu: true,
                                                })
                                            ) {
                                                if (get.attitude(player, target) > 0) {
                                                    return -7;
                                                } else {
                                                    return -4;
                                                }
                                            }
                                            return -0.5;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                            },
                        },
                        shen_wei: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['shen_wei_a'],
                            intro: {
                                name: '神威',
                                content: '你拥有#层神威标记',
                            },
                            trigger: {
                                global: 'loseMaxHpAfter',
                            },
                            forced: true,
                            marktext: '神',
                            content() {
                                player.addMark('shen_wei');
                                player.markSkill('shen_wei');
                                game.log(player, '你获得了一层神威');
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    forced: true,
                                    skillAnition: true,
                                    filter(event, player) {
                                        return player.countMark('shen_wei') >= 4;
                                    },
                                    content() {
                                        player.draw(2);
                                        player.recover();
                                        player.init('zzb_shenweikkx');
                                    },
                                },
                            },
                        },
                        zy_sw: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard(card) {
                                return get.type(card) == 'basic';
                            },
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                target.loseMaxHp();
                                ('step 1');
                                player.turnOver();
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 4,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        if (target == player) return false;
                                        return 2;
                                    },
                                },
                            },
                            group: ['zy_sw_roundcount'],
                        },
                        yy_sw: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            round: 1,
                            nobracket: true,
                            check(event, player) {
                                if (player.hp < 4) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player.turnOver();
                                ('step 1');
                                trigger.cancel();
                            },
                            group: ['yy_sw_roundcount'],
                        },
                        sw_ylj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'turnOverAfter',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                player.chooseTarget(true).set('ai', function (target) {
                                    return -get.attitude(player, target);
                                });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].chooseToDiscard('h', 1, true);
                                    result.targets[0].chooseToDiscard('e', 1, true);
                                    player.draw();
                                }
                            },
                        },
                        sw_lq: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['sw_lq_a'],
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                var card = game.createCard('shandian');
                                trigger.target.addJudge(card);
                                trigger.target.$draw(card);
                                trigger.target.chooseToDiscard('e', true);
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'damageBefore',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return event.nature == 'thunder';
                                    },
                                    content() {
                                        trigger.cancel();
                                    },
                                },
                            },
                        },
                        hh_dmzs: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'phaseJudgeBefore',
                            },
                            filter(event, player, target) {
                                return player != target && event.player.countCards('j') > 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            nobracket: true,
                            content() {
                                player.useCard({ name: 'sha' }, trigger.player);
                                player.draw();
                            },
                        },
                        luna_pifu: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var a = ['extension/作者包动漫/image/绯红露娜.jpg'];
                                var b = ['extension/作者包动漫/image/蔷薇露娜.jpg'];
                                var c = ['extension/作者包动漫/image/紫霞露娜.jpg'];
                                var d = ['extension/作者包动漫/image/新婚露娜.jpg'];
                                var e = ['extension/作者包动漫/image/zzb_yuanshiluna.jpg'];
                                var n = [a, b, c, d, e].randomGet();
                                player.node.avatar.setBackgroundImage(n);
                                ('step 1');
                                trigger.num += 1;
                            },
                        },
                        xing_yue: {
                            audio: 'ext:作者包动漫/audio:2',
                            intro: {
                                name: '星月',
                                content: '你拥有#层星月标记',
                            },
                            trigger: {
                                player: 'ln_yueguangAfter',
                            },
                            forced: true,
                            marktext: '星',
                            content() {
                                player.addMark('xing_yue', 1);
                                player.markSkill('xing_yue');
                                game.log(player, '你获得了一层星月');
                            },
                        },
                        ln_yueguang: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    target.damage();
                                    player.draw();
                                    target.addSkill('ln_xingbao');
                                    game.swapSeat(target, player);
                                    target.addMark('xing_yue', 1);
                                    target.markSkill('xing_yue');
                                } else {
                                    player.draw(2);
                                    player.addMark('xing_yue', 1);
                                    player.markSkill('xing_yue');
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0 && target.countCards('h') > 0) return -2;
                                        if (target == player) return false;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ln_yuedun: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            group: ['ln_yuedun_a', 'ln_yuedun_roundcount'],
                            filter(event, player) {
                                return player.countMark('xing_yue') > 1;
                            },
                            content() {
                                'step 0';
                                player.removeMark('xing_yue', 2);
                                player.markSkill('xing_yue');
                                game.log(player, '你移除了一层星月标记');
                                ('step 1');
                                player.changeHujia();
                                ('step 2');
                                if (player.countMark('xing_yue') == 0) {
                                    player.unmarkSkill('xing_yue');
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('xing_yue') >= 5;
                                    },
                                    content() {
                                        'step 0';
                                        var n = player.countMark('xing_yue');
                                        player.draw(n);
                                        ('step 1');
                                        player.removeMark('xing_yue', 10);
                                        player.markSkill('xing_yue');
                                    },
                                },
                            },
                        },
                        ln_xingbao: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('xing_yue') >= 3;
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                ('step 1');
                                player.removeMark('xing_yue', 3);
                                player.markSkill('xing_yue');
                                ('step 2');
                                if (player.countMark('xing_yue') == 0) {
                                    player.removeSkill('xing_yue');
                                }
                            },
                        },
                        hf_motou: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            filter(event, player) {
                                return event.source != undefined && event.source != player;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var chat = ['摸你小头', '摸你狗头,又能奈我何!', '给你摸摸头,别闹,喔!'].randomGet();
                                player.say(chat);
                                ('step 1');
                                trigger.source.changeHujia();
                                trigger.source.loseMaxHp();
                            },
                        },
                        hf_ddbc: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                var chat = ['打得不错', '呦西,洗累', '你的,死啦死啦滴干活'].randomGet();
                                player.say(chat);
                                ('step 1');
                                trigger.player.loseMaxHp();
                                trigger.player.draw(Math.min(player.hp, 20));
                            },
                            group: ['hf_ddbc_roundcount'],
                        },
                        hf_haofan: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.hs && evt.hs.length;
                            },
                            content() {
                                'step 0';
                                var chat = ['怎么还没打完啊,真TM烦', '又没得牌了,真烦', '啊啊啊,好烦'].randomGet();
                                player.say(chat);
                                ('step 1');
                                player.draw(2);
                            },
                        },
                        zzb_wwhc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'recoverAfter',
                            },
                            round: 1,
                            forced: true,
                            nobracket: true,
                            _priority: 10,
                            content() {
                                'step 0';
                                player.recover();
                                ('step 1');
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                ('step 2');
                                if (event.targets.length) {
                                    event.targets.shift().recover();
                                    event.redo();
                                }
                            },
                            group: ['zzb_wwhc_roundcount'],
                        },
                        zzb_sjrc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'recoverAfter',
                            },
                            filter(event, target, player) {
                                return target != player;
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                player.draw();
                            },
                        },
                        chun_tian: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '春天',
                                content: '你拥有#层春天标记',
                            },
                            trigger: {
                                player: 'dyingBegin',
                            },
                            group: ['chun_tian_a', 'chun_tian_b'],
                            marktext: '春',
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                player.revive();
                                player.changeHujia(2);
                                player.gainMaxHp();
                                ('step 1');
                                player.addMark('chun_tian', 1);
                                player.markSkill('chun_tian');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseUseBefore',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('chun_tian') >= 3;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('chun_tian', 5);
                                        player.markSkill('chun_tian');
                                        ('step 1');
                                        player.die();
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.maxHp >= 5;
                                    },
                                    content() {
                                        player.addSkill('zzb_bhqf');
                                    },
                                },
                            },
                        },
                        zzb_bhqf: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            position: 'he',
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            selectCard: 2,
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 1;
                            },
                            nobracket: true,
                            content() {
                                target.damage();
                                target.chooseToDiscard('he', 2, true);
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0 && target.countCards('he') > 0) return -2;
                                        if (target != player) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        yong_zhuang: {
                            group: ['yong_zhuang_e', 'yong_zhuang_a', 'yong_zhuang_b', 'yong_zhuang_c', 'yong_zhuang_d'],
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    filter(event, player) {
                                        return player.getEquip(1) && event.card && event.card.name == 'sha'; //QQQ
                                    },
                                    forced: true,
                                    content() {
                                        player.recover();
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'damageAfter',
                                    },
                                    filter(event, player) {
                                        return player.getEquip(2);
                                    },
                                    forced: true,
                                    content() {
                                        player.draw(2);
                                    },
                                },
                                c: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    filter(event, player) {
                                        return player.getEquip(3);
                                    },
                                    forced: true,
                                    content() {
                                        trigger.num++;
                                    },
                                },
                                d: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuAfter',
                                    },
                                    filter(event, player) {
                                        return player.getEquip(4);
                                    },
                                    forced: true,
                                    content() {
                                        player.draw();
                                    },
                                },
                                e: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'loseAfter',
                                        global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                                    },
                                    filter(event, player) {
                                        if (player.countCards('h') > 0) return false;
                                        var evt = event.getl(player);
                                        return player.getEquip(5) && evt && evt.player == player && evt.hs && evt.hs.length;
                                    },
                                    forced: true,
                                    content() {
                                        player.changeHujia();
                                    },
                                },
                            },
                        },
                        xia_tian: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '夏天',
                                content: '你拥有#层夏天标记',
                            },
                            trigger: {
                                player: 'loseEnd',
                                global: ['equipEnd', 'addJudgeEnd', 'gainAfter'],
                            },
                            filter(event, player) {
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.es && evt.es.length;
                            },
                            forced: true,
                            marktext: '夏',
                            content() {
                                player.addMark('xia_tian', 1);
                                player.markSkill('xia_tian');
                                game.log(player, '你获得了一层夏天');
                            },
                        },
                        yan_ri: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return target != player && target.countDisabled() <= 5;
                            },
                            filter(event, player) {
                                return player.countMark('xia_tian') > 0;
                            },
                            content() {
                                'step 0';
                                player.removeMark('xia_tian', 1);
                                player.markSkill('xia_tian');
                                ('step 1');
                                var list = ['equip1', 'equip2', 'equip3', 'equip4', 'equip5'];
                                for (var i = 0; i < list.length; i++) {
                                    if (target.isDisabled(list[i])) {
                                        list.remove(list[i--]);
                                    }
                                }
                                var n = [1, 2, 3, 4, 5].randomGet();
                                target.disableEquip(n);
                                target.chooseToDiscard('h', true);
                            },
                            ai: {
                                order: 6,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp > 0) return -2;
                                        if (target == player && target.countDisabled() >= 5) return false;
                                        return 4;
                                    },
                                },
                            },
                        },
                        xia_ri: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard('he', function (card) {
                                    return get.type(card) == 'equip';
                                });
                                next.ai = function (card) {
                                    if (player.hp == 0) {
                                        return 9 - get.value(card);
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.hp = player.maxHp;
                                }
                            },
                        },
                        zzb_fenshenshu: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['zzb_fenshenshu_a'],
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                player.chooseControl('视为使用【顺手牵羊】', function () {
                                    if (
                                        game.hasPlayer(function (current) {
                                            return get.attitude(player, current) < 0;
                                        })
                                    ) {
                                        return '视为使用【顺手牵羊】';
                                    }
                                });
                                ('step 1');
                                if (result.control == '视为使用【顺手牵羊】') {
                                    player.chooseUseTarget('###视为使用一张无视距离的【顺手牵羊】', { name: 'shunshou' }, false, 'nodistance');
                                } //QQQ
                            },
                            subSkill: {
                                a: {
                                    audio: 1,
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        player.chooseControl('视为使用【过河拆桥】', function () {
                                            if (
                                                game.hasPlayer(function (current) {
                                                    return get.attitude(player, current) < 0;
                                                })
                                            ) {
                                                return '视为使用【过河拆桥】';
                                            }
                                        });
                                        ('step 1');
                                        if (result.control == '视为使用【过河拆桥】') {
                                            player.chooseUseTarget('###视为使用一张【过河拆桥】', { name: 'guohe' }, false, 'nodistance');
                                        }
                                    },
                                },
                            },
                        },
                        zzb_erdaoliu: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return event.card.name == 'sha' && player.countCards('h', 'sha') > 0;
                            },
                            content() { },
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return +2;
                                },
                            },
                        },
                        zzb_fengrenshu: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            position: 'he',
                            nobracket: true,
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            viewAs: {
                                name: 'sha',
                            },
                            promot: '将一张装备牌当杀使用或打出',
                            ai: {
                                respondSha: true,
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                                            }) &&
                                            game.countPlayer(function (current) {
                                                return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                                            }) > 1
                                        )
                                            return 3.1;
                                        return 3;
                                    }
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                        },
                        zzb_zhiyushu: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            _priority: 10,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'spade' }) > 0;
                            },
                            content() {
                                target.recover();
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp < target.maxHp) return 2;
                                        if (target.hp == 1) return 4;
                                        if (player == target && player.countCards('he', { suit: 'spade' }) > 0) return 3;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ji_du: {
                            audio: 'ext:作者包动漫/audio:2',
                            group: ['ji_du_a'],
                            intro: {
                                name: '嫉妒',
                                content: '你拥有#层嫉妒标记',
                            },
                            trigger: {
                                global: 'dyingBegin',
                            },
                            forced: true,
                            content() {
                                player.addMark('ji_du', 1);
                                player.markSkill('ji_du');
                                game.log(player, '你获得了一层嫉妒标记');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: ['phaseBegin', 'phaseJieshuBegin'],
                                    },
                                    filter(event, player) {
                                        return player.countMark('ji_du') >= 5;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        player.init('zzb_jidumonv');
                                        ('step 1');
                                        player.draw(2);
                                    },
                                },
                            },
                        },
                        amly_bjzh: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '冰洁',
                                content: '你拥有#层冰洁标记,你还剩#回合',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            filter(event, player, target) {
                                return player.countMark('amly_bjzh') <= 0;
                            },
                            content() {
                                'stsp 0';
                                target.addMark('amly_bjzh', 2);
                                target.markSkill('amly_bjzh');
                                game.log(player, '你获得了两个冰洁标记');
                                target.addSkill('bingjie_zhihua1');
                                ('step 1');
                                player.addMark('amly_bjzh', 3);
                                player.markSkill('amly_bjzh');
                                game.log(player, '你获得了两个冰洁标记');
                                player.addSkill('bingjie_zhihua2');
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.maxHp > 0) return -2;
                                        if (target.maxHp > 3) return -4;
                                        return 6;
                                    },
                                },
                            },
                        },
                        bingjie_zhihua1: {
                            group: ['bingjie_zhihua1_a'],
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('amly_bjzh') > 0;
                            },
                            content() {
                                'step 0';
                                player.removeMark('amly_bjzh', 1);
                                player.markSkill('amly_bjzh');
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return player.countMark('amly_bjzh') == 0;
                                    },
                                    content() {
                                        'step 0';
                                        player.loseMaxHp();
                                        ('step 1');
                                        if (player.countMark('amly_bjzh') == 0) {
                                            player.unmarkSkill('amly_bjzh');
                                            player.removeSkill('bingjie_zhihua1');
                                        }
                                    },
                                },
                            },
                        },
                        bingjie_zhihua2: {
                            group: ['bingjie_zhihua2_a'],
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return player.countMark('amly_bjzh') > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.removeMark('amly_bjzh', 1);
                                player.markSkill('amly_bjzh');
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    filter(event, player) {
                                        return player.countMark('amly_bjzh') == 0;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        player.gainMaxHp();
                                        player.recover();
                                        ('step 1');
                                        if (player.countMark('amly_bjzh') == 0) {
                                            player.unmarkSkill('amly_bjzh');
                                            player.removeSkill('bingjin_zhihua2');
                                        }
                                    },
                                },
                            },
                        },
                        amly_jl: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '精灵',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player, target) {
                                return player.maxHp > 4 && player.countMark('amly_jl') <= 0;
                            },
                            check(event, target) {
                                if (target.hp > 0) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(1, function (event, target, player) {
                                        return target != player;
                                    })
                                    .set('ai', function (event, target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    player.loseMaxHp();
                                    player.draw(2);
                                    result.targets[0].addSkill('amly_jl1');
                                    result.targets[0].addMark('amly_jl', 2);
                                    result.targets[0].markSkill('amly_jl');
                                    game.log(player, '你获得了两个精灵标记');
                                }
                            },
                        },
                        amly_jl1: {
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('amly_jl') > 0;
                            },
                            content() {
                                'step 0';
                                player.removeMark('amly_jl', 1);
                                player.markSkill('amly_jl');
                                game.log(player, '你失去了一层精灵标记');
                                ('step 1');
                                if (player.countMark('amly_jl') == 0) {
                                    player.unmarkSkill('amly_jl');
                                    player.removeSkill('amly_jl1');
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.chooseToDiscard('h', true);
                                } else {
                                    trigger.cancel();
                                }
                            },
                        },
                        amly_pake: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(event, player, target) {
                                return target != player;
                            },
                            filter(event, player) {
                                return player.hp > player.countMark('ji_du') && player.countMark('ji_du') > 0;
                            },
                            content() {
                                'step 0';
                                var a = player.countMark('ji_du');
                                var b = player.hp;
                                var c = b - a;
                                if (c > 3) {
                                    player.gainPlayerCard('he', 3, target, true);
                                } else {
                                    player.gainPlayerCard('he', c, true, target);
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.countCards('he') > 0) return -2;
                                        return 2;
                                    },
                                },
                            },
                        },
                        amly_jidu: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return player.countMark('jd_mn') > 0;
                            },
                            async content(event, trigger, player) {
                                const num = player.countMark('jd_mn');
                                if (num >= 3) {
                                    player.draw();
                                    player.addSkill('amly_jdmn4');
                                }
                                if (num >= 6) {
                                    player.addSkill('amly_jidu1');
                                }
                                if (num >= 9) {
                                    player.addSkill('amly_jidu2');
                                }
                                if (num >= 10) {
                                    player.addSkill('amly_jidu3');
                                }
                            },//QQQ
                        },
                        jd_mn: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['jd_mn_a'],
                            intro: {
                                name: '嫉妒魔女',
                                content: '你拥有#层嫉妒魔女标记',
                            },
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            nobracket: true,
                            _priority: 10,
                            filter(event, player) {
                                return player.countMark('jd_mn') < 10;
                            },
                            content() {
                                player.addMark('jd_mn', 1);
                                player.markSkill('jd_mn');
                                game.log(player, '你获得了一层嫉妒魔女标记');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return player.countMark('jd_mn') < 10;
                                    },
                                    content() {
                                        player.addMark('jd_mn', 1);
                                        player.markSkill('jd_mn');
                                        game.log(player, '你获得了一层嫉妒魔女标记');
                                    },
                                },
                            },
                        },
                        amly_jidu1: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['damageEnd', 'recoverEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('jd_mn') >= 6;
                            },
                            content() {
                                'step 0';
                                var a = player.maxHp - player.hp;
                                player.draw(a);
                                ('step 2');
                                if (player.countMark('jd_mn') < 6) {
                                    player.removeSkill('amly_jidu1');
                                }
                            },
                        },
                        amly_jidu2: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.hs && evt.hs.length && player.countMark('jd_mn') >= 9;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(1, (card, target, player) => player != target).set('ai', (target) => -get.attitude(player, target)); //QQQ
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].turnOver();
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (player.countMark('jd_mn') < 9) {
                                    player.removeSkill('amly_jidu2');
                                }
                            },
                        },
                        amly_jdmn4: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            _priority: 10,
                            filter(event, player) {
                                return player.countMark('jd_mn') >= 10;
                            },
                            content() {
                                player.removeSkill('amly_jidu1');
                                player.removeSkill('amly_jidu2');
                                player.removeMark('jd_mn', 99);
                                player.markSkill('jd_mn');
                            },
                        },
                        amly_swhg: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            filter(event, player) {
                                return player.countMark('jd_mn') >= 6;
                            },
                            forced: true,
                            content() {
                                player.recover(66);
                            },
                        },
                        amly_jdzy: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countMark('jd_mn') > 5;
                            },
                            content() {
                                var a = player.countMark('jd_mn');
                                var b = player.hp;
                                var c = a - b;
                                if (c >= 3) {
                                    target.damage(2);
                                } else {
                                    target.damage(c);
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        if (target.hp == 0) return -4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        tr_bd: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['tr_bd_a'],
                            enable: ['chooseToUse', 'chooseToRespond'],
                            filterCard: {
                                name: 'sha',
                            },
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            viewAs: {
                                name: 'shan',
                            },
                            promot: '将一张杀当闪使用或打出',
                            check() {
                                return 1;
                            },
                            ai: {
                                respondSha: true,
                                order: 3,
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    filterCard: {
                                        name: 'shan',
                                    },
                                    filter(event, player) {
                                        return player.countCards('h', 'shan') > 0;
                                    },
                                    viewAs: {
                                        name: 'sha',
                                    },
                                    promot: '将一张闪当杀使用或打出',
                                    check() {
                                        return 1;
                                    },
                                    ai: {
                                        respondShan: true,
                                        canLink(player, target, card) {
                                            if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                            if (
                                                target.mayHaveShan() &&
                                                !player.hasSkillTag(
                                                    'directHit_ai',
                                                    true,
                                                    {
                                                        target: target,
                                                        card: card,
                                                    },
                                                    true
                                                )
                                            )
                                                return false;
                                            if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                            return true;
                                        },
                                        basic: {
                                            useful: [5, 1],
                                            value: [5, 1],
                                        },
                                        order(item, player) {
                                            if (player.hasSkillTag('presha', true, null, true)) return 10;
                                            if (lib.linked.includes(get.nature(item))) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                                                    }) &&
                                                    game.countPlayer(function (current) {
                                                        return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                                                    }) > 1
                                                )
                                                    return 3.1;
                                                return 3;
                                            }
                                            return 3.05;
                                        },
                                        result: {
                                            target(player, target, card, isLink) {
                                                var eff = (function () {
                                                    if (!isLink && player.hasSkill('jiu')) {
                                                        if (
                                                            !target.hasSkillTag('filterDamage', null, {
                                                                player: player,
                                                                card: card,
                                                                jiu: true,
                                                            })
                                                        ) {
                                                            if (get.attitude(player, target) > 0) {
                                                                return -7;
                                                            } else {
                                                                return -4;
                                                            }
                                                        }
                                                        return -0.5;
                                                    }
                                                    return -1.5;
                                                })();
                                                if (
                                                    !isLink &&
                                                    target.mayHaveShan() &&
                                                    !player.hasSkillTag(
                                                        'directHit_ai',
                                                        true,
                                                        {
                                                            target: target,
                                                            card: card,
                                                        },
                                                        true
                                                    )
                                                )
                                                    return eff / 1.2;
                                                return eff;
                                            },
                                        },
                                        tag: {
                                            respond: 1,
                                            respondShan: 1,
                                            damage(card) {
                                                if (card.nature == 'poison') return;
                                                return 1;
                                            },
                                            natureDamage(card) {
                                                if (card.nature) return 1;
                                            },
                                            fireDamage(card, nature) {
                                                if (card.nature == 'fire') return 1;
                                            },
                                            thunderDamage(card, nature) {
                                                if (card.nature == 'thunder') return 1;
                                            },
                                            poisonDamage(card, nature) {
                                                if (card.nature == 'poison') return 1;
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        tr_xbqlz: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 3,
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 2,
                            filterCard: true,
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            selectTarget: 1,
                            filter(event, player) {
                                return player.countCards('he') >= 2;
                            },
                            content() {
                                'step 0';
                                var b = target.maxHp - target.hp;
                                if (b > 3) {
                                    target.damage(3);
                                } else {
                                    target.damage(b);
                                }
                                ('step 1');
                                player.recover(b);
                                ('step 2');
                                if (target.hp == 1) {
                                    player.draw(player.hp - target.hp);
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp == 2) return -4;
                                        if (target.hp >= target.maxHp) return false;
                                        if (target.hp >= 1) return -1;
                                        return 4;
                                    },
                                },
                            },
                            group: ['tr_xbqlz_roundcount'],
                        },
                        tr_sfz: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaMiss',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(1, function (event, target, player) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(player, target);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].chooseToDiscard('he', 1, true);
                                } else {
                                    player.draw();
                                }
                            },
                        },
                        tr_edl: {
                            mod: {
                                targetInRange(card, player) {
                                    if (card.name == 'sha' && get.color(card) == 'black') return true;
                                },
                                cardUsable(card) {
                                    if (card.name == 'sha' && get.color(card) == 'red') return Infinity;
                                },
                            },
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return event.card.name == 'sha' && get.color(event.card) == 'red';
                            },
                            forced: true,
                            content() {
                                if (player.stat[player.stat.length - 1].card.sha > 0) {
                                    player.stat[player.stat.length - 1].card.sha--;
                                }
                            },
                        },
                        han_bing: {
                            audio: 'ext:作者包动漫/audio:2',
                            intro: {
                                name: '寒冰',
                                content: '你拥有#层寒冰',
                            },
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return get.type(event.card) == 'trick' && player.countMark('han_bing') < 10;
                            },
                            forced: true,
                            marktext: '寒',
                            content() {
                                'step 0';
                                player.addMark('han_bing', 1);
                                player.markSkill('han_bing');
                                game.log(player, '你获得了一个寒冰标记');
                                ('step 1');
                                player.draw();
                            },
                        },
                        tsyy_bf: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '冰封',
                                content: '你已被冰封',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            round: 3,
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            content() {
                                'step 0';
                                target.addSkill('tsyy_bingfeng');
                                target.addMark('tsyy_bf', 1);
                                target.markSkill('tsyy_bf');
                                target.chooseToDiscard('he', 1, true);
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 2;
                                    },
                                },
                            },
                            group: ['tsyy_bf_roundcount'],
                        },
                        tsyy_bingfeng: {
                            trigger: {
                                player: 'phaseBefore',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseControl('跳过摸牌', '跳过出牌').set('ai', function (event, player) {
                                    if (player.countCards('h') < 2) {
                                        return '跳过出牌';
                                    }
                                    return '跳过摸牌';
                                });
                                ('step 1');
                                if (result.control == '跳过出牌') {
                                    player.skip('phaseUse');
                                    player.removeMark('tsyy_bf', 1);
                                    player.markSkill('tsyy_bf');
                                } else {
                                    player.skip('phaseDraw');
                                    player.removeMark('tsyy_bf');
                                    player.markSkill('tsyy_bf');
                                }
                                ('step 2');
                                if (player.countMark('tsyy_bf') == 0) {
                                    player.unmarkSkill('tsyy_bf');
                                    player.removeSkill('tsyy_bingfeng');
                                }
                            },
                        },
                        tsyy_wjjh: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '酒',
                                content: '你拥有#层酒标记',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filter(event, player) {
                                return player.countMark('tsyy_wjjh') < 5 && player.countCards('he', { type: 'equip' }) > 0;
                            },
                            content() {
                                'step 0';
                                player.addMark('tsyy_wjjh', 1);
                                player.markSkill('tsyy_wjjh');
                                game.log(player, '你获得了一个酒标记');
                                ('step 1');
                                player.draw();
                            },
                            ai: {
                                order: 6,
                                expose: 0.2,
                                threaten: 1,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        tsyy_zq: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            filter(event, player) {
                                return player.countMark('tsyy_wjjh') > 0;
                            },
                            round: 1,
                            check(event, target) {
                                return get.attitude(player, target) < 0;
                            },
                            content() {
                                'step 0';
                                var a = player.countMark('tsyy_wjjh');
                                trigger.num += 1;
                                ('step 1');
                                player.removeMark('tsyy_wjjh', 1);
                                player.markSkill('tsyy_wjjh');
                            },
                            group: ['tsyy_zq_roundcount'],
                        },
                        tsyy_jwth: {
                            audio: 'ext:作者包动漫/audio:1',
                            limited: true,
                            mark: true,
                            juexingji: true,
                            nobracket: true,
                            intro: {
                                content: 'limited',
                            },
                            trigger: {
                                player: ['phaseUseBegin', 'phaseJieshuBegin'],
                            },
                            init(player) {
                                player.storage.tsyy_jwth == false;
                            },
                            filter(event, player) {
                                return player.countMark('han_bing') == 10 && player.countMark('tsyy_wjjh') == 5;
                            },
                            content() {
                                'step 0';
                                player.storage.tsyy_jwth == true;
                                player.awakenSkill('tsyy_jwth');
                                ('step 1');
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/涂山雅雅.jpg');
                                ('step 2');
                                player.addSkill('tsyy_zq');
                                player.addSkill('tsyy_bb');
                                player.addSkill('tsyy_jdld');
                            },
                        },
                        tsyy_jdld: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            selectTarget: [1, 2],
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            filter(event, player) {
                                return player.countMark('han_bing') > 0 && player.countMark('tsyy_wjjh') > 0;
                            },
                            content() {
                                'step 0';
                                target.turnOver();
                                player.draw();
                                target.chooseToDiscard('he', 1, true);
                                ('step 1');
                                player.removeMark('han_bing', 1);
                                player.removeMark('tsyy_wjjh', 1);
                                player.markSkill('han_bing');
                                player.markSkill('tsyy_wjjh');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 4,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 2;
                                    },
                                },
                            },
                            group: ['tsyy_jdld_roundcount'],
                        },
                        tsyy_bb: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 2,
                            trigger: {
                                global: 'turnOverEnd',
                            },
                            filter(event, player) {
                                return player.countMark('han_bing') > 3;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.removeMark('han_bing', 2);
                                player.markSkill('han_bing');
                                ('step 1');
                                trigger.player.damage();
                                trigger.player.loseHp();
                                ('step 2');
                                if (player.countMark('han_bing') == 0) {
                                    player.unmarkSkill('han_bing');
                                }
                            },
                            group: ['tsyy_bb_roundcount'],
                        },
                        ts_lyc: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '缠绕',
                                content: '你已被缠绕',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard: true,
                            selectTarget: 1,
                            nobracket: true,
                            marktext: '缠',
                            filterTarget(event, target, player) {
                                return player != target && target.countMark('ts_lyc') <= 1;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                target.addSkill('ts_chanrao');
                                target.addMark('ts_lyc', 1);
                                target.markSkill('ts_lyc');
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        if (target.countMark('ts_lyc') == 0) return -4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ts_chanrao: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.type(event.card) == 'basic';
                            },
                            content() {
                                player.chooseToDiscard('h', 1, true);
                            },
                        },
                        ts_htc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            _priority: 10,
                            nobracket: true,
                            content() {
                                'step 0';
                                player.chooseControl('伤害+1', '弃置两张牌').set('ai', function (event, target) {
                                    if (target.hp <= 2) {
                                        return '伤害+1';
                                    }
                                    return '弃置两张牌';
                                });
                                ('step 1');
                                if (result.control == '伤害+1') {
                                    trigger.num += 1;
                                } else {
                                    trigger.player.chooseToDiscard('he', 2, true);
                                }
                            },
                        },
                        ts_zhongdu: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'spade':
                                        player.loseHp();
                                        break;
                                    default:
                                        player.chooseToDiscard('e', true);
                                }
                            },
                        },
                        ts_aq: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '中毒',
                                content: '你已中毒',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            marktext: '毒',
                            filterTarget(event, target, player) {
                                return player != target && target.countMark('ts_aq') <= 0;
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'spade' }) > 0;
                            },
                            content() {
                                'step 0';
                                target.chooseToDiscard('h', true);
                                target.addSkill('ts_zhongdu');
                                target.addMark('ts_aq', 1);
                                target.markSkill('ts_aq');
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        if (target.countMark('ts_aq') == 0) return -4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        xlts_ssly: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '杀神',
                                content: '你拥有#层杀神标记',
                            },
                            trigger: {
                                player: 'xlts_xljAfter',
                            },
                            filter(event, player) {
                                return player.countMark('xlts_ssly') < 5;
                            },
                            forced: true,
                            marktext: '杀',
                            content() {
                                player.addMark('xlts_ssly', 1);
                                player.markSkill('xlts_ssly');
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        xlts_sz: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return player.countMark('xlts_ssly') > 0 && Math.random() < 0.6;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var a = player.countMark('xlts_ssly');
                                if (a == 0) {
                                    player.draw();
                                } else {
                                    player.draw(a);
                                }
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        xlts_xlz: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countMark('xlts_ssly') >= 5;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (event, player, target) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    var a = player.countMark('xlts_ssly');
                                    var b = player.hp;
                                    var c = a - b;
                                    result.targets[0].damage(c);
                                    var d = player.next;
                                    var e = player.previous;
                                    d.loseHp();
                                    e.loseHp();
                                    player.loseHp();
                                    player.draw(c);
                                    player.removeMark('xlts_ssly', 5);
                                    player.markSkill('xlts_ssly');
                                }
                                ('step 2');
                                player.removeSkill('xlts_xlz');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp > 0) return -2;
                                        if (player.hp == 1) return false;
                                        return 4;
                                    },
                                },
                            },
                        },
                        xlts_xlj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return player.getEquip(1);
                            },
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.recover();
                                        break;
                                    case 'diamond':
                                        player.draw(2);
                                        break;
                                    case 'club':
                                        trigger.player.chooseToDiscard('he', 2, true);
                                        break;
                                    case 'spade':
                                        trigger.player.loseHp();
                                        break;
                                }
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        xlts_shenpan: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectTarget: 1,
                            selectCard: 2,
                            filterCard: true,
                            filterTarget(event, target, player) {
                                return target != player && target.maxHp > 2;
                            },
                            filter(event, player, target) {
                                return player.getEquip(1) && player.countCards('h') > 1;
                            },
                            content() {
                                'step 0';
                                target.loseMaxHp(2);
                                ('step 1');
                                player.addMark('xlts_ssly', 2);
                                player.markSkill('xlts_ssly');
                                player.removeSkill('xlts_shenpan');
                            },
                            ai: {
                                order: 6,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -1;
                                        if (target.maxHp > 2) return -4;
                                        return 4;
                                    },
                                },
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        hsts_wdfb: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return target != player;
                            },
                            filter(event, player) {
                                return player.getEquip(1);
                            },
                            content() {
                                var a = ['lebu', 'bingliang'].randomGet();
                                var card = game.createCard(a);
                                target.addJudge(card);
                                target.$draw(card);
                            },
                            ai: {
                                order: 8,
                                expose: 0.5,
                                threaten: 1,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        hsts_hshh: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'recoverAfter',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                player.line(event.targets, 'green');
                                ('step 1');
                                if (event.targets.length) {
                                    event.current = event.targets.shift();
                                    event.current.chooseToDiscard(event.current.countCards('h') > 0).delay = true;
                                }
                                ('step 1');
                                event.current.chooseToDiscard('h', true, 2);
                                ('step 2');
                                if (event.targets.length) event.goto(1);
                            },
                        },
                        hsts_yqbf: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            selectTarget: 1,
                            filter(event, player) {
                                return player.countCards('e') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('e', 1, true);
                                ('step 1');
                                var a = [1, 2, 3].randomGet();
                                target.damage(a);
                                player.removeSkill('hsts_yqbf');
                            },
                            ai: {
                                order: 1,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -4;
                                        return 6;
                                    },
                                },
                            },
                        },
                        hsts_hzd: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            round: 1,
                            nobracket: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('h', true, 1).set('ai', function (card) {
                                    if (player.hp > 2) {
                                        return 4 - get.value(card);
                                    }
                                    if (player.hp <= 2) {
                                        return 8 - get.value(card);
                                    }
                                });
                                ('step 1');
                                trigger.cancel();
                            },
                            group: ['hsts_hzd_roundcount'],
                        },
                        ys_sg: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard: {
                                name: 'sha',
                            },
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0 && player.hp < player.maxHp;
                            },
                            content() {
                                'step 0';
                                player.recover();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 1,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ys_sp: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filterCard: {
                                name: 'shan',
                            },
                            filter(event, player) {
                                return player.countCards('h', 'shan') > 0;
                            },
                            content() {
                                target.damage();
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -1;
                                        if (player.countCards('h', 'shan') < 2) return false;
                                        return 2;
                                    },
                                },
                            },
                        },
                        ys_sd: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard: {
                                name: 'tao',
                            },
                            filter(event, player) {
                                return player.countCards('h', 'tao') > 0;
                            },
                            content() {
                                'step 0';
                                player.changeHujia();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ys_sj: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectTarget: 1,
                            selectCard: 1,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filterCard: {
                                name: 'jiu',
                            },
                            filter(event, player) {
                                return player.countCards('h', 'jiu') > 0;
                            },
                            content() {
                                'step 0';
                                target.loseHp();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ys_ys: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'chooseToUse',
                            mark: true,
                            limited: true,
                            init(player) {
                                player.storage.ys_ys = false;
                            },
                            filter(event, player) {
                                if (player.storage.ys_ys) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('ys_ys');
                                player.storage.ys_ys = true;
                                ('step 1');
                                player.link(false);
                                player.turnOver(false);
                                player.init('zzb_hayase');
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player, arg, target) {
                                    if (player != target || player.storage.ys_ys) return false;
                                },
                                save: true,
                                result: {
                                    player(player, target, card) {
                                        if (player.hp <= 0) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.ys_ys) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        ys_ha: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseDrawBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.maxHp > player.hp;
                            },
                            content() {
                                'step 0';
                                trigger.num -= 2;
                                ('step 1');
                                player.draw(player.maxHp - player.hp);
                            },
                        },
                        ys_qs: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: [1, Infinity],
                            filterCard: true,
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                player.draw(cards.length);
                            },
                            ai: {
                                order: 1,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ys_ah: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                var a = player.countCards('h');
                                if (a > 4) {
                                    player.draw(4);
                                } else {
                                    player.draw(a);
                                }
                            },
                        },
                        zzb_jjtl: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            uniqen: true,
                            nobracket: true,
                            filter(event, player) {
                                return [3, 5, 7].includes(game.roundNumber);
                            },
                            content() {
                                'step 0';
                                if (game.roundNumber == 3) {
                                    player.addSkill('zzb_jj');
                                    player.addSkill('zzb_tl');
                                }
                                ('step 1');
                                if (game.roundNumber == 5) {
                                    player.addSkill('zzb_fs');
                                }
                                ('step 2');
                                if (game.roundNumber == 7) {
                                    player.addSkill('zzb_mp');
                                }
                            },
                        },
                        zzb_jj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            content() {
                                player.draw();
                            },
                        },
                        zzb_tl: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            round: 2,
                            content() {
                                player.recover();
                            },
                            group: ['zzb_tl_roundcount'],
                        },
                        zzb_fs: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source != undefined && event.source != player && event.num > 0;
                            },
                            content() {
                                trigger.source.damage(trigger.num);
                            },
                        },
                        zzb_mp: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            content() {
                                'step 0';
                                target.addSkill('zzb_qp');
                                ('step 1');
                                player.removeSkill('zzb_mp');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        zzb_qp: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            content() {
                                trigger.num--;
                            },
                        },
                        zzb_jjts: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'dying',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                player.maxHp = 5;
                                player.hp = 5;
                                player.draw(5);
                                ('step 1');
                                player.removeSkill('zzb_jjts');
                            },
                        },
                        zzb_jjhf: {
                            group: ['zzb_jjhf_a', 'zzb_jjhf_b', 'zzb_jjhf_c', 'zzb_jjhf_d', 'zzb_jjhf_e'],
                            ai: {
                                effect: {
                                    target(card) {
                                        if (card.name == 'tiesuo') return 'zeroplayertarget';
                                    },
                                },
                            },
                            subSkill: {
                                e: {
                                    trigger: {
                                        player: 'loseMaxHpBegin',
                                    },
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                    },
                                },
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'linkBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return !player.isLinked();
                                    },
                                    content() {
                                        trigger.cancel();
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'turnOverBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return !player.isTurnedOver();
                                    },
                                    content() {
                                        trigger.cancel();
                                    },
                                },
                                c: {
                                    mod: {
                                        targetEnabled(card, player, target) {
                                            if (get.type(card) == 'delay') return false;
                                        },
                                    },
                                },
                                d: {
                                    ai: {
                                        noCompareTarget: true,
                                    },
                                },
                            },
                        },
                        xia_yy: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaAfter',
                            },
                            forced: true,
                            content() {
                                player.draw();
                            },
                        },
                        xia_xf: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.card && event.card.name == 'sha') return true;
                                return false;
                            },
                            content() {
                                player.useCard({ name: 'sha' }, trigger.player);
                            },
                            group: ['xia_xf_roundcount'],
                        },
                        xia_ps: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard: {
                                name: 'sha',
                            },
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('e', 1, true);
                                ('step 1');
                                target.chooseToDiscard('e', 5, true);
                                target.damage();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0 && target.countCards('e') > 0) return -2;
                                        if (player.countCards('h', 'sha') > 1) return 2;
                                        return 4;
                                    },
                                },
                            },
                            group: ['xia_ps_roundcount'],
                        },
                        xia_xu: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 3,
                            selectTarget: 1,
                            filterTarget: true,
                            filter(event, player) {
                                return player.countDisabled() < 5; //QQQ
                            },
                            content() {
                                'step 0';
                                var a = [1, 2, 3, 5];
                                var b = [1, 2, 3, 5].randomGet();
                                player.isDisabled(a);
                                player.disableEquip(b);
                                ('step 1');
                                target.judge();
                                ('step 2');
                                switch (result.suit) {
                                    case 'heart':
                                        target.loseMaxHp();
                                        break;
                                    case 'diamond':
                                        target.loseMaxHp();
                                        break;
                                    case 'club':
                                        target.loseHp();
                                        break;
                                    case 'spade':
                                        target.loseHp();
                                        break;
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                            group: ['xia_xu_roundcount'],
                        },
                        cym_sw: {
                            audio: 'ext:作者包动漫/audio:3',
                            group: ['cym_sw_a'],
                            intro: {
                                name: '死亡',
                                content: '你拥有#层死亡标记',
                            },
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            marktext: '死',
                            _priority: 8,
                            content() {
                                player.revive();
                                player.recover();
                                player.addMark('cym_sw', 1);
                                player.markSkill('cym_sw');
                            },
                            subSkill: {
                                a: {
                                    audio: 1,
                                    trigger: {
                                        player: 'cym_swBefore',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return player.countMark('cym_sw') >= player.maxHp + player.maxHp - player.hp;
                                    },
                                    content() {
                                        player.die();
                                    },
                                },
                            },
                        },
                        cym_hg: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['cym_hg_a'],
                            trigger: {
                                player: 'recoverBefore',
                            },
                            forced: true,
                            content() {
                                trigger.cancel();
                                player.draw(2);
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'cym_hgBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return Math.random() < 0.5;
                                    },
                                    content() {
                                        player.gainMaxHp();
                                    },
                                },
                            },
                        },
                        cym_mao: {
                            trigger: {
                                player: 'cym_swAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('cym_sw') > 0;
                            },
                            content() { },
                            mod: {
                                maxHandcard(player, num) {
                                    var a = player.countMark('cym_sw');
                                    return (num += a);
                                },
                            },
                        },
                        cym_pt: {
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (card.name == 'bingliang' || card.name == 'lebu' || card.name == 'shandian') return false;
                                },
                            },
                        },
                        dfyc_dzxy: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                if (target.hp == 1) {
                                    target.recover(2);
                                } else {
                                    target.damage();
                                    target.recover(2);
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target) {
                                        if (target.hp < target.maxHp) return 1;
                                        if (player.hp < player.maxHp) return 2;
                                        if (player.hp == 1 && target.hp == 1) return 4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        dfyc_yy: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['dfyc_yy_a'],
                            intro: {
                                name: '阳炎',
                                content: '你拥有#层阳炎标记',
                            },
                            trigger: {
                                player: 'damageBefore',
                            },
                            forced: true,
                            marktext: '阳',
                            nobracket: true,
                            filter(event, player) {
                                if (event.card && event.card.name == 'sha') return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red';
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                }
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.card && event.card.name == 'sha') return true;
                                        return false;
                                    },
                                    content() {
                                        'step 0';
                                        trigger.player.judge(function (card) {
                                            return get.color(card) == 'red';
                                        });
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.player.addSkill('dfyc_cz');
                                            trigger.player.addMark('dfyc_yy', 1);
                                            trigger.player.markSkill('dfyc_yy');
                                        }
                                    },
                                },
                            },
                        },
                        dfyc_cz: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJishuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('dfyc_yy') > 0;
                            },
                            content() {
                                'step 0';
                                if (player.countMark('dfyc_yy') >= 3) {
                                    player.damage(1, 'fire');
                                    player.removeMark('dfyc_yy', 3);
                                    player.markSkill('dfyc_yy');
                                }
                            },
                        },
                        dfyc_xk: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['dfyc_xk_a'],
                            intro: {
                                name: '虚空',
                                content: '你拥有#虚空标记',
                            },
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            nobracket: true,
                            filter(event, player) {
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.es && evt.es.length;
                            },
                            forced: true,
                            marktext: '虚',
                            content() {
                                'step 0';
                                player.addMark('dfyc_xk', 1);
                                player.markSkill('dfyc_xk');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    selectTarget: 1,
                                    filterTarget(event, player, target) {
                                        return player != target;
                                    },
                                    filter(event, player) {
                                        return player.countMark('dfyc_xk') > 1;
                                    },
                                    content() {
                                        'step 0';
                                        target.damage();
                                        target.loseHp();
                                        ('step 1');
                                        player.removeMark('dfyc_xk', 2);
                                        player.markSkill('dfyc_xk');
                                    },
                                    ai: {
                                        order: 8,
                                        expose: 1,
                                        threaten: 2,
                                        result: {
                                            target(player, target, card) {
                                                if (target.hp > 0) return -2;
                                                return 4;
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        mr_lxw: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var chat = ['螺旋丸', '没有什么是一个丸子解决不了的,如果有,那就两丸'].randomGet();
                                player.say(chat);
                                ('step 1');
                                trigger.target.chooseToDiscard('he', 1, true);
                            },
                        },
                        mr_fs: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                content: 'limited',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            filterCard: true,
                            uniqen: true,
                            limited: true,
                            mark: true,
                            init(player) {
                                player.storage.mr_fs == false;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            async content(event, trigger, player) {
                                player.storage.mr_fs == true;
                                player.awakenSkill('mr_fs');
                                ui.arena.setNumber(game.players.length + 1);
                                const fellow = game.addFellow(null, 'zzb_fsmryi');
                                fellow.side = player.side;
                                fellow.identity = player.identity;
                                fellow.setIdentity('分');
                                fellow.group = player.group;
                                fellow.identityShown = true;
                                await fellow.draw(fellow.hp);
                                fellow.node.identity.dataset.color = fellow.identity;
                            },
                            ai: {
                                order: 4,
                                expose: 0.1,
                                threaten: 0.5,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        mr_sy: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('h') > 1;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            filterCard: true,
                            selectCard: 1,
                            selectTarget: 1,
                            position: 'h',
                            check(card) {
                                return 6 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var chat = ['忍法·色诱术', '忍术究极奥秘·色诱术'].randomGet();
                                player.say(chat);
                                ('step 1');
                                player.swapHandcards(target);
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        if (player.countCards('h') > target.countCards('h')) return 0;
                                        return -target.countCards('h');
                                    },
                                },
                                order: 8,
                                threaten: 0.5,
                            },
                        },
                        mr_xm: {
                            audio: 'ext:作者包动漫/audio:3',
                            group: ['mr_xm_a'],
                            intro: {
                                name: '仙人',
                                content: '你拥有#层仙人标记',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            marktext: '仙',
                            forced: true,
                            content() {
                                player.addMark('mr_xm', 1);
                                player.markSkill('mr_xm');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: ['phaseUseBegin', 'phaseJieshuBegin'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('mr_xm') >= 5;
                                    },
                                    content() {
                                        player.init('zzb_xrmsmingren');
                                    },
                                },
                            },
                        },
                        xm_lxw: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'shaAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var chat = ['仙法·大玉螺旋丸', '仙法·螺旋双丸'].randomGet();
                                player.say(chat);
                                ('step 1');
                                trigger.target.chooseToDiscard('he', 2, true);
                            },
                        },
                        xm_jm: {
                            audio: 'ext:作者包动漫/audio:3',
                            group: ['xm_jm_a'],
                            intro: {
                                name: '九尾',
                                content: '你拥有#层九尾标记',
                            },
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            marktext: '九',
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.hs && evt.hs.length;
                            },
                            content() {
                                'step 0';
                                player.addMark('xm_jm', 1);
                                player.markSkill('xm_jm');
                                ('step 1');
                                player.recover();
                                player.changeHujia();
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: ['phaseUseBegin', 'phaseJieshuBegin'],
                                    },
                                    filter(event, player) {
                                        return player.countMark('xm_jm') >= 4;
                                    },
                                    forced: true,
                                    content() {
                                        player.init('zzb_jsmingren');
                                    },
                                },
                            },
                        },
                        xm_fs: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            uniqen: true,
                            limited: true,
                            mark: true,
                            position: true,
                            selectCard: 1,
                            filterCard: true,
                            init(player) {
                                player.storage.xm_fs == false;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            async content(event, trigger, player) {
                                player.storage.xm_fs == true;
                                player.awakenSkill('xm_fs');
                                ui.arena.setNumber(game.players.length + 3);
                                let num = 3;
                                while (num-- > 1) {
                                    const fellow = game.addFellow(null, 'zzb_xmfser');
                                    fellow.side = player.side;
                                    fellow.identity = player.identity;
                                    fellow.setIdentity('分');
                                    fellow.group = player.group;
                                    fellow.identityShown = true;
                                    await fellow.draw(fellow.hp);
                                    fellow.node.avatar.setBackgroundImage(`extension/作者包动漫/image/仙鸣${num}.jpg`);
                                    fellow.node.identity.dataset.color = fellow.identity;
                                }
                            },
                            intro: {
                                content: 'limited',
                            },
                            ai: {
                                order: 2,
                                expose: 0.5,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        xm_wy: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                player: 'shaMiss',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('he', 1, true).set('ai', function (card) {
                                    return 6 - get.value(card);
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.target.damage();
                                }
                            },
                            group: ['xm_wy_roundcount'],
                        },
                        jm_lxw: {
                            audio: 'ext:作者包动漫/audio:4',
                            trigger: {
                                player: 'shaEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var chat = ['彗星螺旋丸', '多重螺旋丸', '超大玉螺旋丸', '螺旋吸丸'].randomGet();
                                player.say(chat);
                                ('step 1');
                                var a = [0, 1].randomGet();
                                trigger.target.damage(a);
                            },
                        },
                        jm_js: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                player: 'damageBefore',
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'basic' }) > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('he', 1, true, function (card) {
                                    return get.type(card) == 'basic';
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                }
                            },
                            group: ['jm_js_roundcount'],
                        },
                        jm_fs: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            limited: true,
                            mark: true,
                            enable: 'phaseUse',
                            position: 'he',
                            filterCard: true,
                            selectCard: 1,
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.jm_fs == false;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            async content(event, trigger, player) {
                                player.storage.jm_fs == true;
                                player.awakenSkill('jm_fs');
                                ui.arena.setNumber(game.players.length + 5);
                                let num = 5;
                                while (num-- > 1) {
                                    const fellow = game.addFellow(null, 'zzb_jmfssa');
                                    fellow.side = player.side;
                                    fellow.identity = player.identity;
                                    fellow.setIdentity('分');
                                    fellow.group = player.group;
                                    fellow.identityShown = true;
                                    await fellow.draw(fellow.hp);
                                    fellow.node.avatar.setBackgroundImage(`extension/作者包动漫/image/金鸣${num}.jpg`);
                                    fellow.node.identity.dataset.color = fellow.identity;
                                }
                            },
                            ai: {
                                order: 1,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player(player, target, card) {
                                        if (player.hp <= 2) return 4;
                                        return 0;
                                    },
                                },
                            },
                        },
                        xm_lj: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            mark: true,
                            limited: true,
                            enable: 'phaseUse',
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.xm_lj == false;
                            },
                            filter(event, player) {
                                return player.countMark('xm_jm') >= 2;
                            },
                            content() {
                                'step 0';
                                player.storage.xm_lj == true;
                                player.awakenSkill('xm_lj');
                                ('step 1');
                                target.chooseToDiscard('he', 1, true);
                                player.draw();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        mr_hg: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            mark: true,
                            limited: true,
                            enable: 'phaseUse',
                            selectTarget: -1,
                            skillAnimaton: true,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            init(player) {
                                player.storage.mr_hg == false;
                            },
                            filter(event, player) {
                                return player.countMark('mr_xm') >= 3;
                            },
                            content() {
                                'step 0';
                                player.storage.mr_hg == true;
                                player.awakenSkill('mr_hg');
                                ('step 1');
                                var a = [1, 2, 3, 4, 5].randomGet();
                                target.disableEquip(a);
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        jm_dx: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            mark: true,
                            limited: true,
                            enable: 'phaseUse',
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.jm_dx == false;
                            },
                            filter(event, player) {
                                return player.hp <= 2;
                            },
                            content() {
                                'step 0';
                                player.storage.jm_dx == true;
                                player.awakenSkill('jm_dx');
                                ('step 1');
                                var a = [1, 2].randomGet();
                                target.loseMaxHp(a);
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        jm_sg: {
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - Infinity;
                                },
                            },
                        },
                        yl_lm: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            selectTarget: 1,
                            filterTarget(event, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                if (target == player) return false;
                                return true;
                            },
                            filterCard(card) {
                                return get.color(card) == 'black';
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                target.changeHujia();
                            },
                            ai: {
                                order: 6,
                                expose: 1,
                                threaten: 1.5,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return 2;
                                        if (target.hp == 1) return 4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        yl_cslm: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            limited: true,
                            mark: true,
                            enable: 'phaseUse',
                            nobracket: true,
                            selectTarget: 1,
                            filterTarget: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.yl_cslm == false;
                            },
                            filter(event, player) {
                                return player.hp <= 2;
                            },
                            content() {
                                'step 0';
                                player.storage.yl_cslm == true;
                                player.awakenSkill('yl_cslm');
                                ('step 1');
                                player.loseMaxHp();
                                target.gainMaxHp();
                                target.recover(99);
                                target.draw(2);
                            },
                            ai: {
                                order: 4,
                                expose: 1,
                                threaten: 3.5,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp <= 2 && player.hp <= 2) return 2;
                                        if (target.hp == 1 && player.hp == 1) return 6;
                                        return 4;
                                    },
                                },
                            },
                        },
                        yl_ld: {
                            mod: {
                                targetEnabled(card) {
                                    if (card.name == 'sha' && card.number < 10) return false;
                                },
                                maxHandcardBase(player, num) {
                                    return 5;
                                },
                            },
                        },
                        yl_yc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['damageBegin', 'recoverBegin'],
                            },
                            forced: true,
                            content() {
                                player.node.hp.hide();
                                player.node.equips.hide();
                            },
                        },
                        yl_qd: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp <= 2;
                            },
                            content() {
                                'step 0';
                                var chat = ['警告!体力小于等于2了', '警告!体力≤2了'].randomGet();
                                player.say(chat);
                                ('step 1');
                                player.draw();
                            },
                        },
                        hz_pf: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var a = ['extension/作者包动漫/image/荒野猴子.jpg'];
                                var b = ['extension/作者包动漫/image/美猴猴子.jpg'];
                                var c = ['extension/作者包动漫/image/情人猴子.jpg'];
                                var d = ['extension/作者包动漫/image/地狱猴子.jpg'];
                                var e = ['extension/作者包动漫/image/娶妻猴子.jpg'];
                                var f = ['extension/作者包动漫/image/zzb_sunwukong.jpg'];
                                var g = ['extension/作者包动漫/image/全息猴子.jpg'];
                                var n = [a, b, c, d, e, f, g].randomGet();
                                player.node.avatar.setBackgroundImage(n);
                                ('step 1');
                                player.draw();
                            },
                        },
                        hz_bz: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['hz_bz_a'],
                            intro: {
                                name: '棒子',
                                content: '你拥有#层棒子标记',
                            },
                            trigger: {
                                source: 'damageAfter',
                            },
                            marktext: '棒',
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return player.countMark('hz_bz') < 3;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                player.addMark('hz_bz', 1);
                                player.markSkill('hz_bz');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('hz_bz') == 3;
                                    },
                                    content() {
                                        'step 0';
                                        trigger.num += 1;
                                        ('step 1');
                                        player.removeMark('hz_bz', 3);
                                        player.markSkill('hz_bz');
                                    },
                                },
                            },
                        },
                        hz_bj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'recoverAfter',
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 10,
                            filter(event, player) {
                                return Math.random() < 0.2;
                            },
                            content() {
                                player.recover(10);
                            },
                        },
                        hz_jg: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['hz_jg_a'],
                            intro: {
                                name: '金箍',
                                content: '你拥有#层金箍标记',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            marktext: '金',
                            filter(event, player) {
                                return player.countMark('hz_jg') < 5;
                            },
                            content() {
                                'step 0';
                                player.addMark('hz_jg', 1);
                                player.markSkill('hz_jg');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filter(event, player) {
                                        return player.countMark('hz_jg') >= 3;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('hz_jg', 3);
                                        player.markSkill('hz_jg');
                                        ('step 1');
                                        player.changeHujia();
                                    },
                                    ai: {
                                        order: 10,
                                        expose: 0.5,
                                        threaten: 2,
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                            },
                        },
                        hz_md: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['hz_md_a'],
                            intro: {
                                name: '魔道',
                            },
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            marktext: '魔',
                            _priority: 10,
                            content() {
                                player.addMark('hz_md', 1);
                                player.markSkill('hz_md');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'hz_mdAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('hz_md') >= 4;
                                    },
                                    content() {
                                        'step 0';
                                        player.recover();
                                        player.draw(2);
                                        player.init('zzb_mdsunwukong');
                                    },
                                },
                            },
                        },
                        md_jgb: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['md_jgb_a'],
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                trigger.target.chooseToDiscard('e', 1, true);
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    content() {
                                        trigger.num += 1;
                                    },
                                },
                            },
                        },
                        md_rm: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return [2, 4, 6, 8, 10, 12, 14, 16, 18, 20].includes(game.roundNumber);
                            },
                            content() {
                                'step 0';
                                if (game.roundNumber == 2) {
                                    player.loseMaxHp();
                                }
                                ('step 1');
                                if (game.roundNumber == 4) {
                                    player.loseMaxHp();
                                }
                                ('step 2');
                                if (game.roundNumber == 6) {
                                    player.loseMaxHp();
                                }
                                ('step 3');
                                if (game.roundNumber == 8) {
                                    player.loseMaxHp();
                                }
                                ('step 4');
                                if (game.roundNumber == 10) {
                                    player.loseMaxHp();
                                }
                                ('step 5');
                                if (game.roundNumber == 12) {
                                    player.loseMaxHp();
                                }
                                ('step 6');
                                if (game.roundNumber == 14) {
                                    player.loseMaxHp();
                                }
                                ('step 7');
                                if (game.roundNumber == 16) {
                                    player.loseMaxHp();
                                }
                                ('step 8');
                                if (game.roundNumber == 18) {
                                    player.loseMaxHp();
                                }
                                ('step 9');
                                if (game.roundNumber == 20) {
                                    player.loseMaxHp();
                                }
                            },
                        },
                        md_fk: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['damageBegin', 'loseHpBegin'],
                            },
                            forced: true,
                            content() {
                                trigger.cancel();
                            },
                        },
                        md_mq: {
                            mod: {
                                cardname(card, player) {
                                    if (card.name == 'jiu' || card.name == 'shan' || card.name == 'tao') return 'sha';
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                        },
                        zzb_ng: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['zzb_ng_a'],
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('zzb_lg') > 0 && event.source != player;
                            },
                            content() {
                                'step 0';
                                var a = trigger.source;
                                player.discardPlayerCard('he', a, true);
                                ('step 1');
                                player.removeMark('zzb_lg', 1);
                                player.markSkill('zzb_lg');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('zzb_lg') > 0;
                                    },
                                    content() {
                                        'step 0';
                                        var b = trigger.player;
                                        player.discardPlayerCard('he', b, true);
                                        ('step 1');
                                        player.removeMark('zzb_lg', 1);
                                        player.markSkill('zzb_lg');
                                    },
                                },
                            },
                        },
                        zzb_lg: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['zzb_lg_a'],
                            intro: {
                                name: '记果',
                                content: '你拥有#层记果',
                            },
                            trigger: {
                                player: ['damageAfter', 'loseHpAfter'],
                            },
                            forced: true,
                            _priority: 10,
                            markimage: 'extension/作者包动漫/image/记果标记.jpg',
                            filter(event, player) {
                                return player.countMark('zzb_lg') < 20;
                            },
                            content() {
                                player.addMark('zzb_lg', 2);
                                player.markSkill('zzb_lg');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return player.countMark('zzb_lg') < 20;
                                    },
                                    content() {
                                        player.addMark('zzb_lg', 2);
                                        player.markSkill('zzb_lg');
                                    },
                                },
                            },
                        },
                        zzb_jieg: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            _priority: 10,
                            filter(event, player) {
                                return player.countMark('zzb_lg') > 0;
                            },
                            content() {
                                'step 0';
                                if (player.countMark('zzb_lg') >= 5) player.draw();
                                ('step 1');
                                if (player.countMark('zzb_lg') >= 10) player.addSkill('zzb_leig');
                                ('step 2');
                                if (player.countMark('zzb_lg') >= 15) player.addSkill('zzb_sg');
                                ('step 3');
                                if (player.countMark('zzb_lg') >= 20) player.addSkill('zzb_yg');
                            },
                        },
                        zzb_leig: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 5,
                            filter(event, player) {
                                return player.countMark('zzb_lg') > 3;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (event, player, target) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('thunder');
                                    player.removeMark('zzb_lg', 4);
                                    player.markSkill('zzb_lg');
                                }
                            },
                            group: ['zzb_leig_roundcount'],
                            ai: {
                                order: 6,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        zzb_sg: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCardToBegin',
                            },
                            forced: true,
                            filter(event, player, target) {
                                if (get.is.altered('zzb_sg') && player.hasSkill('zzb_sg2')) return false;
                                return event.targets && event.targets.length == 1 && player.getEnemies().includes(event.target);
                            },
                            content() {
                                'step 0';
                                trigger.target.getDebuff();
                            },
                        },
                        zzb_yg: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            limited: true,
                            mark: true,
                            juexingji: true,
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.zzb_yg == false;
                            },
                            filter(event, player) {
                                return player.countMark('zzb_lg') >= 20;
                            },
                            content() {
                                'step 0';
                                player.storage.zzb_yg == true, player.awakenSkill('zzb_yg');
                                ('step 1');
                                player.gainMaxHp(2);
                                player.hp = player.maxHp;
                                player.draw(2);
                                player.addSkill('zzb_lingg');
                                ('step 2');
                                player.removeMark('zzb_lg', 20);
                                player.markSkill('zzb_lg');
                            },
                        },
                        zzb_lingg: {
                            audio: 'ext:作者包动漫/audio:1',
                            forced: true,
                            gainable: true,
                            trigger: {
                                global: 'discardAfter',
                            },
                            filter(event, player) {
                                if (event.player == player) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.suit != 'heart' && get.position(i) == 'd') {
                                            return true;
                                        }
                                    }
                                return false;
                            },
                            content() {
                                'step 0';
                                if (trigger.delay == false) game.delay();
                                ('step 1');
                                var cards = [];
                                for (var i = 0; i < trigger.cards.length; i++) {
                                    if (trigger.cards[i].suit != 'heart' && get.position(trigger.cards[i]) == 'd') {
                                        cards.push(trigger.cards[i]);
                                    }
                                }
                                if (cards.length) {
                                    player.gain(cards, 'log');
                                    player.$gain2(cards);
                                }
                            },
                        },
                        szzb_shoug: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return -2;
                                },
                                globalTo(from, to, distance) {
                                    return -2;
                                },
                            },
                        },
                        hyh_lm: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            delay: 0,
                            content() {
                                'step 0';
                                var dialog = ui.create.dialog('灵眸');
                                for (var i = 0; i < game.players.length; i++) {
                                    if (game.players[i] == player) continue;
                                    if (game.players[i].countCards('h')) {
                                        dialog.add(get.translation(game.players[i]) + '的手牌');
                                        var hs = game.players[i].getCards('h');
                                        dialog.add(hs);
                                    }
                                }
                                event.dialog = dialog;
                                if (player == game.me) {
                                    if (event.isMine()) {
                                        game.pause();
                                        ui.create.confirm('o');
                                        game.countChoose();
                                        event.choosing = true;
                                    } else {
                                        event.finish();
                                        event.result = 'viewed';
                                        setTimeout(function () {
                                            event.dialog.close();
                                        }, 2 * lib.config.duration);
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 1');
                                event.result = 'viewed';
                                _status.imchoosing = false;
                                event.choosing = false;
                                if (event.dialog) event.dialog.close();
                            },
                        },
                        hyh_bbx: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['hyh_bbx_a'],
                            trigger: {
                                target: 'useCardToBegin',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return get.type(event.card) == 'trick';
                            },
                            content() {
                                player.draw();
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    round: 1,
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return get.type(event.card) == 'trick';
                                    },
                                    content() {
                                        player.changeHujia();
                                    },
                                    group: ['hyh_bbx_a_roundcount'],
                                },
                            },
                        },
                        hyh_sl: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['hyh_sl_a'],
                            intro: {
                                name: '死灵',
                                content: '你拥有#层死灵标记',
                            },
                            trigger: {
                                global: 'die',
                            },
                            forced: true,
                            marktext: '死',
                            content() {
                                player.addMark('hyh_sl', 1);
                                player.markSkill('hyh_sl');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filter(event, player) {
                                        return player.countMark('hyh_sl') >= 3;
                                    },
                                    content() {
                                        'step 0';
                                        player.hp = player.maxHp;
                                        ('step 1');
                                        player.removeMark('hyh_sl', 3);
                                        player.markSkill('hyh_sl');
                                    },
                                    ai: {
                                        order: 10,
                                        expose: 1,
                                        threaten: 2,
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                            },
                        },
                        hyh_tc: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'shaBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.distance(player, event.target) <= 1 && player.countCards('h') <= player.hp;
                            },
                            content() {
                                player.draw();
                            },
                        },
                        qxzs_bhht: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return Math.random() < 0.67;
                            },
                            content() {
                                'step 0';
                                trigger.cancel();
                            },
                        },
                        qxzs_ns: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, target, player) {
                                if (player == target) return false;
                                return target.countCards('h') || target.isUnseen(2);
                            },
                            content() {
                                'step 0';
                                player.chooseCardButton(target, target.getCards('h')).set('filterButton', function (button) {
                                    return get.type(button.link) != 'equip';
                                });
                                ('step 1');
                                if (result.links?.length) {
                                    event.card = result.links[0];
                                    player.gain(event.card, target);
                                    target.$gain(event.card, player);
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 0.5,
                                threaten: 1.5,
                                result: {
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                            },
                        },
                        qxzs_lhcj: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('h', 1, true);
                                ('step 1');
                                target.chooseToDiscard('e', 1, true);
                                target.addTempSkill('fengyin');
                            },
                            ai: {
                                order: 6,
                                expose: 0.5,
                                threaten: 1.5,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp) return -2;
                                        if (player.countCards('h') > 1) return -4;
                                        return 0;
                                    },
                                },
                            },
                        },
                        qxzs_hdzl: {
                            audio: 'ext:作者包动漫/audio:1',
                            uniqen: true,
                            mark: true,
                            limited: true,
                            enable: 'phaseUse',
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            init(player) {
                                player.storage.qxzs_hdzl == false;
                            },
                            content() {
                                'step 0';
                                player.storage.qxzs_hdzl == true;
                                player.awakenSkill('qxzs_hdzl');
                                ('step 1');
                                player.link();
                                player.turnOver();
                                player.draw(player.maxHp - player.hp);
                                ('step 2');
                                var num = [1, 2].randomGet();
                                target.link();
                                target.chooseToDiscard('he', num, true);
                                target.loseHp(num);
                            },
                            ai: {
                                order: 3,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (player.hp > 2) return false;
                                        if (target.hp <= 2 && target.countCards('he') >= 2) return -4;
                                        return 0;
                                    },
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        twl_jlw: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                var list = [];
                                if (!player.hasSkill('yingzi')) {
                                    list.push('yingzi');
                                }
                                if (!player.hasSkill('biyue')) {
                                    list.push('biyue');
                                }
                                if (!player.hasSkill('yizhong')) {
                                    list.push('yizhong');
                                }
                                if (!player.hasSkill('tieji')) {
                                    list.push('tieji');
                                }
                                if (!player.hasSkill('lianying')) {
                                    list.push('lianying');
                                }
                                if (!player.hasSkill('qianxun')) {
                                    list.push('qianxun');
                                }
                                if (!player.hasSkill('luanwu')) {
                                    list.push('luanwu');
                                }
                                if (list.length) {
                                    var num = list.randomGet();
                                    player.addSkill(num);
                                } else player.removeSkill('twl_jlw');
                            },
                            ai: {
                                maixue: true,
                                maixue_hp: true,
                                order: 10,
                                threaten: 2,
                                result: {
                                    player: 4,
                                },
                            },
                        },
                        twl_jlz: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 2,
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return event.card && (event.card.name == 'juedou' || event.card.name == 'sha'); //QQQ
                            },
                            content() {
                                'step 0';
                                trigger.player.draw();
                                trigger.num += 1;
                            },
                            group: ['twl_jlz_roundcount'],
                        },
                        CCcc: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            position: 'he',
                            selectCard: 1,
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                player.awakenSkill('CCcc');
                                player.addSkill('CCcc1');
                                target.addSkill('CCcc1');
                                target.marks.CCcc = target.markCharacter(player, {
                                    name: '缔结',
                                    content: '摸牌阶段摸牌+1',
                                });
                                game.addVideo('markCharacter', target, {
                                    name: '缔结',
                                    content: '摸牌阶段摸牌+1',
                                    id: 'CCcc',
                                    target: player.dataset.position,
                                });
                                player.storage.CCcc = target;
                                target.storage.CCcc = player;
                                player.marks.CCcc = player.markCharacter(target, {
                                    name: '缔结',
                                    content: '摸牌阶段摸牌+1',
                                });
                                game.addVideo('markCharacter', player, {
                                    name: '缔结',
                                    content: '摸牌阶段摸牌+1',
                                    id: 'CCcc',
                                    target: target.dataset.position,
                                });
                            },
                            ai: {
                                order: 1,
                                expose: 0.5,
                                threaten: 1.5,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return 4;
                                        return 6;
                                    },
                                },
                            },
                        },
                        CCcc1: {
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            froquen: true,
                            content() {
                                trigger.num += 1;
                            },
                        },
                        cc_djqy: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                global: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (get.is.altered('cc_djqy')) return game.phaseNumber % 8 == 0;
                                return game.phaseNumber % 6 == 0;
                            },
                            content() {
                                player.chooseDrawRecover(get.prompt('cc_djqy'));
                            },
                        },
                        cc_code: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            _priority: 10,
                            nobracket: true,
                            filter(event, player) {
                                return event.source != player && event.source != undefined;
                            },
                            content() {
                                'step 0';
                                trigger.source.damage();
                                ('step 1');
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                ('step 2');
                                if (event.targets.length) {
                                    event.targets.shift().damage();
                                    event.redo();
                                }
                            },
                        },
                        cc_ba: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                global: 'dyingAfter',
                            },
                            forced: true,
                            filter(event, player, target) {
                                return player != target;
                            },
                            content() {
                                var n = [1, 2].randomGet();
                                player.changeHujia();
                                player.draw(n);
                            },
                        },
                        zly_xr: {
                            audio: 'ext:作者包动漫/audio:3',
                            mark: true,
                            marktext: '仙',
                            intro: {
                                content: 'cards',
                            },
                            init(player) {
                                player.storage.zly_xr = [];
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            discard: false,
                            prepare: 'throw',
                            filterCard: {
                                name: ['jiu', 'jiedao', 'wugu', 'hanbing', 'shandian'],
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                ('step 1');
                                player.storage.zly_xr.addArray(cards);
                            },
                            ai: {
                                order: 10,
                                expose: 0.5,
                                threaten: 1,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        zly_yl: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 2,
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('zly_xr') > 0;
                            },
                            content() {
                                'step 0';
                                if (player.countMark('zly_xr') % 2 == 1) {
                                    player.addTempSkill('zly_yd', 'phaseUseAfter');
                                } else {
                                    player.addTempSkill('zly_hqz', 'phaseUseAfter');
                                }
                            },
                            group: ['zly_yl_roundcount'],
                        },
                        zly_yd: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard(card) {
                                return get.color(card) == 'red';
                            },
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                target.damage('fire');
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        zly_hqz: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectTarget: -1,
                            selectCard: 1,
                            filterCard(card) {
                                return get.color(card) == 'black';
                            },
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                target.link();
                                target.chooseToDiscard('h', 1, true);
                            },
                            ai: {
                                order: 9,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (!target.isLinked) return -4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        zly_hj: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'zly_xrAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('zly_xr') >= 3;
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                player.recover();
                                player.draw(2);
                                player.addSkill('zly_lx');
                                player.addSkill('zly_xs');
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/仙自来也.jpg');
                                player.removeSkill('zly_hj');
                            },
                        },
                        zly_tlzs: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('e') > 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red';
                                });
                                ('step 1');
                                if (result.bool) {
                                    var a = player.countCards('e');
                                    var b = [0, 0, 1].randomGet();
                                    if (a > 2) {
                                        target.chooseToDiscard('he', 2, true);
                                        target.damage(b);
                                    } else {
                                        target.chooseToDiscard('he', a, true);
                                        target.damage(b);
                                    }
                                } else {
                                    var c = player.countCards('e');
                                    var d = [0, 0, 1].randomGet();
                                    if (c > 2) {
                                        target.chooseToDiscard('he', 2, true);
                                        target.damage(d);
                                        player.chooseToDiscard('e', 5, true);
                                    } else {
                                        target.chooseToDiscard('he', c, true);
                                        target.damage(d);
                                        player.chooseToDiscard('e', 5, true);
                                    }
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp > 0) return -2;
                                        if (player.countCards('e') >= 3) return -8;
                                        return 4;
                                    },
                                },
                            },
                        },
                        zly_xs: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['zly_xs_a'],
                            trigger: {
                                player: 'taoAfter',
                            },
                            forced: true,
                            content() {
                                player.draw();
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'dyingAfter',
                                    },
                                    forced: true,
                                    content() {
                                        player.recover();
                                    },
                                },
                            },
                        },
                        zly_lx: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            logTarget: 'player',
                            filter(event, player) {
                                return event.card.name == 'sha';
                            },
                            content() {
                                player.gain(
                                    get.cardPile(function (card) {
                                        return get.type(card, 'equip') == 'equip';
                                    }),
                                    'gain2'
                                );
                            },
                        },
                        zzb_pf: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '平凡',
                                content: '你拥有#层平凡标记',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            marktext: '平',
                            filter(event, player) {
                                return event.source != player && event.source != undefined;
                            },
                            content() {
                                'step 0';
                                var a = player.maxHp - player.hp;
                                trigger.source.addSkill('zzb_pf1');
                                trigger.source.addMark('zzb_pf', a);
                                trigger.source.markSkill('zzb_pf');
                            },
                        },
                        zzb_pf1: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            _priority: 20,
                            filter(event, player) {
                                return player.countMark('zzb_pf') > 0;
                            },
                            content() {
                                'step 0';
                                var a = player.countMark('zzb_pf');
                                var b = player.countCards('h');
                                var c = a - b;
                                if (a <= b) {
                                    player.chooseToDiscard('h', a, true);
                                }
                                if (a > b) {
                                    player.chooseToDiscard('h', b, true);
                                    player.damage(c);
                                }
                                ('step 1');
                                player.removeMark('zzb_pf', 1);
                                player.markSkill('zzb_pf');
                            },
                        },
                        zzb_bf: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha'; //QQQ
                            },
                            content() {
                                'step 0';
                                var a = trigger.player.countMark('zzb_pf');
                                if (a > 0) {
                                    trigger.cancel();
                                    trigger.player.chooseToDiscard('he', 2, true);
                                }
                            },
                        },
                        zzb_ff: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['phaseBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            filter(event, player) {
                                return player.countCards('h') < 3;
                            },
                            content() {
                                player.draw(3 - player.countCards('h'));
                            },
                        },
                        zzb_cf: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: -1,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                if (player.hp >= player.maxHp) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                target.addMark('zzb_pf', player.hp);
                                target.markSkill('zzb_pf');
                                ('step 1');
                                player.removeSkill('zzb_cf');
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 3.5,
                                result: {
                                    target(player, target, card) {
                                        //QQQ
                                        if (target.hp <= 1) return -8;
                                        if (player.hp <= 2) return 8;
                                        return 0;
                                    },
                                },
                            },
                        },
                        zzb_xn: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.draw(Math.min(player.maxHp, 20));
                                } else {
                                    player.recover();
                                }
                            },
                        },
                        xj_gy: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseDiscardBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() { },
                            mod: {
                                ignoredHandcard(card, player) {
                                    if (get.type(card) == 'trick') {
                                        return true;
                                    }
                                },
                                cardDiscardable(card, player, name) {
                                    if (name == 'phaseDiscard' && get.type(card) == 'trick') return false;
                                },
                            },
                        },
                        xj_yr: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return get.type(event.card) == 'trick';
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, target, player) {
                                        return target != player && target.countCards('he') > 0;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    player.discardPlayerCard(result.targets[0], 'he', true);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var card = result.cards[0];
                                if (get.type(card) != 'trick') {
                                    player.draw();
                                }
                            },
                        },
                        blxc_gs: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '钩锁',
                                content: '你已被钩锁住',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard: true,
                            selectTarget: 1,
                            marktext: '钩',
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            prompt: '选择一名角色作为钩锁的目标',
                            content() {
                                'step 0';
                                target.addSkill('blxc_gs1');
                                target.addMark('blxc_gs', 1);
                                target.markSkill('blxc_gs');
                                ('step 1');
                                player.addSkill('blxc_gs2');
                                game.swapSeat(player, target);
                                player.useCard({ name: 'sha' }, target, false);
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        blxc_gs2: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseJieshuAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var a = player.countCards('e');
                                if (a > 2) {
                                    player.draw(2);
                                } else {
                                    player.draw(a);
                                }
                                ('step 1');
                                player.removeSkill('blxc_gs2');
                            },
                        },
                        blxc_kr: {
                            audio: 'ext:作者包动漫/audio:3',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.type(event.card) == 'basic';
                            },
                            content() {
                                player.draw();
                            },
                        },
                        blxc_xl: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp <= 1;
                            },
                            content() {
                                var a = [1, 1, 1, 1, 3].randomGet();
                                player.draw(a);
                            },
                        },
                        blxc_my: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 2,
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.getStat('kill') > 0;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                            group: ['blxc_my_roundcount'],
                        },
                        blsy_jm: {
                            mod: {
                                maxHandcard(player, num) {
                                    var a = player.countCards('e');
                                    return num + a;
                                },
                            },
                        },
                        blsy_kf: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            group: ['blsy_kf_a', 'blsy_kf_b'],
                            position: 'h',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard: {
                                name: 'sha',
                            },
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            content() {
                                player.useCard({ name: 'sha' }, target);
                            },
                            ai: {
                                order: 10,
                                expose: 0.8,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    position: 'h',
                                    selectCard: 2,
                                    selectTarget: 1,
                                    filterTarget(event, target, player) {
                                        return player != target;
                                    },
                                    filterCard: {
                                        name: 'sha',
                                    },
                                    filter(event, player) {
                                        return player.countCards('h', 'sha') > 1;
                                    },
                                    content() {
                                        player.useCard({ name: 'sha' }, target, false);
                                        player.draw();
                                    },
                                    ai: {
                                        order: 8,
                                        expose: 1,
                                        threaten: 3,
                                        result: {
                                            target(player, target, card) {
                                                if (target.hp > 0) return -2;
                                                return 4;
                                            },
                                        },
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    position: 'h',
                                    selectCard: 3,
                                    selectTarget: 1,
                                    filterCard: {
                                        name: 'sha',
                                    },
                                    filterTarget(event, target, player) {
                                        return player != target;
                                    },
                                    filter(event, player) {
                                        return player.countCards('h', 'sha') > 2;
                                    },
                                    content() {
                                        player.useCard({ name: 'sha' }, target, false);
                                        player.draw();
                                        player.addSkill('blsy_kf1');
                                    },
                                    ai: {
                                        order: 9,
                                        expose: 1,
                                        threaten: 3.8,
                                        result: {
                                            target(player, target, card) {
                                                if (target.hp > 0) return -2;
                                                return 4;
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        blsy_kf1: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                trigger.num += 1;
                                ('step 1');
                                player.removeSkill('blsy_kf1');
                            },
                        },
                        blsy_mz: {
                            mod: {
                                cardname(card, player) {
                                    if (card.suit == 'diamond') return 'sha';
                                    if (card.suit == 'club') return 'shan';
                                },
                            },
                        },
                        blsy_tt: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: 'damageBegin',
                            },
                            round: 1,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('h', true).set('ai', function (card) {
                                    return 8 - get.value(card);
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                    player.draw();
                                    player.useCard({ name: 'sha' }, trigger.source);
                                }
                            },
                            group: ['blsy_tt_roundcount'],
                        },
                        sl_bq: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'dieBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp <= 0 && player.maxHp > 0;
                            },
                            content() {
                                'step 0';
                                trigger.cancel();
                                ('step 1');
                                var a = player.countMark('sl_fy');
                                player.chooseToDiscard('e', 5, true);
                                player.gainMaxHp(a);
                                player.recover(player.maxHp);
                                player.draw(Math.min(player.hp, 20));
                                ('step 2');
                                event.card = get.cardPile(function (card) {
                                    return get.subtype(card) == 'equip1';
                                });
                                if (event.card) {
                                    player.equip(event.card, true).set('delay', true);
                                }
                                ('step 3');
                                event.card = get.cardPile(function (card) {
                                    return get.subtype(card) == 'equip2';
                                });
                                if (event.card) {
                                    player.equip(event.card, true).set('delay', true);
                                }
                                ('step 4');
                                event.card = get.cardPile(function (card) {
                                    return get.subtype(card) == 'equip3';
                                });
                                if (event.card) {
                                    player.equip(event.card, true).set('delay', true);
                                }
                                ('step 5');
                                event.card = get.cardPile(function (card) {
                                    return get.subtype(card) == 'equip4';
                                });
                                if (event.card) {
                                    player.equip(event.card, true).set('delay', true);
                                }
                                ('step 6');
                                player.removeSkill('sl_bq');
                            },
                        },
                        sl_fy: {
                            audio: 'ext:作者包动漫/audio:3',
                            group: ['sl_fy_a'],
                            intro: {
                                name: '烽烟',
                                content: '你拥有#层烽烟',
                            },
                            trigger: {
                                player: 'shaBefore',
                            },
                            forced: true,
                            marktext: '烽',
                            filter(event, player) {
                                return player.countMark('sl_fy') < 3;
                            },
                            content() {
                                player.addMark('sl_fy', 1);
                                player.markSkill('sl_fy');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        return player.countMark('sl_fy') > 2;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('sl_fy', 3);
                                        player.markSkill('sl_fy');
                                        ('step 1');
                                        player.chooseControl('伤害+1', '摸弃牌').set('ai', function (event, target) {
                                            if (target.hp <= 2) {
                                                return '伤害+1';
                                            }
                                            return '摸弃牌';
                                        });
                                        ('step 2');
                                        if (result.control == '伤害+1') {
                                            trigger.num += 1;
                                        } else {
                                            trigger.player.chooseToDiscard('h', true);
                                            trigger.player.chooseToDiscard('e', true);
                                            player.draw();
                                        }
                                    },
                                },
                            },
                        },
                        sl_lj: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                content: 'limited',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            mark: true,
                            uniqen: true,
                            limited: true,
                            position: 'he',
                            selectCard: [1, Infinity],
                            filterCard: true,
                            selectTarget: -1,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            init(player) {
                                player.storage.sl_lj == false;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.storage.sl_lj == true;
                                player.awakenSkill('sl_lj');
                                ('step 1');
                                var a = player.countMark('sl_fy');
                                target.chooseToDiscard('he', cards.length, true);
                                target.damage(a);
                            },
                            ai: {
                                order: 9,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player(player, target, card) {
                                        if (player.hp <= 2) return 8;
                                        if (player.countMark('sl_fy') >= 2) return 4;
                                        return 0;
                                    },
                                },
                            },
                        },
                        hml_dj: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: ['useCardAfter', 'loseEnd'],
                            },
                            filter(event, player) {
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.original == 'e') return true;
                                    }
                                return get.type(event.card) == 'equip';
                                return false;
                            },
                            forced: true,
                            uniqen: true,
                            _priority: 10,
                            derivation: ['tiandu', 'lianying', 'qianxun', 'huanyin'],
                            content() {
                                var list = [];
                                if (player.countCards('e') >= 1) {
                                    list.push('tiandu');
                                }
                                if (player.countCards('e') >= 2) {
                                    list.push('lianying');
                                }
                                if (player.countCards('e') >= 3) {
                                    list.push('qianxun');
                                }
                                if (player.countCards('e') >= 4) {
                                    list.push('huanyin');
                                }
                                if (list.length) {
                                    player.addAdditionalSkill('hml_dj', list);
                                }
                            },
                        },
                        hml_cj: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: ['phaseBefore', 'equipAfter', 'loseAfter'],
                            },
                            forced: true,
                            popup: false,
                            derivation: ['wusheng', 'xiaoji', 'ganglie', 'busi'],
                            filter(event, player) {
                                if (player.equiping) return false;
                                var suits = [];
                                var es = player.getCards('e');
                                for (var i = 0; i < es.length; i++) {
                                    suits.add(es[i].suit);
                                }
                                if (player.additionalSkills.hml_cj) {
                                    return player.additionalSkills.hml_cj.length != suits.length;
                                } else {
                                    return suits.length;
                                }
                            },
                            content() {
                                var suits = [];
                                var es = player.getCards('e');
                                for (var i = 0; i < es.length; i++) {
                                    suits.add(es[i].suit);
                                }
                                player.removeAdditionalSkill('hml_cj');
                                switch (suits.length) {
                                    case 1:
                                        player.addAdditionalSkill('hml_cj', ['wusheng']);
                                        break;
                                    case 2:
                                        player.addAdditionalSkill('hml_cj', ['wusheng', 'xiaoji']);
                                        break;
                                    case 3:
                                        player.addAdditionalSkill('hml_cj', ['wusheng', 'xiaoji', 'ganglie']);
                                        break;
                                    case 4:
                                        player.addAdditionalSkill('hml_cj', ['wusheng', 'xiaoji', 'ganglie', 'busi']);
                                        break;
                                }
                            },
                            ai: {
                                threaten: 1.2,
                            },
                        },
                        hml_zfdf: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: ['phaseUseBegin', 'phaseJieshuAfter'],
                            },
                            forced: true,
                            derivation: ['yanjia', 'drlt_huairou'],
                            filter(event, player) {
                                return player.hp == 1;
                            },
                            content() {
                                'step 0';
                                var a = player.countCards('e');
                                player.gainMaxHp();
                                player.recover(2);
                                player.draw(a);
                                player.addSkill('yanjia');
                                player.addSkill('drlt_huairou');
                                ('step 1');
                                player.removeSkill('hml_zfdf');
                            },
                        },
                        blxc_gs1: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['blxc_gs1_a'],
                            trigger: {
                                global: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('blxc_gs') > 0;
                            },
                            content() {
                                player.chooseToDiscard('he', true);
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        global: 'phaseUseAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('blxc_gs') > 0;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('blxc_gs', 1);
                                        player.markSkill('blxc_gs');
                                        ('step 1');
                                        if (player.countMark('blxc_gs') == 0) {
                                            player.unmarkSkill('blxc_gs');
                                            player.removeSkill('blxc_gs1');
                                        }
                                    },
                                },
                            },
                        },
                        zzb_ds: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard(card) {
                                return get.color(card) == 'black';
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            content() {
                                var list = player.getEnemies();
                                if (list.length) {
                                    var target = list.randomGet();
                                    player.line(target, 'green');
                                    target.gain(game.createCard('du'), 'gain2');
                                }
                            },
                            ai: {
                                order: 7,
                                expose: 0.2,
                                threaten: 1.5,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        zzb_dshi: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '毒师',
                                content: '你拥有#层毒师',
                            },
                            trigger: {
                                global: 'loseHpBegin',
                            },
                            forced: true,
                            marktext: '毒',
                            group: ['zzb_dshi_a'],
                            filter(event, player) {
                                return player.countMark('zzb_dshi') < 5;
                            },
                            content() {
                                player.addMark('zzb_dshi', trigger.num);
                                player.markSkill('zzb_dshi');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    selectTarget: [1, 3],
                                    filterTarget(event, player, target) {
                                        return player != target;
                                    },
                                    filter(event, player) {
                                        return player.countMark('zzb_dshi') > 2;
                                    },
                                    content() {
                                        'step 0';
                                        target.chooseToDiscard('h', 1, true);
                                        ('step 1');
                                        player.removeMark('zzb_dshi', 1);
                                        player.markSkill('zzb_dshi');
                                    },
                                    ai: {
                                        order: 9,
                                        expose: 0.8,
                                        threaten: 1.5,
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                            },
                        },
                        zzb_dsh: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '赌士',
                                content: '你拥有#层赌士',
                            },
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            forced: true,
                            marktext: '赌',
                            group: ['zzb_dsh_a'],
                            filter(event, player) {
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.es && evt.es.length && player.countMark('zzb_dsh') < 5;
                            },
                            content() {
                                player.addMark('zzb_dsh', 1);
                                player.markSkill('zzb_dsh');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        global: 'recoverEnd',
                                    },
                                    check(event, player) {
                                        return get.attitude(player, event.player) < 0;
                                    },
                                    filter(event, player) {
                                        return player != event.player && player.countMark('zzb_dsh') > 0;
                                    },
                                    content() {
                                        'step 0';
                                        player.judge();
                                        ('step 1');
                                        switch (result.color) {
                                            case 'red':
                                                trigger.player.loseHp();
                                                break;
                                            default:
                                                trigger.player.chooseToDiscard('h', 1, true);
                                                break;
                                        }
                                        ('step 2');
                                        player.removeMark('zzb_dsh', 1);
                                        player.markSkill('zzb_dsh');
                                    },
                                },
                            },
                        },
                        zzb_dsi: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '睹视',
                                content: '你拥有#层睹视',
                            },
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            marktext: '睹',
                            group: ['zzb_dsi_a'],
                            filter(event, player) {
                                return player.countMark('zzb_dsi') < 5;
                            },
                            content() {
                                player.addMark('zzb_dsi', trigger.num);
                                player.markSkill('zzb_dsi');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    enable: 'phaseUse',
                                    usable: 1,
                                    selectTarget: -1,
                                    filterTarget(event, player, target) {
                                        return player != target;
                                    },
                                    filter(event, player) {
                                        return player.countMark('zzb_dsi') > 4;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('zzb_dsi', 5);
                                        player.markSkill('zzb_dsi');
                                        ('step 1');
                                        player.useCard({ name: 'yuansuhuimie' }, target);
                                        ('step 2');
                                        if (player.countCards('h') < 3) {
                                            player.draw();
                                        }
                                    },
                                    ai: {
                                        order: 5,
                                        expose: 1,
                                        threaten: 3,
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                            },
                        },
                        pe_wx: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            filter(event, player) {
                                return target.countCards('h') > 0;
                            },
                            content() {
                                player.gainPlayerCard('h', target, true);
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                            ai: {
                                order: 9,
                                expose: 0.5,
                                threaten: 1.5,
                                result: {
                                    target(player, target, card) {
                                        if (target.countCards('h') > 0) return -2;
                                        if (target.countCards('h') >= 3) return -4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        pe_tz: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                player: 'damageBefore',
                            },
                            nobracket: true,
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'black';
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                } else {
                                    trigger.source.chooseToDiscard('h', 2, true);
                                }
                            },
                            group: ['pe_tz_roundcount'],
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                            },
                        },
                        pe_tx: {
                            audio: 'ext:作者包动漫/audio:2',
                            enable: 'phaseUse',
                            round: 2,
                            usable: 1,
                            selectTarget: -1,
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            content() {
                                'step 0';
                                var next = target.chooseToRespond({ name: 'sha' });
                                next.autochoose = lib.filter.autoRespondSha;
                                ('step 1');
                                if (result.bool == false) {
                                    target.damage();
                                    player.draw();
                                }
                            },
                            ai: {
                                order: 6,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player: 1,
                                },
                            },
                            group: ['pe_tx_roundcount'],
                        },
                        pe_pi: {
                            audio: 'ext:作者包动漫/audio:1',
                            mark: true,
                            limited: true,
                            uniqen: true,
                            juexingji: true,
                            nobracket: true,
                            intro: {
                                content: 'limited',
                            },
                            trigger: {
                                player: ['phaseUseBegin', 'phaseJieshuBegin'],
                            },
                            init(player) {
                                player.storage.pe_pe == false;
                            },
                            filter(event, player) {
                                return player.countCards('e') >= 4;
                            },
                            content() {
                                'step 0';
                                player.storage.pe_pe == true;
                                player.awakenSkill('pe_pi');
                                ('step 1');
                                player.say('佩因六道,就此参上!');
                                ('step 2');
                                player.init('zzb_changmen');
                            },
                        },
                        cm_td: {
                            audio: 'ext:作者包动漫/audio:2',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != _status.currentPhase && get.itemtype(event.cards) == 'cards';
                            },
                            content() {
                                'step 0';
                                player.draw(trigger.num);
                            },
                        },
                        cm_rjd: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, target, player) {
                                if (player == target) return false;
                                return target.countCards('h') || target.isUnseen(2);
                            },
                            content() {
                                'step 0';
                                player.chooseCardButton(target, target.getCards('h')).set('filterButton', function (button) {
                                    return get.type(button.link) == 'delay';
                                });
                                ('step 1');
                                if (result.links?.length) {
                                    event.card = result.links[0];
                                    player.gain(event.card, target);
                                    target.$gain(event.card, player);
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 0.5,
                                threaten: 1.5,
                                result: {
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                            },
                        },
                        cm_xld: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            position: 'he',
                            selectTarget: 1,
                            selectCard: 1,
                            nobracket: true,
                            filterCard(card) {
                                return get.type(card) == 'equip';
                            },
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' }) > 0;
                            },
                            content() {
                                target.damage();
                            },
                            ai: {
                                order: 9,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                            group: ['cm_xld_roundcount'],
                        },
                        cm_csd: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            content() {
                                player.gain(
                                    get.cardPile(function (card) {
                                        return get.type(card, 'trick') == 'trick';
                                    }),
                                    'gain2'
                                );
                            },
                            ai: {
                                order: 10,
                                expose: 0.1,
                                threaten: 0.5,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        cm_egd: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageBefore',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                if (event.nature) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                trigger.cancel();
                                ('step 1');
                                player.recover();
                            },
                        },
                        cm_dyd: {
                            audio: 'ext:作者包动漫/audio:1',
                            round: 1,
                            trigger: {
                                global: 'dying',
                            },
                            nobracket: true,
                            filter(event, player, target) {
                                return !player.isTurnedOver() && player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            content() {
                                'step 0';
                                trigger.player.hp = player.maxHp;
                                trigger.player.loseMaxHp();
                                player.turnOver();
                            },
                            group: ['cm_dyd_roundcount'],
                        },
                        cm_pi: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            nobracket: true,
                            derivation: ['cm_td', 'cm_xld', 'cm_rjd', 'cm_csd', 'cm_egd', 'cm_dyd'],
                            content() {
                                'step 0';
                                player.addSkill('cm_td');
                                player.addSkill('cm_xld');
                                player.addSkill('cm_rjd');
                                player.addSkill('cm_csd');
                                player.addSkill('cm_egd');
                                player.addSkill('cm_dyd');
                                ('step 1');
                                player.removeSkill('cm_pi');
                            },
                        },
                        cm_wd: {
                            audio: 'ext:作者包动漫/audio:1',
                            mark: true,
                            limited: true,
                            uniqen: true,
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player) {
                                player.storage.cm_wd == false;
                            },
                            filter(event, player) {
                                return game.dead.length;
                            },
                            content() {
                                'step 0';
                                player.storage.cm_wd == true;
                                player.awakenSkill('cm_wd');
                                player.loseMaxHp();
                                ('step 1');
                                var list = [];
                                for (var i = 0; i < game.dead.length; i++) {
                                    list.push(game.dead[i].name);
                                }
                                player.chooseButton(ui.create.dialog('选择1名角色复活', [list, 'character']), function (button) {
                                    for (var i = 0; i < game.dead.length && game.dead[i].name != button.link; i++);
                                    return get.attitude(_status.event.player, game.dead[i]);
                                });
                                ('step 2');
                                if (result.bool) {
                                    for (var i = 0; i < game.dead.length && game.dead[i].name != result.buttons[0].link; i++);
                                    var dead = game.dead[i];
                                    dead.gainMaxHp(3);
                                    dead.revive(dead.maxHp);
                                    dead.draw(4);
                                    dead.recover(99);
                                }
                            },
                            ai: {
                                order: 1,
                                expose: 1,
                                threaten: 3.8,
                                result: {
                                    player: 10,
                                },
                            },
                        },
                        tsrr_dzxy: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            selectTarget: 1,
                            selectCard: 1,
                            nobracket: true,
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            filterTarget(event, target, player) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                if (target.hp == 1) {
                                    target.recover(2);
                                } else {
                                    target.recover();
                                }
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target) {
                                        if (target.hp < target.maxHp) return 2;
                                        if (player.hp < player.maxHp) return 2;
                                        if (player.hp == 1 && target.hp == 1) return 4;
                                        return 4;
                                    },
                                },
                            },
                        },
                        tsrr_wyz: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['tsrr_wyz_a'],
                            trigger: {
                                player: 'shaMiss',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return player.countCards('h') <= player.hp;
                            },
                            content() {
                                player.draw(2);
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'shaBefore',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') > player.hp;
                                    },
                                    content() {
                                        trigger.directHit = true;
                                    },
                                },
                            },
                        },
                        tsrr_hlzs: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            filter(event, player) {
                                if (!player.canMoveCard) return false;
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current.countCards('ej');
                                    })
                                ) {
                                    return false;
                                }
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseToDiscard(get.prompt('tsrr_hlzs'), '弃置一张手牌并移动场上一张牌', lib.filter.cardDiscardable)
                                    .set('ai', function (card) {
                                        if (!_status.event.check) return 0;
                                        return 6 - get.value(card);
                                    })
                                    .set('check', player.canMoveCard(true))
                                    ('step 1');
                                if (result.bool) {
                                    player.moveCard(true);
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                order: 8,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        fbb_csbl: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            nobracket: true,
                            group: ['fbb_csbl_a'],
                            filter(event, player) {
                                if (player.hp >= player.maxHp) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.recover();
                                }
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') < 3;
                                    },
                                    content() {
                                        player.draw(player.countUsed());
                                    },
                                },
                            },
                        },
                        fbb_kd: {
                            intro: {
                                content: '你的手牌上限-1',
                            },
                            mark: true,
                            mod: {
                                maxHandcard(player, num) {
                                    return num - 1;
                                },
                            },
                        },
                        fdd_mr: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.player.addTempSkill('fbb_kd', { player: 'phaseJieshuAfter' });
                            },
                        },
                        fbb_sbs: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['fbb_sbs_a', 'fbb_sbs_b'],
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:2',
                                    trigger: {
                                        player: 'shaMiss',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') > 0;
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseToDiscard('h', true);
                                        trigger.target.chooseToDiscard('h', true);
                                        ('step 1');
                                        var a = trigger.target;
                                        if (a.countCards('h') == 0) {
                                            a.damage();
                                        }
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageBefore',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.player.hp == event.player.maxHp;
                                    },
                                    content() {
                                        'step 0';
                                        trigger.player.addTempSkill('fbb_dlz', { player: 'phaseJieshuAfter' });
                                    },
                                },
                            },
                        },
                        fbb_dlz: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                content: '你已中毒,回合开始前,你进行一次判定,如果不为♠️️,你流失一点体力',
                            },
                            mark: true,
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return card.suit != 'spade';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.loseHp();
                                }
                            },
                        },
                        yy_fzl: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['yy_fzl_a'],
                            intro: {
                                name: '风之灵',
                                content: '你拥有#层风之灵',
                            },
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            marktext: '风',
                            nobracket: true,
                            filter(event, player) {
                                return player.countMark('yy_fzl') < 4;
                            },
                            content() {
                                player.addMark('yy_fzl', 1);
                                player.markSkill('yy_fzl');
                            },
                            subSkill: {
                                a: {
                                    mod: {
                                        maxHandcard(player, num) {
                                            var a = player.countMark('yy_fzl');
                                            return num + a;
                                        },
                                    },
                                },
                            },
                        },
                        yy_fzj: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            nobracket: true,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            filter(event, player) {
                                return player.countMark('yy_fzl') >= 3;
                            },
                            content() {
                                'step 0';
                                var a = player.countMark('yy_fzl');
                                target.chooseToDiscard('he', a, true);
                                target.loseHp();
                                ('step 1');
                                var b = player.countMark('yy_fzl');
                                var c = player.hp;
                                var d = b - c;
                                if (b > c) {
                                    player.draw(d);
                                }
                                player.removeMark('yy_fzl', 3);
                                player.markSkill('yy_fzl');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    target(player, target, card) {
                                        if (target.hp > 0) return -2;
                                        return 4;
                                    },
                                },
                            },
                        },
                        ylj_hms: {
                            audio: 'ext:作者包动漫/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            selectTarget: 1,
                            filterCard: true,
                            nobracket: true,
                            filterTarget(event, target, player) {
                                return player != target;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                target.draw(2);
                                target.damage();
                            },
                            ai: {
                                order: 7,
                                expose: 1,
                                threaten: 2,
                                result: {
                                    target(player, target, card) {
                                        if (player.countCards('h') > 2) return 4;
                                        if (target.countCards('h') <= 1) return -4;
                                        if (target.hp > 0) return -1;
                                        return 1;
                                    },
                                },
                            },
                        },
                        ylj_ss: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'die',
                            },
                            forced: true,
                            forceDie: true,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            content() {
                                'step 0';
                                var a = trigger.source;
                                a.turnOver();
                                a.loseMaxHp();
                                a.addSkill('fbb_kd');
                                ('step 1');
                                player.chooseTarget().set('ai', function (target) {
                                    return get.attitude(player, target) > 0;
                                });
                                ('step 2');
                                if (result.targets?.length) {
                                    var b = result.targets;
                                    b[0].recover();
                                    b[0].draw(2);
                                    b[0].addSkill('ylj_hms');
                                }
                            },
                        },
                        ylj_sh: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.nature != 'fire';
                            },
                            content() {
                                'step 0';
                                trigger.nature == 'fire';
                                ('step 1');
                                trigger.player.addSkill('ylj_hy');
                            },
                        },
                        ylj_hy: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                content: '你已被灼烧,回合开始前进行一次判定,如果为红色,你则受到一点火焰伤害',
                            },
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            mark: true,
                            forced: true,
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red';
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.damage('fire');
                                }
                            },
                        },
                        ylj_hlz: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            usable: 1,
                            forced: true,
                            filter(event, player) {
                                return get.type(event.card) != 'trick';
                            },
                            content() {
                                player.gain(
                                    get.cardPile(function (card) {
                                        return get.type(card, 'trick') == 'trick';
                                    }),
                                    'gain2'
                                );
                            },
                        },
                        lb_jy: {
                            audio: 'ext:作者包动漫/audio:2',
                            intro: {
                                name: '剑意',
                                content: '你拥有#层剑意',
                            },
                            trigger: {
                                player: 'shaAfter',
                            },
                            forced: true,
                            marktext: '剑',
                            group: ['lb_jy_a'],
                            filter(event, player) {
                                return player.countMark('lb_jy') < 4;
                            },
                            content() {
                                player.addMark('lb_jy', 1);
                                player.markSkill('lb_jy');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && player.countMark('lb_jy') < 4; //QQQ
                                    },
                                    content() {
                                        player.addMark('lb_jy', 1);
                                        player.markSkill('lb_jy');
                                    },
                                },
                            },
                        },
                        lb_qjj: {
                            audio: 'ext:作者包动漫/audio:3',
                            intro: {
                                content: '你已发动#次将进酒',
                            },
                            trigger: {
                                player: 'useCard',
                            },
                            usable: 3,
                            forced: true,
                            nobracket: true,
                            marktext: '将',
                            group: ['lb_qjj_a'],
                            filter(event, player) {
                                return _status.currentPhase == player && get.type(event.card) != 'equip';
                            },
                            content() {
                                'step 0';
                                player.draw();
                                player.addMark('lb_qjj', 1);
                                player.markSkill('lb_qjj');
                                ('step 1');
                                var a = player.countMark('lb_qjj');
                                if (a >= 3) {
                                    player.tempHide();
                                }
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: ['phaseUseBefore', 'phaseJieshuAfter'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('lb_qjj') > 0;
                                    },
                                    content() {
                                        player.removeMark('lb_qjj', 4);
                                        player.markSkill('lb_qjj');
                                    },
                                },
                            },
                        },
                        lb_slzb: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            selectCard: 1,
                            filterCard: true,
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countMark('lb_jy') >= 2 && !player.hujia && player.countCards('h') > 0;
                            },
                            content() {
                                player.changeHujia();
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        lb_ql: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: -1,
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            nobracket: true,
                            filter(event, player) {
                                return player.countMark('lb_jy') >= 4;
                            },
                            content() {
                                'step 0';
                                var next = target.chooseToRespond({ name: 'shan' });
                                next.autochoose = lib.filter.autoRespondSha;
                                ('step 1');
                                if (result.bool == false) {
                                    target.loseHp();
                                    target.chooseToDiscard('he', true);
                                }
                                ('step 2');
                                player.removeMark('lb_jy', 4);
                                player.markSkill('lb_jy');
                            },
                            ai: {
                                order: 10,
                                expose: 1,
                                threaten: 3.9,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        dw_jn: {
                            audio: 'ext:作者包动漫/audio:1',
                            group: ['dw_jn_a'],
                            intro: {
                                name: '激怒',
                                content: '你拥有#层激怒',
                            },
                            trigger: {
                                source: 'dieAfter',
                            },
                            forced: true,
                            forceDie: true,
                            marktext: '激',
                            content() {
                                player.addMark('dw_jn', 1);
                                player.markSkill('dw_jn');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('dw_jn') > 0;
                                    },
                                    content() {
                                        var a = player.countMark('dw_jn');
                                        trigger.num += a;
                                    },
                                },
                            },
                        },
                        dw_hy: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                content: '你下次造成的伤害+1',
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            round: 2,
                            position: 'h',
                            selectCard: 1,
                            filterCard: true,
                            marktext: '红',
                            check(card) {
                                return 4 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0 && player.countMark('dw_hy') <= 0;
                            },
                            content() {
                                player.addSkill('dw_hya');
                                player.addMark('dw_hy', 1);
                                player.markSkill('dw_hy');
                            },
                            ai: {
                                order: 9,
                                expose: 0.2,
                                threaten: 1.5,
                                result: {
                                    player(player, target, card) {
                                        if (player.countCards('h') >= 2) return 2;
                                        return 0;
                                    },
                                },
                            },
                            group: ['dw_hy_roundcount'],
                        },
                        dw_hya: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countMark('dw_hy') > 0;
                            },
                            content() {
                                'step 0';
                                trigger.num += 1;
                                ('step 1');
                                player.removeMark('dw_hy', 1);
                                player.markSkill('dw_hy');
                                ('step 2');
                                if (player.countMark('dw_hy') == 0) {
                                    player.unmarkSkill('dw_hy');
                                    player.removeSkill('dw_hya');
                                }
                            },
                        },
                        dw_kb: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'damageAfter',
                            },
                            forced: true,
                            group: ['dw_kb_a'],
                            content() {
                                'step 0';
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                ('step 1');
                                if (event.targets.length) {
                                    event.targets.shift().chooseToDiscard('h', true);
                                    event.redo();
                                }
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        player.recover();
                                    },
                                },
                            },
                        },
                        dw_sx: {
                            audio: 'ext:作者包动漫/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.hp < player.maxHp;
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                player.draw(player.maxHp - player.hp);
                                player.hp = 1;
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/典韦五秒男.jpg');
                                ('step 1');
                                player.addSkill('dw_sxa');
                                player.removeSkill('dw_sx');
                            },
                            ai: {
                                order: 20,
                                expose: 1,
                                threaten: 3.8,
                                result: {
                                    player(player, target, card) {
                                        if (player.hp <= 2) return 8;
                                    },
                                },
                            },
                        },
                        dw_sxa: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 20,
                            usable: 3,
                            group: ['dw_sxa_a'],
                            content() {
                                player.recover();
                            },
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return Infinity;
                                },
                            },
                            subSkill: {
                                a: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    content() {
                                        player.addSkill('qiangxi');
                                        player.removeSkill('dw_sxa');
                                    },
                                },
                            },
                        },
                        zzb_sm: {
                            audio: 'ext:作者包动漫/audio:4',
                            intro: {
                                name: '失名',
                                content: '你拥有#层失名标记',
                            },
                            trigger: {
                                player: 'useCard',
                            },
                            _priority: 20,
                            forced: true,
                            marktext: '失',
                            content() {
                                player.addMark('zzb_sm', 1);
                                player.markSkill('zzb_sm');
                            },
                        },
                        zzb_js: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            group: ['zzb_js_a'],
                            content() {
                                'step 0';
                                var a = ['jizhi'];
                                var b = ['blxc_kr'];
                                var c = [a, b].randomGet();
                                player.addTempSkill(c, 'phaseUseAfter');
                                ('step 1');
                                var d = ['tieji'];
                                var e = ['retieji'];
                                var f = [d, e].randomGet();
                                player.addTempSkill(f, 'phaseUseAfter');
                            },
                            subSkill: {
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        var g = ['anlianying'];
                                        var h = ['cm_td'];
                                        var i = [g, h].randomGet();
                                        player.addTempSkill(i, { player: 'phaseUseBegin' });
                                        ('step 1');
                                        var j = ['ganglie'];
                                        var k = ['reganglie'];
                                        var l = [j, k].randomGet();
                                        player.addTempSkill(l, { player: 'phaseUseBegin' });
                                    },
                                },
                            },
                        },
                        zzb_nt: {
                            audio: 'ext:作者包动漫/audio:1',
                            intro: {
                                name: '逆天',
                                content: '你拥有#层逆天',
                            },
                            trigger: {
                                player: 'phaseBefore',
                            },
                            forced: true,
                            _priority: 20,
                            marktext: '逆',
                            filter(event, player) {
                                return player.countMark('zzb_sm') >= 30;
                            },
                            content() {
                                'step 0';
                                var a = player.maxHp * 2;
                                player.maxHp = a;
                                player.hp = player.maxHp;
                                player.setIdentity('逆');
                                if (player.countCards('h') < 3) {
                                    player.draw(3 - player.countCards('h'));
                                }
                                ('step 1');
                                var b = player.countMark('zzb_sm');
                                player.addMark('zzb_nt', b);
                                player.markSkill('zzb_nt');
                                player.removeMark('zzb_sm', 99);
                                player.markSkill('zzb_sm');
                                ('step 2');
                                player.node.avatar.setBackgroundImage('extension/作者包动漫/image/失名逆天.jpg');
                                player.removeSkill('zzb_js');
                                player.removeSkill('zzb_sm');
                                player.addSkill('zzb_jsheng');
                                ('step 3');
                                if (player.countMark('zzb_sm') == 0) {
                                    player.unmarkSkill('zzb_sm');
                                }
                            },
                        },
                        zzb_jsheng: {
                            audio: 'ext:作者包动漫/audio:1',
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter'],
                            },
                            forced: true,
                            group: ['zzb_jsheng_a', 'zzb_jsheng_b', 'zzb_jsheng_c', 'zzb_jsheng_d'],
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.hs && evt.hs.length && player.countMark('zzb_nt') > 0;
                            },
                            content() {
                                'step 0';
                                player.draw(Math.min(player.maxHp, 20));
                                player.removeMark('zzb_nt', 1);
                                player.markSkill('zzb_nt');
                                ('step 1');
                                if (player.countMark('zzb_nt') == 0) {
                                    player.unmarkSkill('zzb_nt');
                                    player.addSkill('zzb_js');
                                    player.removeSkill('zzb_jsheng');
                                }
                            },
                            subSkill: {
                                d: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageAfter',
                                    },
                                    check(event, player) {
                                        return get.attitude(player, event.player) < 0;
                                    },
                                    filter(event, player) {
                                        return player.countMark('zzb_nt') > 4;
                                    },
                                    content() {
                                        'step 0';
                                        trigger.player.loseMaxHp();
                                        player.removeMark('zzb_nt', 5);
                                        player.markSkill('zzb_nt');
                                        ('step 1');
                                        if (player.countMark('zzb_nt') == 0) {
                                            player.unmarkSkill('zzb_nt');
                                            player.addSkill('zzb_js');
                                            player.removeSkill('zzb_jsheng');
                                        }
                                    },
                                },
                                c: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        player: 'dying',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countMark('zzb_nt') > 3;
                                    },
                                    content() {
                                        'step 0';
                                        player.hp = player.maxHp;
                                        player.removeMark('zzb_nt', 4);
                                        player.markSkill('zzb_nt');
                                        ('step 1');
                                        if (player.countMark('zzb_nt') == 0) {
                                            player.unmarkSkill('zzb_nt');
                                            player.addSkill('zzb_js');
                                            player.removeSkill('zzb_jsheng');
                                        }
                                    },
                                },
                                a: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        source: 'damageBefore',
                                    },
                                    check(event, player) {
                                        return get.attitude(player, event.player) < 0;
                                    },
                                    filter(event, player) {
                                        return player.countMark('zzb_nt') > 1;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('zzb_nt', 2);
                                        player.markSkill('zzb_nt');
                                        var z = player.countMark('zzb_nt');
                                        if (z > 0) {
                                            player.draw();
                                        }
                                        ('step 1');
                                        var a = player.countCards('h');
                                        var b = player.countMark('zzb_nt');
                                        if (a < b) {
                                            player.draw();
                                        }
                                        ('step 2');
                                        var c = player.maxHp;
                                        var d = player.countMark('zzb_nt');
                                        if (c < d) {
                                            player.draw();
                                        }
                                        ('step 3');
                                        var e = player.countCards('h');
                                        var f = player.countCards('e');
                                        if (e > f) {
                                            player.draw();
                                        }
                                        ('step 4');
                                        if (player.countMark('zzb_nt') == 0) {
                                            player.unmarkSkill('zzb_nt');
                                            player.addSkill('zzb_js');
                                            player.removeSkill('zzb_jsheng');
                                        }
                                    },
                                },
                                b: {
                                    audio: 'ext:作者包动漫/audio:1',
                                    trigger: {
                                        global: 'dyingBegin',
                                    },
                                    _priority: 30,
                                    check(event, player) {
                                        return get.attitude(player, event.player) < 0;
                                    },
                                    filter(event, player) {
                                        return player.countMark('zzb_nt') > 2;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('zzb_nt', 3);
                                        player.markSkill('zzb_nt');
                                        trigger.player.die();
                                        ('step 1');
                                        if (player.countMark('zzb_nt') == 0) {
                                            player.unmarkSkill('zzb_nt');
                                            player.addSkill('zzb_js');
                                            player.removeSkill('zzb_jsheng');
                                        }
                                    },
                                },
                            },
                        },
                    },
                    translate: {
                        zzb_zuozhe: "<span style='color: #808080;'>作者",
                        zzb_hy: "<span style='color: #FF0000;'>火影忍者",
                        zzb_zz: "<body><h3 id='自制'>自制</h3></body><style>#自制{animation:change 10s linear 0s infinite;}@keyframes change{0%{color: #FF0000;}10%{color:F08080;}20%{color: #FFC0CB;}30%{color: #FF00FF;}40%{color: #9932CC;}50%{color: #1E90FF;}60%{color: #00FFFF;}70%{color: #7FFFD4;}80%{color:%#ADFF2F;}90%{color: #FFFF00;}100%{color: #FF0000;}}</style>",
                        zzb_wzry: "<span style='color: #00FFFF;'>王者荣耀",
                        zzb_dldl: "<span style='color: #0000FF;'>斗罗大陆",
                        zzb_yrzx: '一人之下',
                        zzb_djsy: "<span style='color: #FFFF00;'>刀剑神域",
                        zzb_clksdysjsh: "<span style='color: #ADFF2F;'>从零开始的异世界生活",
                        zzb_ywtptjqdfyl: "<span style='color: #FFC0CB;'>因为太怕疼就全点防御了",
                        zzb_hyxhl: "<span style='color: #9932CC;'>狐妖小红娘",
                        zzb_xjns: "<span style='color: #D8BFD8;'>玄机女神",
                        zzh_yedonger: '叶东儿',
                        zzb_yeqiuer: '叶秋儿',
                        zzz_bofengshuimen: '波风水门',
                        zzb_yeqier: '叶琪儿',
                        zzb_kaidie: '铠爹',
                        zzb_kaihuang: '凯皇',
                        zzb_kaishen: '恺神',
                        zzb_leimu: '蕾姆',
                        zzb_yasina: '亚斯娜',
                        zzb_meipulu1: '梅普露',
                        zzb_tushanhonghong: '涂山红红',
                        zzb_kakaxi: '卡卡西',
                        zzb_shenweikkx: '神威卡卡西',
                        zzb_yuanshiluna: '露娜',
                        zzb_haofan: '好烦',
                        zzb_yechuner: '叶春儿',
                        zzb_yexiaer: '叶夏儿',
                        zzb_shali: '莎莉',
                        zzb_aimiliya: '艾米莉亚',
                        zzb_jidumonv: '嫉妒魔女',
                        zzb_tongren: '桐人',
                        zzb_tushanyaya: '涂山雅雅',
                        zzb_tangsan: '唐三',
                        zzb_xlstangsan: '修罗神·唐三',
                        zzb_hstangsan: '海神·唐三',
                        zzb_yase: '光明亚瑟',
                        zzb_hayase: '黑暗亚瑟',
                        zzb_dtmhaofan: '大筒木好烦',
                        zzb_xia: '霞',
                        zzb_caiyuemao: '菜月昴',
                        zzb_dongfangyuechu: '东方月初',
                        zzb_mingren: '漩涡鸣人',
                        zzb_xrmsmingren: '仙鸣',
                        zzb_fsmryi1: '鸣人',
                        zzb_xmfser1: '仙鸣',
                        zzb_xmfser2: '仙鸣',
                        zzb_jsmingren: '金鸣',
                        zzb_jmfssa: '金鸣',
                        zzb_dtmyile: '大筒木一乐',
                        zzb_sunwukong: '孙悟空',
                        zzb_mdsunwukong: '魔孙悟空',
                        zzb_yelinger: '叶铃儿',
                        zzb_huoyuhao: '霍雨浩',
                        zzb_qingxuzhishen: '情绪之神',
                        zzb_tangwulin: '唐舞麟',
                        'zzb_c.c': 'C.C',
                        zzb_zilaiye: '自来也',
                        zzb_yefan: '叶凡',
                        zzb_shaosiming: '少司命',
                        zzb_bailixuance: '百里玄策',
                        zzb_bailishouyue: '百里守约',
                        zzb_sulie: '苏烈',
                        zzb_huamulan: '花木兰',
                        zzb_yeduer: '叶毒儿',
                        zzb_peien: '佩恩',
                        zzb_changmen: '长门',
                        zzb_tushanrongrong: '涂山蓉蓉',
                        zzb_fengbaobao: '冯宝宝',
                        zzb_yunyun: '云韵',
                        zzb_yanlingjishui: '焰灵姬',
                        zzb_yanlingji: '焰灵姬',
                        zzb_yanlingjixin: '焰灵姬',
                        zzb_libai: '李白',
                        zzb_dianwei: '典韦',
                        zzb_shiming: '失名',
                        dong_jiang: '东降',
                        dong_jiang_info: '当你受到伤害时,当你在回合结束弃牌时,你获得等量的东降标记',
                        dong_yi: '东一',
                        dong_yi_info: '锁定技,当你死亡时,你可以弃一层东降标记进行一次判定,如果不为♠️️,你可以回复三点体力并摸一张牌',
                        dong_er: '东二',
                        dong_er_info: '锁定技,当你使用杀时,你可以失去一层东降标记进行一次判定,如果不为♥️️,你则摸一张牌且此杀必中',
                        dong_san: '东三',
                        dong_san_info: '锁定技,当你受到伤害时,你可以弃一层东降标记选择弃置伤害来源一张牌,自己摸一张牌',
                        dong_si: '东四',
                        dong_si_info: '每当你使用锦囊牌时,你可以失去一层东降标记摸一张牌',
                        dong_lin: '东临',
                        dong_lin_info: '①锁定技,当你有东降标记存在时,你获得技能东一、东二、东三、东四.②觉醒技,当你的东降标记≥10时,你失去此技能,获得技能东灭',
                        dong_mie: '东灭',
                        dong_mie_info: '出牌阶段一次,你可以失去三层东降标记,自己流失一点体力再摸一张牌,选择一名角色失去一点体力上限再弃一张牌',
                        qiu_yi: '秋义',
                        qiu_yi_info: '锁定技,当你造成伤害、回合外失去牌时,你获得一个秋义标记',
                        qiuyi_yi: '秋一',
                        qiuyi_yi_info: '一回合一次,你的出牌阶段,你可把一张♥️️当无中生有使用,你失去一层秋义标记',
                        qiu_so: '秋收',
                        qiu_so_info: '你的回合开始前,如果你有秋义标记,你获得技能:秋一、秋二、秋三、秋四,如果你的标记≧5,你流失一点体力上限,获得技能连营、垂钓,之后失去秋收技能',
                        qiuyi_er: '秋二',
                        qiuyi_er_info: '你可以将一张♦️️当过河拆桥使用,你失去一层秋义标记',
                        qiuyi_sa: '秋三',
                        qiuyi_sa_info: '你可以将♣️️当闪使用或打出,你失去两层秋义标记',
                        qiuyi_si: '秋四',
                        qiuyi_si_info: '你可以将♠️️当桃使用或打出,你失去一层秋义标记',
                        fei_ls: '飞雷神',
                        fei_ls_info: '你造成一点伤害可令对方获得一个飞雷神标记,自己也获得一个飞雷神标记',
                        fei_yi: '飞一',
                        fei_yi_info: '飞雷神零段·瞬闪:三回合一次,当你受到伤害前,你可以失去一层飞雷神标记取消此伤害你顺便再回复一点体力',
                        fei_er: '飞二',
                        fei_er_info: '飞雷神第二段:两回合出牌阶段一次,你选择一名有飞雷神标记的角色,令对方受到一点伤害并移除全部飞雷神标记',
                        fei_lin: '飞零',
                        fei_lin_info: '飞雷神超闪光吼旋风第零式:两回合出牌阶段一次,如果你的飞雷神标记≧5,你移除全部飞雷神标记,令有飞雷神标记的角色弃两张手牌和四张装备牌,之后再翻面,场上每有一面角色翻面,你自己摸两张牌',
                        fu_si: '赴死',
                        fu_si_info: '锁定技,击杀你的角色失去一点体力上限,你选择一项:<dr/>①变身替换为叶双儿,摸两张牌,体力调整至3,再获得技能男双、女双,失去技能赴死.<dr/>②变身替换为叶爽儿,摸两张牌,体力调整至4,再获得技能抉择、决择,失去技能赴死',
                        jue_ze: '抉择',
                        jue_ze_info: '锁定技,当你受到伤害后,你进行一次判定:♥️️回复一点体力,♠️️伤害来源流失一点体力,♦️️♣️️摸两张牌',
                        jue_zhe: '决泽',
                        jue_zhe_info: '①当场上有人流失体力后,你获得一层决泽标记②出牌阶段一次,你可以弃一层决泽标记摸两张牌并将体力回满',
                        nan_shuang: '男双',
                        nan_shuang_info: '出牌阶段一次,你可以与一名角色拼点,你赢了则对方失去一点体力上限,你输了则摸2张牌',
                        nv_shuang: '女双',
                        nv_shuang_info: '你回合结束时进行一次判定,红色则获得技能享乐,黑色则获得技能帷幕,之后获得技能刚烈,持续到下个回合开始',
                        mo_kai: '魔铠',
                        mo_kai_info: '当你受到伤害、造成伤害、回复体力、流失体力时,你获得一个魔铠标记<br/>回合开始时,如果你魔铠标记≥6,你变身为铠爹附体状态,再摸一张牌,之后获得技能抵靴、黑器、无尽、宗师、破甲、破军',
                        mokai_a: '抵靴',
                        mokai_a_info: '锁定技,当你有魔铠标记时,你可以跳过你的判断阶段',
                        mokai_b: '黑器',
                        mokai_b_info: '你的非锦囊牌可当杀使用或打出,你失去一层魔铠标记',
                        mokai_c: '无尽',
                        mokai_c_info: '出牌阶段,你可以多打出三张杀',
                        kai_mo: '铠魔',
                        kai_mo_info: '回合结束时,若你魔铠标记≤5,你退出铠爹附体状态,失去六神装技能,摸一张牌',
                        mokai_d: '宗师',
                        mokai_d_info: '一轮一次,当你造成伤害时,你可以弃一层魔铠标记,回复一点体力',
                        mokai_f: '破军',
                        mokai_f_info: '当你使用杀造成伤害后,你可以失去两层魔铠标记令此伤害+1',
                        mokai_e: '破甲',
                        mokai_e_info: '当你使用杀时,你可以失去两层魔铠标记令目标弃一张手牌和两张装备牌',
                        ba_men: '八门',
                        ba_men_info: '锁定技,当你体力变动时,你获得以下效果:<br/>≤5时,你获得技能朝孔雀<br/>≤4时,你获得技能昼虎<br/>≤3时,你获得技能夕象<br/>≤2时,你获得技能夜凯',
                        bamen_c: '夕象',
                        bamen_c_info: '你使用的杀不可被闪',
                        bamen_a: '朝孔雀',
                        bamen_a_info: '你使用杀可以格外指定一名角色',
                        bamen_d: '夜凯',
                        bamen_d_info: '锁定技,一轮一次,当你使用杀造成伤害前,你可以失去两点体力上限令此伤害+2',
                        bamen_b: '昼虎',
                        bamen_b_info: '当场上有玩家死亡时,你增加一点体力上限',
                        ba_buff: '霸幅',
                        ba_buff_info: '当你使用杀和决斗时,你可对目标随机获得一个负面效果.<br/>当你使用闪和酒后,你随机获得一个正面效果',
                        kai_yi: '恺',
                        kai_yi_info: '锁定技,当你累积受到两次伤害后,你下次受伤-1',
                        kai_er: '凯',
                        kai_er_info: '锁定技,当你累积摸两张牌后,你下次摸牌+2',
                        kai_san: '铠',
                        kai_san_info: '锁定技,当你累积回复两点体力后,你下次回复体力时格外回复一点体力',
                        kai_kai: '铠凯恺',
                        kai_kai_info: '锁定技,当你死亡前,你失去一点体力上限,取消死亡并将体力回满',
                        si_zhan: '死战',
                        si_zhan_info: '锁定技,当你失去、增加体力上限时,你摸两张牌并获得一层护甲',
                        leimu_wr: '温柔',
                        leimu_wr_info: '锁定技,回合结束时,你摸两张牌,如果你手中没牌,则改为摸四张',
                        gui_hua: '鬼化',
                        gui_hua_info: '①锁定技,你每受到伤害时,你获得一个鬼化标记.<br/>②锁定技,回合开始和结束时,如果你的鬼化标记=>4,你变身为鬼化状态,你把体力和体力上限调整为6再摸两张牌,且获得技能冰击、锤击、鬼击、化鬼,失去技能温柔、女仆、鬼化',
                        leimu_np: '女仆',
                        leimu_np_info: '出牌阶段一次,你可以选择一名角色获得你两张牌',
                        chui_ji: '锤击',
                        chui_ji_info: '锁定技,当你造成伤害时有三分之一的几率暴击.(暴击伤害为3)',
                        bing_ji: '冰击',
                        bing_ji_info: '出牌阶段一次,你可以弃一张装备牌令一名角色受到一点伤害',
                        gui_ji: '鬼击',
                        gui_ji_info: '两轮出牌阶段一次,你可以失去一层鬼化标记,选择一名角色弃置全部牌并翻面,你摸两张牌并获得一个护甲且翻面',
                        hua_gui: '化鬼',
                        hua_gui_info: '锁定技,回合结束时,你失去一层鬼化标记,当鬼化标记等于零时,你变为普通形态,体力上限调整为3,失去技能冰击、锤击、鬼击,你获得技能温柔、女仆、鬼化,最后你失去此技能',
                        jian_zzcj: '中子冲击',
                        jian_zzcj_info: '锁定技,当你使用杀指定目标时,你可以获得对方一张牌',
                        jian_xxlg: '星屑泪光',
                        jian_xxlg_info: '锁定技,当你使用杀造成伤害后,目标随机废除一个装备区',
                        jian_sctc: '四重痛楚',
                        jian_sctc_info: '锁定技,当你使用杀未命中时,目标弃置一张手牌和一张装备牌',
                        jian_smsm: '圣母圣鸣',
                        jian_smsm_info: '当你成为杀的目标时,对方需进行一次判定,若不为♥️️,对方需弃置一张基本牌,否则此杀无效',
                        beng_shi: '笨失',
                        beng_shi_info: '锁定技,你的防御距离+1',
                        jing_shi: '掠食',
                        jing_shi_info: '锁定技,当你受到伤害时,伤害来源陷入混乱状态,持续到下个回合开始',
                        jue_juefang: '绝对防御',
                        jue_juefang_info: '觉醒技,当你死亡前,你取消死亡,并将体力回满,摸体力量的牌,武将替换为梅普露绝对防御形态,失去所有技能,获得技能坚盾、毒液、掠化、护卫',
                        jue_jijia: '机甲破坏神',
                        jue_jijia_info: '觉醒技,当你体力=1时,你变身为梅普露机甲破坏神,体力回满,失去所有技能,获得技能机甲、机炮、机能',
                        tian_shi: '天使圣御',
                        tian_shi_info: '①锁定技,当场上有人使用桃和无中生有后,你获得一个天使标记.<br/>②觉醒技,当你天使标记≥8时,你变身为梅普露天使圣御形态,失去所有技能,体力调整至5且摸两张牌并回复一点体力,获得技能圣光、圣御、御域、圣怨',
                        jj_jijia: '机甲',
                        jj_jijia_info: '锁定技,属性伤害对你无效',
                        jj_jineng: '机能',
                        jj_jineng_info: '锁定技,当你造成一点属性伤害时,你选择一项:<dr/>①你回复一点体力.<dr/>②摸两张牌',
                        ji_jipao: '机炮',
                        ji_jipao_info: '当你使用火攻指定目标时,目标随机受到一点属性伤害并弃一张装备牌',
                        jf_jiandun: '坚盾',
                        jf_jiandun_info: '锁定技,当你受到伤害后,你获得两个护甲',
                        jf_duye: '毒液',
                        jf_duye_info: '锁定技,当你流失体力时,你将体力回满',
                        jf_luehua: '掠化',
                        jf_luehua_info: '锁定技,当场上有人死亡时,你获得两个护甲再摸体力等数量的牌',
                        jf_huwei: '护卫',
                        jf_huwei_info: '当一名其他角色使用杀指定另一名角色时,你可以把目标改为自己,如此这么做,你摸一张牌',
                        ts_shengguang: '圣光',
                        ts_shengguang_info: '出牌阶段一次,你可以弃一张牌并选择任意名角色进行一次判定:若为♥️️,则回复一点体力,不为♥️️,则摸两张牌',
                        ts_shengyu: '圣御',
                        ts_shengyu_info: '出牌阶段一次,你可以失去一点体力令一名角色获得一个护甲',
                        ts_yuyu: '御域',
                        ts_yuyu_info: '当你受到伤害前,你可以弃一张装备牌取消此伤害',
                        ts_shengjin: '圣尽',
                        ts_shengjin_info: '锁定技,击杀你的角色废除全部装备区且获得技能圣怨',
                        ts_shengyuan: '圣怨',
                        ts_shengyuan_info: '锁定技,你的手牌上限-2',
                        hh_jyzs: '绝缘之手',
                        hh_jyzs_info: '①锁定技,你使用红色杀必中.<dr/>②你防止受到火焰伤害',
                        hh_jyzz: '绝缘之爪',
                        hh_jyzz_info: '锁定技,黑色锦囊牌对你无效且你再摸一张牌',
                        hh_zsxy: '转世续缘',
                        hh_zsxy_info: '锁定技,当你死亡时,你满血复活并增加两点体力上限获得一个护甲,失去所有技能,再获得技能呆萌、呆萌之手',
                        hh_daimeng: '呆萌',
                        hh_daimeng_info: '锁定技,当你受到伤害后,你可以将一张乐不思蜀放入伤害来源的判定区',
                        kkx_qns: '千年杀',
                        kkx_qns_info: '锁定技,当你使用杀造成伤害后,目标进行一次判定,♠️️则流失一点体力上限,不为♠️️则弃一张牌',
                        kkx_tudun: '土遁',
                        kkx_tudun_info: '当你受到伤害前,你可以弃一张装备牌取消此伤害',
                        kkx_fengdun: '风遁',
                        kkx_fengdun_info: '出牌阶段一次,你可以弃一张闪选择一名角色弃一张手牌和一张装备牌',
                        kkx_shuidun: '水遁',
                        kkx_shuidun_info: '当你造成伤害时,你可以弃一张锦囊牌令此伤害+1',
                        shu_xing: '属性',
                        shu_xing_info: '锁定技,摸牌阶段摸牌+1,获得雷切、水遁、土遁、风遁,最后失去此技能',
                        kkx_fuzhi: '复制',
                        kkx_fuzhi_info: '出牌阶段一次,你选择一名角色,随机获得他一个技能,持续到你的回合开始',
                        kkx_leiqie: '雷切',
                        kkx_leiqie_info: '你的杀可附带雷属性',
                        shen_wei: '神威',
                        shen_wei_info: '①当场上有人流失体力上限后,你获得一个神威标记.<dr/>②回合开始时,如果神威标记≥4,你把武将替换为神威卡卡西',
                        zy_sw: '左眼神威·吸收',
                        zy_sw_info: '每两轮出牌阶段一次,你可以弃一张基本牌选择一名角色失去一点体力上限,你翻面',
                        yy_sw: '右眼神威·虚化',
                        yy_sw_info: '当你受到伤害前,你可以翻面取消此伤害.(一轮一次)',
                        sw_ylj: '神威·手里剑',
                        sw_ylj_info: '当你翻面时,你可以选择一名角色分别弃置一张手牌和一张装备牌,你摸一张牌',
                        sw_lq: '神威·雷切',
                        sw_lq_info: '①当你使用杀时,目标弃一张装备牌,装备一个闪电进入判断区(闪电可叠加).<dr/>②雷电伤害对你无效',
                        hh_dmzs: '呆萌之手',
                        hh_dmzs_info: '当其他角色进行判定前,你可以对该角色出一张杀,之后你摸一张牌',
                        luna_pifu: '皮肤',
                        luna_pifu_info: '回合开始时,你随机改变一种皮肤,你每改变一种皮肤摸一张牌',
                        xing_yue: '星月',
                        xing_yue_info: '当你拼点后,你获得一个星月标记',
                        ln_yueguang: '月光',
                        ln_yueguang_info: '出牌阶段一次,你可以与一名角色拼点:<br/>①如果你赢了,对方受到一点伤害且与你交换位置,你摸一张牌,对方再获得一个星月标记和技能月爆.(月爆:锁定技,回合结束时,如果星月标记≥3,你失去一点体力上限,失去此技能.)<br/>②如果你输了,你摸两张牌,你获得一个星月标记',
                        ln_yuedun: '月盾',
                        ln_yuedun_info: '①每两轮出牌阶段一次,你可以弃两层星月标记获得一个护甲.<br/>②锁定技,结束阶段时,如果你的星月标记≥5,你失去全部星月标记,摸标记数量的牌',
                        ln_xingbao: '星爆',
                        ln_xingbao_info: '锁定技,回合结束时,如果你的星月标记≥3时,你失去一点体力上限,失去此技能',
                        hf_motou: '摸头',
                        hf_motou_info: '锁定技,当你受到伤害前,你可以令伤害来源获得一个护甲,再永久失去一点体力上限,随便嘲讽一句.(😜😜😜)',
                        hf_ddbc: '打得不错',
                        hf_ddbc_info: '锁定技,一轮一次,当你造成伤害时,目标失去一点体力上限,但是却要摸自己体力数量的牌,你就可以嘲讽对面一下.(😏😏😏)',
                        hf_haofan: '好烦',
                        hf_haofan_info: '锁定技,当你失去最后一张牌时,你可以吐槽一句,摸两张牌.(😨😨😨)',
                        zzb_wwhc: '万物回春',
                        zzb_wwhc_info: '锁定技:一轮一次,当你回复体力时,你可以格外回复一点体力且令全体角色回复一点体力',
                        zzb_sjrc: '四季如春',
                        zzb_sjrc_info: '锁定技,当场上有人回复体力时,你摸一张牌',
                        chun_tian: '春暖花开',
                        chun_tian_info: '①锁定技,当你死亡时,你取消死亡,回复一点体力且增加一点体力上限再获得两个护甲,获得一个春天标记.<br/>②锁定技,回合开始前,如果你的春天标记≥3时,你直接死亡.<br/>③锁定技,回合结束时,如果你的体力上限≥5,你获得技能百花齐放',
                        zzb_bhqf: '百花齐放',
                        zzb_bhqf_info: '出牌阶段,你可以弃两张装备牌选择一名角色受到一点伤害且弃两张牌',
                        yong_zhuang: '泳装',
                        yong_zhuang_info: '①当你装备武器牌时,你使用杀造成伤害回复一点体力.<br/>②当你装备防具牌时,你受到伤害摸两张牌.<br/>③当你装备防御马时,你摸牌阶段摸牌+1.<br/>④当你装备进攻马时,你回合结束时摸一张牌.<br/>⑤当你装备宝物牌时,你失去最后一张牌你获得一个护甲',
                        xia_tian: '炎夏',
                        xia_tian_info: '锁定技,当你失去装备牌时,你获得一个夏天标记',
                        yan_ri: '炎日',
                        yan_ri_info: '出牌阶段一次,你可以失去一层夏天标记,选择一名角色弃置一张手牌并随机废除一个装备区',
                        xia_ri: '夏日',
                        xia_ri_info: '当你死亡前,你可以弃一张装备牌,取消死亡,且将体力回满',
                        zzb_fenshenshu: '分身术',
                        zzb_fenshenshu_info: '①回合前,你可以选择一名角色使用一张无视距离的顺手牵羊.<br/>②回合结束时,你可以选择一名角色使用一张过河拆桥',
                        zzb_erdaoliu: '二刀流',
                        zzb_erdaoliu_info: '锁定技,你可以格外打出一张杀',
                        zzb_fengrenshu: '风刃术',
                        zzb_fengrenshu_info: '你的装备牌可以当杀使用或打出',
                        zzb_zhiyushu: '治愈术',
                        zzb_zhiyushu_info: '出牌阶段一次,你可以弃一张♠️️牌,选择任意一名角色回复一点体力',
                        ji_du: '嫉妒',
                        ji_du_info: '①锁定技,当场上有人进入濒死状态时,你获得一个嫉妒标记.<br/>觉醒技,当你的嫉妒标记≥5时,你摸两张牌且把武将替换为嫉妒魔女',
                        amly_bjzh: '冰洁之花',
                        amly_bjzh_info: '出牌阶段一次,如果你没有冰洁标记,你可以选择一名角色,目标两回合后失去一点体力上限,你增加一点体力上限',
                        bingjie_zhihua1: '冰洁',
                        bingjie_zhihua1_info: '锁定技,两回合后,你失去一点体力上限',
                        bingjie_zhihua2: '之花',
                        bingjie_zhihua2_info: '锁定技,三回合后,你增加一点体力上限',
                        amly_jl: '精灵',
                        amly_jl_info: '锁定技,当你受到伤害时,如果你的体力上限≥5,你可以失去一点体力上限并摸两张牌,选择一名其它角色获得两个一次性技能.(精灵:当你造成伤害时你需弃置一张牌,否则此伤害无效)',
                        amly_jl1: '精灵1',
                        amly_jl1_info: '锁定技,当你造成伤害时,你需弃置一张牌,否则此伤害无效',
                        amly_pake: '帕克',
                        amly_pake_info: '出牌阶段一次,如果你的体力>你的嫉妒标记,你就可以选择一名角色,你获得它x张牌.(x为体力-嫉妒标记之差,x最多为3)',
                        amly_jidu: '魔女本色',
                        amly_jidu_info: '锁定技,当你的嫉妒魔女标记变动时,你获得以下效果:<br/>①≥3时,回合开始时摸一张牌.<br/>②≥6时,当你受到伤害、回复体力时,你摸已损失体力数量的牌.<br/>③≥9时,当你失去最后一张手牌时,你可以选择一名角色翻面.<br/>④=10时,你失去所有嫉妒标记',
                        jd_mn: '嫉妒魔女',
                        jd_mn_info: '锁定技,回合开始、结束时,你获得一个嫉妒魔女标记.(标记上限为10)',
                        amly_jidu1: '嫉妒1',
                        amly_jidu1_info: '锁定技,当你受到伤害、回复体力时,你摸已损失体力数量的牌',
                        amly_jidu2: '嫉妒2',
                        amly_jidu2_info: '锁定技,当你失去最后一张手牌时,你可以选择一名角色翻面',
                        amly_jdmn4: '嫉妒4',
                        amly_jdmn4_info: '',
                        amly_swhg: '死亡回归',
                        amly_swhg_info: '锁定技,如果你的嫉妒魔女标记≥6,你就不会死亡',
                        amly_jdzy: '嫉妒之源',
                        amly_jdzy_info: '出牌阶段一次,如果你的嫉妒魔女标记≥6,你可以选择一名角色,使其受到x点伤害.(x为嫉妒魔女标记-体力之差,x最多为2)',
                        tr_bd: '拔刀',
                        tr_bd_info: '你可以将一张杀当闪、闪当杀使用或打出',
                        tr_xbqlz: '星爆气流斩',
                        tr_xbqlz_info: '出牌阶段一次,你可以弃两张牌选择一名已受伤的角色,使其受到x点伤害,你回复x点体力,如果目标体力因此为1,你摸y张牌,此技能陷入三回合的冷却时间.(x为目标已损失体力,x最多为3;y为玩家体力-目标体力之差)',
                        tr_sfz: '四方斩',
                        tr_sfz_info: '当你使用杀被闪后,你可以指定一名角色分别弃一张牌,否则你就摸一张牌',
                        tr_edl: '双刀流',
                        tr_edl_info: '锁定技,你的黑色杀无视距离,红色杀无视次数限制',
                        han_bing: '寒冰',
                        han_bing_info: '锁定技,你每使用一张锦囊牌摸一张牌,且获得一个寒冰标记.(标记上限为10)',
                        tsyy_bf: '冰封',
                        tsyy_bf_info: '出牌阶段每三轮限一次,你令全体角色弃一张牌,获得技能冰封',
                        tsyy_bingfeng: '冰封1',
                        tsyy_bingfeng_info: '锁定技,你选择一项:<br/>①跳过摸牌阶段.<br/>②你跳过出牌',
                        tsyy_wjjh: '无尽酒壶',
                        tsyy_wjjh_info: '出牌阶段一次,你可以弃一张装备牌,获得一个酒标记,再摸一张牌.(标记上限为5)',
                        tsyy_zq: '醉拳',
                        tsyy_zq_info: '一轮一次,当你造成伤害时,你可以弃一个酒标记,令此伤害+1',
                        tsyy_jwth: '九尾天狐',
                        tsyy_jwth_info: '觉醒技,回合开始、结束时,如果你的寒冰标记=10且酒标记=5时觉醒,你进入暴怒状态,获得技能醉拳、绝对零度、冰爆',
                        tsyy_jdld: '绝对零度',
                        tsyy_jdld_info: '每两轮出牌阶段一次,你可以弃两个寒冰标记和一个酒标记,选择1-2名角色翻面并各弃一张牌,场上每有一名角色翻面,你摸一张牌',
                        tsyy_bb: '冰爆',
                        tsyy_bb_info: '两轮一次,当其它角色翻面时,你可以弃两个寒冰标记,使其受到一点伤害再流失一点体力',
                        ts_lyc: '蓝银草',
                        ts_lyc_info: '出牌阶段一次,你可以弃一张牌,选择一名角色进入缠绕状态',
                        ts_chanrao: '缠绕',
                        ts_chanrao_info: '锁定技,每当你使用基本牌时,你需弃一张手牌',
                        ts_htc: '昊天锤',
                        ts_htc_info: '当你造成一点伤害时,你可以选择一项:<br/>①伤害+1.<br/>②弃置两张牌',
                        ts_zhongdu: '中毒',
                        ts_zhongdu_info: '锁定技,回合开始时,你进行一次判定,♠️️流失一点体力,不为♠️️,你弃置一张装备牌',
                        ts_aq: '暗器',
                        ts_aq_info: '出牌阶段一次,你可以弃一张♠️️牌,选择一名角色进入中毒状态,对方弃置一张手牌',
                        xlts_ssly: '杀神领域',
                        xlts_ssly_info: '锁定技,你每挥动一次修罗剑,获得一个杀神标记.(标记上限为5)',
                        xlts_sz: '神祗',
                        xlts_sz_info: '锁定技,回合结束时,如果你有杀神标记,你有60%的几率发动,你摸x张牌.(x为杀神标记数,最少为1)',
                        xlts_xlz: '修罗斩',
                        xlts_xlz_info: '限定技:出牌阶段一次,如果你的杀神标记=5,你可以弃置全部标记选择一名角色,使其受到x点伤害,由于修罗斩威力巨大,你周围的角色均流失一点体力,自己进入反噬,流失一点体力,再摸x张牌作为补偿.(x为杀神标记-自己体力之差)',
                        xlts_xlj: '修罗剑',
                        xlts_xlj_info: '锁定技,如果你装备了武器牌,那么你每造成一点伤害可以进行一次判定:♥️️回复一点体力♦️️摸两张牌♣️️目标弃两张牌♠️️目标流失一点体力',
                        xlts_shenpan: '审判',
                        xlts_shenpan_info: '限定技,出牌阶段一次,如果你装备了武器牌,你可以弃两张牌,选择一名体力上限≥3的角色,使其流失两点体力上限,自己获得两个杀神标记',
                        hsts_wdfb: '无定风波',
                        hsts_wdfb_info: '出牌阶段一次,如果你装备了武器牌,你可以选择一名角色随机放置一张兵粮寸断或乐不思蜀进入判定区',
                        hsts_hshh: '海神黄昏',
                        hsts_hshh_info: '锁定技,当你回复体力时,你可令全部角色弃两张手牌',
                        hsts_yqbf: '一去不返',
                        hsts_yqbf_info: '限定技:出牌阶段一次,如果你装备了武器牌,你可以弃一张装备牌,选择一名角色随机受到1-3点伤害',
                        hsts_hzd: '海之盾',
                        hsts_hzd_info: '一轮一次,当你受到伤害时,你可以弃一张手牌,抵挡这次伤害',
                        ys_sg: '圣光',
                        ys_sg_info: '出牌阶段一次,你可以弃一张杀,回复一点体力',
                        ys_sp: '审判',
                        ys_sp_info: '出牌阶段一次,你可以弃一张闪,选择一名角色受到一点伤害',
                        ys_sd: '圣盾',
                        ys_sd_info: '出牌阶段一次,你可以弃一张桃,获得一个护甲',
                        ys_sj: '圣剑',
                        ys_sj_info: '出牌阶段一次,你可以弃一张酒,选择一名角色流失一点体力',
                        ys_ys: '亚瑟',
                        ys_ys_info: '限定技:当你死亡时,你将武将替换为黑暗亚瑟',
                        ys_ha: '黑暗',
                        ys_ha_info: '锁定技,回合开始时,如果你已受伤,你跳过你的摸牌阶段,改为摸你已损失的体力数',
                        ys_qs: '骑士',
                        ys_qs_info: '出牌阶段一次,你可以弃任意张手牌,摸x张牌.(x为你弃的牌)',
                        ys_ah: '暗黑',
                        ys_ah_info: '锁定技,回合结束时,你摸手牌数的牌,最多为4',
                        zzb_jjtl: '究极瞳力',
                        zzb_jjtl_info: '锁定技,①你回合第三轮开始时,你获得技能究极、瞳力.(究极:锁定技,你回合开始时摸一张牌;瞳力:锁定技,每两轮一次,回合结束时,你回复一点体力)<br/>②第五轮开始时,你获得技能反伤.(反伤:锁定技,当你受到伤害、流失体力时,伤害来源受到一点伤害)<br/>③第七轮开始时,你获得技能摸牌.(摸牌:限定技,出牌阶段,你可以令全部角色获得技能弃牌;弃牌:锁定技,摸牌阶段摸牌-1)',
                        zzb_jj: '究极',
                        zzb_jj_info: '锁定技,你回合开始时摸一张',
                        zzb_tl: '瞳力',
                        zzb_tl_info: '锁定技,每两轮限一次,你回合结束时回复一点体力',
                        zzb_fs: '反伤',
                        zzb_fs_info: '锁定技,当你受到一点伤害时,伤害来源受到一点伤害',
                        zzb_mp: '摸牌',
                        zzb_mp_info: '限定技,出牌阶段一次,你可以令除你之外的全部角色获得技能弃牌',
                        zzb_qp: '弃牌',
                        zzb_qp_info: '锁定技,你摸牌阶段摸牌-1',
                        zzb_jjts: '究极瞳术',
                        zzb_jjts_info: '觉醒技,当场上有玩家进入濒死状态时,你将体力上限调整为5,且将体力回满,摸5张牌,失去此技能',
                        zzb_jjhf: '究极好烦',
                        zzb_jjhf_info: '锁定技,当你被横置、翻面时,你取消之,你不能成为延时锦囊牌、拼点的目标,流失体力上限对你无效',
                        xia_yy: '阳炎',
                        xia_yy_info: '「第一式·阳炎」<br/>锁定技,当你使用杀后,你摸一张牌',
                        xia_xf: '旋风',
                        xia_xf_info: '「第四式·旋风」<br/>一轮一次,当你使用杀造成伤害后,你可以立即对目标使用一张杀',
                        xia_ps: '破碎',
                        xia_ps_info: '「第七式·破碎」<br/>出牌阶段每两轮一次,你可以弃一张杀和一张装备牌(以自身武器耐久度为代价),选择一名角色弃置所有装备牌,目标受到一点伤害',
                        xia_xu: '虚',
                        xia_xu_info: '「最初式·虚」<br/>出牌阶段每三轮一次,你可以随机废除一个装备区(大幅度降低武器耐久度),选择一名角色进行一次判定:<br/>①红色则流失一点体力上限.<br/>②黑色则流失一点体力',
                        cym_sw: '死亡',
                        cym_sw_info: '①锁定技,当你死亡时,你取消死亡,回复一点体力,获得一个死亡标记.<br/>②当你死亡标记≥x时,你直接死亡.(x为自己的体力上限+已损失体力值)',
                        cym_hg: '回归',
                        cym_hg_info: '锁定技,当你回复体力时,你改为摸两张牌,且有50%的几率增加一点体力上限',
                        cym_mao: '昴',
                        cym_mao_info: '锁定技,如果你有死亡标记,你的手牌上限为死亡标记数',
                        cym_pt: '普通',
                        cym_pt_info: '锁定技,你不能成为乐不思蜀、兵粮寸断、闪电的目标',
                        dfyc_dzxy: '斗转星移',
                        dfyc_dzxy_info: '「以右为本,再生左边」<br/>出牌阶段一次,你可以弃一张♥️️牌,选择一名角色先受到一点伤害,再回复两点体力,若该角色体力为1,直接回复两点体力',
                        dfyc_yy: '纯质阳炎',
                        dfyc_yy_info: '①锁定技,当你受到杀造成的伤害前,你可以进行一次判定:如果为红色,则此伤害无效.<br/>②锁定技,当你使用杀造成伤害后,你可以进行一次判定:如果为红色,对方则获得一个阳炎标记,再获得技能纯质.(纯质:锁定技,回合结束时,如果阳炎标记≥3,你受到一点火焰伤害,失去全部标记)',
                        dfyc_cz: '纯质',
                        dfyc_cz_info: '锁定技,回合结束时,如果你的阳炎标记≥3,你受到一点火焰伤害,失去全部阳炎标记',
                        dfyc_xk: '虚空之泪',
                        dfyc_xk_info: '①锁定技,当你失去装备牌时,你获得一个虚空标记.<br/>②出牌阶段一次,你可以弃两个虚空标记,选择一名角色受到一点伤害再流失一点体力',
                        mr_lxw: '螺旋',
                        mr_lxw_info: '「螺旋丸」<br/>锁定技,当你使用杀指定目标时,目标弃置一张牌',
                        mr_fs: '分身',
                        mr_fs_info: '「影分身之术」<br/>限定技:出牌阶段,你可以召唤一个分身',
                        mr_sy: '色诱',
                        mr_sy_info: '「色诱术」<br/>出牌阶段一次,你可以弃一张牌,选择一名角色与其交换手牌',
                        mr_xm: '仙鸣',
                        mr_xm_info: '①锁定技,当你受到伤害时,你获得一个仙人标记.<br/>②觉醒技,回合开始、结束时,如果你的仙人标记≥5时觉醒,你把武将替换为仙人模式鸣人(仙鸣)',
                        xm_lxw: '螺旋',
                        xm_lxw_info: '「大玉螺旋丸」<br/>当你使用杀后,目标需弃置两张牌',
                        xm_jm: '仙术',
                        xm_jm_info: '①锁定技,当你失去最后一张手牌时,你回复一点体力,获得一个护甲,再获得一个九尾标记.<br/>②觉醒技,回合开始、结束时,如果你的九尾标记≥4时觉醒,你把武将替换为九尾查克拉模式鸣人(金鸣)',
                        xm_fs: '分身',
                        xm_fs_info: '「仙法·影分身之术」<br/>限定技:出牌阶段,你可以弃一张牌,召唤两个分身.(分身拥有技能)',
                        xm_wy: '蛙印',
                        xm_wy_info: '「仙法·蛙组手」<br/>当你使用杀被闪时,你可以弃一张牌,令目标直接受到一点伤害',
                        jm_lxw: '螺旋',
                        jm_lxw_info: '「花式螺旋丸」<br/>锁定技,当你使用杀后,目标有一般的几率直接受到一点伤害',
                        jm_js: '金身',
                        jm_js_info: '一轮一次,当你受到伤害时,你可以弃一张基本牌,取消此伤害',
                        jm_fs: '分身',
                        jm_fs_info: '限定技:「多重影分身之术」<br/>出牌阶段,你可以召唤四个分身.(分身拥有技能)',
                        xm_lj: '螺剑',
                        xm_lj_info: '「螺旋丸手里剑」<br/>限定技:出牌阶段,如果九尾标记≥2,你可以令全体角色弃一张牌,你摸x张牌.(x为场上的角色数)',
                        mr_hg: '后宫',
                        mr_hg_info: '「后宫之术」<br/>限定技:出牌阶段,如果仙人标记≥3,你可以令全体角色随机废除一个装备区',
                        jm_dx: '多旋',
                        jm_dx_info: '「螺旋多旋丸」<br/>限定技:出牌阶段,如果你体力≤2,你可以令全体角色随机失去1-2点体力上限',
                        jm_sg: '闪光',
                        jm_sg_info: '锁定技,你防御距离+1,进攻距离无限',
                        yl_lm: '拉面',
                        yl_lm_info: '出牌阶段一次,你可以弃一张黑色手牌,选择一名其它已受伤的角色获得一个护甲',
                        yl_cslm: '叉烧拉面',
                        yl_cslm_info: '限定技:出牌阶段,如果你的体力≤2时可发动,你可以失去一点体力上限,选择一名角色增加一点体力上限并回复全部体力再摸两张牌',
                        yl_ld: '六道',
                        yl_ld_info: '①锁定技,你不能成为点数<10杀的目标.<br/>②锁定技,你的手牌上限为5',
                        yl_yc: '隐藏',
                        yl_yc_info: '锁定技,当你体力变动时,你隐藏自己的体力和装备区',
                        yl_qd: '求道',
                        yl_qd_info: '「拉面玉(求道玉)」<br/>简介在技能里面哦!',
                        hz_pf: '皮肤',
                        hz_pf_info: '锁定技,回合结束时,你随机切换一个皮肤,每切换一个皮肤,你摸一张牌',
                        hz_bz: '猴三棒',
                        hz_bz_info: '①锁定技,当你造成伤害后,你获得一个棒子标记再摸一张牌.(标记最多为3)<br/>②锁定技,当你造成伤害时,如果你的棒子标记=3,此伤害+1,失去所有标记',
                        hz_bj: '暴击',
                        hz_bj_info: '锁定技,当你回复体力、造成伤害后,你有20%的几率发动,你直接将体力回满',
                        hz_jg: '金箍',
                        hz_jg_info: '①锁定技,当你受到一点伤害后,你获得一个金箍标记.(标记上限为5)<br/>②出牌阶段一次,你可以弃三个金箍标记,获得一个护甲',
                        hz_md: '魔道',
                        hz_md_info: '觉醒技:当你进入濒死状态时,你获得一个魔道标记,若魔道标记≥4时,你立即变身为魔道孙悟空',
                        md_jgb: '金箍棒',
                        md_jgb_info: '①锁定技,当你使用杀指定目标时,目标需弃置一张装备牌.<br/>②锁定技,你造成的伤害始终+1',
                        md_rm: '入魔',
                        md_rm_info: '锁定技,回合开始时,如果轮数是双数,你流失一点体力上限',
                        md_fk: '疯狂',
                        md_fk_info: '锁定技,你无法受到伤害',
                        md_mq: '魔气',
                        md_mq_info: '锁定技,你的基本牌均视为杀,且你的进攻距离+1',
                        zzb_ng: '孽果',
                        zzb_ng_info: '①锁定技,当你受到一点伤害时,你可以失去一层记果标记,弃置伤害来源一张牌.<br/>②锁定技,当你造成一点伤害时,你可以失去一层记果标记,弃置对方一张牌',
                        zzb_lg: '记果',
                        zzb_lg_info: '锁定技,当你受到伤害、流失体力时,你获得两个灵果标记,当你造成一点伤害时,你获得两个灵果标记.(标记上限为20)',
                        zzb_jieg: '劫果',
                        zzb_jieg_info: '锁定技,回合开始记果标记有x时发动:<br/>①x≥5,回合开始时摸一张牌.<br/>②x≥10时,你获得技能雷果(出牌阶段每五轮一次,你可以弃四个记果标记,选择一名角色受到一点雷电伤害).<br/>③≥15时,你获得技能失果(锁定技,当你使用单体目标牌指定目标时,你可以令其随机获得一个负面效果).<br/>⑤≥20时,你获得技能因果(觉醒技:出牌阶段,你失去所有标记,增加两点体力上限且体力回满再摸两张牌,获得技能铃果).<li><br/>铃果:锁定技,当其它角色失去牌而进入弃牌堆时,你获得其中的非♥️️牌',
                        zzb_leig: '雷果',
                        zzb_leig_info: '出牌阶段每五轮一次,你可以弃四个记果标记,选择一名其它角色受到一点雷电伤害',
                        zzb_sg: '失果',
                        zzb_sg_info: '锁定技,当你使用单体目标牌指定目标后,目标随机获得一个负面效果',
                        zzb_yg: '因果',
                        zzb_yg_info: '觉醒技:回合开始时,如果你记果标记≥20时觉醒,你增加两点体力上限并体力回满再摸两张牌,获得技能铃果.(铃果:锁定技,当其它角色失去牌而进入弃牌堆时,你获得其中的非♥️️牌)',
                        zzb_lingg: '铃果',
                        zzb_lingg_info: '锁定技,当其它角色失去牌而进入弃牌堆时,你获得其中的非♥️️牌',
                        szzb_shoug: '収果',
                        szzb_shoug_info: '锁定技,你进攻距离+2,防御距离-2',
                        hyh_lm: '灵眸',
                        hyh_lm_info: '回合开始时,你可以观看其它玩家们的手牌',
                        hyh_bbx: '冰碧蝎',
                        hyh_bbx_info: '①锁定技,当你成为锦囊牌的目标时,你摸一张牌.<br/>②一轮一次,当你使用锦囊牌造成伤害时,你获得一个护甲',
                        hyh_sl: '死灵',
                        hyh_sl_info: '①锁定技,当场上有角色死亡时,你获得一个死灵标记.<br/>②出牌阶段一次,你可以失去三层死灵标记,将体力回满',
                        hyh_tc: '天蚕',
                        hyh_tc_info: '锁定技,每当你距离1以内的角色成为杀的目标时,如果你的手牌≤你的体力值,你摸一张牌',
                        qxzs_bhht: '冰皇护体',
                        qxzs_bhht_info: '锁定技,当你受到伤害时,你有65%的几率取消此伤害',
                        qxzs_ns: '凝视',
                        qxzs_ns_info: '出牌阶段一次,你可以观看一名其它角色的手牌,从中获取一张非装备牌',
                        qxzs_lhcj: '灵魂冲击',
                        qxzs_lhcj_info: '出牌阶段一次,你可以弃一张手牌,选择一名其它角色弃置一张装备牌,且本回合内非锁定技失效',
                        qxzs_hdzl: '浩东之力',
                        qxzs_hdzl_info: '限定技:出牌阶段一次,你可以选择一名其它角色,令其随机弃置1-2张牌,再流失x点体力值,如此这么做你将自己翻面且横置,再摸已损失体力值的牌.(x为弃置的牌数)',
                        twl_jlw: '金龙王',
                        twl_jlw_info: '锁定技,当你受到伤害后,你随机获得以下一个技能:龙威(英姿)、龙鸣(闭月)、肉身(毅重)、力量(铁骑)、自然之子(连营)、海神(谦逊)、龙神(乱武),当你全部拥有后,失去此技能',
                        twl_jlz: '金龙爪',
                        twl_jlz_info: '锁定技:每两轮一次,当你使用杀或决斗造成伤害时,你可对方摸一张牌,此伤害+1',
                        CCcc: '缔结',
                        CCcc_info: '「缔结geass」<br/>限定技,出牌阶段,你可以弃一张装备牌,选择一名其它角色与你缔结gress,你与缔结gress的玩家于每回合摸牌阶段摸牌+1',
                        CCcc1: '缔结1',
                        CCcc1_info: '锁定技,摸牌阶段摸牌+1',
                        cc_djqy: '缔结契约',
                        cc_djqy_info: '「缔结者的契约」<br/>锁定技,其它角色出牌阶段结束时,你可以摸一张牌或回复一点体力.(每隔六回合发动一次)',
                        cc_code: 'CODE ',
                        cc_code_info: '「CODE的力量」<br/>锁定技,当你进入濒死状态时,你可以对全体角色造成一点伤害,且伤害来源格外受到一点伤害',
                        cc_ba: '被爱',
                        cc_ba_info: '「GEASS被爱」<br/>锁定技,当场上其它玩家脱离濒死状态时,你获得一个护甲且随机摸1-2张牌',
                        zly_xr: '仙人',
                        zly_xr_info: '「蛤蟆仙人」<br/>出牌阶段一次,你可以将一张酒、借刀杀人、五谷丰登、寒冰剑、闪电放置到你武将牌上称为仙(标记),摸一张牌',
                        zly_yl: '毅力',
                        zly_yl_info: '「毅力忍传」<br/>锁定技,每两轮一次,回合开始时,如果仙标记为单数,你获得技能炎弹,若为双数,你获得技能黄泉沼,持续到回合结束.<li><br/>炎弹:出牌阶段一次,你可以弃一张红色牌,令一名角色受到一点火焰伤害.<li>黄泉沼:出牌阶段一次,你可以弃一张黑色牌,令全体角色弃一张牌并横置',
                        zly_yd: '炎弹',
                        zly_yd_info: '出牌阶段一次,你可以弃一张红色牌选择一名其它角色受到一点火焰伤害',
                        zly_hqz: '黄泉沼',
                        zly_hqz_info: '出牌阶段一次,你可以弃一张黑色牌,令全体角色弃一张牌并横置',
                        zly_hj: '豪杰',
                        zly_hj_info: '觉醒技,如果你仙标记≥3时,你觉醒为仙人自来也,你流失一点体力上限,摸两张牌且回复一点体力,获得技能螺旋、仙术.<li><br/>螺旋:锁定技,当你使用杀后,你随机获得一张装备牌.<li>仙术:锁定技,当你使用桃后,你摸一张牌,当你脱离濒死状态时,你回复一点体力',
                        zly_tlzs: '通灵',
                        zly_tlzs_info: '「通灵·屋台崩坏之术」<br/>出牌阶段一次,如果你装备区里有装备牌,你可以进行一次判定:<br/>①红色:目标弃置x张牌,且有三分之一的几率受到一点伤害.(x为你的装备牌数,最多为2)<br/>②黑色:目标弃置x张牌,且有三分之一的几率受到一点伤害,你再弃置全部装备牌.(x为你的装备牌数,最多为2)',
                        zly_xs: '仙术',
                        zly_xs_info: '锁定技,当你使用桃后摸一张牌,当你脱离濒死状态时,你回复一点体力',
                        zly_lx: '螺旋',
                        zly_lx_info: '「仙法·超大玉螺旋丸」<br/>锁定技,当你使用杀后,你随机获得一张装备牌',
                        zzb_pf: '平凡',
                        zzb_pf_info: '锁定技,当你受到一点伤害时,你令伤害来源获得你已损失体力数量的平凡标记.<li><br/>平凡标记:锁定技,摸牌阶段开始前,你需弃置x张卡牌,否则就受到x点伤害,你失去一层平凡标记.(x为平凡标记数)',
                        zzb_pf1: '平凡1',
                        zzb_pf1_info: '锁定技,摸牌阶段开始前,你需弃置x张卡牌,否则就受到x点伤害,你失去一层平凡标记.(x为平凡标记数)',
                        zzb_bf: '不凡',
                        zzb_bf_info: '锁定技,当你使用杀造成伤害前,如果目标有平凡标记,你可以取消此伤害,改为目标弃置两张牌',
                        zzb_ff: '非凡',
                        zzb_ff_info: '锁定技,回合开始时、回合结束时,如果你的手牌<3,你将手牌数补充置3',
                        zzb_cf: '超凡',
                        zzb_cf_info: '限定技:出牌阶段,你可以令全体角色获得x个平凡标记.(x为你的体力值)',
                        zzb_xn: '玄女',
                        zzb_xn_info: '<玄机女神><br/>锁定技,回合结束时,你进行一次判定:若为红色,你摸等体力上限的牌;若为黑色,回复一点体力',
                        xj_gy: '归叶',
                        xj_gy_info: '锁定技,弃牌时,你的锦囊牌不计入手牌上限',
                        xj_yr: '叶刃',
                        xj_yr_info: '当你使用锦囊牌时,你可以指定一名角色,你弃置对方一张牌,如果弃置的不是锦囊牌,你便摸一张牌',
                        blxc_gs: '钩锁',
                        blxc_gs_info: '出牌阶段一次,你可以弃一张手牌,选择一名其它角色令其获得一个钩标记持续到你回合结束,且与其交换位置,如此这么做你可以对其使用一张杀(此杀不计入次数);此回合结束时,如果你已装备了装备牌,你再摸装备数量的牌,最多为2.<li><br/>钩锁标记:当你造成伤害、受到伤害时,拥有钩锁标记的角色需弃置一张牌',
                        blxc_gs2: '钩锁',
                        blxc_gs2_info: '',
                        blxc_kr: '狂热',
                        blxc_kr_info: '锁定技,每当你使用一张基本牌时,你摸一张牌',
                        blxc_xl: '血镰',
                        blxc_xl_info: '锁定技,当你造成伤害后,如果你的体力为1,你摸一张牌,且有五分之一的几率暴击.(暴击摸三张牌)',
                        blxc_my: '梦魇',
                        blxc_my_info: '锁定技:每两轮一次,回合结束时,如果你本回合内击杀过角色,则你可以进行一次格外一个回合',
                        blsy_jm: '静谧',
                        blsy_jm_info: '锁定技,你手牌上限+x.(x为你的装备牌数)',
                        blsy_kf: '狂风',
                        blsy_kf_info: '出牌阶段一次,①你可以弃一张杀,选择一名角色使用一张杀.<br/>②弃两张杀,选择一名角色使用一张无视次数的杀且摸一张牌.<br/>③弃三张杀,选择一名角色使用一张无视次数的杀,且摸一张牌并此伤害+1',
                        blsy_kf1: '狂风',
                        blsy_kf1_info: '锁定技,你下次造成的伤害+1',
                        blsy_mz: '瞄准',
                        blsy_mz_info: '锁定技,♦️️始终视为杀,♣️️始终视为闪',
                        blsy_tt: '逃脱',
                        blsy_tt_info: '一轮一次,当你受到伤害前,你可以弃一张手牌,取消此伤害,并对伤害来源使用一张杀你再摸一张牌',
                        sl_bq: '不屈',
                        sl_bq_info: '限定技,当你死亡时,你取消死亡,你增加x点体力上限且将体力回满并摸体力上限数量的牌,再随机获得一套装备.(x为烽烟标记数)',
                        sl_fy: '烽烟',
                        sl_fy_info: '锁定技,①你每使用一张杀,你获得一个烽烟标记.(标记上限为3)<br/>②当你造成伤害时,如果烽烟标记为3,你可以弃置全部标记选择一项:⒈此伤害+1.⒉目标分别弃一张手牌和装备牌,你摸一张牌',
                        sl_lj: '豪烈万军',
                        sl_lj_info: '限定技:出牌阶段,你可以弃x张牌,令全体角色也弃置x张牌,如果你有烽烟标记,则全部角色再受到y点伤害.(x为弃置的牌数,y为标记数)',
                        hml_dj: '短剑',
                        hml_dj_info: '锁定技,如果你已装备了x个装备牌,你获得以下效果:<br/>①x=1时,你获得技能天妒.<br/>②x=2时,你获得技能连营.<br/>③x=3时,你获得技能谦逊.<br/>④x=4时,你获得技能幻音',
                        hml_cj: '长剑',
                        hml_cj_info: '锁定技,如果你已装备了装备牌,若花色数量为:<br/>①=1时,你获得技能武圣.<br/>②=2时,你获得技能枭姬.<br/>③=3时,你获得技能刚烈.<br/>④=4时,你获得技能不死',
                        hml_zfdf: '绽放刀锋',
                        hml_zfdf_info: '觉醒技:回合开始、结束时,如果你的体力为1时觉醒,你增加一点体力上限并回复两点体力且摸x张牌,再获得技能偃甲、怀柔.(x为装备数)',
                        blxc_gs1: '钩锁',
                        blxc_gs1_info: '',
                        zzb_ds: '毒尸',
                        zzb_ds_info: '出牌阶段一次,你可以弃一张黑色手牌,随机令一名敌方角色获得一个毒',
                        zzb_dshi: '毒师',
                        zzb_dshi_info: '①锁定技,当场上有人流失体力后,你获得一个毒师标记.(标记上限为5)<br/>②出牌阶段一次,如果你的毒师标记≥3时,你可以选择1-3名角色各弃一张牌,你失去x层毒师标记(x为角色数)',
                        zzb_dsh: '赌士',
                        zzb_dsh_info: '①锁定技,当你失去装备牌时,你获得一个赌士标记.(标记上限为5)<br/>②当场上有玩家回复体力后,你可以弃一层赌士标记,进行一次判定:红色则该玩家流失一点体力;黑色则弃一张手牌',
                        zzb_dsi: '睹视',
                        zzb_dsi_info: '①锁定技,当你受到伤害后,你获得一个睹视标记.(标记上限为5)<br/>②出牌阶段一次,如果你睹视标记≥5,你可以失去全部睹视标记,对除你以外的全体角色使用一张元素毁灭,如此这么做如果你的手牌数<3,你便摸一张牌.<li><br/>元素毁灭:令目标弃2张牌,否则就受到2-x点伤害.(x为弃牌数)',
                        pe_wx: '万象天引',
                        pe_wx_info: '①出牌阶段一次,你可以选择一名角色,你获得目标一张手牌.<br/>②锁定技,你进攻距离+1',
                        pe_tz: '神罗天征',
                        pe_tz_info: '①一轮一次,当你受到伤害前,你可以进行一次判定,如果为黑色则此伤害无效,否则伤害来源就弃置两张手牌.<br/>②锁定技,你防御距离+1',
                        pe_tx: '地爆天星',
                        pe_tx_info: '出牌阶段每两轮一次,你可以令全体角色打出一张杀,否则就受到一点伤害,你每造成一点伤害就摸一张牌',
                        pe_pi: '佩恩六道',
                        pe_pi_info: '觉醒技,回合开始、结束时,如果你装备区的装备牌≥4时觉醒,你将武将替换为为长门',
                        cm_td: '天道',
                        cm_td_info: '锁定技,当你在回合外失去牌时,你摸一张牌',
                        cm_rjd: '人间道',
                        cm_rjd_info: '出牌阶段一次,你可以观看一名其它角色的手牌,其中如果有延时锦囊牌,你便获得其中一张',
                        cm_xld: '修罗道',
                        cm_xld_info: '出牌阶段每两轮一次,你可以弃一张装备牌,选择一名角色受到一点伤害',
                        cm_csd: '畜生道',
                        cm_csd_info: '出牌阶段一次,你可以随机获得一张锦囊牌',
                        cm_egd: '饿鬼道',
                        cm_egd_info: '锁定技,当你受到属性伤害时,你取消伤害并改为回复一点体力',
                        cm_dyd: '地狱道',
                        cm_dyd_info: '一轮一次,当场上有玩家进入濒死状态时,如果你正面朝上,你可以将自己翻面,该玩家取消死亡并将体力回满,不过要流失一点体力上限',
                        cm_pi: '佩因六道',
                        cm_pi_info: '锁定技,当你受到伤害后,你获得技能天道、修罗道、人间道、畜生道、饿鬼道、地狱道,失去此技能',
                        cm_wd: '外道轮回',
                        cm_wd_info: '「外道·轮回天生之术」<br/>限定技,出牌阶段,你可以流失一点体力上限选择一名角色复活并增加3点体力上限且体力回满并再摸四张牌',
                        tsrr_dzxy: '斗转星移',
                        tsrr_dzxy_info: '「以右为本,在生左边」<br/>出牌阶段一次,你可以弃一张♠️️牌,选择任意一个受伤的角色回复一点体力,如果该角色体力为1,直接回复2点体力',
                        tsrr_wyz: '望约掌',
                        tsrr_wyz_info: '①望月掌:锁定技,当你使用杀被闪时,如果你的手牌数≤你的体力值,你便摸两张牌.<br/>②忘约掌:锁定技,当你使用杀时,如果你的手牌数>你的体力值,则此杀必中',
                        tsrr_hlzs: '狐念之术',
                        tsrr_hlzs_info: '出牌阶段一次,你可以弃一张手牌,选择一名玩家装备区的一张牌任意移动到一个合理的位置',
                        fbb_csbl: '长生不老',
                        fbb_csbl_info: '①「长生」<br/>锁定技,回合开始前,如果你已受伤,你可以进行一次判定,若为红色你则回复一点体力.<br/>②「不老」<br/>锁定技,回合结束时,如果你的手牌数<3,你摸x张牌.(x为你本回合使用的牌数)',
                        fbb_kd: '坑洞',
                        fbb_kd_info: '锁定技,你的手牌上限-1',
                        fdd_mr: '埋人',
                        fdd_mr_info: '锁定技,当你造成伤害后,你对该角色令其手牌上限-1直到回合结束后',
                        fbb_sbs: '十八式',
                        fbb_sbs_info: '「阿威十八式,全活不打折」<br/>①<老汉推车>锁定技,当你使用杀被闪后(被格挡后),你与该目标都弃置一张手牌,如果因此该目标手牌为0时,<观音坐莲>你对其造成一点伤害.<br/>②<毒龙钻>锁定技,当你造成伤害前,如果目标未受伤,你对其造成中毒效果,持续到该角色回合结束',
                        fbb_dlz: '毒龙钻',
                        fbb_dlz_info: '锁定技,回合开始前进行一次判定,如果不为♠️️,则流失一点体力',
                        yy_fzl: '风之灵',
                        yy_fzl_info: '锁定技,当你造成伤害后,你获得一个风之灵标记,标记上限为4,你每有一层风之灵标记,你手牌上限+x.(x为标记数)',
                        yy_fzj: '风之极',
                        yy_fzj_info: '「风之极·陨杀」<br/>出牌阶段一次,如果你的风之灵标记≥3,你可以选择一名角色弃置x张牌并流失一点体力,如果你的标记数>你的体力值,你便摸y张牌,最后失去三层风之灵标记.(x为标记数,y为标记数-体力值的差)',
                        ylj_hms: '火魅术',
                        ylj_hms_info: '出牌阶段一次,你可以弃一张牌,选择一名其它角色摸两张牌,受到一点伤害',
                        ylj_ss: '似水',
                        ylj_ss_info: '锁定技,击杀你的角色失去一点体力上限且翻面并且手牌上限-1,你选择一名角色使其回复一点体力且摸两张牌,获得你的技能火魅术',
                        ylj_sh: '似火',
                        ylj_sh_info: '锁定技,你造成的伤害均为火焰伤害,并令目标附上灼烧效果',
                        ylj_hy: '灼烧',
                        ylj_hy_info: '',
                        ylj_hlz: '火灵簪',
                        ylj_hlz_info: '锁定技,每当你使用一张非锦囊牌时,你随机获得一张锦囊牌.(每名角色限一次)',
                        lb_jy: '剑意',
                        lb_jy_info: '锁定技,每当你使用一张杀后,你获得一层剑意标记,如果此杀造成伤害后,你格外再获得一个剑意标记.(标记上限为4)',
                        lb_qjj: '将进酒',
                        lb_qjj_info: '锁定技:回合内,每当你使用一张非装备牌你便摸一张牌(最多可摸三次),如果因此发动了三次,你便获得潜行直到下一个回合开始',
                        lb_slzb: '神笔',
                        lb_slzb_info: '「神来之笔」<br/>出牌阶段一次,如果你的剑意标记过半且你没有护甲,你可以弃一张手牌获得一个护甲',
                        lb_ql: '青莲剑歌',
                        lb_ql_info: '出牌阶段一次,如果你的剑意标记≥4,你可以弃置全部剑意标记令全体角色打出一张闪,否则就流失一点体力且弃置一张牌',
                        dw_jn: '激怒',
                        dw_jn_info: '①锁定技,每当你击杀一名玩家,你获得一层激怒标记.<br/>②锁定技,如果你有激怒标记,摸牌阶段摸牌加x.(x为标记数)',
                        dw_hy: '红眼',
                        dw_hy_info: '出牌阶段每两轮限一次,你可以弃一张牌,令下次造成的伤害+1.(不可叠加)',
                        dw_hya: '红眼',
                        dw_hya_info: '',
                        dw_kb: '狂暴',
                        dw_kb_info: '①锁定技,当你受到伤害后,你令全体角色弃置一张牌.<br/>②锁定技,当你造成>1的伤害后,你回复一点体力',
                        dw_sx: '嗜血',
                        dw_sx_info: '限定技:出牌阶段如果你已受伤,你可以进入为五秒男模式,本回合内:你每造成一点伤害可以回复一点体力(最多三次),且无出杀次数,最后流失一点体力上限且摸你已损失体力数量的牌,之后再把体力调整至1,回合结束后,你再获得技能强袭',
                        dw_sxa: '嗜血',
                        dw_sxa_info: '',
                        zzb_sm: '失名',
                        zzb_sm_info: '锁定技,每当你使用一张牌,你获得一个失名标记',
                        zzb_js: '剑神',
                        zzb_js_info: '锁定技,回合内,你随机获得两个技能:集智、狂热/铁骑、铁骑(界);回合外,你随机获得两个技能:强运、天道/刚烈、刚烈(界)',
                        zzb_nt: '逆天',
                        zzb_nt_info: '觉醒技:回合开始前,如果你的无名标记≥30时觉醒,你进入逆天模式,你的势力改为逆且无名标记转换为逆天标记,失去技能无名、剑神,获得技能剑剩,体力上限调整为x且体力回满,如果你的手牌上限<3,你将手牌补充置3.(x为你的体力上限×2)',
                        zzb_jsheng: '剑剩',
                        zzb_jsheng_info: '①当你失去最后一张手牌时,你可以弃一层逆天标记,将手牌补充置体力上限.<br/>②当你造成伤害后,你可以弃两层逆天标记,每满足一个条件,你摸一张牌:⒈如果你的逆天标记≥1,你摸一张牌.⒉如果你的手牌数<逆天标记,你摸一张牌.⒊如果你的体力上限<逆天标记,你摸一张牌.⒋如果你的手牌数>你的装备牌数,你摸一张牌.<br/>③当场上有玩家进入濒死状态时,你可以弃三层逆天标记,令其立即死亡.<br/>④当你死亡前,如果你的逆天标记≥4,你可以弃四层逆天标记,满血复活.<br/>⑤当你造成伤害后,你可以弃五层逆天标记,令目标失去一层体力上限.<br/>⑥当你失去全部逆天标记时,你失去剑剩技能,获得剑神技能',
                    },
                };
                lib.config.all.characters.add('作者包动漫');
                lib.config.characters.add('作者包动漫');
                for (var i in QQQ.character) {
                    QQQ.character[i][4].add(`ext:作者包动漫/image/${i}.jpg`)
                }
                lib.translate['作者包动漫_character_config'] = `作者包动漫`;
                return QQQ;
            });
        },
        help: {
            作者包动漫: '<li>此扩展包原名为动漫,现如今叫作者包动漫,创始于2020年12月27日,此扩展汇集了<火影忍者>、<王者荣耀>、<刀剑神域>、<从零开始的异世界生活>、<因为太怕疼就全点防御了>、<狐妖小红娘>、<斗罗大陆>、<一人之下>以及一些自制武将,扩展强度偏大于官方,若想关闭某个扩展小包,可在相应的武将栏进行关闭,开启也是一样.<br/><li>若发现bug可到无名杀扩展讨论群:984985268进行反馈,无名杀花里胡哨扩展闲聊群:723057104进行反馈,群名——一打七桑(不常驻);私人群:火影——无名杀:868324586进行反馈,群名——好烦(常驻);如果有推荐的动漫人物,可以到私人群里推荐哦!<br/><li>最后,感谢大家对我的支持,祝大家游戏愉快!',
        },
        config: {
            zzbhelp: {
                name: '→→→',
                init: '1',
                item: {
                    1: "<span style='color: #8A2BE2;'>查看介绍",
                    2: "<span style='color: #00FF00;'>作者包动漫,萌新上路,本扩展内含60个武将、1个隐藏武将,后续仍会更新,请大家多多关照",
                    3: "<span style='color: #FFC0CB;'>本次更新,新增了武将<涂山蓉蓉>、<冯宝宝>、<焰灵姬>、<云韵>、<叶毒儿>、<佩恩>、<长门>、<典韦>、<李白>、<失名>,修改了花木兰技能bug漏洞,调整了部分武将强度平衡",
                    4: "<span style='color: #FF0000;'>此扩展强度偏大于官方,请谨慎使用",
                    5: "<span style='color: #8FBC8F;'>更多内容介绍详看:其它→帮助",
                    6: "<span style='color: #00BFFF;'>更新预告:(张楚岚)、(王昭君)、(甄姬)、(小南)、(纲手)、(小舞)、(小舞)、(唐梧桐)、(古月娜)、(未知)",
                    7: "<span style='color: #A9A9A9;'>尽请期待!",
                    8: "<br/><br/><br/><br/><span style='color: #D8DED8;'>更新日记",
                    9: "<span style='color: #000000;'>2020年12月27日(1.0)</span><li><span style='color: #808080;'>开始有了灵感,开始制作,扩展名作者包动漫,初始武将有叶东儿、叶秋儿、叶琪儿、波风水门",
                    10: "<span style='color: #000000;'>2021年1月10日(1.1)</span><li><span style='color: #808080;'>新增了武将铠爹、凯皇、恺神",
                    11: "<span style='color: #000000;'>2021年1月14日(1.2)</span><li><span style='color: #808080;'>新增了武将蕾姆、亚丝娜、梅普露",
                    12: "<span style='color: #000000;'>2021年1月17日(1.3)</span><li><span style='color: #808080;'>新增了武将卡卡西、神威·卡卡西、露娜、叶春儿、叶夏儿、涂山红红、好烦",
                    13: "<span style='color: #000000;'>2021年1月30日(1.4)</span><li><span style='color: #808080;'>新增了武将涂山雅雅、莎莉、艾米莉亚、嫉妒魔女、唐三、海神·唐三、修罗神·唐三、光明亚瑟、黑暗亚瑟",
                    14: "<span style='color: #000000;'>2021年2月7日(1.5)</span><li><span style='color: #808080;'>新增了武将东方月初、霞、菜月昴、叶铃儿、孙悟空、魔孙悟空、霍雨浩、情绪之神、唐舞麟、大筒木好烦、大筒木一乐、漩涡鸣人、仙鸣、金鸣",
                    15: "<span style='color: #000000;'>2021年2月13日(1.6)</span><li><span style='color: #808080;'>新增了武将C.C、自来也、花木兰、苏烈、百里守约、百里玄策、叶凡、少司命",
                    16: "<span style='color: #000000;'>2021年2月19日(1.7)</span><li><span style='color: #808080;'>新增了武将失名、冯宝宝、云韵、焰灵姬、涂山蓉蓉、叶毒儿、佩恩、长门、典韦、李白",
                },
            },
        },
        package: {
            intro: "<span style='color: #FFA500;'>写在前面的话:<span style='color: #FFFF00;'>写点啥呢？啊啊啊～好烦,既然没啥好写的,就请你们自行体会吧!😒😉😏<br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br></span>",
            author: "【<span style='color: #0000AD;'>萌新</span><span style='color:'00CED1;'>——</span><span style='color: #00FFFF;'>好烦</span>】<br/><span style='color: #87CEFA;'>当前版本:1.7.2</span>",
            version: '1.7.2',
        },
    };
});
