//大事记录：20240505起，因无名杀官方出了台词函数功能，本扩展自定义的台词函数可以不再更新台词部分，但编程、配音、设计信息需继续更新。
'use strict';
window.jyimport(function (lib, game, ui, get, ai, _status) {
    lib.arenaReady.push(function () {
        if (lib.rank) {
            //废将
            lib.rank.rarity.junk.addArray([]);
            //精品
            lib.rank.rarity.rare.addArray(['tlbb_cuibaiquan', 'sdxl_shendiao', 'sdyx_qiuchuji', 'sdyx_duantiande', 'sdyx_qiuqianren', 'sdyx_zhoubotong', 'sdyx_ouyangfeng', 'sdyx_zhebie', 'xajh_shangguanyun', 'xajh_pingyizhi', 'xajh_tianboguang', 'xajh_zhuqianqiu', 'xajh_laodenuo', 'xajh_moda', 'xajh_yanglianting', 'ywhy_spzhanzhao', 'ywhy_qiumoyan', 'ywhy_fangshiyu', 'ywhy_yewen', 'qtpz_fanli', 'qtpz_sangjielama', 'qtpz_luobing', 'qtpz_zhangzhaozhong', 'qtpz_wusangui', 'qtpz_niujinxing', 'qtpz_chenjialuo', 'qtpz_dindian', 'qtpz_wenqingqing', 'qtpz_wentailai', 'qtpz_hongniangzi', 'qtpz_fengjizhong', 'qtpz_meiniansheng', 'qtpz_diyun', 'qtpz_songxiance', 'qtpz_chenjinnan', 'qtpz_xuanye', 'qtpz_yuanchengzhi', 'qtpz_xieyanke', 'qtpz_ajiu', 'qtpz_yuyutong', 'qtpz_jyliyan', 'qtpz_miaorenfeng', 'qtpz_haidafu', 'qtpz_weizhongxian', 'yttl_fanyao', 'yttl_jixiaofu', 'yttl_yudaiyan', 'yttl_guoxiang', 'yttl_weiyixiao', 'yttl_spxuanmingerlao', 'yttl_yangbuhui', 'yttl_chenyouliang', 'yttl_hanqianye', 'yttl_changyuchun', 'yttl_changbaoshu', 'yttl_jinhuapopo', 'yttl_due', 'sdxl_gongsunzhi', 'tlbb_spjiumozhi', 'tlbb_youtanzhi', 'tlbb_murongbo', 'tlbb_quanguanqing', 'tlbb_muwanqing', 'tlbb_xiaofeng', 'tlbb_daobaifeng', 'tlbb_liqinglu', 'tlbb_qinhongmian', 'tlbb_suxinghe', 'tlbb_yuelaosan', 'tlbb_zhongling', 'tlbb_ganbaobao', 'tlbb_tianshantonglao', 'tlbb_xiaoyuanshan', 'tlbb_xuanciyeerniang', 'tlbb_madayuan', 'tlbb_baobutong', 'tlbb_huangmeiseng', 'tlbb_xuzhuliqinglu']);
            //史诗
            lib.rank.rarity.epic.addArray(['ywhy_dongtianbao', 'qtpz_wanzhenshan', 'yttl_zhangwujizhaomin', 'ldj_sufeiya', 'yttl_dudajin', 'qtpz_zhangsanlisi', 'ywhy_liyuanfang', 'ywhy_wusong', 'ywhy_lianxing', 'xajh_qufeiyan', 'yttl_dingminjun', 'sdyx_nanxiren', 'sdxl_wudunruwuxiuwen', 'sdyx_wangchongyang', 'xajh_jiangnansiyou', 'sdyx_hanbaoju', 'sdyx_quanjinfa', 'qtpz_hehongyao', 'yttl_yulianzhou', 'yttl_zhangsongxi', 'xajh_liangfa', 'sdxl_daerba', 'yttl_xinran', 'qtpz_goujian', 'qtpz_zhaobanshan', 'ldj_weichunhua', 'sdxl_luzhanyuan', 'qtpz_hongli', 'yttl_hanliner', 'ywhy_guxizhao', 'yttl_moshenggu', 'xajh_ningzhongze', 'sdyx_liping', 'sdxl_zhenzhibing', 'ldj_pangshoutoutuo', 'sdyx_zhucong', 'ldj_mujianpin', 'sdyx_sp_huangrong', 'sdyx_jue_guojing', 'sdyx_duanzhixin', 'sdyx_munianci', 'sdyx_tuolei', 'sdyx_meichaofeng', 'sdyx_yangkang', 'sdyx_huangrong', 'sdyx_guojing', 'sdyx_spguojing', 'sdyx_huangyaoshi', 'xajh_dongfangbubaiyanglianting', 'xajh_spdongfangbubai', 'xajh_renyingying', 'xajh_zuolengchan', 'xajh_yuelingsan', 'xajh_ludayou', 'xajh_dongfangbubai', 'ywhy_zhanzhao', 'ywhy_zhouhuaian', 'ywhy_huangfeihong', 'ywhy_luxiaofeng', 'ywhy_yaoyue', 'ywhy_baozheng', 'qtpz_shuanger', 'qtpz_hongantong', 'qtpz_muzhuolun', 'qtpz_huoayi', 'qtpz_yuanzhiyi', 'qtpz_xiaxueyi', 'qtpz_wuchendashi', 'qtpz_liyuanzhi', 'qtpz_chengbenzhi', 'qtpz_chenglingsu', 'qtpz_aobai', 'qtpz_wuzixu', 'qtpz_aqing', 'yttl_yintianzheng', 'yttl_songyuanqiao', 'yttl_yuanzhen', 'yttl_xiaozhao', 'yttl_xiexun', 'yttl_yinyewang', 'yttl_spyangdingtian', 'yttl_zhouzhiruo', 'yttl_daiqisi', 'yttl_zhangcuishan', 'yttl_songqingshu', 'yttl_miejue', 'yttl_luhe', 'yttl_yinliting', 'yttl_yinli', 'yttl_zhuyuanzhang', 'yttl_yangxiao', 'yttl_changbaisanqin', 'sdxl_guofuX', 'sdxl_qiuqianchi', 'sdxl_spguoxiang', 'sdxl_mengge', 'sdxl_jinlunfawang', 'sdxl_xiaolongniv', 'tlbb_yelvhongji', 'tlbb_spazi', 'tlbb_ruanxingzhu', 'tlbb_murongfu', 'tlbb_dingchunqiu', 'tlbb_yunzhonghe', 'tlbb_zhongling', 'tlbb_duanyu', 'tlbb_qiaofeng', 'tlbb_xuemuhua', 'tlbb_spxuzhu', 'tlbb_kangmin', 'tlbb_liqingluo', 'tlbb_yeerniang', 'tlbb_baishijing', 'tlbb_azhi', 'ywhy_nieyinniang']);
            //传说
            lib.rank.rarity.legend.addArray(['xajh_xie_renwoxing', 'ywhy_niefeng', 'ywhy_xiongba', 'ywhy_sudaji', 'ywhy_songci', 'ywhy_zhaopan', 'ywhy_liangxiao', 'qtpz_shuisheng', 'sdyx_juehuangyaoshi', 'ywhy_hongfunv', 'ywhy_lengxue', 'qtpz_yuanchengzhiwenqingqing', 'sdyx_wanyankang', 'qtpz_murenqing', 'ldj_ake', 'xajh_dingxianshitai', 'sdxl_gongsunlve', 'yttl_juezhangsanfeng', 'sdyx_spmeichaofeng', 'ywhy_hongmao', 'tlbb_jue_damo', 'xajh_sp_tianboguang', 'ywhy_zhizunbao', 'ywhy_xiaowei', 'yttl_huangshannv', 'xajh_wumingtaijian', 'ywhy_taisen', 'ywhy_nezha', 'ywhy_xiangshaolong', 'ldj_wuyingxiong', 'ywhy_zhuiming', 'sdyx_chenxuanfeng', 'ywhy_mengxinghun', 'yttl_zhoudian', 'ywhy_lixunhuan', 'sdyx_jue_huangshang', 'sdxl_spyangguo', 'xajh_feibin', 'xajh_fengqingyang', 'ywhy_baozupo', 'ywhy_abao', 'ywhy_boya', 'ywhy_baisuzheng', 'sdxl_fengmofeng', 'ywhy_ganshijiumei', 'ldj_weixiaobaojianning', 'ywhy_honghaier', 'sdyx_baoxiruo', 'sdxl_jue_duguqiubai', 'tlbb_spwangyuyan', 'ywhy_qingmin', 'sdyx_yuefei', 'sdyx_spyinggu', 'sdyx_sphuangyaoshi', 'sdyx_wanyanhonglie', 'sdyx_tiemuzhen', 'sdyx_kezhene', 'sdyx_yinggu', 'sdyx_hongqigong', 'sdyx_jue_hongqigong', 'sdyx_ouyangke', 'sdyx_fengheng', 'sdyx_huazheng', 'xajh_liuzhengfengquyang', 'xajh_taoguliuxian', 'xajh_lanfenghuang', 'xajh_yucanghai', 'xajh_yilin', 'xajh_tianmendaozhang', 'xajh_linpingzhi', 'xajh_linghuchong', 'xajh_yuebuqun', 'xajh_renwoxing', 'xajh_linghuchongrenyinyin', 'ywhy_xiaoyuer', 'ywhy_yuhuatian', 'ywhy_chuliuxiang', 'ywhy_shenglian', 'ywhy_baiyutang', 'ywhy_huawuque', 'ywhy_suqier', 'ywhy_lixiaolong', 'ywhy_zhangqiling', 'ywhy_jiushu', 'ywhy_hubayi', 'ywhy_wuxie', 'ywhy_jinyong', 'qtpz_shipotian', 'qtpz_huyidao', 'qtpz_maodongzhu', 'qtpz_lintuisi', 'qtpz_duoergun', 'qtpz_lizicheng', 'qtpz_wangchengen', 'qtpz_huoqingtong', 'qtpz_zengrou', 'qtpz_pingasi', 'qtpz_jianninggongzhu', 'qtpz_hufei', 'qtpz_weihutou', 'qtpz_weixiaobao', 'qtpz_tianguinong', 'qtpz_kasili', 'qtpz_huatiegan', 'qtpz_zhuyoujian', 'qtpz_xuedaolaozhu', 'qtpz_xishi', 'qtpz_suquan', 'yttl_zhujiuzhenwuqingying', 'yttl_spsongyuanqiao', 'yttl_zhuchangling', 'yttl_wujincao', 'yttl_yintianzheng', 'yttl_doujiushenseng', 'yttl_huqingniu', 'yttl_zhaomin', 'yttl_jueyuandashi', 'yttl_yinsusu', 'yttl_spzhouzhiruo', 'yttl_zhangwuji', 'yttl_zhangsanfeng', 'sdxl_guopolu', 'sdxl_zhaozhijin', 'sdxl_limochou', 'sdxl_chengying', 'sdxl_yangguo', 'sdxl_guojinghuangrong', 'sdxl_yangguoxiaolongnv', 'sdxl_hubilie', 'tlbb_juexiaofeng', 'tlbb_jue_tianshantonglao', 'tlbb_jiumozhi', 'tlbb_wuyazi', 'tlbb_saodiseng', 'tlbb_muronglongcheng', 'tlbb_sptianshantonglao', 'tlbb_duanzhengchun', 'tlbb_zhaixingzi', 'tlbb_liqiushui', 'tlbb_xuanci', 'tlbb_xuzhuzi', 'tlbb_qiaofengazhu', 'tlbb_spduanyu', 'tlbb_duanyanqing', 'tlbb_azhu', 'tlbb_wangyuyan', 'tlbb_xie_murongfu']);
        }
    });
    //统一定制角色资料格式的代码
    var createIntro = function (des, sj, bc, py, tc) {
        var pre = '<img style=width:600px src=';
        var path = 'extension/金庸群侠传/image/label/';
        var png = '.png><br>';
        var bl = '<br><br>';
        var peh = pre + path;
        return peh + 'xz' + png + '&nbsp;&nbsp;&nbsp;&nbsp;' + des + bl + peh + 'sj' + png + sj + bl + peh + 'bc' + png + bc + bl + peh + 'py' + png + py + bl + peh + 'tc' + png + tc;
    };
    //createIntro("暂无武将描述","大小熊猫","落影","稳得高处","暂无台词");
    var createTaici = function (tc) {
        var pre = '<img style=width:28px src=';
        var path = 'extension/金庸群侠传/image/xingji/';
        var png2 = 'line2.png><font size = 20px>';
        var inn = '</font>';
        var pre2 = '<img style=width:248px src=';
        var png = 'line1.png>';
        var bl = '<br><br>';
        var peh = pre + path + png2;
        var peh2 = inn + pre2 + path + png;
        var cob = function (sy) {
            return peh + sy[0] + peh2 + sy[1];
        };
        tc = tc.replace(/<b>【/g, '#');
        tc = tc.replace(/】<\/b>/g, '@');
        var arr = tc.split('#');
        if (arr[0] == '') arr.splice(0, 1);
        var str = '';
        for (var i = 0; i < arr.length; i++) {
            var arr2 = arr[i].split('@');
            str += cob([arr2[0], arr2[1]]);
        }
        return str + bl;
    };
    //"ywhy_boya":createTaici("<b>【摄命】</b><br>无敌旋风，夺魂索命！<br>草菅人命，法不容情！<br><br><b>【追踪】</b><br>尔等宵小之辈，哪里逃！<br>你已死路一条，还不束手伏法？<br><br><b>【阵亡】</b><br>得之我幸，失之我命……"),
    var createIntroAndTaici = function (name, des, sj, bc, py, tc) {
        lib.characterTaici = lib.characterTaici || {};
        lib.characterIntro[name] = createIntro(des, sj, bc, py, tc);
        lib.characterTaici[name] = createTaici(tc);
    };
    //角色信息清单
    //模板createIntroAndTaici("ywhy_hongmao","暂无资料","大熊小猫","落影逝尘","配音演员","<b>【技能】</b><br>暂无台词！<br>暂无台词！<br><br><b>【技能】</b><br>暂无台词！<br>暂无台词！<br><br><b>【技能】</b><br>暂无台词！<br>暂无台词！<br><br><b>【阵亡】</b><br>暂无台词……<br><br><br><br>");
    //天龙八部
    createIntroAndTaici('tlbb_jue_xuzhu', '虚竹本是少林寺的一名籍籍无名的小和尚，下山发请帖的时候，无意间破解了无崖子布下的珍珑棋局，从此他的人生便发生了翻天覆地的改变。尤其是在遇到天山童姥之后，少林寺的那些戒律清规全都被迫破除。他一心只想缘求佛法，但最终求而不得，凡间的这花花世界老天都注定要让他遍览一番。最终携爱妻李清露隐居在天山灵鹫宫。', '大熊小猫', '霸天', 'DZ', '<b>【逍遥】</b><br>逍遥堪自乐，浩荡信无忧。<br>追风赶月莫停留，平芜尽处是春山！<br><br><b>【冥海】</b><br>一点灵光彻太虚，万物相从归一理。<br>色身当自轮回来，万相皆空入冥海。<br>无穷般若心自在，语默动静体自然。 <br>大乘寂灭时，幻海现佛宗。<br><br><br><br><b>【死亡】</b><br>众生皆苦，有缘皆孽……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_heliantieshu', '赫连铁树是小说《天龙八部》中的角色，西夏国官封征东大将军，统率西夏一品堂。赫连铁树带领一品堂中勇士，出使汴梁，表面朝聘，意在窥探虚实，企图伺机侵略大宋。<p>白世镜低声道：“正是如此。凡是进得‘一品堂’之人，都号称武功天下一品。统率一品堂的是位王爷，官封征东大将军，叫做什么赫连铁树。据本帮派在西夏的易大彪兄弟报知，最近那赫连铁树带领馆中勇士，出使汴梁，朝见我大宋太后和皇上。其实朝聘是假，真意是窥探虚实。他们知晓本帮是大宋武林中一大支柱，想要一举将本帮摧毁，先树声威。再引兵犯界，长驱直进。”徐长老暗暗心惊，低声道：“这条计策果然毒辣得紧。”', '大熊小猫', '霸天', '二空', '<b>【环伺】</b><br>高昌、回鹘、凉州，皆我大夏之疆！<br>河西一路，可北拒大辽，南抗吐蕃！<br><br><b>【虎眈】</b><br>祁山无粮之地，汉人岂可久守？<br>攻下玉门关，万里沃土，唾手可得！<br><br><br><br><b>【阵亡】</b><br>内失政理，外丧战机，吾空有良谋……<br><br><br><br>');
    createIntroAndTaici('tlbb_wangjiantong', '汪剑通是丐帮前任帮主，绰号剑髯。年轻时，因收到虚假信息，在带头大号的号召下一同前往雁门关截杀到少林偷取武功秘籍的契丹武士，经过一场伤亡无数的血战，误杀了大辽珊军总教头萧远山。为了弥补过失，将萧远山的遗孤乔峰送给汉人夫妇抚养，后来更是培养乔峰成为丐帮新任接班人。但乔峰契丹人的身份始终令他忧心忡忡，提前谋划好了应对计划，给副帮主马大元留下遗信，信中嘱托，如果乔峰亲辽叛宋，丐帮上下必当合力诛杀。', '吃饱睡睡醒吃', '霸天', '薛晨鸭', '<b>【血役】</b><br>寸心寸忧寸血泪，寸疆寸土寸河山！<br>一呼百应筑边关，抛泪洒血铸英魂！<br><br><b>【误杀】</b><br>血战雁门征夫泪，多少憾事未可知！<br>风合黄草掩白骨，霜摧红叶映残阳！<br><br><b>【绸缪】</b><br>非我族类，其心必异！<br>乔峰乃契丹遗血，一举一动需倍加监视！<br><br><b>【遗信】</b><br>乔峰若起异心，丐帮上下当倾力诛之！<br>事关宋辽两国杀伐，汝当守口如瓶！<br><br><b>【阵亡】</b><br>胡汉恩仇英雄泪，雁门边声葬忠魂……<br><br><br><br>');
    createIntroAndTaici('tlbb_duanyanqing_new', '段延庆本是大理国太子，受到奸臣迫害流亡。后遭强仇围攻，面目全毁，双腿残废，仅能用腹语交流。本欲寻死，但由于和刀白凤的露水情缘，重拾信念。伤势回复后，疯狂报复当年追杀过他的人。因手段残忍，获得恶贯满盈称号，成为四大恶人之首。一心想夺回帝位，最后竟然发觉将要继承皇位的段誉是他的亲生儿子，在得段誉默认他为父之后此生再无积郁，飘然而去。', '吃饱睡睡醒吃', '霸天', 'DZ', '<b>【腹语】</b><br>腹语控神魂，奇功缚佛心！<br>血债封七窍，仇海闭五音！<br><br><b>【控魂】</b><br>窃国之耻、断足之恨，你，准备好偿还了吗？<br>定要你拱手奉上，朕的每一寸江山！<br><br><b>【风月】</b><br>落魄王孙，怎消受，杨枝玉露！<br>天龙寺外，菩提树下。化子邋遢，观音长发！<br><br><b>【阵亡】</b><br>神器……终归我手，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('tlbb_xie_zhuangjuxian', '庄聚贤又名游坦之，聚贤庄少庄主，丐帮第十代帮主，是金庸笔下命运最悲苦的角色之一，父母双亡，在复仇路上，痴恋残忍歹毒的阿紫而被套上铁头，成为毁容的奴隶，误入歧途。阿紫练化功大法，贱待他的性命。偶然机会下练就冰蚕毒掌成为绝世高手，武功威力几可与萧峰和虚竹平手。后化名庄聚贤，成为丐帮帮主。阿紫瞎了眼睛，他就把自己双眼换给阿紫治眼。最后阿紫不想欠他人情，还他双眼，并抱着萧峰的尸体跳崖，游坦之也跟着跳崖，为了孽情落得悲剧人生。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【冰蚕】</b><br>草木残生颅铸铁，虫豸凝寒掌作冰！<br>极阴之毒，摧经腐脉！<br><br><b>【邪妄】</b><br>邪魔已蚀骨，甘为护花狂！<br>护花多危情，愿屈男儿膝！<br><br><b>【傀伪】</b><br>摆布由人甘傀儡，浮沉一世作痴聋！<br>阿紫姑娘喜欢大英雄，我要做大英雄！<br><br><b>【阵亡】</b><br>我的命，都是姑娘的……<br><br><br><br>');
    createIntroAndTaici('tlbb_xie_dingchunqiu', '丁春秋是逍遥派的弟子，后来背叛师父无崖子，将无崖子打下悬崖，为了寻找逍遥派的武功秘籍，在西域创立星宿派。丁春秋不仅武功高强，并且极擅用毒。门下弟子称其为“星宿老仙”，江湖中人不耻其行径而称之为星宿老怪。练就一身阴毒武功，其中化功大法以剧毒化解他人内力，武林人士对此最为痛恨。星宿派独门暗器之多、毒药之猛更是人见人惧。后来在少室山武林群雄大会中和虚竹交战，被虚竹用生死符制住，终生囚禁于少林寺。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【尸毒】</b><br>神功控魂，剧毒腐心！<br>世人皆惧断肠物，不见最毒在人心！<br><br><b>【化功】</b><br>奇毒入筋脉，妙法化神功！<br>化功大法法无边，奇毒异蛊蛊人心！<br><br><b>【神鼎】</b><br>星宿宝鼎纳百毒，老仙神功破万诀！<br>万毒加身，见血封喉！<br><br><b>【阵亡】</b><br>施毒害人一世，终究毒上己身……<br><br><br><br>');
    createIntroAndTaici('tlbb_wulaoda', '乌老大是灵鹫宫下属的三十六洞七十二岛的其中一名首脑，被天山童姥以生死符控制。在谋反童姥的万仙大会任首领。趁童姥返老还童不备之际将其捉下山来。后在追杀救走童姥的虚竹途中被迫吃下断筋腐骨丸。其后继续率众攻打缥缈峰，被新任宫主的虚竹以德报怨解除生死符剧毒，从此乌老大率从归附虚竹。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【符毒】</b><br>这生死符，犹如附骨之疽！<br>断筋腐骨，生不如死！<br><br><b>【除疖】</b><br>诸位掌门，随我杀上灵鹫宫！<br>三十六洞天罡聚，七十二岛地煞集！<br><br><b>【绿刀】</b><br>绿波乍现，夺魂索命！<br>香露初凝，剧毒封喉！<br><br><b>【阵亡】</b><br>虚竹宫主宅心仁厚，小人愿誓死相从……<br><br><br><br>');
    createIntroAndTaici('tlbb_kurongdashi', '枯荣大师是大理国皇室宗亲，年轻时在天龙寺出家，武功极高，德高望重，掌有六脉神剑剑谱。吐蕃国师鸠摩智来天龙寺抢夺六脉神剑剑谱时，众僧研习六脉剑阵，枯荣大师分练拇指少商剑。为了大理国与吐蕃不起战端，故在将六脉神剑传于段誉后，使用一阳指功力将六脉神剑剑谱烧毁。', '大熊小猫', '霸天', '末生', '<b>【枯荣】</b><br>有常无常，双树枯荣！<br>南北西东，非假非空！<br><br><b>【少商】</b><br>剑意斜疏，石破天惊！<br>剑气纵横，风雨骤至！<br><br><b>【焚谱】</b><br>六脉神剑已作灰烬，大轮明王，请回罢！<br>焚经护国，天龙寺与大理国共存亡！<br><br><b>【阵亡】</b><br>双树入灭，涅槃本相，常乐我净……<br><br><br><br>');
    createIntroAndTaici('tlbb_zhaoqianshun', '赵钱孙是金庸《天龙八部》及其衍生作品中的人物，曾参与在雁门关伏击契丹高手萧远山，因看到好友在与萧远山激战时的惨死，竟然当场吓晕，从此如同行尸走肉，隐姓埋名，自称赵钱孙，帮不知其真实姓名。虽然赵钱孙胆小懦弱，但他对待朋友肝胆相照，宁死也不肯吐露带头大哥的身份。', '大熊小猫', '棉花糖', '愛の名で', '<b>【埋名】</b><br>已死之人，无名无姓！<br>赵钱孙李周吴郑，天地玄黄宇宙洪！<br><br><b>【文过】</b><br>两国交兵，暗施偷袭，何错之有！<br>宋辽争战，互相杀伐，不足为奇！<br><br><b>【隐姓】</b><br>百劫余生，走肉行尸！<br>树上死人能复走，谷底白骨难再言！<br><br><b>【阵亡】</b><br>你！你……还活着……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuanku', '玄苦是《天龙八部》中的少林高僧，方丈玄慈的师兄。雁门关一役后，年幼的乔峰被送给乔三槐夫妇抚养，玄苦便承担起乔峰的授业恩师。后来，玄苦被萧远山假扮的乔峰偷袭，一掌震得五脏剧裂而亡。令人遗憾的是，玄苦至死都以为杀他的凶手是自己的爱徒萧峰。', '大熊小猫', '霸天', '路边奇石', '<b>【燃木】</b><br>炽火燃木，不着一刀！<br>锋燧燃枯树，刃风偃蒲草！<br><br><b>【授业】</b><br>长江后浪推前浪，雏凤清于老凤声。<br>万般业障皆随我，愿得赤子长无忧！<br><br><b>【凶影】</b><br>往昔宿因所种，如今该当有此业报！<br>我不入地狱，谁入地狱？<br><br><b>【阵亡】</b><br>阿弥陀佛……');
    createIntroAndTaici('tlbb_xie_murongfu', '慕容复出身姑苏慕容世家，风度翩翩，文武双全，机警多智。祖先是十六国时期进入中原建立燕国的鲜卑慕容氏。作为没落的皇室贵冑，被取名为复，时时提醒自己复国称帝。可他刚愎自用、心胸狭隘，不具备领导才能，他的理想与壮志注定淹没在历史的长河中。', '大熊小猫', '霸天', '彻君', '<b>【彼道】</b><br>贤才广纳，良将入麾！<br>收揽人心，以为己助！<br><br><b>【执念】</b><br>图谋大业﹐光宗复国！<br>身登大宝﹐开国中兴！<br><br><b>【心魔】</b><br>碍我大业者，当死无赦！<br>但求兴复，无不可为。<br><br><b>【倾覆】</b><br>奔波碌碌，兴复之望渺茫！<br>人谋有尽，岂能逆转大势！<br><br><b>【阵亡】</b><br>联乃大燕皇帝，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('tlbb_yelvnielugu', '耶律涅鲁古是《天龙八部》中的人物，其父亲耶律重元被辽兴宗尊为“皇太弟”，结果皇太子即位，自己又被封为皇太叔，心里闷闷不平，在儿子耶律涅鲁古的怂恿下，起兵谋反。谋反失败后，耶律涅鲁古被杀耶律重元途穷末路而自尽。', '吃饱睡睡醒吃', '霸天、藏海', '狗子', '<b>【萧墙】</b><br>铁甲雄兵，力讨国贼！<br>铁骑百万，即日起兵！<br><br><b>【起叛】</b><br>众军听令：誓取洪基首级，申伪讨逆！<br>废黜伪帝，匡正皇室！<br><br><b>【劫禅】</b><br>解甲来降者，可从一等功!<br>洪基速速来降，休做无谓挣扎！<br><br><b>【阵亡】</b><br>成王败寇，古今如是……');
    createIntroAndTaici('tlbb_zuozimuxinshuangqing', '左子穆和辛双清分别是无量派剑东宗和西宗掌门，左子穆心眼小、疑心重。每隔五年，西宗与东宗论剑决定哪一方入居剑湖宫。无量剑派归附天山灵鹫宫后，东西两宗合二为一成为“无量洞”，因辛双清是女子，故而成为了“无量洞”的洞主，属于缥缈峰灵鹫宫旗下“三十六洞洞主、七十二岛岛主”之一。', '吃饱睡睡醒吃', '霸天', '冰霜墨菊', '<b>【分庭】</b><br>滚滚澜沧水，涛涛剑湖波！<br>落木滴寒气，惊蛰鸣剑风！<br><br><b>【斗剑】</b><br>试观今日之域中，竟是谁家之天下？<br>宗门分高下，剑上决胜负！<br><br><b>【玉璧】</b><br>月下玉璧裹剑影，一眸纯白似仙瞳！<br>仙人化身，神来之剑！<br><br><b>【阵亡】</b><br>无量剑，愿听候灵鹫宫差遣！');
    createIntroAndTaici('tlbb_cuibaiquan', '崔百泉是金庸《天龙八部》中的角色，伏牛派门下之人，武器是一把金算盘，善于发射连珠，令敌人防不胜防，故江湖人称“金算盘”。年轻时得罪姑苏慕容氏，因此远至大理避难，在王府中伪装成帐房师爷的手下“霍先生”。整日醉酒赌博，是段誉热衷棋弈时的对手。', '吃饱睡睡醒吃', '霸天', '冰霜墨菊', '<b>【激珠】</b><br>算珠连射，定取尔等性命！<br>行不更名坐不改姓，老子便是金算盘！<br><br><b>【嵌珠】</b><br>隐疾虽痛，怎及师门大仇！<br>姑苏慕容氏，你我不共戴天！<br><br><b>【阵亡】</b><br>千算万算，人心难算……<br><br><br><br>');
    createIntroAndTaici('tlbb_shiqinglu', '石清露是苏星河的弟子，函谷八友之一。沉迷花卉之道，任一奇种名种经她栽培无不欣欣向荣。她所莳奇花，虽不能伤敌却大有妙用，曾用花粉迷倒姑苏慕容家将邓百川。师门有难时，身为女子并未逃避，随众同门共赴师门之难。虚竹接任逍遥派掌门之后回归逍遥派。', '吃饱睡睡醒吃', '霸天', '蓦焱', '<b>【莳花】</b><br>泪眼问花花不语，风吹红乱乱我心。<br>不经一番心血溉，怎得花中第一流！<br><br><b>【异卉】</b><br>阆苑花发处，人间葬红时！<br>南国有名种，春时寄相思！<br><br><b>【阵亡】</b><br>人非花是花睹人，花是人非人无花……<br><br><br><br>');
    createIntroAndTaici('tlbb_zhiguangdashi', '智光大师是当年雁门关一役的知情人士，乔峰在寻找身世谜团时，其作为主要线索人物出现，告知乔峰姓萧。但萧峰追究谁是带头大哥时，他却为了掩护带头大哥而自揽所有罪责。其早年曾发大愿心，漂洋过海，远赴海外蛮荒，采集异种树皮治愈浙闽两广一带无数染了瘴毒的百姓。他因此而大病两场，结果武功全失。', '吃饱睡睡醒吃', '霸天', '待定', '<b>【普渡】</b><br>渡海发慈心，誓愿救万民！<br>佛前悔罪业，行善赎功德！<br>不如天下之罪业，皆归老僧罢！<br>雁门关下，残阳如血;往事依稀，不见旧人！<br><br><b>【灾瘴】</b><br>身染疾恙，亦不可移我之志！<br>奇木异树，可治瘴毒！<br><br><b>【拓书】</b><br>乔帮主，你本姓是萧，你可知否？<br>石刻虽能抹，罪业不可销！<br><br><b>【阵亡】</b><br>恩怨是非，俱作尘土……<br><br><br><br>');
    createIntroAndTaici('tlbb_xiaofeng', '萧峰的身世被公布于众之后，一生致力于寻找带头大哥为双亲报仇，却因马夫人散布虚假消息，误杀了爱妻阿朱。心灰意冷的萧峰在辽国与耶律洪基义结金兰，官封南院大王。后耶律洪基意欲挥兵南下，侵犯南朝江山。生于大宋的萧峰不忍两国交战，挟持义兄休兵，并以死殉志。', '大熊小猫', '落影逝尘', '觅阳', '<b>【偃兵】</b><br>陛下此生，永不犯宋。若违此誓，有如此箭！<br>单于断箭英雄去，月下犹闻燕赵歌。<br><br><b>【殉志】</b><br>风雨恨萧萧，胡汉难共朝！<br>此鉴苍生应有愧，忍将碧血洒青天！<br><br><b>【阵亡】</b><br>恨怒喋血，终归黄土；花可解语，命殒青桥……<br><br><br><br>');
    createIntroAndTaici('tlbb_jue_damo', '达摩是印度人，于南北朝时期进入中原成为得道高僧，为中国禅宗的始祖。传说后人将他的坟墓挖开，看见一副空棺材，以为他已经羽化成佛。在小说《天龙八部》中他著有旷世武学《易筋经》，书中修习过此功的人有游坦之、鸠摩智等。', '大小熊猫', '落影逝尘', '狗子', '<b>【易筋】</b><br>吐故纳新，兼收并蓄！<br>花开花落非僧事，自有清风对碧流！<br><br><b>【洗髓】</b><br>一穴开百穴，一脉通百脉！<br>此脉一动，百脉俱通！<br>人生如逆旅，我亦是行人！<br>无根无极，万法自然！<br><br><b>【阵亡】</b><br>轮回过患，人生无常……<br><br><br><br>');
    createIntroAndTaici('tlbb_spwangyuyan', '王语嫣自小生长在蔓陀山庄，因为表哥慕容复青梅竹马而倾心相许，为相助表哥光复大燕的鸿鹄大志，熟读琅嬛玉洞的万卷武学秘籍，对江湖各路武学均有涉猎，能从旁给人简明扼要的提示从而扭转战局。可惜慕容复一心光复大燕，心中装不下儿女私情，终与她决裂。', '大熊小猫', '落影逝尘', '阿也', '<b>【点拨】</b><br>右指运力，攻其“膻中穴”！<br>打狗棒法之妙，在于“黏字诀”和“缠字诀”！<br><br><b>【寻经】</b><br>还施水阁还几度，玲珑福地聆千经！<br>倾君复燕览玉洞，几闭尘世窥琅嬛。<br><br><b>【阵亡】</b><br>最是人间留不住，朱颜辞镜花辞树……<br><br><br><br>');
    createIntroAndTaici('tlbb_qiaofengazhu', '本为一帮之主的乔峰因身世谜团陷入困境，阿朱被他的英雄气概吸引而倾心相许。乔朱二人约定替父报仇之后，便隐居塞外，牧马放羊，奈何受到康敏所惑，乔峰误以为段正淳便是杀父仇人，阿朱替父还债，乔妆成段正淳赴约青石桥，死在乔峰降龙十八掌下，塞外之约便成空。', '大熊小猫', '诗笺、落影逝尘', '大绿_Midori酱、小林', '<b>【乔妆】</b><br>巧饰千般面，朱颜一人留！<br>如梦幻真真亦假，姑苏水榭映莲香！<br><br><b>【辞朱】</b><br>痴情何谈悔与恨，青石桥头葬孤魂！<br>塞上牛羊空许约，烛畔鬓云有旧盟！<br><br><b>【孤鸿】</b><br>形单影只寄天涯，江湖何处可归家？<br>劳燕分飞各东西，夜凉梦醒裹旧衣！<br>阿朱就是阿朱，千秋万载四海列国，就只有一个阿朱！<br><br><b>【亢悔】</b><br>亢龙有悔，悔不当初！<br>千古之恨恨不休，万般悔意意难平！<br><br><b>【阵亡】</b><br>阿朱，我陪你去牧马放羊……<br><br><br><br>');
    createIntroAndTaici('tlbb_ruanxingzhu', '阮星竹出身在书香门弟之家，性情顽皮敏黠，善易容之术。义无返顾爱上段正淳后，为他诞下两个女儿。因担忧家人发现而将两个女儿阿朱和阿紫转赠他人，临送前在她们肩头刻下“段”字，以便日后相认，独居小镜湖等待段正淳前来与自己重温当年旧梦。最后却被慕容复一剑刺死。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【点青】</b><br>再续母女情，但凭这刺青！<br>这个段字，是我当年亲手所刺！<br><br><b>【春晖】</b><br>遥怜小儿女，未解忆长安。<br>孤鸿号外野，翔鸟鸣北林。<br><br><b>【鸳梦】</b><br>相见时稀隔别多。又春尽，奈悉何！<br>段郎，你可知我多年对你魂牵梦萦？<br><br><b>【阵亡】</b><br>旧梦重温，虽死无憾……<br><br><br><br>');
    createIntroAndTaici('tlbb_yelvhongji', '耶律洪基是辽兴宗耶律宗真长子，辽国第八位皇帝。《天龙八部》中的耶律洪基与萧峰是结拜兄弟，颇为敬佩萧峰的胆魄与魅力。萧峰替他解除内乱之后，更封其为南院大王。后来耶律洪基欲举兵南下，攻打大宋，萧峰恩义两难决，在雁门关前迫使耶律洪基罢兵，并于众人面前以死明志。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【南征】</b><br>打下南朝，你我君臣名垂青史，岂不美哉？<br>南朝君臣不协，人心不附，正是我大辽兴兵之良机！<br><br><b>【鸣金】</b><br>大军北归，南征之举就此作罢！<br>鸣金收兵，班师南京！<br><br><b>【从谏】</b><br>传我将令，随我回朝，扫荡女真蛮族！<br>兵凶战危，朕此一生，不越宋界！<br><br><b>【阵亡】</b><br>萧兄弟，今生臣负君，来世复君臣……<br><br><br><br>');
    createIntroAndTaici('tlbb_youjiyouju', '游骥和游驹两兄弟并称“游氏双雄”，出自金庸《天龙八部》，为聚贤庄的庄主，兄弟二人各用一面百炼钢盾，攻守兼备，二人联手威力更是大增。兄弟二人为人好客大方，过往江湖之人无不倾力结交，但有所求皆尽心尽力，极有孟尝之风。故而虽然二人武艺不算绝顶，但聚贤庄在武林之中却极有声望。得知丐帮帮主乔峰为契丹遗子，聚集大批武林豪杰，共商除患大计，在聚贤庄一役中，率先对乔峰发起攻击，失手后双双羞愤自杀。', '吃饱睡睡醒吃', '霸天', '紫青叔', '<b>【聚贤】</b><br>邀武林同道，除契丹遗孽！<br>此函见者有份，盼来共议大事！<br><br><b>【盾锋】</b><br>百炼精钢盾，可攻亦可守！<br>以盾为锋，攻守兼备！<br><br><br><br><b>【死亡】</b><br>盾在人在，盾失人亡……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_youtanzhi', '聚贤庄少庄主，父母双亡，在复仇路上，痴恋残忍歹毒的阿紫而被其套上铁头罩，成为毁容的奴隶，误入歧途。阿紫练化功大法，践踏其性命，因为游坦之捡到易筋经修练才得以存活。其对阿紫的仰慕已达到变态的地步，堪称孽缘。后来为她捐出双眼，更在阿紫抱着萧峰尸体跳岸后跟着殉情。', '西沉', '落影逝尘', '沃声_风飞语', '<b>【鬼役】</b><br>愿为姑娘当牛做马！<br>若能一亲芳泽，粉身碎骨也甘愿！<br><br><b>【脱胎】</b><br>涤荡六腑，超凡入圣！<br>脱胎换骨，易筋洗髓！<br><br><b>【殉葬】</b><br>上穷碧落下黄泉,两处茫茫皆不见！<br>与其孤独终老，不如泉下相随！<br><br><b>【舛途】</b><br>时运不济，命途多舛！<br>人生如此颠沛，活着有何意义？<br><br><b>【阵亡】</b><br>姑娘为何，从不对我正眼相看……<br><br><br><br>');
    createIntroAndTaici('tlbb_juexiaofeng', '萧峰本是丐帮帮主，前途大好，岂料因得罪康敏而横生枝节，其身为契丹人的秘密被抖出，当年雁门关血案也因此牵出。为了寻找杀父害母的带头大哥，其在追查真凶的路上困难重重，更是间接击杀了爱人阿朱。最后坦然接受自己是辽人的身份，为劝阻耶律洪基南征而以死明志。', '大熊小猫', '诗笺', '沃声_风飞语', '<b>【困龙】</b><br>天大地大，我又能何处容身？<br>身世成谜，胡汉难辨！<br><br><b>【追凶】</b><br>一叶障目迷雾宽，血仇不报誓不还！<br>天涯海角，也要手刃仇人！<br><br><b>【亢龙】</b><br>萧某非嗜杀之人，怎会赶尽杀绝？<br>念在往日情义，今日便留你一命！<br><br><b>【溯源】</b><br>萧峰今日，不再以契丹人为耻！<br>真相大白，昔日恩怨一笔勾销！<br><br><b>【缚龙】</b><br>陛下若不退兵，我便与你玉石俱焚！<br>罪臣萧峰，叩谢圣恩！<br><br><b>【阵亡】</b><br>让这一切，埋葬在雁门关吧……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuemuhua', '神医薛慕华，号称阎王敌，函谷八友之老五，为逍遥派苏星河弟子，医术高明。苏星河为使弟子八人免于祸端，将八人同时逐出门墙。薛慕华救人往往有一个条件，要用其武功绝学来交换。萧峰携阿朱到聚贤庄求医，将阿朱留在庄上，垂死的她被薛神医救治过来。', '寰宇星城、大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【赎命】</b><br>你的性命，可不是白救的！<br>阎王殿里救人，岂能劳而无功？<br><br><b>【避祸】</b><br>星宿老贼为祸江湖，唯有避其锋芒！<br>门户之乱,当退而自保！<br><br><b>【阵亡】</b><br>阎王，终究还是敌不过……<br><br><br><br>');
    createIntroAndTaici('tlbb_duanyanqing', '《天龙八部》里的重要角色，段延庆本为云南大理国太子，因皇朝内乱，被奸臣杨义贞谋国后流亡在外，并受到追杀，面目全毁，双腿残废，仅靠腹语交流。后成为四大恶人之首，致力于夺回皇位，最后争了一辈子的皇权落到了亲生儿子段誉身上，实乃造化弄人。', '大熊小猫', '落影逝尘', '狗子', '<b>【戕残】</b><br>苟且偷生，只因国仇未报！<br>窃国之辈，你我不死不休！<br><br><b>【遗胄】</b><br>我乃大理皇脉，自可为所欲为！<br>我贵为太子，你们，却一无所有！<br><br><b>【流亡】</b><br>这夺储之恨，永世难消！<br>总有一天，我会夺回我失去的一切！<br><br><b>【攘权】</b><br>大理江山，终于物归原主！<br>乱臣贼子，感受到我复仇的火焰了吗？<br><br><b>【阵亡】</b><br>恨了一辈子，争了一辈子，真是荒唐的命运……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuzhuzi', '《天龙八部》男主角之一，少林寺无名小僧，木讷老实，相貌丑陋，但为人忠厚善良。随师父发放名帖下山，误打误撞破解珍珑棋局，成为逍遥派无崖子关门弟子，并得其七十余年体力。后遇三十六洞洞主七十二岛岛主欲加害天山童姥而挺身相救，被其强逼破戒，因此和西夏公主李清露结缘。', '大熊小猫', '落影逝尘', '林三', '<b>【破戒】</b><br>阿弥陀佛，罪过，罪过！<br>世间安得双全法，不负如来不负卿？<br><br><b>【还俗】</b><br>小僧四戒皆破，愿领杖责之罚！<br>劣徒屡破清规，已无颜立足少林！<br><br><b>【北冥】</b><br>无德无义之人，不如早日退出江湖！<br>枉你神功盖世，却是滥杀无辜之徒！<br><br><b>【阵亡】</b><br>原来，竟是春梦一场……<br><br><br><br>');
    createIntroAndTaici('tlbb_azhu', '阿朱为段正淳与情妇阮星竹所生的长女，其母因未婚生女故将其转送。出场时为姑苏慕容氏的二婢之一，居于听香水榭，擅长易容术，易容本领鬼斧神工。阿朱孝顺父母，疼爱妹妹，为阻止乔峰与段正淳残杀，易容为段正淳前往青石桥赴约，被乔峰一掌误杀，死前叮嘱乔峰要好好照顾阿紫。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【易容】</b><br>以假乱真，瞒天过海！<br>容颜可易，坚心难移！<br><br><b>【孝悌】</b><br>天上星，亮晶晶，永灿烂，长安宁！<br>树欲静而风不止，子欲养而子先行！<br><br><b>【阵亡】</b><br>塞上牛羊成空约……<br><br><br><br>');
    createIntroAndTaici('tlbb_xiaoyaozi', '逍遥子是逍遥派的开创人，无崖子、天山童姥等人的师傅曾居大理不老长春谷，因谷中本有一部神奇的经书，此派人人都年逾百岁却乌发朱颜。后此书被逍遥子带走，只留下一道可令人长葆青春之泉。后创制天长地久不老长春功。他的足迹踏遍河山，他倏然而出，倏然又隐，宛如夜空中划过的一颗流星。', '大熊小猫', '霸天', '君墨', '<b>【海纳】</b><br>一朝闻道乘风起，抟云扶摇九万里！<br>北冥鲲鱼纳碧海，南天鹏鸟负青天！<br>数仞迎风下，遨游蓬蒿间。<br>磅礴凌云梦，晓觉暮天长。<br><br><b>【长春】</b><br>吾生须臾杳无迹，惟觅不老长春功！<br>乘闲自是逍遥事，明月清风徐自来！<br>世间安有长生事？花发叶落随自然。<br>此生逍遥天休问，古来万事东流水<br><br><b>【阵亡】</b><br>仙风神骨今何在？人间哪得真长生……<br><br><br><br>');
    createIntroAndTaici('tlbb_duanyu', '大理“镇南王”段正淳唯一的儿子，实为段延庆与刀白凤所生。英俊善良，厌恶杀戮争斗。不慎闯入无量山琅环福地，习得凌波微步。曾在少室山与萧峰、虚竹并肩相战，使用六脉神剑单独击败慕容复。造化弄人，先后心仪的女子木婉清、钟灵均为自己的妹妹。', '大熊小猫', '诗笺', '神齐大叔', '<b>【修脉】</b><br>无形之剑，扼敌咽喉！<br>迅如闪电，雷厉风行！<br><br><b>【情关】</b><br>谁家子弟谁家院？无计悔多情！<br>缘起缘灭缘终尽，花开花落花归尘！<br><br><b>【凌波】</b><br>微步穀纹生，剑气碧烟横。<br>江湖险恶，且习这轻功自保！<br><br><b>【阵亡】</b><br>若有来世，莫问前缘……<br><br><br><br>');
    createIntroAndTaici('tlbb_spduanyu', '段誉为了解救被人挟持的钟灵，误闯入无量山琅环福地，从洞中一尊玉像（其称为神仙姐姐）处习得逍遥派奇功——北冥神功。后来曾在曼陀山庄以北冥神功吸纳严嬷嬷的内功，乘机救走王语嫣、阿朱和阿碧姐妹。后段誉被无量剑派拘禁期间，意外之下服食了百毒之王莽牯朱蛤，自此百毒不侵。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【纳元】</b><br>百川聚海，放弥六合！<br>穷发之北有冥海，谓之天池也。<br><br><b>【朱蛤】</b><br>小生误食朱蛤，方能百毒不侵！<br>此乃以毒攻毒之故！<br><br><b>【阵亡】</b><br>奈何世故人心，更胜毒蛇猛兽……<br><br><br><br>');
    createIntroAndTaici('tlbb_kangmin', '伙同白世镜、全冠清等害死丈夫马大元的康敏表面上是个冷若冰霜的孀妇，实则生性放荡，水性杨花，与多人有染。因不满乔峰从不正眼相看，恨意横生的她发布虚假消息害得乔峰间接害死阿朱。恶人有天收，最后自恃美貌的她被阿紫划破脸蛋，更将伤口洒上蜂蜜招引蚁群噬咬，死相可怖。', '大熊小猫', '朱阳光', '珂里', '<b>【弑夫】</b><br>男人不思进取，活着有何用！<br>汝密除之，妾当以身相许！<br><br><b>【布谣】</b><br>害死萧老英雄的元凶，便是大理镇南王段正淳！<br>你若亲我，我便告知你带头大哥的下落。<br><br><b>【思迁】</b><br>天下男人皆一样，色字当头恩义忘！<br>未亡人马门康氏，望长老主持公道！<br><br><b>【阵亡】</b><br>乔峰，我咒你不得好死……<br><br><br><br>');
    createIntroAndTaici('tlbb_tangongtanpo', '谭公和谭婆是金庸《天龙八部》中一对有趣的老夫妻，并和谭婆的师兄赵钱孙之间产生过一段奇葩的三角恋情，导致谭公都时刻还吃赵钱孙的醋。两夫妻以寒玉和雪蟾制作成一味解药，曾以此药为阿朱续命 ，使得阿朱能撑到薛神医为她医治。夫妻两人曾经受邀到杏子林参加乔峰的“公审大会”，在。回忆当年雁门关事件中起到助推使用；后来又参加聚贤庄大会，率先对乔峰发起攻击，谭公长江三叠浪和乔峰交手，内功犹如长江大浪前涌后继。最后谭婆死于萧远山之手，谭公悲伤之余，随之殉情自杀。', '吃饱睡睡醒吃', '霸天', '前轮、安生', '<b>【寒药】</b><br>[谭公]寒玉雪蟾膏，可起沉疴、解百毒！<br>[谭婆]此药性寒，若非万不得已，不可擅用！<br><br><b>【叠浪】</b><br>[谭公]惊涛骇浪，层见叠出！<br>[谭公]涌浪兼天，排山倒海！<br><br><b>【故识】</b><br>[谭婆]我给师兄飞鸽传书乃要事相邀，你偏爱吃这干醋！<br>[谭婆]师哥，请你说说雁门关外的往事罢！<br><br><br><b>【死亡】</b><br>[谭公]小娟……你死了，我也不独活了……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_suxinghe', '苏星河是逍遥派掌门无崖子首徒，因师弟丁春秋背叛师门，他便遵从师父的命令，装聋作哑，自创聋哑门归隐江湖。他一生都守护着师父布下的珍珑棋局，以期有缘之人能破解此局，加入逍遥派，替本派清理门户。他广发武林帖子，最终虚竹误打误撞解开了棋局。苏星河最终死于含笑逍遥散。', '大熊小猫', '落影逝尘', '弈声传媒有声工作室', '<b>【邀贴】</b><br>还请各路江湖朋友，前来以棋会友！<br>多谢各位赏脸前来蔽派做客！<br><br><b>【破劫】</b><br>棋逢对手，快哉快哉！<br>先师布下这珍珑棋局，哪位高人可破解之？<br><br><b>【哑隐】</b><br>装聋作哑，只为清理门户！<br>唯有此举，可避江湖凶险！<br><br><b>【阵亡】</b><br>终究是逃不过江湖纷争……<br><br><br><br>');
    createIntroAndTaici('tlbb_zhongling', '万劫谷谷主钟万仇与甘宝宝之女，生父实为段正淳。活泼机灵，笑靥如花。驯有一貂，以毒虫饲之，性凶残而迅捷。段誉在无量山对无量剑派出言相讥而身陷困境，钟灵路见不平，放出飞貂为其解困，自己却被无量剑派捉拿。段誉拿着她的绣花鞋作为信物到万劫谷邀请她父母相助。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【驯貂】</b><br>貂儿，给我教训这个泼皮无赖！<br>一群莽夫欺负一个文弱书生，害不害臊！<br><br><b>【乞援】</b><br>你速去万劫谷，邀我爹妈前来搭救！<br>段郎，我在这里等着你！<br><br><b>【信物】</b><br>奉上此鞋，他们自会明白！<br>凭此信物，他们便知我深陷险境！<br><br><b>【阵亡】</b><br>我不是大丈夫，我偏要示弱……<br><br><br><br>');
    createIntroAndTaici('tlbb_yuelaosan', '岳老三在四大恶人中排行第三，性格憨直，虽被称为凶神恶煞，却重情重义。与段誉的较量失败后，也显出守信的优点，尊称他为师父。岳老三使用鳄嘴剪和鳄尾鞭横行江湖，武功高强力气大，加上长相凶煞，实为江湖中人所惧，其实为人任性可爱，与老顽童周伯通倒有几分相似。', '大熊小猫', '落影逝尘', '觅阳', '<b>【千钧】</b><br>此剪摧锋挫锐，实乃神兵利器！<br>死在你岳爷爷的鳄嘴剪下，算你造化！<br><br><b>【鱼贯】</b><br>一只苍蝇也别想飞出去！<br>今天将是你们共同的祭日！<br><br><b>【阵亡】</b><br>这小子看似无缚鸡之力，不料竟身怀绝技……<br><br><br><br>');
    createIntroAndTaici('tlbb_wangyuyan', '李青萝与段正淳的女儿，自小生长在曼陀山庄内，与表哥慕容复青梅竹马，表哥一心光复大燕，为他熟读各派武学秘笈，能看出各家武功招式，是一位武学理论家，却不谙武功。曾在听香水榭用武学知识指点闹事的人们。后来被薄情寡义的表哥弃于枯井，因而对其死心。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【问典】</b><br>为君苦修万卷书，为君险行万里路！<br>寻经问典，只为助表哥光复江山！<br><br><b>【点化】</b><br>这城字十八破，改为十五破反而精要。<br>繁章累述，不如化繁为简。<br><br><b>【阵亡】</b><br>满腔复燕梦，心中无儿女……<br><br><br><br>');
    createIntroAndTaici('tlbb_qiaofeng', '带头大哥收到不实信息后误杀乔峰双亲，为表悔意，将其寄养在乔三槐夫妇家里，并委托少林授其功夫。后出任丐帮帮主之位，生性放荡的康敏因诱惑不成，便诬陷他击杀夫君马大元，更在杏子林当众揭发他是契丹人的身世，令其众叛亲离，更是卷入了中原武林和辽国的惊涛骇浪之中。', '大熊小猫', '落影逝尘', '觅阳', '<b>【降龙】</b><br>飞龙在天！<br>神龙摆尾！<br><br><b>【亢悔】</b><br>恩怨荣辱，俱化灰尘！<br>亢龙长啸终成悔，英雄魂断雁门关！<br><br><b>【众判】</b><br>莫提旧誓与新约，怕问姓乔还姓萧！<br>杏林深处，前尘渺渺，奈何伴萍漂！<br><br><b>【阵亡】</b><br>天大地大，竟无我容身之所……<br><br><br><br>');
    createIntroAndTaici('tlbb_ganbaobao', '甘宝宝在少年时与段正淳相遇而陷入情网，并与之珠胎暗结，后来无奈之下被迫嫁给钟万仇，不久产下钟灵。钟万仇因自惭形秽而对她百般宠爱，但她对段正淳念念不忘，日日想着他们过往的旖旎风情。后来难忍相思，以寻找女儿为借口，重入江湖，最后被慕容复击杀在段正淳身边。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【愁肠】</b><br>晓镜但愁云鬓改，夜吟应觉月光寒！<br>愁肠已断无由醉，酒未到，先成泪。<br><br><b>【哀结】</b><br>花自飘零水自流，一种相思，两处闲愁。<br>物是人非事事休，欲语泪先流。<br><br><b>【顾怜】</b><br>满目山河空念远，何不怜取眼前人？<br>伊人已作他人妇，空余此心更付谁？<br><br><b>【阵亡】</b><br>此生，逃不过一个情字……<br><br><br><br>');
    createIntroAndTaici('tlbb_spxuzhu', '虚竹破解苏星河的珍珑棋局后，无意间救了天山缥缈峰灵鷲宫宫主天山童姥一命，为了逃避死对头师妹李秋水的追杀，她命虚竹一起躲藏在西夏皇宫内的冰窖中，并于丧失武功期间传给虚竹天山折梅手和天山六阳掌，以对付李秋水。期间，童姥更是强迫这位执拗善良的少林小僧破除荤、酒、杀、淫四戒。', '大熊小猫', '诗笺', '林三', '<b>【落梅】</b><br>花开堪折直须折，莫待无花空折枝！<br>巧力婉转，一手折梅！<br><br><b>【酒戒】</b><br>胸中热血沸腾，管他戒律清规！<br>人生苦短，当及时行乐！<br><br><b>【阵亡】</b><br>苦海无崖，回头是岸……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuanciyeerniang', '叶二娘原本是个涉世未深的小姑娘，因玄慈救了她父亲，为了报恩，对玄慈以身相许，并生下虚竹。一个是德高望重的少林方丈，一个是红尘俗世的痴情女子，两人的恋情只能变成遥相守望，长埋地下。多年后两人的恋情被萧远山拆穿，自觉无颜面对少林众僧的玄慈，自绝而死。', '大熊小猫', '落影逝尘', '青灯折扇不语、地鼠', '<b>【诱僧】</b><br>缘起即灭，缘生已空！<br>天与多情，不与长相守！<br><br><b>【度悔】</b><br>天道祸淫，不加悔罪之人！<br>虔心忏悔，愿得佛祖宽恕！<br><br><b>【阵亡】</b><br>六根不净，何以诵佛……<br><br><br><br>');
    createIntroAndTaici('tlbb_xie_yeerniang', '叶二娘是金庸小说《天龙八部》里的角色，四大恶人之一，排名第二。叶二娘本来是个好姑娘，温柔美貌。后来失身于少林玄慈，生下虚竹，在他的身上点下香疤作为标记。萧远山为了向玄慈报仇，抢走虚竹，在叶二娘脸上抓下六道血痕，并将虚竹放在少林寺的菜园中，使玄慈和叶二娘均不知亲子去向。痛失爱子的叶二娘忆子成痴、因痛生恨，开始盗取别人家的婴儿来玩弄，玩弄完便即杀害，因此得了“无恶不作”的称号，后来被段延庆搜罗为羽翼。二十四年后在少室山武林群雄大会上，叶二娘终于与虚竹母子相认，但萧远山现身揭破真相，逼死玄慈，叶二娘也自尽殉夫。', '吃饱睡睡醒吃', '霸天', '喵吱', '<b>【失孤】</b><br>丧父失亲悲凄苦，乌声夜夜啼孤儿！<br>襁褓未闻婴儿泣，环顾不见爱子身！<br>我～的～儿～啊～！我～的～儿～啊～！<br><br><b>【婴啼】</b><br>好肥壮的儿子，娘抱来玩玩儿，嘿嘿嘿……<br>妈妈到晚上才弄死你，现在可舍不得，嘻嘻嘻……<br><br><br><br><b>【死亡】</b><br>我甘入地狱赎罪，只求换得吾儿平安……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_liqingluo', '无崖子与李秋水的女儿，段正淳的情人之一，与姑苏慕容家为亲戚，后嫁入姑苏王家，成为曼陀山庄的女主人，育有一女王语嫣。她对段正淳极具独占之心，由此因爱转恨。生平喜好花草，常迫害无情无义的男子，将他们的尸体当作花肥。后来被外甥慕容复杀害，死前原谅了段正淳。', '大熊小猫', '落影逝尘', '蛋黄酱爆炸', '<b>【卷帙】</b><br>这小子定是图我琅环玉洞的武学秘籍！<br>卷帙浩繁书中理，浮萍飘摇情中丝！<br><br><b>【繁蕊】</b><br>如此负心汉，当杀了作花肥！<br>这书生看似籍籍无名之辈，却甚懂花理。<br><br><b>【同忧】</b><br>你不肯留下来，那就同归于尽！<br>我得不到的男人，别的女人也别想得到！<br><br><b>【阵亡】</b><br>慕容复，你怎能罔顾亲情人伦……<br><br><br><br>');
    createIntroAndTaici('tlbb_tianshantonglao', '天山缥缈峰灵鹫宫主人，因身材如同女童故人称天山童姥，实已九十六岁高龄。善使用暗器生死符控制众人，武功绝学为八荒六合惟我独尊功、天山折梅手、天山六阳掌等，可化尽天下各路武功。因与李秋水共同痴逍遥派师兄无崖子而成为宿敌，在死前得知二人皆空欢喜一场后，冰释前嫌。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【折梅】</b><br>梅开二度，威震四海！<br>天山折梅手，尽破天下武学！<br><br><b>【冰符】</b><br>我要你求生不得，求死不能！<br>尝尝这生不如死的滋味吧！<br><br><b>【阵亡】</b><br>你我皆非画中人，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('tlbb_xiaoyuanshan', '身为辽国珊军总教头的萧远山，携带妻儿前往岳父家中，途经雁门关时被收到虚假情报的大批中原武士截杀。经过一场血战后，其妻被杀，独子萧峰亦被带头大哥送给汉人乔三槐夫妇抚养。身负血海深仇的萧远山，大肆杀戳当年参与过雁门关事件的中原武士，且30年来潜伏在少林寺，企图将少林武学传入辽国，希望有朝一日能为辽军所用。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【祸延】</b><br>祸首也好，帮凶也罢，统统该死！<br>血洗中原武林，方消这杀妻夺子之恨！<br><br><b>【踅居】</b><br>我潜伏少林，已遍览武学典籍！<br>少林武学，终将为我大辽武士所用！<br><br><b>【阵亡】</b><br>皈依佛门中，人间恨已消……<br><br><br><br>');
    createIntroAndTaici('tlbb_madayuan', '身为丐帮副帮主，马大元为人憨实忠厚，心系丐帮安危，武功绝学为锁喉擒拿功。汪帮主临终前交给他一封密函，此信与乔峰身世相关，并嘱咐他若乔峰起了二心，当立即将此信交给所有长老一同拆阅并合力击杀乔峰。马夫人因恼恨他胸无大志，劝说他揭发乔峰身世无果后，伙同白世镜将他害死并嫁祸给乔峰。', '大熊小猫', '落影逝尘', '白', '<b>【锁喉】</b><br>若非形势危急，马某绝不狠下毒手！<br>乔兄弟若有异心，马某必践汪帮主遗志！<br><br><b>【缄密】</b><br>此函事关重大，夫人切勿泄露！<br>此信关系丐帮生死存亡，不到万不得已不得私启！<br><br><b>【阵亡】</b><br>乔兄弟，怪我未保管好此信，连累你了……<br><br><br><br>');
    createIntroAndTaici('tlbb_daobaifeng', '刀白凤是段正淳的妻子，又是段誉的母亲。她出身为云南摆夷族酋长的女儿，贵为镇南王妃，却因痛恨段正淳风流不羁、政务繁忙屡遭冷落，愤慨之下出家做了带发修行的道姑。刀白凤人到中年却风韵犹存，曾因和段誉动作亲昵，被木婉清误会而横生醋意。后被慕容复捉拿，平生虽痛恨段正淳，危急之中却果断殉情。', '大熊小猫', '落影逝尘', '无名配音师', '<b>【春怨】</b><br>寂寞空庭春欲晚，梨花满地不开门。<br>忽见陌头杨柳色，悔教夫婿觅封侯。<br><br><b>【寂灭】</b><br>多情总比无情苦，最是情痴不自知！<br>波澜誓不起，妾心古井水！<br><br><b>【阵亡】</b><br>贪什么母仪天下，只盼情关易闯……<br><br><br><br>');
    createIntroAndTaici('tlbb_yeerniang', '为报答玄慈恩情，叶二娘早年对其以身相许并生下虚竹，却被复仇的萧远山夺走孩儿偷偷寄养在少林寺。痛失幼儿的叶二娘加入了四大恶人的行列成为西夏一品堂的高手，乐此不疲地将别人家的婴儿偷来击杀，要让世人尝尽自己受过的痛苦。后来玄慈“带头大哥”的身份被当众揭底并授受杖刑致死，她选择为之殉情。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【盗婴】</b><br>我既已尽失天伦，不妨你也尝尝此般痛苦！<br>我遍尝人间之恶，那便无恶不作！<br><br><b>【苟合】</b><br>我的夫君，他是一位盖世英雄！<br>你有苦说不出，那才是真苦！<br><br><b>【阵亡】</b><br>愿天上，没有骨肉分离……<br><br><br><br>');
    createIntroAndTaici('tlbb_huangmeiseng', '黄眉僧师承福建莆田达摩下院，年轻时习得一身高超武功四处锄奸，名震一时。后被慕容博金刚指击败，心灰意冷，来到大理国拈花寺出家。曾受大理保定帝段正明所托前往万劫谷营救段誉，为了能执黑棋占先行之利，竟自剁一趾赢得先手。如此残忍手段连四大恶人之首的段延庆也为之侧目。 ', '大熊小猫', '落影逝尘', '蚩宇', '<b>【断趾】</b><br>有所得，必有所失！<br>小小牺牲，不足挂齿！<br><br><b>【先机】</b><br>贫僧是客，当受先行之利！<br>如此，唯有猜枚以定先后！<br><br><b>【阵亡】</b><br>天外有天，人外有人……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuzhuliqinglu', '一心向佛的虚竹，因心地善良，秉承佛法拯救天下苍生的执念，将天山童姥从众多叛徒手里救下后，却被蛮横的童姥强迫破了四戒，再也不能被佛法所容，更可怕的是他对李清露的思念却不是为他人所逼，全是自己意愿。告别少林寺后，他出任灵鹫宫宫主，并迎娶西夏公主李清露，成为一对伉俪夫妻。', '大熊小猫', '落影逝尘', '林三、卿九', '<b>【色空】</b><br>色即是空，空即是色！<br>紫陌红尘拂面来，无人不道看花回。<br><br><b>【绝尘】</b><br>佛日，长相厮守，有如修行！<br>如今我佛缘已尽，你便是我余生所系。<br><br><b>【阵亡】</b><br>痴未了，情未了，恩未了，怨未了……<br><br><br><br>');
    createIntroAndTaici('tlbb_baishijing', '白世镜是丐帮执法长老，乔峰的结拜兄弟。原本铁面无私，其妻仙逝二十余年亦不近女色，奈何却被马夫人所惑，起了加害乔峰之心。他和马夫人合谋击杀马大元并嫁祸给乔峰，害其远走辽国。堂堂执法长老，晚节不保。善恶有报，萧远山假扮马大元的鬼魂捏碎了白世镜的喉骨，当即毙命。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【缠丝】</b><br>丐帮白某，领教阁下高招！<br>缠丝擒拿手，一击即毙！<br><br><b>【失节】</b><br>英雄难过美人关啊！<br>白某，晚节不保矣！<br><br><b>【构陷】</b><br>一不做，二不休，唯有一条道走到黑了！<br>如今已成骑虎之势，乔帮主，得罪了！<br><br><b>【阵亡】</b><br>帮主不计前嫌，着实令白某羞愧难当……<br><br><br><br>');
    createIntroAndTaici('tlbb_azhi', '阿朱的妹妹，自小在星宿派丁春秋门下长大，学得毒辣性格，毒辣之中亦不乏天真与执着。因盗走师父神木王鼎而亡命天涯，在小镜湖得知身世，其姐阿朱临终前将其托付给乔峰。曾为了练习邪功而令游坦之以鲜血饲喂毒虫，与其建立起一种主子与奴隶的关系。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【纵蛊】</b><br>若愿为我赴汤蹈火，那便伸手入瓮！<br>贪生怕死，怎么做我奴才？<br><br><b>【恣睢】</b><br>就算星星月亮，姐夫也会替我摘下！<br>我姐夫盖世神功，你敢动我分毫！<br><br><b>【憾恃】</b><br>不要命的，就尽管放马过来！<br>无名小卒，可听过我师父大名？<br><br><b>【阵亡】</b><br>我真的，什么都不如阿朱吗……<br><br><br><br>');
    createIntroAndTaici('tlbb_liqiushui', '李秋水是逍遥派无崖子和天山童姥的师妹，多年来与童姥为获得无崖子芳心斗争不断，其更在师姐练八荒六合惟我独尊功时进行偷袭使其身材永如女童。后在西夏冰窖趁童姥失去功力与其对决，被虚竹无意间吸走体力。临终前得知无崖子所爱并非自己和童姥，遂化解恩怨。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【搜魂】</b><br>师姊，你来师妹家中作客，怎不知会一声？<br>我知道你藏在这里，师姊何不现身相见？<br><br><b>【龟息】</b><br>此门绝学乃师兄无崖子亲授，师姊可羡慕？<br>师兄独授我小无相功，量你也伤不到我分毫！<br><br><b>【阵亡】</b><br>师姊，原来我们都错了……<br><br><br><br>');
    createIntroAndTaici('tlbb_xuanci', '早年玄慈误信慕容博的情报，为了阻止契丹武士到少林盗取武学秘籍，为祸大宋，他率领多名中原武士在雁门关截杀萧远山夫妇，酿下大错。中原武士为包庇玄慈绝口不提他带头大哥的身份。多年后事情败露，愧疚一生的玄慈当众承认了自己当年的罪行，并重罚自己，气绝身亡。', '大熊小猫', '冷雨', '蚩宇', '<b>【伏击】</b><br>截杀契丹武士，挽救大宋国运！<br>断不能让契丹狗贼，为祸大宋江山！<br><br><b>【蒙庇】</b><br>玄慈蒙义士包庇，方可苟于人世！<br>众兄弟何苦为老衲隐瞒过错！<br><br><b>【揭底】</b><br>雁门关一役造成业障，老衲永世不得超生！<br>这累累血债，几世业报也无法偿还！<br><br><b>【杖刑】</b><br>酿成今日之祸，老衲罪不可恕！<br>大错已铸，老衲愿以死谢罪！<br><br><b>【阵亡】</b><br>愿佛祖，洗尽我一身罪孽……<br><br><br><br>');
    createIntroAndTaici('tlbb_baobutong', '包不同是姑苏慕容氏麾下四大家将之一，排行第三，又称包三先生，生平决不认错，决不道歉，明知自己错了，一张嘴也要死撑到底，乐于与人抬杠。但为人豪爽，直言不讳，最后因点破慕容复丑恶行径，直言劝谏他不该投靠大理段氏而惨被慕容复杀害。', '大熊小猫', '落影逝尘', '狗子', '<b>【忠谏】</b><br>你卖友求荣，是为不义！<br>堂堂慕容公子，岂可改姓段氏？<br><br><b>【逞辩】</b><br>非也，非也！<br>此乃顺理成章，岂有强词夺理之说！<br><br><b>【式微】</b><br>姑苏慕容氏，早已辉煌不再！<br>大厦之倾，非一世而为！<br><br><b>【阵亡】</b><br>慕容公子，愿你好自为之……<br><br><br><br>');
    createIntroAndTaici('tlbb_fengboe', '风波恶是金庸《天龙八部》中的人物，姑苏慕容氏麾下四大家将之一，排行第四，玄霜庄庄主，生来喜好打架、争强好胜，只要有架打，不吃饭也成。即使失败也不觉得自卑。慕容复为了光复大燕，不惜认贼作父，不仁不义，包不同劝谏不成反被慕容复杀害，作为包不同的好兄弟，风波恶对此失望之极，与邓百川、公冶乾一同和慕容复决裂，之后便带着包不同的遗体离开。', '吃饱睡睡醒吃', '霸天', '大宝', '<b>【好斗】</b><br>[嗅探]有血腥气！前面八成有人打架！<br>今天这一架，打得痛快至极！<br>想打架吗？风某，随时奉陪！<br>好啊！今天找到个好对手！<br><br><b>【缠斗】</b><br>就是咬，老子今天也要把你咬死！<br>想跑？哼！再来大战三百回合！<br>何人最好斗？江南一阵风！<br><br><br><br><b>【死亡】</b><br>唉，技不如人，今后再也不好斗了……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_duanyuwangyuyan', '段誉和王语嫣是金庸武侠小说《天龙八部》中的主要角色。王语嫣是段正淳与李青萝的女儿、无崖子与李秋水的外孙女，她自小与母亲生长在曼陀山庄内，因爱慕表哥慕容复而熟读各种武学典籍，能驾轻就熟地帮助他人指点一二。段誉则是段正淳的儿子，是大理世子，后身份被揭露为段延庆之子。两人虽然没有血缘关系，但因为各自的家庭背景和复杂的人物关系，他们的关系充满了波折。在连载版和修订版中，段誉对王语嫣情定三生，最后同回大理。然而在新修版中，王语嫣因发现自己身世后，误以为自己是段誉同父所生的亲妹，不能和段誉结合，而回到慕容复身边，和阿碧', '大熊小猫', '霸天', '安生', '<b>【博闻】</b><br>[王]知招难拆解，博武不能施！<br>[王]水阁玉洞，两处典籍，我已尽览。<br><br><b>【步罡】</b><br>[段]微步随周转，动息踏天罡！<br>[段]粼粼微波起，步步妙花生！<br><br><b>【六脉】</b><br>[段]六脉剑势，工拙捷缓，奇正有别！<br>[段]罡气盈体虎跃势，剑风激荡龙吟声！<br><br><br><b>【死亡】</b><br>[合]你我之间，终是求而不得……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_meilanzhuju', '梅兰竹菊，出自金庸武侠小说《天龙八部》，是灵鹫宫四姐妹组合的称呼，分别为梅剑、兰剑、竹剑、菊剑，于小说第三十八章出场。 四人是孪生姐妹，被亲生父母抛弃，被天山童姥在采药时发现，觉得有趣，因此带回去抚养长大。童姥仙逝后，忠心不二地追随新尊主虚竹。后来，段誉征得梅兰竹菊四姝首肯，并获得虚竹夫妇认可，将她们分别许配于高泰明、华赫艮、巴天石等人之子，都有着不错的归宿。', '吃饱睡睡醒吃', '棉花糖', '鲨鲨', '<b>【同心】</b><br>[合]童姥座下四婢，参见新主人！<br>[合]灵鹫宫四婢，特来伺候新尊主！<br>[合]血脉相连，心意相通！<br><br><b>【四君】</b><br>墨枝迎风傲，梅雪自芬芳！<br>一夜飞雪寒梅起，散作乾坤万里春。<br>新雨山林寂，空谷蕙兰幽。<br>兰草不逊芙蓉色，何须涉江入荒泽？<br>滴滴泪痕洒，萧萧斑竹鸣。<br>生长松石听风雨，竹枝亦羡行人吟。<br>寒秋肃杀色，菊开独悠然。<br>方寸天地皆可隐，岂独东篱采菊花？<br>[合]四花所寄托者，皆君子之魂也。<br><br><br><br><b>【死亡】</b><br>[合]尊主，来世……再续主仆情……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_liqinglu', '李清露本是西夏无忧无虑的银川公主，因天山童姥在西夏皇宫冰窖避难期间与虚竹斗气，将她点穴后迫使虚竹与她夜夜欢娱，天一亮童姥则将她抱回寝宫。李清露每日醒来后都以为自己做了一场春梦，却对梦中的“梦郎”情愫暗生。后利用和亲的机会找到虚竹，并喜结连理，成就美事一桩。', '大熊小猫', '落影逝尘', '卿九', '<b>【夙缘】</b><br>原来，你就是夜夜出现在我梦中的郎君！<br>此生最是欢娱，应是凤城梦境！<br><br><b>【春闺】</b><br>柔情似水，佳期如梦！<br>我爱上一个人，却不知道他的名字。<br><br><b>【阵亡】</b><br>生生世世若梦，岁岁年年如斯……<br><br><br><br>');
    createIntroAndTaici('tlbb_yunzhonghe', '云中鹤在四大恶人中排行第四，其轻功水平在小说中数一数二，为人以好色著称，出场时险些对木婉清施以毒手，后被段誉机智救下。曾被镇南王府四卫围攻，仗着轻功高绝逃离追捕。', '大熊小猫', '落影逝尘', '清酒摇舟', '<b>【飞鹤】</b><br>逝如轻烟，鸿飞冥冥！<br>杀其夫而占其妻，谋其财而居其谷，哈哈哈！<br><br><b>【阵亡】</b><br>轻功再高，也怕乱刀……<br><br><br><br>');
    createIntroAndTaici('tlbb_xiaofeng', '萧峰的身世被公布于众之后，一生致力于寻找带头大哥为双亲报仇，却因马夫人散布虚假消息，误杀了爱妻阿朱。心灰意冷的萧峰在辽国与耶律洪基义结金兰，官封南院大王。后耶律洪基意欲挥兵南下，侵犯南朝江山。生于大宋的萧峰不忍两国交战，挟持义兄休兵，并以死殉志。', '大熊小猫', '落影逝尘', '觅阳', '<b>【偃兵】</b><br>陛下此生，永不犯宋。若违此誓，有如此箭！<br>单于断箭英雄去，月下犹闻燕赵歌。<br><br><b>【殉志】</b><br>风雨恨萧萧，汉难共朝！<br>此鉴苍生应有愧，忍将碧血洒青天！<br><br><b>【阵亡】</b><br>恨怒喋血，终归黄土；花可解语，命殒青桥……<br><br><br><br>');
    createIntroAndTaici('tlbb_sptianshantonglao', '灵鹫宫尊主，练功时被李秋水暗害导致身材永如女童。善于使用暗器生死符控制部下，绝学天山六阳掌掌力至阳，是化解生死符的唯一方法。', '大熊小猫', '落影逝尘', '强珂', '<b>【童颜】</b><br>君已鹤发白胜雪，奈何今朝似髫年！<br>神功累我如稚童，独坐相思缥缈峰！<br><br><b>【种符】</b><br>杀人不用第二招！<br>这，就是背叛我的下场！<br><br><b>【独尊】</b><br>八荒六合，惟我独尊！<br>你的性命，已在我股掌之中！<br><br><b>【六阳】</b><br>此掌至阳，可解寒毒。<br>此乃解符要诀，你当铭记于心！<br><br><b>【阵亡】</b><br>天山鸟飞绝，故人两相忘……<br><br><br><br>');
    createIntroAndTaici('tlbb_murongfu', '慕容复出身于武林世家姑苏慕容。其真实身份是于五胡十六国时期入侵中原，并建立多个燕国的鲜卑族贵族遗脉。其面如冠玉，因以彼之道，还施彼身的功夫闻名江湖。其肩负慕容氏复国之大任，却如死灰槁木而不得志，最后不惜拜投段延庆并击杀忠臣包不同以明志。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【移星】</b><br>以其人之道，还治其人之身！<br>斗转星移，名震江湖！<br><br><b>【重祚】</b><br>复我大燕，矢志不移！<br>举世纷纷笑慕容，谁知陈涉起耕佣？<br><br><b>【倾覆】</b><br>时不我与，生不逢时！<br>难道我大燕，注定复国无望？<br><br><b>【自负】</b><br>我乃姑苏慕容，不负盛名！<br>难若能光复大燕，忍辱负重又何妨！<br><br><b>【阵亡】</b><br>愧对列祖列宗……<br><br><br><br>');
    createIntroAndTaici('tlbb_dingchunqiu', '丁春秋师从逍遥派，后背叛师父无崖子与师叔李秋水勾搭在一起。将师父无崖子打下悬崖，跌入深谷致其全身瘫痪，成为活死人。后来在西域创立星宿派，武功极高，心狠手辣，善于用毒。门下弟子称之为“星宿老仙”。曾经使剧用毒“三笑逍遥散”害死师兄苏星河。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【迷散】</b><br>哼，苏星河，你的死期到了！<br>再笑一声，便去向阎王老爷报道吧！<br><br><b>【腐功】</b><br>星宿老仙，法力无边！<br>你已毒入骨髓，神仙难救！<br><br><b>【阵亡】</b><br>这生死符，才是人间至毒啊……<br><br><br><br>');
    createIntroAndTaici('tlbb_muronglongcheng', '慕容龙城生于五代之末的龙城乡，故而名为龙城。他也不忘遗训，纠合好汉意图复国，可惜冥冥之中自有定数，被赵匡胤领先一步建立大宋王朝。人世间总是有太多的悲哀与无奈，终无所建树，以失败告终了，其后半生终大彻大悟总结毕生武学流传后世。', '大熊小猫', '落影逝尘', '涂涂', '<b>【还施】</b><br>以彼之道，还施彼身！<br>以眼还眼，以牙还牙！<br><br><b>【换斗】</b><br>斗转星移，逆天改命！<br>闲云潭影日悠悠，物换星移几度秋！<br><br><b>【阵亡】</b><br>叹我姑苏慕容，敢上九天缚苍龙……<br><br><br><br>');
    createIntroAndTaici('tlbb_saodiseng', '负责打扫藏经阁的老僧，具有大智慧。见证了少林派发生的事迹。与众人解说偷学少林武功之弊端，又以一人之力对战萧远山、萧峰、慕容博、鸠摩智等武林高手，轻松收服萧远山、慕容博两人，之后以佛法化解两人之间的恩怨，冰释前嫌，并拜己为师，皈依佛门。', '大熊小猫', '落影逝尘', '林三', '<b>【说法】</b><br>两位施主，何必为仇恨蒙蔽双眼？<br>妄执于恩怨情仇，不如跳出红尘俗世！<br><br><b>【博览】</b><br>天下武功，出少林！<br>少要武学，博大精深！<br><br><b>【气罩】</b><br>习武之人，当以佛学为基，以慈悲为念！<br>若心存歹念，必为戾气所伤！<br><br><b>【阵亡】</b><br>一念成佛，一念成魔……<br><br><br><br>');
    createIntroAndTaici('tlbb_qinhongmian', '秦红棉外号修罗刀，使用一对喂毒的双刀，暗器是毒药袖箭，其师妹是甘宝宝。她与段正淳由打生情，最后被一句“修罗刀下死，作鬼也风流”所折服，拜倒在段郎的山河履之下，生下木婉清。因为段正淳风流多情，在绝望之后，带着女儿隐居幽谷，自称幽谷客，怨毒和仇恨变成了可怕的毒药。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【袖箭】</b><br>情如修罗场，梦醒总断肠！<br>与其情孽纠缠，不如早做了断！<br><br><b>【情恨】</b><br>天长地久有时尽，此恨绵绵无绝期！<br>情不知所起，一往而深。恨不知所终，一笑而泯！<br><br><b>【阵亡】</b><br>一见段郎，误终身……<br><br><br><br>');
    createIntroAndTaici('tlbb_ganbaobao', '甘宝宝在少年时与段正淳相遇而陷入情网，并与之珠胎暗结，后来无奈之下被迫嫁给钟万仇，不久产下钟灵。钟万仇因自惭形秽而对她百般宠爱，但她对段正淳念念不忘，日日想着他们过往的旖旎风情。后来难忍相思，以寻找女儿为借口，重入江湖，最后被慕容复击杀在段正淳身边。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【愁肠】</b><br>晓镜但愁云鬓改，夜吟应觉月光寒！<br>愁肠已断无由醉，酒未到，先成泪！<br><br><b>【哀结】</b><br>花自飘零水自流，一种相思，两处闲愁！<br>物是人非事事休，欲语泪先流！<br><br><b>【顾怜】</b><br>满目山河空念远，何不怜取眼前人！<br>伊人已作他人妇，空余此心更付谁！<br><br><b>【阵亡】</b><br>此生，逃不过一个情字……<br><br><br><br>');
    createIntroAndTaici('tlbb_wuyazi', '无崖子是逍遥派祖师逍遥子的二弟子，继任掌门之后，面如冠玉、风度闲雅，因其对琴棋书画医土花戏倾心研究，导致遭到徒弟丁春秋暗算，被推下山崖。侥幸不死的他摆下珍珑棋局等待有缘人为其复仇，后棋局被虚竹因缘巧合下破解，无崖子在将平生功力以及逍遥派掌门传于虚竹后逝世。', '大熊小猫', '落影逝尘', '林三', '<b>【珍珑】</b><br>愿得有缘人，举弈论寰宇！<br>莫畏浮云遮望眼，守得云开见月明！<br><br><b>【造劫】</b><br>吾生也有涯，而知也无涯！<br>见微知著，守正待时！<br><br><b>【倾授】</b><br>你既已入我逍遥派，还要这少林功夫做什么？<br>重振逍遥派的重任，就交给你了！<br><br><b>【阵亡】</b><br>乘风驾鹤，羽化登仙……<br><br><br><br>');
    createIntroAndTaici('tlbb_duanzhengchun', '段正淳是大理国镇南王，深受保定帝器重，擅长段家剑和一阳指。妻子刀白凤因其生性风流、情债累累而隐为道姑。段正淳一生命运与六个女人纠缠不清，包括丐帮大嫂马夫人、曼陀山庄李青萝、修罗刀秦红棉等。其人虽多情，却又痴情，最终为情而死，是金庸笔下当之无愧的情种。', '大熊小猫', '落影逝尘', '冰霜墨菊', '<b>【滥情】</b><br>青裙玉面如相识，九月茶花满路开！<br>星眸竹腰相伴，不知天地岁月也, 不知天地岁月也!<br>你我重温旧梦，更比昔日情浓！<br>小康风姿绰约，更胜年少英姿！<br>修罗刀下死，做鬼也风流！<br>皎凤朝凰忘芳菲，侯门难掩百花香！<br><br><b>【孽债】</b><br>你们皆是段某至爱，何苦强分轩轾！<br>手心手背都是肉，段某如何取舍！<br><br><b>【阵亡】</b><br>死后，我们也是同命鸳鸯……<br><br><br><br>');
    createIntroAndTaici('tlbb_xie_liqingluo', '李青萝是金庸小说《天龙八部》中的人物，李秋水与无崖子的女儿，王语嫣之母，段正淳的情妇之一，丁春秋的养女。后来嫁入姑苏王家，成为曼陀山庄的女主人，喜好栽培山茶花和饲养醉人蜂为宠物。李青萝残忍毒辣，她是被丁春秋养大的，受其影响本就漠视人命，又被段正淳始乱终弃，性格变得十分恶毒。丈夫去世寡居后捉了不少平民回来肆意审判，只要不顺着自己的意思就把他们剁了拿去做花肥。滥杀无辜，导致名声不好，和官府也有了芥蒂。', '吃饱睡睡醒吃', '霸天', '安生', '<b>【陷花】</b><br>茶花零落，伊人憔悴！<br>花谢花飞，红消香断！<br>青裙玉面今仍在，茶花满路为谁开？<br><br><b>【醉蜂】</b><br>段郎，你我醉生梦死，还要什么社稷江山！<br>此蜂甚毒，没人能活着离开我这曼陀山庄！<br><br><b>【沃腴】</b><br>天下男子，十九薄幸！<br>大理段氏，个个该杀！<br><br><br><b>【死亡】</b><br>段郎，我是你心头所爱吗？……<br><br><br><br><br>');
    createIntroAndTaici('tlbb_murongbo', '慕容博是已亡国的鲜卑王族后裔，一心想着复国，运用毒辣手段及发动阴谋，为了挑起辽国与中原武士的纷争，发布虚假情报，谎称将有契丹武士到少林夺取武学秘籍，害得大批中原武士为了截杀契丹武士，血战雁门关，令契丹珊军教头萧远山与中原武林结下不解之仇。最后复国无望，随扫地僧皈依佛门。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【谣谍】</b><br>好戏上演，静观其变！<br>且看你们，自相残杀！<br><br><b>【复燕】</b><br>我大燕复兴之日，近在咫尺！<br>百年大计，东山再起！<br><br><b>【阵亡】</b><br>千年帝王师，一枕黄梁梦……<br><br><br><br>');
    createIntroAndTaici('tlbb_muwanqing', '大理镇南王段正淳与情妇修罗刀秦红棉之女，容貌可谓绝色，犹如新月清晖，花树堆雪。被师父严加管教，自小以幕篱帷帽示人，立誓第一个见到她的男人，要么嫁他，要么杀他。最初与段誉立下白首之约，奈何二人实为兄妹。后扮为男装替段誉到西夏国相亲。', '大熊小猫', '落影逝尘', '古梁舟', '<b>【幕篱】</b><br>水木清华，婉兮清扬！<br>古人有云，男女授受不亲！<br><br><b>【绝誓】</b><br>初窥帷篱者，当立白首约！<br>师父有命，我若不嫁你，便要杀你！<br><br><b>【使姻】</b><br>我代家兄前来和亲！<br>西夏公主花容月貌，倒和家兄相衬。<br><br><b>【阵亡】</b><br>段郎，来世投胎，不做兄妹……<br><br><br><br>');
    createIntroAndTaici('tlbb_quanguanqing', '全冠清是丐帮长老，投机主义者，善于玩弄权术，城府颇深。得知帮主乔峰是契丹人身份后，同马夫人一起处心积虑揭穿他的身世，最终令其辞去帮主之位并退出丐帮。在丐帮群龙无首时，遇到处于情感漩涡中的游坦之，在全冠清的挑唆和拥立之下，游坦之为了得到心仪的阿紫的欢心，化名为庄聚贤，出任丐帮帮主。', '大熊小猫', '落影逝尘', '狗子', '<b>【政变】</b><br>乔峰乃契丹孽种，留下只会为祸丐帮！<br>若不逐出乔峰，丐帮基业恐将毁于一旦！<br><br><b>【拥立】</b><br>庄大侠智勇双全，当担此大任！<br>今丐帮群龙无首，庄大侠切莫推辞！<br><br><b>【阵亡】</b><br>我这么做，全是为了丐帮好……<br><br><br><br>');
    createIntroAndTaici('tlbb_zhaixingzi', '摘星子是丁春秋的大弟子，阿紫的大师兄，面目颇为英俊，体力、轻功均不错，出手狠辣，善使用毒磷烧杀敌人。奉师父丁春秋之命，率众师弟前往中原捉拿盗走神木王鼎的阿紫，其师弟出尘子失手，大兴问罪，用毒磷将其烧死，其状惨不忍睹。后萧峰借用阿紫的掌力将其击伤，被折磨的半死不活。', '大熊小猫', '诗笺', '洛', '<b>【遣罪】</b><br>你办事不力，当受帮规处置！<br>不取回神木王鼎，就提头来见！<br><br><b>【飞磷】</b><br>飞磷绽火，毁天灭地！<br>这烈火焚身的滋味儿，不好受吧！<br><br><b>【阵亡】</b><br>竟然，引火烧身……<br><br><br><br>');
    createIntroAndTaici('tlbb_jiumozhi', '吐蕃国护法国师，平生自傲，痴迷于武学，狂热的追求至高武功，挑战大理，决战少林。身负火焰刀、无相劫指、拈花指等众家功夫。最终误入枯井走火入魔，功力尽失，但因祸得福，由此大彻大悟终成一代高僧。', '大熊小猫', '落影逝尘', '涂涂', '<b>【武痴】</b><br>小僧痴顽，难断思友之情！<br>愿一睹贵寺六脉神剑大威！<br><br><b>【焰刀】</b><br>掌中藏火，绵延不熄。<br>运息纵火，定要黑教灰飞烟灭！<br><br><b>【劫指】</b><br>我佛慈悲，姑且放你一马！<br>自生自灭，且看造化！<br><br><b>【拈花】</b><br>拈花一笑，得窥佛缘！<br>佛祖拈花，迦叶一笑。<br><br><b>【魔障】</b><br>世外闲人，岂为这俗事萦怀？<br>方外之人，不恋俗尘。<br><br><b>【洗髓】</b><br>易筋洗髓，超凡脱俗。<br>莲池礼佛，如有重生。<br><br><b>【阵亡】</b><br>一生贪功恋势，不如云游四海……<br><br><br><br>');
    createIntroAndTaici('tlbb_spjiumozhi', '鸠摩智为吐蕃国大轮明王，得道高僧，本应具备大师风范，奈何在痴迷武学的道路沉沦至深，四处追寻武学宝典，用密宗绝学交换中土武籍，终致走火入魔，在枯井里不慎被段誉的北冥神功吸走毕生功力，从此也堪破尘世的贪嗔增怒，大彻大悟成为一代高僧。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【启衅】</b><br>小僧这不情之请，还望大师成全！<br>得窥宝籍奥秘，小僧死而无憾！<br><br><b>【贪嗔】</b><br>能习得这上乘武学，折寿折福何足惧哉！<br>天下武籍，尽归我手！<br><br><b>【戒断】</b><br>苦非苦，乐非乐，皆一时执念！<br>一念放下，万般自在。<br>世上无难事，庸人自扰之！<br><br><b>【阵亡】</b><br>早登极乐，往生净土……<br><br><br><br>');
    createIntroAndTaici('tlbb_jue_tianshantonglao', '天山童姥因与师妹李秋水争风吃醋成为宿仇，练习长生不老功的时候被李秋水暗算，导致周期性的返老还童，身形永如女童，成为她永远的伤痛。天山童姥为人残酷，为了控制三十六洞七十二岛，使用生死符这种至毒的暗器控制他们的生命，使他们永远听从自己的命令，凡有背叛者，生不如死。', '大熊小猫', '落影逝尘', '遂非', '<b>【还童】</b><br>天若有情天亦老，月如无恨月长圆！<br>此情堪虞恨天长，不如人间共白头！<br><br><b>【控符】</b><br>除了效忠于我，你，别无选择！<br>在痛苦的地狱里，轮回吧！<br><br><b>【灵尊】</b><br>我，才是你生命的主宰！<br>顺我者昌，逆我者亡！<br><br><b>【阵亡】</b><br>长生不老，是对我最大的惩罚……<br><br><br><br>');
    createIntroAndTaici('tlbb_spazi', '阿紫是段正淳的私生女，被母亲抛弃，拜于星宿派门下，自小习得毒辣的武功，心狠手辣。盗取了师父丁春秋的神木王鼎后逃到中原避难，遇到倾慕自己的游坦之，将铁盔罩于其头上，称其为铁丑，更将铁丑变成自己的奴隶，用他的鲜血喂养毒虫好供自己练习化功大法。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【盗鼎】</b><br>有了宝鼎，不必再受制于星宿老怪！<br>宝鼎在我姐夫手里，有本事就去拿！<br><br><b>【引蛊】</b><br>等我练成化功大法，谁还敢欺负我？<br>行走江湖，绝技傍身！<br><br><b>【驱役】</b><br>我不要你的心，只要你的命！<br>铁丑，还不把手伸进来？<br><br><b>【阵亡】</b><br>冷眼世间，最苦相思毒……<br><br><br><br>');
    createIntroAndTaici('tlbb_xie_kangmin', '康敏，是在金庸《天龙八部》中的人物，丐帮副帮主马大元的妻子，人称马夫人。曾是大理国镇南王段正淳的情人之一。因年少艰辛，养成病态的嫉妒心，为达目的不择手段，外表冰清玉洁，实则艳媚入骨，天性放荡，与白世镜、全冠清等武林人士均有私情。后来勾引乔峰不成，为了报复乔峰，伙同白世镜、全冠清等人当众揭发乔峰身世、后来又设计害死阿朱。最后被阿紫划伤脸蛋，伤口又遭虫蚊嗜咬，绝美容颜毁于一旦，被镜子里的自己惊愕而死。', '吃饱睡睡醒吃', '霸天', '安生', '<b>【妒毁】</b><br>我绝不会和别的女人，分享男人！<br>我得不到的，你也休想得到！<br>我要天下男子，都拜倒在我的石榴裙下！<br><br><b>【顾影】</b><br>对镜顾影犹自怜，琉璃玉貌花月颜！<br>月貌花容自沉沦，媚骨天成人销魂！<br><br><b>【怨艾】</b><br>以色事人者，色衰而爱弛！<br>美人迟暮将军老，最是红尘两不堪！<br><br><b>【碎镜】</b><br>镜子！我要镜子！<br>我的绝世容颜，我的绝世容颜！<br><br><b>【阵亡】</b><br>玉碎珠沉，香消玉殒……<br><br><br><br>');
    //射雕英雄传
    createIntroAndTaici('sdyx_wumianfeng', '武眠风曾经是桃花岛主黄药师的得意弟子，天赋异禀，医术高超，更精通师父的绝学——碧海潮生曲。然而，命运的转折点却因为梅超风和陈玄风的背叛而降临。他们偷走了黄药师视若珍宝的《九阴真经》，黄药师一怒之下，将所有弟子打折双腿、逐出师门，武眠风亦未能幸免。在这场风波中，他的人生发生了翻天覆地的变化，从备受黄药师器重的弟子，变成了一个流浪江湖的孤影。尽管如此，武眠风并未放弃，他带着对医术的执着追求和对碧海潮生曲的精湛造诣，开始了他飘零而孤独的旅程。', '大熊小猫', '霸天', '星空下木头', '<b>【仁术】</b><br>药到病除，效如桴[fú]鼓！<br>仁术施乡里，恩义溯师门。<br><br><b>【零落】</b><br>何处晴烟掩平沙，落英浮沉似天涯！<br>山溪不闻潮声响，孑零一生故桃花。<br>春花秋月两相和，飘零落尽无定处！<br>午夜梦回惊坐起，风吹落红入寒窗！<br><br><b>【呓曲】</b><br>此夜曲中奏潮水，何人不起伤怀情。<br>我抚玉箫已叹息，又舞桃花复凄凄！<br>广陵绝响何人继？碧海潮生一夜箫！<br>桃花飞殇哀往事，曲尽碧海尚彷徨！<br><br><br><b>【死亡】</b><br>一别数载，桃花依旧……<br><br><br><br><br>');
    createIntroAndTaici('sdyx_mayu', '马钰道号丹阳子，全真七子之一。由于师弟丘处机和江南七怪的十八年赌约，马钰苦劝丘处机不成，便亲自远赴大漠教导郭靖两年内功心法。后与江南七怪合力击退梅超风。马钰生性淡泊，不与人争且潜心修道，故外功修为普通，但内功修为相当深厚，开导郭靖内功修练方法将他导入成为高手的正确路途，弥补了江南七怪内功不足的缺失。', '大熊小猫', '霸天', '白狗', '<b>【暗授】</b><br>思定则情忘、体虚则气运！<br>心死则神活、阳盛则阴消！<br>切记今日之事，不可与外人道也！<br>魂不内荡，神不外游，此为修炼内功之要诀！<br><br><b>【云游】</b><br>我欲乘风归去，游遍四海八荒！<br>拂云游四海，弄影到三山！<br>风萧萧兮木叶飞，声嗷嗷兮雁南归。<br><br><br><br><b>【死亡】</b><br>嗟人世兮魂欲飞，伤人世兮心欲摧……<br><br><br><br><br>');
    createIntroAndTaici('sdyx_guoxiaotian', '郭啸天是梁山泊好汉地佑星赛仁贵郭盛的后代，郭靖的父亲。郭啸天在年轻时与杨铁心都居于山东，后来金国入侵，一同迁至临安府牛家村，并与杨铁心结为异姓兄弟，后于牛家村与妻子李萍诞下郭靖。因大金六王爷垂涎义弟杨铁心之妻包惜弱的美色，郭杨两家受到迫害，为救义弟杨铁心而激怒段天德，被段天德砍掉右膀失血过多而死。', '大熊小猫', '霸天', '前轮', '<b>【忠裔】</b><br>苍龙啸月瓦岗寨，骏马乘风赤水泉！<br>剑雨蒙霜轻似雪，行歌对酒涵如渊。<br><br><b>【喋血】</b><br>生当作人杰，死亦为鬼雄！<br>袖里乾坤销残骨，叱咤风云义薄天！<br><br><br><br><b>【死亡】</b><br>国亡身殒今何有，只留离骚在世间……<br><br><br><br><br>');
    createIntroAndTaici('sdyx_xie_meiruohua', '梅若华来历不详，拜入桃花岛后，师父黄药师为其改名为梅超风。在旧版小说里她曾经和恩师有过一段晦涩的感情。后来和师兄一起偷走《九阴真经》，黄药师大为震怒，将其二人逐出师门，为了躲避仇家追杀，远走蒙古大漠，偷偷拿活人练习九阴白骨爪，江湖人称黑风双煞，提到九阴白骨爪便令人胆寒。原著中没有分析她偷盗《九阴真经》的真正动机，在被逐出师门之后，她最大的心愿是能够重回桃花岛。后来为师父挡下欧阳锋一掌而毙命，同时也回复了桃花岛弟子的身份。', '大熊小猫', '霸天', '安生', '<b>【夭夭】</b><br>夭夭映丹霞，灼灼融春华！<br>桃林浅深处，佳人淡浓妆！<br><br><b>【情窦】</b><br>三月桃花开已盛，梁间燕子何时归？<br>寂寞芳菲开无主，风吹一夜满桃花！<br>花落随水意，春来我自知！<br>落英缤纷寄潮水，暗香疏影浮月光！<br><br><b>【碧潮】</b><br>[碧海潮生曲]<br><br><b>【猩红】</b><br>夜深忽梦桃花事，过往如沙泪阑干！<br>一声枭啼残夜尽，梦惊空枕洒泪痕！<br><br><b>【魔爪】</b><br>我要用你们的项上头颅，以祭亡夫之灵！<br>贼汉子，你在天之灵，看见我为你报仇了吗！<br><br><b>【阵亡】</b><br>零落成泥化尘土，桃花归处是桃花……<br><br><br><br>');
    createIntroAndTaici('sdyx_qulingfeng', '曲灵风是药师的大徒弟，因陈玄风和梅超风偷走《九阴真经》而受到师父迁怒，被打断双腿，赶出桃花岛。辗转来到牛家村，改名曲三，开酒店营生，结识了郭啸天和杨铁心两位忠良之后。后为讨黄药师欢心以重回师门，多次深入皇宫盗取名贵字画、金银器皿，最终被众多宫廷侍卫围攻，与大内高手石彦明同归于尽。', '大熊小猫', '霸天', '薛晨鸭', '<b>【劈空】</b><br>劈空神掌，掌不落空！<br>此掌无影无形，瞧你如何能躲！<br><br><b>【盗宝】</b><br>西赆南琛献恩师，重回师门待指日！<br>飞檐走壁破严防，奇珍异宝唾手得！<br><br><br><br><b>【阵亡】</b><br>芦花影落难振剑，钱塘潮生不闻箫……<br><br><br><br>');
    createIntroAndTaici('sdyx_luchengfeng', '陆乘风是黄药师的四徒弟，上有曲灵风、陈玄风、梅超风，下有武眠风、冯默风。因师兄师姐私奔并盗走《九阴真经》，黄药师迁怒众徒弟，挑断他们的脚筋，并赶出桃花岛。后来在太湖建造归云庄，模仿桃花岛在庄里布下奇门八阵，掌管太湖群盗。被挑断脚筋但未敢怨憎师父，最后重回师门。', '大熊小猫', '霸天', '末生', '<b>【四象】</b><br>卦象变换，易理玄通。<br>四阵生克八卦定，四象幻化八方踪。<br>恩师所授遁甲之术，乘风一日未敢忘却！<br><br><b>【拆阵】</b><br>何方高手，竟破我桃花岛玄门八阵！<br>舍却此庄，也要擒住黑风双煞！<br><br><b>【归云】</b><br>欲将心事付瑶琴，知音少，弦断有谁听？<br>潮落潮涨赴潮水，云卷云舒待云归。<br><br><b>【阵亡】</b><br>重回师门，此生，梦圆……<br><br><br><br>');
    createIntroAndTaici('sdyx_jue_hongqigong', '洪七公是金庸《射雕英雄传》和《神雕侠侣》中的人物，绰号北丐，武功登峰造极，乃天下五绝之一。丐帮帮主，为人正义且机智，黑白两道都十分敬重他。洪七公和蔼正义，具有一切正派人物所应具有的优点，其独门武学为打狗棒法及降龙十八掌名满江湖。洪七公在任期间，见到不平之事，便暗中扶危济困，杀恶诛奸。', '大熊小猫', '霸天', '临时小驻', '<b>【潜龙】</b><br>藏巧于拙，潜龙勿用！<br>亢龙有悔,盈不可久！<br>顺势而发，势不可挡！<br>逆势而动，后劲无穷！<br><br><b>【神丐】</b><br>贼虏亡我之心不死，我辈岂可坐以待毙！<br>借天势，驱鞑虏！<br><br><b>【屠狗】</b><br>负心多为读书人，仗义每多屠狗辈！<br>愿执玉杖心不移，屠尽天下猪狗辈！<br><br><b>【阵亡】</b><br>愿……天下无狗……');
    createIntroAndTaici('sdyx_shangguanjiannan', '上官剑南是金庸《射雕英雄传》中的人物，原是南宋名将韩世忠部下的将领，岳飞遗作《武穆遺书》流传过程中非常关键的一个人物。曾经亲笔书写下关于《武穆遗书》所藏之地在铁掌山中指峰第二指节，并附铁掌山画与岳飞诗作于纸上的暗谜。后创立铁掌帮，习得刚猛无比的铁掌功。', '大熊小猫', '霸天', '随遇而安', '<b>【武略】</b><br>洞庭残阳映天红，誓灭金贼一扫空！<br>厉兵秣马从仇日， 勒马燕然第一峰！<br><br><b>【流芳】</b><br>破金要略何处觅？壁立千仞在中峰！<br>得此兵书，救国救民！<br><br><b>【铁掌】</b><br>习得神功，当救国于危难、解民于倒悬！<br>抗金扶宋，功在千秋！<br><br><b>【阵亡】</b><br>千仞，破金大业，重于山……');
    createIntroAndTaici('sdyx_jueouyangfeng', '西毒欧阳锋平生作恶多端，武功登峰造极。因逆练郭靖乱改的九阴真经而疯，武功却更胜从前。第二次华山论剑中先后击败郭靖、黄药师、洪七公三人， 成为第二次华山论剑武功天下第一。后来与洪七公在华山比武而油尽灯枯，临死前回光返照回复记忆，两人互相拥抱大笑而逝。', '大熊小猫', '霸天', '随遇而安', '<b>【流毒】</b><br>广施流毒得利好，遗损万世又何妨？<br>谅尔自诩内力高绝，也难抵我万蛇之毒！<br>行到毒云惨淡处，笑看天地同寿时！<br>诡奇异怪流毒远，天下至毒我为尊！<br><br><b>【逆脉】</b><br>逆中取顺，败中求胜！<br>似前实后，因左而右！<br>逆练真经，功冠武林！<br>真气逆走，经脉逆行！<br><br><b>【阵亡】</b><br>好你个老叫化子，哈哈哈哈……');
    createIntroAndTaici('sdyx_juehuangyaoshi', '黄药师是金庸先生笔下“正中带有七分邪，邪中带有三分正”的人物是桃花岛的岛主。“桃花影落飞神剑，碧海潮生按玉箫”是他一生武功的写照，武功造诣非凡，已臻化境，为金庸小说中武功绝顶的高手之一。黄药师上通天文，下通地理，五行八卦、奇门遁甲、琴棋书画，甚至农田水利、经济兵略等亦无一不晓，无一不精。', '大熊小猫', '霸天、藏海', '冬赫', '<b>【奇阵】</b><br>五运更始，变应天期！<br>天衍四九，人遁其一！<br><br><b>【箫剑】</b><br>落英缤纷神剑雨，凤曲长鸣棹歌流！<br>形销怆然箫声起，玉漏催银洒碧霄！<br><br><b>【阵亡】</b><br>如今但欲关门睡，一任♣️️作雪飞……<br><br><br><br>');
    createIntroAndTaici('sdyx_wanyankang', '完颜康是杨铁心与包惜弱之子，金国六王爷完颜洪烈的养子。聪明机警，外貌俊美，生母养父对其万般宠溺，自幼在顺境中成长，处处争强好胜、不择手段。因迷恋金朝王室的富贵，在得知身世后仍继续追随仇人完颜洪烈，并欲继其王位。后掌击黄蓉软猬甲，被南希仁遗留在软猬甲上的剧毒刺破手掌，中毒身亡，尸身为众多乌鸦啄食。', '大熊小猫', '藏海', '科学舟自横', '<b>【叛国】</b><br>生是金国人，死为完颜鬼！<br>家河破碎寄完颜，富贵荣华伴露迁！<br><br><b>【通敌】</b><br>何计身后荣与辱，万里江山皆我物！<br>一人之下，万人之上，哈哈哈…<br><br><b>【权妄】</b><br>看浮生千般意趣，又何止金帛玉缕！<br>不甘此生布衣路，挥戈纵马展宏图！<br><br><b>【阵亡】</b><br>一朝顿醒魂消散，反骨何堪对碧山……<br><br><br><br>');
    createIntroAndTaici('sdyx_hanbaoju', '韩宝驹是《射雕英雄传》中的人物，在“江南七怪”中排行第三，人送外号“马王神”，原是马贩子，韩小莹的堂兄，身材极其矮胖。韩宝驹精擅专攻下盘的金龙鞭法，马术超群，相马之术更是举世无双。授予郭靖的武功为“金龙鞭法”，最后在桃花岛墓室中被杨康偷袭而死。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【相马】</b><br>此马非凡马，一身龙骨傲！<br>良驹遇伯乐，宝马配英雄！<br><br><b>【驯化】</b><br>此马野性未改，且瞧我治它一治！<br>骏马如风，脱缰则野！<br><br><b>【阵亡】</b><br>治国无法，如野马脱缰矣……<br><br><br><br>');
    createIntroAndTaici('sdyx_nanxiren', '南希仁，江南七怪中的老四，樵夫打扮，身体壮实。一般很少说话，不过一说就切中要害，在七怪里颇有威信。使纯钢扁担。武学是南山拳法，最后在桃花岛中被欧阳峰杖头怪蛇咬中舌头，支撑多日后身亡。死前留书曰“杀我者乃十”，“十”本指杨字，代表杨康。结果只写了两笔便气绝而亡。郭靖误认为“黄”字，认为凶手是黄药师。', '大熊小猫', '霸天、藏海', '冬赫', '<b>【铁肩】</b><br>铁肩撑栋梁，甘洒满腔血！<br>吾虽南山樵，重任亦可担！<br><br><b>【血证】</b><br>血誓之约芒在骨，丹心一片证肝肠！<br>以血为证，至死不绝！<br><br><b>【阵亡】</b><br>杀我之人，乃……<br><br><br><br>');
    createIntroAndTaici('sdyx_quanjinfa', '全金发在江南七怪中排行第六，绰号“闹市侠隐”，郭靖的六师父。所用兵器为镔铁铸成的大杆秤，兼带秤钩和秤砣。全金发的轻功不俗，曾在蒙古与柯镇恶等义兄弟妹一起恶斗黑风双煞，后来又一起辅佐郭靖成才。最后在桃花岛上被西毒欧阳锋所杀。', '大熊小猫', '落影逝尘', '狗子', '<b>【亨通】</b><br>一分铜钿，一分货！<br>财运亨通，吉星高照！<br><br><b>【精算】</b><br>一手交钱，一手交货！<br>折本儿买卖，不做不做！<br><br><b>【阵亡】</b><br>人算，不如天算啊……<br><br><br><br>');
    createIntroAndTaici('sdyx_shatongtianhoutonghai', '沙通天和侯通海是《射雕英雄传》中的人物，分别被称为三头蛟和鬼门龙王。两人是黄河帮的师兄弟，水性极好，长期在黄河一带独霸一方，被大金六王爷完颜洪烈招募到帐下，成为其五大高手之一。后来被周伯通擒住，交与丘处机等人，被长期监禁在重阳宫内。', '大熊小猫', '落影逝尘', '无忆CHENG', '<b>【蟠龙】</b><br>人走船留，雁过拔毛，哈哈哈哈哈！<br>要想从此过，留下买路财！</b><br>蛟龙入海，浪卷潮回！<br>双蛟掠命，尔等，已是釜底游鱼！<br><br><b>【双蛟】</b><br>兴风作浪，呼风唤雨！<br>这片水域，都是我们的地盘！<br><br><b>【阵亡】</b><br>这究竟，是哪里来的暗流……<br><br><br><br>');
    createIntroAndTaici('sdyx_chenxuanfeng', '陈玄风是桃花岛黄药师门人，与梅超风相爱私定终身。二人觊觎黄药师的《九阴真经》，企图盗走此书下卷。陈玄风自创“九阴白骨爪”邪功，武功高强。曾击杀飞天蝙蝠柯镇恶的兄长柯辟邪。后来在荒山夜战中，将笑弥陀张阿生打成重伤致死，但因轻敌大意，被年仅六岁的小郭靖用匕首刺穿肚脐的命门而死去，梅超风将他刺在胸口皮肤上的《九阴真经》连皮取走。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【盗经】</b><br>得此奇书，他日称霸武林，岂不威风！<br>黄老贼不肯交出经书，唯有出此下策！<br><br><b>【少阳】</b><br>万物负阴而抱阳！<br>合抱之木生于毫末，九层之台起于累土！<br><br><b>【老阳】</b><br>人法地，地法天，天法道，道法自然！<br>天地之道，极则反，盈则损！<br><br><b>【少阴】</b><br>阳中求真阴，九阴第三重！<br>以阴练真阴，九阴第四重！<br><br><b>【老阴】</b><br>鬼狱阴风，以阴索魂！<br>气至丹田贯十指，抓石破铁摧坚爪！<br><br><b>【摹刻】</b><br>贼婆娘，务必报此血海深仇！<br>他日神功大成，勿忘为夫大仇！<br><br><b>【阵亡】</b><br>这乳臭未干的小子，究竟何方神圣……<br><br><br><br>');
    createIntroAndTaici('sdyx_jue_huangshang', '黄裳是金庸《射雕英雄传》中被提及的人物，是北宋一名编纂道家典藏的文官，因长年累月逐字校对，便领悟了道家的绝世武功，后因击杀众多明教高手而结下各门各派仇家，遭受到灭门之祸。为了报血海深仇潜心研究武功，最终写下震古烁今的《九阴真经》。', '大熊小猫', '落影逝尘', '小林', '<b>【校译】</b><br>读书破万卷，下笔如有神！<br>读书百遍，其义自见！<br>挑灯夜读十年苦，天下美谈鸡蛇兔！<br><br><b>【通悟】</b><br>大道至简，悟在天成！<br>大道在悟，不在修！<br>大道由中悟，逍遥匪外寻！<br><br><b>【九阴】</b><br>日极则仄，月满则亏！<br>道常无为，而无不为！<br>道法自然，天人合一！<br>天地不仁，以万物为刍狗！<br>道生一，一生二，二生三，三生万物！<br><br><b>【阵亡】</b><br>冤家宜解不宜结……<br><br><br><br>');
    createIntroAndTaici('sdyx_liping', '李萍是金庸小说《射雕英雄传》中主角郭靖之母，本是临安村一名质朴的农妇，受到奸人迫害而失去丈夫，逃难到蒙古大漠，在冰天地雪中产下郭靖，含辛茹苦将其抚养长大。虽是一名村妇，但她深明大义，在铁木真准备发兵征宋时，为了不拖累郭靖选择了自杀，是郭靖成长为一代大侠之路上最重要的启蒙老师。', '大熊小猫', '看破一切', '谢声繁', '<b>【漂萍】</b><br>漂忽如萍，人生如寄！<br>漂泊异乡，故土难离！<br>寄人篱下，非长久之策！<br><br><b>【大义】</b><br>人生百年匆匆过，要留丹心昭日月！<br>何惜百死报家国，青山处处埋忠骨！<br><br><b>【阵亡】</b><br>落叶，归根……<br><br><br><br>');
    createIntroAndTaici('sdyx_baoxiruo', '包惜弱与爱郎杨铁心本在临安牛家村过着相敬如宾的幸福生活，却被金国六王爷完颜洪烈觊觎美色，被其设计陷害，夫妻分离。误嫁给完颜洪烈后的包惜弱思郎心切，在繁华的王爷府邸中按牛家村故居布置了偏房，长居于此。她天性善良，悲天悯人，连鸡也不忍击杀。', '大熊小猫', '看破一切', '一叶米粥', '<b>【悲悯】</b><br>人非草木，孰能无情？<br>众生平等，安有贵贱之分？<br><br><b>【追思】</b><br>昔年梦碎忆临安，京华难驻思劳燕！<br>侯门一入深似海，从此萧郎是路人！<br><br><b>【阵亡】</b><br>铁哥，我们生生世世，永不分离……<br><br><br><br>');
    createIntroAndTaici('sdyx_zhucong', '朱聪在“江南七侠”中排行老二，外号“妙手书生”，武功为“分筋错骨手”，兵器是一把破油纸扇的扇骨。其盗术天下无双。曾多次悄无声息地从他人怀中探囊取物。后在桃花岛被“西毒”欧阳锋用蛤蟆功杀害，临死前，偷取了杨康身上带着的小鞋子，成为黄蓉破案的关键证据之一。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【偷天】</b><br>妙手空空侠盗客，散尽天下不义财！<br>妙手神偷走江湖，不盗财来不贪物！<br><br><b>【换日】</b><br>偷梁换柱，万无一失！<br>雕虫小技，让道长见笑了！<br><br><b>【阵亡】</b><br>常在河边走，哪有不湿鞋……<br><br><br><br>');
    createIntroAndTaici('sdyx_sp_huangrong', '桃花岛主黄药师的独女黄蓉才思敏捷，凭借一件软猬甲独步武林，欲伤她者，均被软猬甲反刺。身中蛇毒的南希仁死前曾拍过此甲一掌，后杨康又击此一掌，中毒身亡。黄蓉精通算筹与术数，在黑沼潭轻易破解瑛姑布下的桩阵，在太湖陆乘风布下的五行八卦阵之中也可以来去自如。', '大熊小猫', '落影逝尘', '桃子玥', '<b>【宝甲】</b><br>善恶到头终有报！<br>这一切都是你咎由自取！<br><br><b>【五行】</b><br>此阵怎可与桃花岛相提并论？<br>神目如电，看穿仙界凡间！<br><br><b>【阵亡】</b><br>冤冤相报何时了……<br><br><br><br>');
    createIntroAndTaici('sdyx_spyinggu', '瑛姑本是段智兴的妃子，因倍受冷落，与周伯通珠胎暗结并生下儿子，后其子死于非命。为了击杀裘千仞替儿子报仇，她隐居到黑沼潭苦心钻研术数，以求破解桃花岛的桃花阵术，好救得周伯通出岛。虽精通算筹之术，却事与愿违。后在一灯大师的开解下放下仇恨。', '大熊小猫', '落影逝尘', 'FLORA', '<b>【算筹】</b><br>我黑沼潭岂是你说来就来的？<br>人间最是参不透，不是阵网是情网！<br><br><b>【术数】</b><br>三人同行七十稀，五树♣️️廿一枝。<br>七子团圆正半月，除百零五便得知。<br><br><b>【阵亡】</b><br>鸳鸯织就欲双飞，可怜未老头先白……<br><br><br><br>');
    createIntroAndTaici('sdyx_zhamuhe', '在金庸武侠小说《射雕英雄传》中，札木合与铁木真结义三次。其后双方发生冲突，札木合联合王罕、桑昆部族及金国的六王子完颜洪烈，意图伏击铁木真，但被郭靖识破。在交涉中，铁木真与札木合恩断义绝。在札木合、王罕等战败后，札木合被亲兵捆绑，送至铁木真帐下，札木合自知无颜再见义兄，请成吉思汗赐自己不流血而死。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【斡难】</b><br>三次结拜情，从此恩义绝！<br>斡难冰声犹在耳，情随髀石已归尘！<br><br><b>【联伐】</b><br>莽莽草原，却容不下你我两个英雄！<br>铁木真有安答，可成吉思汗没有兄弟！<br><br><b>【阵亡】</b><br>我要看你东征西讨，亲手创下蒙古人的伟业……<br><br><br><br>');
    createIntroAndTaici('sdyx_jue_guojing', '郭靖在第三次“华山论剑”时，继承师父“北丐”洪七公的北位，成为了“北侠”，与一灯、周伯通、黄药师和杨过合称为“新五绝”。后蒙古军南侵，郭靖夫妇用“二十八宿大阵”大战蒙古军。出任武林盟主后，率领一家人死守襄阳城，最后与妻子黄蓉及小儿子郭破虏一同战死。', '大熊小猫', '落影逝尘', '冰霜墨菊', '<b>【镇卫】</b><br>重甲上阵，杀他个落花流水！<br>头颅尚可抛，山河不能移！<br>鞑子兴兵南下，襄阳断不可失！<br><br><b>【侠骨】</b><br>皑皑白骨映长空，殷殷热血入黄河！<br>犹记当年靖康耻，壮士出征保家国！<br><br><b>【阵亡】</b><br>人生自古谁无死，留取丹心照汗青……<br><br><br><br>');
    createIntroAndTaici('sdyx_yuefei', '岳飞是南宋时期抗金名将、军事家、战略家、民族英雄 ，位列南宋“中兴四将”之首。在《射雕英雄传》中，金庸杜撰的《武穆遗书》是岳飞在沙场上写下的兵书，本藏于铁掌峰第二指节山洞中，金国王爷完颜洪烈为争夺《武穆遗书》，学习里面的兵法称霸中原而大动干戈。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【伐虏】</b><br>壮志饥餐胡虏肉，笑谈渴饮匈奴血！<br>犯我华夏者，虽远必诛！<br><br><b>【战记】</b><br>撒豆成兵，誓破胡虏！<br>何日请缨提锐旅，一鞭直渡清河洛！<br><br><b>【忠魂】</b><br>忠魂常在，佑我中华！<br>斩除顽恶还车贺，不问登坛万户侯。<br><br><b>【阵亡】</b><br>靖康耻，犹未雪；臣子恨，何时灭……<br><br><br><br>');
    createIntroAndTaici('sdyx_huazheng', '华筝公主是郭靖在蒙古一起长大的青梅竹马，倾情于郭靖，被父亲许配给郭靖为未婚妻子，一生钟情于郭靖。后来郭靖南下寻找杀父仇人并与黄蓉交好，郁郁之下华筝向计划伐宋的铁木真泄露了郭靖准备返宋的消息，间接害得郭靖的娘亲自杀，自此一生于郭靖有愧，无颜再见郭靖一面。', '寰宇星城、大熊小猫', '落影逝尘', 'FLORA', '<b>【许婚】</b><br>父汗，女儿非郭靖安答不嫁！<br>孩儿对郭靖，早已芳心暗许！<br><br><b>【长念】</b><br>你此去江南，不知何时能归？<br>十万铁骑踏春归，不见鸿雁捎信回！<br><br><b>【断义】</b><br>你我海誓山盟，岂可薄情寡义？<br>今生你负我，来世永不见！<br><br><b>【阵亡】</b><br>大漠白雕，终抵不过江南的燕儿……<br><br><br><br>');
    createIntroAndTaici('sdyx_huangrong', '桃花岛主黄药师与冯蘅的独生女，精通父亲传授的桃花岛武功、五行八卦阵和奇门遁甲术。黄蓉集天地灵气而于一身，冰雪聪明、玲珑剔透、博古通今，精通琴棋书画、厨艺了得。曾凭借聪明才智多次化解危险。与郭靖一生相恋、患难与共，全心全意助旺他，后辅佐夫君保家卫国，竭尽所能。', '大熊小猫', 'SUKINCEN', '仙女桥', '<b>【请师】</b><br>七公，你就将这套武功授予靖哥哥嘛！<br>我爹爹的落英神剑，自不如你降龙十八掌高明！<br><br><b>【巧言】</b><br>大师救命之恩，如同再生父母。<br>大师舍命相救，蓉儿无以为报！<br><br><b>【奇门】</b><br>略施算筹，乱敌阵脚！<br>布五行八卦阵，方可金蝉脱壳！<br><br><b>【阵亡】</b><br>你们是大漠比翼的白雕，我只是江南柳枝下一只燕儿……<br><br><br><br>');
    createIntroAndTaici('sdyx_zhoubotong', '周伯通是王重阳的师弟，全真七子的师叔。天性纯真，爱作弄别人，故有“老顽童”之称。他不拘小节，与晚辈郭靖结拜为兄弟，教他左右互博术和空明拳。王重阳在第一次华山论争中胜出，得到秘籍《九阴真经》，临终前托咐周伯通好好保管，切不练习书中的武功。周伯通虽贪玩，但一生恪守师兄遗训。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【冥顽】</b><br>上当了上当了！真不好玩儿！<br>老叫化子不肯陪我玩儿，你陪我玩儿吧！<br>情情爱爱的真麻烦，教我养蜜蜂吧！<br><br><b>【守训】</b><br>若我师兄在世，你蔫能接住他十招？<br>师兄让我好生保管此书！<br><br><b>【阵亡】</b><br>情情爱爱，折煞世人情狂……<br><br><br><br>');
    createIntroAndTaici('sdyx_fengheng', '东邪黄药师之妻，黄蓉之母，有过目不忘的本领，曾为黄药师得到《九阴真经》，向周伯通借阅通读一遍，并谎称此书是假的，周伯通盛怒之下撕毁此书，之后冯蘅凭高超的记忆能力一字不漏地默写了一本，并成为孤本。多年后，此书被梅超风盗走，其为重新默写经书，心力交瘁，难产而死。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【默书】</b><br>周大哥，请借经书与我一阅！<br>天之道，损有馀而补不足，是故虚胜实，不足胜有馀。<br><br><b>【瘁心】</b><br>请原谅我已心力交瘁。<br>时隔多年，经文所述已恍然如梦！<br><br><b>【阵亡】</b><br>药师，我实在是，无能为力……<br><br><br><br>');
    createIntroAndTaici('sdyx_ouyangfeng', '欧阳锋，西域白驼山庄庄主，武功登峰造极，为“天下五绝”之一。曾用蛇毒暗算试图救自己的洪七公。为在华山论剑中得到天下第一的名号而急功近利，因逆练郭靖乱改的《九阴真经》而疯。后来与洪七公在华山比武，欧阳锋回复记忆，两人释怀大笑，互相拥抱而逝。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【蛇阵】</b><br>尝尝万蛇噬心的滋味！<br>灵蛇狂舞，逐鹿中原！<br><br><b>【毒袭】</b><br>我白驼山的蛇毒，无药可解！<br>老叫化子已身中剧毒，大难临头。<br><br><b>【逆筋】</b><br>逆行筋脉，别有洞天！<br>顺逆自如，问鼎华山！<br><br><b>【阵亡】</b><br>我是谁，我是谁！谁是欧阳锋……<br><br><br><br>');
    createIntroAndTaici('sdyx_guojing', '郭靖在第三次“华山论剑”时，继承师父“北丐”洪七公的北位，成为了“北侠”，与一灯、周伯通、黄药师和杨过合称为“新五绝”。后蒙古军南侵，郭靖夫妇用“二十八宿大阵”大战蒙古军。出任武林盟主后，率领一家人死守襄阳城，最后与妻子黄蓉及小儿子郭破虏一同战死。', '大熊小猫', '朱阳光', '青灯折扇不语', '<b>【丹心】</b><br>生系黎民苍生，死守襄阳古城！<br>侠之大者刻心中，为国为民撼苍穹！<br><br><b>【破虏】</b><br>藐视金军千秋图，漠然徂徕襄阳西！<br>如今蒙古鞑子进犯，愿天下豪杰共御外敌！<br><br><b>【阵亡】</b><br>射雕英雄今安在？襄阳千古留侠名……<br><br><br><br>');
    createIntroAndTaici('sdyx_zhebie', '哲别最初是铁木真的敌人，曾将铁木真从马上射下。兵败后身受重伤的他躲藏到幼年郭靖家中。郭靖敬佩其神勇，宁死也不将其行踪告知铁木真之子术赤。在术赤即将击杀郭靖的一瞬间，哲别将其救下。哲别佩服铁木真雄才伟略而归于旗下。哲别箭术惊人，在铁木真麾下立下不少战功，更推荐郭靖成为铁木真的助手。', '大熊小猫', '落影逝尘', '觅阳', '<b>【射骑】</b><br>草原男儿，能骑善射！<br>靖儿乃武学奇才，大汗可重用之！<br><br><b>【归附】</b><br>大汗雄才伟略，哲别诚心归附！<br>愿随大汗开疆拓土！<br><br><b>【阵亡】</b><br>魂归大漠……<br><br><br><br>');
    createIntroAndTaici('sdyx_huangyaoshi', '桃花岛主黄药师因个性离经叛道、狂傲不羁、性情孤僻、身形飘忽、有如鬼魅，人称“东邪”。其妻冯氏阿蘅因苦忆《九阴真经》殚心而逝，黄药师为表追思之情，终生未得续弦。郭靖和欧阳克上岛提亲，黄岛主连出三道题目对其进行考试，考试题目无一不与音律与亡妻相关，足见其用情之深。', '大熊小猫', '落影逝尘', '觅阳', '<b>【悲怀】</b><br>风吹落梅蘅芷去，徒留芙蓉对桃花。<br>岁岁醉孤影，天地一放翁！<br><br><b>【曲殇】</b><br>一目十行，且看两位贤侄造化。<br>胜负既分，便将岛图相赠，贤侄可即日离岛。<br><br><b>【阵亡】</b><br>萧瑟平生只自知，玉箫忍按悼亡词……<br><br><br><br>');
    createIntroAndTaici('sdyx_spguojing', '郭啸天在临安牛家村遭段天德杀害，遗孀李萍为逃避追杀而隐居蒙古大漠，郭靖随母自幼在蒙古部落长大，机缘巧合救下勇士哲别，遂拜其为师，习得高超的射箭本领，可百步穿杨，曾一箭双雕，技惊四座。与铁木真四子拖雷结拜为安答。曾多次相救铁木真，并助其统一多个蒙古部落。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【箭驰】</b><br>弯弓如满月，箭去似流星！<br>引弓长射，一箭双雕！<br><br><b>【愚忠】</b><br>大汗养育之恩，自当肝胆相照！<br>靖儿不懂大道理，唯有沙场相报！<br><br><b>【阵亡】</b><br>大宋乃我故疆，大汗何故……<br><br><br><br>');
    createIntroAndTaici('sdyx_qiuqianren', '裘千仞是铁掌帮帮主，有一双胞胎大哥裘千丈和妹妹裘千尺。成名绝学为铁砂掌，江湖人称铁掌水上漂。为在第一次华山论剑中除掉一个强劲对手，打伤南帝段智兴贵妃瑛姑的儿子，想耗费段智兴的真气使他无法获胜。但这是瑛姑和周伯通的私生子，段智兴因而不救，裘千仞计谋失利。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【铁掌】</b><br>气自丹田，掌力不绝！<br>区区软猬甲，怎敌我刚猛拳法！<br><br><b>【祸连】</b><br>段皇爷分心救子，我必能问鼎华山！<br>大丈夫，当不择手段！<br><br><b>【阵亡】</b><br>竟然，失算了……<br><br><br><br>');
    createIntroAndTaici('sdyx_hongqigong', '洪七公为丐帮帮主，为人正义，生性贪吃，曾经因贪吃误事，自断其右手食指，故人称“九指神丐”。离开桃花岛时，在船上被欧阳锋用蛇毒暗袭所伤，于明霞岛上授位给黄蓉并亲授其打狗棒法，以策万全。曾在黄蓉的死缠烂打、美食引诱下，将独门武学降龙十八掌传授给爱徒郭靖。', '大熊小猫', '落影逝尘', '林三', '<b>【授命】</b><br>我大限将至，今将帮主之位传给你！<br>此棒乃帮中信物，切莫落入奸人之手！<br><br><b>【飨宴】</b><br>蓉儿莫忧，且让老叫花子供供五脏庙！<br>山珍海味，莫如这鸳鸯五珍脍！<br><br><b>【阵亡】</b><br>一笑泯恩仇……<br><br><br><br>');
    createIntroAndTaici('sdyx_ouyangke', '欧阳克是西域白驼山的少主，与欧阳锋叔侄相称，实为其私生子。欧阳克面目俊雅、英气逼人，却生性好色。他受到完颜洪烈聘请到中原盗取《武穆遗书》，擅长牧蛇，常以蛇阵应付敌人。为人狡猾阴险，却被道高一丈的黄蓉在明霞岛上设计弄残了双腿。后因在牛家村曲家酒馆调戏穆念慈，被杨康用铁枪头所杀。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【牧蛇】</b><br>在小爷的蛇阵里，尽情地哭喊吧！<br>喊破喉咙，也不会有人救你！<br><br><b>【积黠】</b><br>蓉妹妹绝色无双，做我的压寨夫人吧！<br>交出《武穆遗书》，本公子便赐你解药！<br><br><b>【阵亡】</b><br>杨康，你这个……卑鄙小人……<br><br><br><br>');
    createIntroAndTaici('sdyx_xie_ouyangfeng', '欧阳锋金庸武侠小说《射雕英雄传》中的头号反派与《神雕侠侣》中的重要角色，“天下五绝”之一，绰号西毒。平生作恶多端，武功登峰造极。其白驼山庄嫡传武学蛤蟆功，发功时蹲在地下，嘴里发出咯咯叫声，宛似一只大青蛙作势相扑。此功纯系以静制动，全身蓄劲涵势，韵力不吐，只要敌人一施攻击，立时便有猛烈无比的劲道反击出来。后因逆练郭靖乱改的九阴真经而疯，不过武功更胜从前，于第二次华山论剑中先后击败郭靖、黄药师、洪七公三人，被三人公认为第二次华山论剑武功天下第一。', '吃饱睡睡醒吃', '霸天', '虚怀若谷', '<b>【逆命】</b><br>命犯逆星，天地不容！<br>逆势而动，逆命而行！<br><br><b>【蟾功】</b><br>千钧重弦，蓄势待发！<br>满溢之堤，一触即溃！<br><br><b>【透骨】</b><br>毒锋无影，透骨穿髓！<br>击其弱势，万蛇噬心！<br><br><br><b>【死亡】</b><br>西毒不死，逆命再生！哈哈哈哈哈哈……<br><br><br><br><br>');
    createIntroAndTaici('sdyx_yinggu', '瑛姑本是南帝段智兴的嫔妃，却与周伯通苟合产子，段智兴欲将其赐给周伯通，却被他抛弃。后来裘千仞夜袭皇宫将瑛姑之子打至重伤，目的是让段智兴出手相救耗费体力而在华山论剑中失利，岂料南帝袖手旁观导致婴儿死亡。从此，瑛姑将南帝和裘千刃视为仇敌，一生为了复仇而算计。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【杏殇】</b><br>人生世事太无常，霹雳晴空青叶殇！<br>魄散珠胎没，芳销玉树沉！<br><br><b>【啼孤】</b><br>我儿含冤而逝，为娘定为你讨个公道！<br>这丧子之痛，我已无力承受！<br><br><b>【血仇】</b><br>去阴曹地府向我儿赔罪吧！<br>定要将你血祭吾儿！<br><br><b>【阵亡】</b><br>大仇得报，孩儿，你安息吧……<br><br><br><br>');
    createIntroAndTaici('sdyx_yangkang', '杨康本是忠良之后，因大金六王爷垂涎其母包惜弱美色，设计害得郭杨两家家破人散，并娶包惜弱为贵妃，杨康从此被更名为完颜康，成为王爵世子。后来身世被揭破，他做出了令人失望的选择：表面上认郭靖为义兄，暗地里坏事做尽，难舍眼前的荣华富贵。曾经害死郭靖几位师父并嫁祸给黄药师，令郭靖黄蓉反目。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【威福】</b><br>我乃王爵世子，岂能与草莽为伍！<br>命里藏金，花开富贵！<br><br><b>【利锁】</b><br>一入江湖深似海，从此山河是故人！<br>众叛亲离又何妨，我自陈王与魏王！<br><br><b>【阵亡】</b><br>念慈，我已痛改前非……<br><br><br><br>');
    createIntroAndTaici('sdyx_meichaofeng', '梅超风和师兄陈玄风盗走师父黄药师的《九阴真经》后，被同门追杀到大漠。其练成九阴白骨爪后，令人闻风丧胆。在和江南七怪的激战中，梅超风被柯镇恶暗算而双目失明。后来在黄药师与欧阳锋的激战中，梅超风舍命为恩师挡住欧阳锋一击而死。黄药师在她临死时，重新收她为徒。', '大熊小猫', 'SUKINCEN', '仙女桥', '<b>【厉爪】</b><br>你已难逃魔爪！<br>死在我九阴白骨爪下，是你的造化！<br><br><b>【师恩】</b><br>一日为师，终身为父！<br>叛徒不求原谅，只求为师父受死！<br><br><b>【归岛】</b><br>没能想到，此生还能回到桃花岛！<br>岛上这一草一木，都充满了回忆。<br><br><b>【阵亡】</b><br>梦回桃花岛……<br><br><br><br>');
    createIntroAndTaici('sdyx_duantiande', '段天德是《射雕英雄传》的开篇人物，因贪图财物而受大金六王爷完颜洪烈指使，遣兵到临安牛家村，对郭杨两家展开虐杀，致郭啸天惨死、杨啸天亡命天涯。事迹败露之后，被全真丘处机追杀，潜逃到其伯父枯木大师主持的云栖寺中，妖言惑众向枯木寻求帮助。后害死枯木，独自逃离。', '大熊小猫', '落影逝尘', '弈声传媒有声工作室', '<b>【佞禄】</b><br>有钱能使鬼推磨！<br>此乃杨贼人头，请六王爷验看！<br><br><b>【惑言】</b><br>侄儿再不敢胡作非为！<br>侄儿无处可逃，特来向伯父求救！<br><br><b>【阵亡】</b><br>伯父，侄儿知错了……<br><br><br><br>');
    createIntroAndTaici('sdyx_kezhene', '柯镇恶是江南七侠之首，绰号飞天蝙蝠，绝技是降魔杖法。他是一位侠义英雄，带着弟妹们远赴蒙古大漠寻找梁山忠烈郭啸天的遗孤郭靖，并教他武功和做人的道理。柯镇恶曾这样评价自己：一生正直，数十年来无一事愧对天地。郭靖黄蓉镇守襄阳期间，独居在桃花岛，卒年一百零八岁。', '大熊小猫', '落影逝尘', '涂涂', '<b>【侠胆】</b><br>行走江湖，侠义为先！<br>习武之人，当立锄强扶弱之志！<br><br><b>【降魔】</b><br>无耻之徒，拿命来！<br>路见不平，拔刀相助！<br><br><b>【阵亡】</b><br>我柯镇恶，无愧于天地……<br><br><br><br>');
    createIntroAndTaici('sdyx_munianci', '穆念慈幼年时，双亲死于瘟疫，幸遇落难的杨铁心将其收养为义女。随义父闯荡江湖寻找杨康的过程中，杨铁心为亭亭玉立的她设下比武招亲的擂台，其间被杨康抢走绣花鞋，因此结缘。杨康因贪恋荣华富贵，认贼做父，穆念慈不愿放弃他，苦等其浪子回头。与杨康育有一子杨过。', '大熊小猫', '落影逝尘', '冷冷鱼', '<b>【招亲】</b><br>小女漂泊无依，愿此举觅得佳婿！<br>今设擂台比武招亲，哪位好汉敢挑战？<br><br><b>【缱绻】</b><br>浪子回头金不换！<br>不管你是杨康还是完颜康，都是我不悔的选择。<br><br><b>【阵亡】</b><br>阿康，我来陪你了……<br><br><br><br>');
    createIntroAndTaici('sdyx_tuolei', '拖雷是铁木真四子，自小与郭靖共同习武，同为哲别的徒弟，骑射本领高强。因与郭靖感情深厚而结拜为安答（兄弟）。后郭靖回归大宋，铁木真大力南征，背负各自家国情怀的拖雷与郭靖被迫成为了战场上的敌人，加上郭靖有负于华筝，拖雷与郭靖自此反目，成为了恩断义绝的仇敌。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【引弓】</b><br>蒙古骑兵，所向无敌！<br>东征西讨，随父征战！<br><br><b>【割袍】</b><br>你我不再是安答，而是战场上的敌人！<br>从今以后，你我恩断义绝！<br><br><b>【阵亡】</b><br>郭靖安答，愿我们来世还做兄弟……<br><br><br><br>');
    createIntroAndTaici('sdyx_tiemuzhen', '大蒙古国可汗，尊号成吉思汗。曾赏识郭靖的义薄云天和哲别的骁勇善射而将他们收于麾下。郭靖长大后，帮助他东征西讨，攻下花剌子模等国。铁木真多次发动对外征服战争，征服地域西达中亚和东欧的黑海海滨，极具野心。郭靖曾经反对他的雄心，称是用白骨换来。', '大熊小猫', '落影逝尘', '李二汪', '<b>【戎马】</b><br>一将功成万骨枯！<br>戎马一生，逐鹿中原！<br><br><b>【拓疆】</b><br>东歼金国，南定大宋！<br>普天之下，莫非王土！<br><br><b>【天骄】</b><br>此乃神谕！<br>策马南征，如有神助！<br><br><b>【阵亡】</b><br>我，真的不该杀戮吗……<br><br><br><br>');
    createIntroAndTaici('sdyx_wanyanhonglie', '完颜洪烈是大金六王爷，一生壮志雄心，欲图南宋疆土却一直被铁木真掣肘。六王爷礼贤下士，广纳能人，一生钟情于包惜弱，最后败于铁木真。', '大熊小猫', '落影逝尘、寰宇星城', '弈声传媒有声工作室', '<b>【礼贤】</b><br>求贤若渴，礼贤下士！<br>此人武艺非凡，可收于麾下！<br><br><b>【逐鹿】</b><br>若得《武穆遗书》，定能助我攻克大宋！<br>如此奇书，当归我所有！<br><br><b>【霸业】</b><br>尔等智计百出，乃我大金之福！<br>踏平南宋，荣华富贵享之不尽！<br><br><b>【阵亡】</b><br>胜者为王，改者为寇……<br><br><br><br>');
    createIntroAndTaici('sdyx_duanzhixin', '段誉后人，为大理国皇帝，以大理段氏“一阳指”自成一派，武学修为登峰造极。爱妃瑛姑与周伯通的私生子被裘千仞所伤，因未出手相救而遭瑛姑忌恨，难渡心劫落发为僧。曾耗费大量体力救了伤势严重的黄蓉性命。后渡化裘千仞，将其收为门下弟子。', '大熊小猫', '落影逝尘', '白', '<b>【龙威】</b><br>一中即离，一攻而退。<br>欺身而上，攻敌要害！<br><br><b>【禅心】</b><br>生亦何欢，死亦何苦？<br>有情皆孽，无情太苦。<br><br><b>【普渡】</b><br>天地有情尽白发，人间无意了沧桑。<br>人生如过客，放下即自在。<br><br><b>【阵亡】</b><br>我不入地狱，谁入地狱……<br><br><br><br>');
    createIntroAndTaici('sdyx_qiuchuji', '丘处机早年在牛家村目睹梁山忠烈之后郭杨两兄弟被金兵迫害，追杀元凶段天德的过程中与江南七怪因误会结怨。后虽解除误会，但柯震恶斥责丘处机重伤其兄弟，与其约定分别寻找郭杨两家的后代并授之武艺，十八年后再到醉仙楼比武。丘处机曾出使西域，向成吉思汗谏言止杀爱民。', '大熊小猫', '落影逝尘', '觅阳', '<b>【密约】</b><br>十八年后，各领爱徒，在此一较高下！<br>如此，十八年后，醉仙楼再见！<br><br><b>【使谏】</b><br>大汗当止杀爱民，成传世之仁君！<br>仁政首要，敬天爱民。<br><br><b>【阵亡】</b><br>康儿数典忘祖，这场比赛，贫道是输了……<br><br><br><br>');
    createIntroAndTaici('sdyx_sphuangyaoshi', '黄药师精通棋琴书画和奇门八卦，桀骜不驯，是个有才情的人。自创的碧海潮生曲和落英神剑是桃花岛独有的绝学。碧海潮生曲可迷惑敌人，表面风平浪静实则暗流汹涌，落英神剑掌凌厉如剑，招数繁复奇幻，四面八方都是掌影，真如桃林中狂风忽起，万花齐落一般。', '大熊小猫', '落影逝尘', '觅阳', '<b>【碧潮】</b><br>桃花影落飞神剑，碧海潮生按玉箫。<br>桃花飞影潮生后 ，尽想东邻一笑痴。<br><br><b>【落英】</b><br>桃花剑影独风流，玉笛青衫不系舟。<br>微雨蝶飞忙，落花顾自伤。<br><br><b>【阵亡】</b><br>自古多情总自伤，花自飘零水自流……<br><br><br><br>');
    createIntroAndTaici('sdyx_wangchongyang', '王重阳是全真派创始祖师，五绝之首。他身材甚高， 腰悬长剑，是一个独步武林的奇才。早年抗金，事败后出家修道，享有“天下武学玄门正宗”的美誉。在“华山论剑”中力挫四绝，夺得至高的武学宝典《九阴真经》。临终前更以“一阳指”重创“西毒”欧阳锋，使之数十年不敢踏入中原。', '大熊小猫', '落影逝尘', '狗子', '<b>【论剑】</b><br>客赏险峰有孤松，剑指华山无绝路！<br>多少英雄多少梦，江湖来去各西东。刀锋交错不遑让，以武论道在孤峰！<br><br><b>【玄通】</b><br>万法互通，方知万法皆空！<br>天下武学，玄门正宗！<br>呼吸吐纳心自在，气沉丹田手心开！<br><br><b>【阵亡】</b><br>无敌真寂寞，高处不胜寒……<br><br><br><br>');
    createIntroAndTaici('sdyx_spmeichaofeng', '梅超风本是桃花岛的门人，其与师兄陈玄风私通并盗走《九阴真经》之后，为躲避师傅的追杀而远走大漠，练得至阴至邪的九阴白骨爪，令江湖中人闻虎色变。不料与前来寻仇的江南七怪激战时，姘夫陈玄风不幸身亡，梅超风也被击瞎双目，从此与江南七怪结下了不解之仇，性情也变得更加乖张暴戾。', '大熊小猫', '霸天', '遂非', '<b>【邪爪】</b><br>摧坚神爪，穿骨摄魂！<br>多少能人异士，皆我爪下亡魂！<br><br><b>【震骨】</b><br>天煞孤星泪，亡夫魂未销！<br>好个双双对对，我偏棒打鸳鸯！<br><br><b>【阵亡】</b><br>夫仇未报，岂能……独活……<br><br><br><br>');
    createIntroAndTaici('sdyx_hanxiaoying', '韩小莹在江南七侠中排行第七，擅长越女剑法，身法轻盈，轻功高强。曾远赴大漠寻找郭靖，授予武功。韩小莹虽然是书中的配角，但从各处收集的点滴汇成的韩小莹形象，显示的是一个可亲可爱可敬的女子。在江南七怪中，韩小莹是最疼爱郭靖的，她对郭靖的关爱，胜过一个母亲对孩子的关心。后来在桃花岛冯氏墓中因不敌欧阳锋和杨康的联手攻击，在绝望中她自刎而死，终年36岁左右。', '大熊小猫', '霸天', '酱子', '<b>【越女】</b><br>杳之若日，偏如腾兔！<br>布形候气，与神俱往！<br><br><b>【巧剑】</b><br>风灵轻渡雨，剑蕴巧心中！<br>拭刃浣纱后，泛舟采莲花。<br><br><b>【阵亡】</b><br>阿生哥，小莹这就来陪你了……<br><br><br><br>');
    createIntroAndTaici('sdyx_zhangasheng', '张阿生在“江南七怪”中排行第五，绰号笑弥陀，身材魁梧，全身油腻，腰间插着柄尺来长的尖刀，原本是个杀猪宰羊的屠夫。武器为屠牛刀，擅长角抵之术，掌法直来直往，威力颇大。心里爱慕着七妹韩小莹。在荒山夜战中为了救韩小莹，以身体挡住陈玄风的九阴白骨爪，在头顶上又遭猛击一拳，临死前才敢表白。韩小莹在他临死前嫁给了他。', '大熊小猫', '霸天', '末生', '<b>【庖丁】</b><br>拆骨分筋，游刃有余！<br>庖丁解牛，大快朵颐！<br><br><b>【铁血】</b><br>虽为贩夫走卒，常怀忠义之心！<br>情如铁坚，义比血浓！<br><br><br><b>【阵亡】</b><br>七妹，莫哭，莫哭……<br><br><br><br>');
    createIntroAndTaici('ywhy_wokuotai', '孛儿只斤·窝阔台，系元太祖成吉思汗的与正妻孛儿帖所生第三子，大蒙古帝国第二任大汗。早年随父亲征服漠北诸部，参加攻金、西征。于太宗六年，与宋联军灭金。次年，议定分兵西征中亚、欧洲，东侵高丽，南攻南宋。在位期间采用“汉法”，立朝仪，建中书省，确定赋税，建立驿站，命路府州县置达鲁花赤，以探马赤军分镇中原，设官分掌军民诸事。晚年统治渐趋混乱。于太宗十三年十一月病死。', '大熊小猫', '霸天', '联络', '<b>【蚕食】</b><br>臣服于蒙古帝国的铁蹄之下吧，哈哈哈……<br>拿下此城，如扼南朝咽喉！<br><br><b>【鲸吞】</b><br>蒙古帝国，四海无疆！<br>马蹄所踏，皆为王土！<br>要把青天覆盖的土地，都变作蒙古人的牧场！<br><br><b>【阵亡】</b><br>马背上的民族，绝不会被打败……<br><br><br><br>');
    createIntroAndTaici('sdyx_xie_yangkang', '杨康是杨铁心与包惜弱之子，本为梁山忠烈之后，因金国六王爷完颜洪烈觊觎其母亲的美色，家庭遭遇迫害，母亲被强娶，自己便成为六王爷的养子，从此养尊处优。生母养父对其万般宠溺，自幼在顺境中成长，处处争强好胜、不择手段。因迷恋金朝王室的富贵，在得知身世后仍继续追随仇人完颜洪烈，并欲继其王位。后因作恶多端，因果循环，死于自己的贪欲。', '大熊小猫', '霸天、棉花糖', '岛主', '<b>【阴爪】</b><br>九阴魔爪，开颅取髓！<br>十指贯胸，烈爪开膛！<br>量小非君子，无毒不丈夫！<br><br><b>【伪道】</b><br>欲成霸业，安能妇人之仁！<br>富贵无极，岂能不冒凶险！<br>他日败寇成王定，我自富贵你自贫！<br><br><br><br><b>【阵亡】</b><br>父王，不要抛下孩儿……<br><br><br><br>');
    createIntroAndTaici('sdyx_shagu', '傻姑是金庸武侠小说《射雕英雄传》和《神雕侠侣》中的人物，是桃花岛嫡传弟子曲灵风的女儿。曲灵风死后，受刺激而神智不清，变得痴痴傻傻。后被黄药师带回桃花岛练就了一身不凡的武功。在与李莫愁比武之时，丝毫不落下风。曾在铁枪届亲眼目睹杨康想要一掌置黄蓉于死地，却被黄蓉软猬甲上的蛇毒反杀。多年后，在冯默风的铁匠铺头将当年的事发经过转述给杨过，使这段尘封的信事重新被人知晓。', '大熊小猫', '霸天', '安生', '<b>【前尘】</b><br>好兄弟，别杀我，别杀我！<br>你去找姑姑抵命，不要找我啊！<br><br><b>【无忧】</b><br>摇啊摇，摇到外婆桥，嘿嘿嘿……<br>哈哈哈，真好玩，哈哈哈哈……<br><br><br><br><b>【死亡】</b><br>爷爷，救命，救命！<br><br><br><br><br>');
    //神雕侠侣
    createIntroAndTaici('sdxl_maguangzuo', '马光佐是金庸武侠小说《神雕侠侣》中的角色，是蒙古四王爷忽必烈座下五大高手之一。马光佐是回疆高手，力大无穷，身高八尺，粗手大脚，脸带傻笑，双眼木然，使用熟铜棍为武器。他在书中是个戆直之人，也是除老顽童外最可爱的人物。重阳宫一役中他见到杨过和小龙女重逢后，欢笑而去，倒有一点潇洒之意 。', '吃饱睡睡醒吃', '霸天', '大宝', '<b>【角力】</b><br>吃……我……一……棍！<br>比力气？我老马难逢敌手！<br>天生神力，所向披靡！<br><br><b>【蛮霸】</b><br>那郭靖妖法厉害，下次再去会会他！<br>俺老马绝不以大欺小、恃强凌弱！<br><br><b>【戆直】</b><br>好酒，好酒……唔……来！干杯！<br>嘿嘿，酒肉穿肠，大块朵颐！<br><br><br><b>【死亡】</b><br>杨兄弟，新娘子，我去也！哈哈哈哈……<br><br><br><br><br>');
    createIntroAndTaici('sdxl_luwushuang', '陆无双，是金庸小说《神雕侠侣》中的人物。原是江南陆家庄的千金小姐，陆家庄二庄主陆立鼎的女儿，幼时遭“赤练仙子”李莫愁灭门，并被其掳去，后成为李莫愁的徒弟，长大后偶遇杨过，并对杨过暗暗倾心。她容貌娇美俏丽，活泼刁钻，机灵可爱，敢爱敢恨，一直深爱杨过，无奈杨过心属小龙女，遂终身不嫁，与表姐程英相伴余生。在绝情谷事件后获得义兄杨过传授古墓派的最高武功秘籍《玉女心经》，十六年间武功大进，成为一流高手。', '吃饱睡睡醒吃', '霸天', '安生', '<b>【家恨】</b><br>终有一日，定要女魔头血债血偿！<br>灭门之仇，他日必报！<br>家破人亡残躯存，景依旧，江湖深！<br><br><b>【孤雏】</b><br>傻蛋，那女魔头杀人不眨眼，你快走啊！<br>如今唯有此计，方能避开我师傅的追查！<br>江湖困顿，趋避强仇！<br>孤雏无依，天涯亡命！<br><br><br><br><b>【死亡】</b><br>杨大哥，我们还能，再见面吗……<br><br><br><br><br>');
    createIntroAndTaici('sdxl_nimoxing', '尼摩星是金庸武侠小说《神雕侠侣》中人物，蒙古军中五大高手之一。尼摩星是天竺来的高手，擅长瑜珈之术，武功狠辣，使用一条蛇形铁鞭，为人颇有野心，虽同为忽必烈麾下，但对金轮法王颇有不服，赏赏邀功争勋，对蒙古国第一勇士之名有觊觎之心。曾在蒙古营中偷袭郭靖。尼摩星脑子并不精光，在襄阳一战中，杨过与李莫愁被金轮法王逼到山洞中躲避，杨过情急之下用李莫愁的冰魄银针布下陷阱，金轮法王不查之下，脚底中针，法王又欺骗尼摩星中招，迫使他自断双腿自保。后其在羊太傅庙中狙杀郭氏姐妹时，被杨过暗中以郭襄一支玉簪击中头部而亡。', '吃饱睡睡醒吃', '霸天', '大宝', '<b>【争勋】</b><br>谁是蒙古第一高手，稍后自有分晓！<br>鹿死谁手，犹未可知！<br>此战劳苦功高，我当受此嘉赏！<br><br><b>【断足】</b><br>舍此残肢，解毒保命！<br>欲救此陷，当断双足！<br><br><b>【苦行】</b><br>鞑靼人的三脚猫功夫，怎比得过天竺秘术？<br>瑜伽修肉身，苦行炼神魂！<br><br><br><b>【死亡】</b><br>难道……强中自有强中手……<br><br><br><br><br>');
    createIntroAndTaici('sdxl_xie_limochou', '李莫愁是金庸武侠小说《神雕侠侣》中悲剧式人物，小龙女的师姐。容貌甚美，却心若蛇蝎，因此江湖中人称其为赤练仙子。年轻时本性善良，倾心于陆展元，因此留恋尘世而被师父逐出师门，本想与陆展元共浴爱河，却没想到被陆展元狠心抛弃。自此李莫愁身心大受打击，性情大变，因爱成恨。曾几乎杀尽陆展元亲弟弟陆立鼎满门，并折磨陆立鼎之女陆无双。纵横江湖十余年，手执冰魄银针、五毒神掌杀人无数，江湖中人无不对之闻风丧胆。李莫愁心狠手辣，毫无悔改之意，虽然曾经救过洪凌波并收她为徒，在绝情谷为了活命却将徒弟洪凌波当垫脚石意欲跳出情花丛，洪凌波拉住李莫愁归于尽。李莫愁被万千情花刺中后，却仍不忘陆展元，最后葬身于焚烧情', '吃饱睡睡醒吃', '霸天', '喵吱', '<b>【悼歌】</b><br>误我意兮恨情深，哀彼绝兮悼永伤！<br>我已无心薄留悔，君既有灵悔薄情？<br>千年悲情悼亡赋，万里哀伤凄歌词！<br>冰魄封心葬白骨，情花入血落残红！<br><br><b>【毒传】</b><br>赤练附骨，蛇毒噬心！<br>毒牙吮血，赤焰灼魂！<br><br><b>【欲海】</b><br>情根一动，烈火焚心，哈哈哈哈……<br>我要天下有情人，都为我陪葬！<br>今生今世不再有李莫愁，只有赤练仙子！<br><br><br><b>【死亡】</b><br>情生缘灭何身殉？爱孽自起难由心……<br><br><br><br><br>');
    createIntroAndTaici('sdxl_jue_wangchongyang', '王重阳，是金庸武侠小说《射雕英雄传》和《神雕侠侣》中的人物，全真派创始祖师，天下五绝之首的中神通 ，身材甚高， 腰悬长剑，风姿飒爽，英气勃勃，飘逸绝伦。是老顽童周伯通的师兄，全真七子的师父。是一个独步武林的奇才，天资聪颖，武功造诣深不可测，已经达到登峰造极的地步，世称天下第一。早年是位抗金英雄，事败后出家修道，在终南山创立全真教，在武林中享有天下武学玄门正宗的美誉。在华山论剑之时，力挫四绝，夺得天下第一高手称号和道家至高的武学宝典《九阴真经》。临终前更以一阳指重创西毒欧阳锋，使之数十年不敢踏入中原。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【参斗】</b><br>天宇无极，宙耀七星！<br>明河映苍穹，北斗落长空！<br><br><b>【星罗】</b><br>天以顺动而地以灵静，故星斗有行矣。<br>七曜行而众星恒，近天则迟，远天则速。<br><br><b>【紫微】</b><br>为政之德譬如北辰，居紫微而众星拱之。<br>天有三辰，辰之一仪，谓之北极。<br><br><b>【天罡】</b><br>极星通地轴，星象正天枢！<br>身同流星杳然逝，吾道长存共北辰！<br><br><b>【天枢】</b><br> 万象举动撼天枢八极纵目览星辰。<br>天枢之星，贪狼之宿。<br><br><b>【天璇】</b><br>天海沁翠色，星璇入银河。<br>天璇应地，巨门入星。<br><br><b>【天玑】</b><br>月华凝碧玉，星尘聚天玑。<br>天玑存禄，避凶趋吉。<br><br><b>【天权】</b><br>我为莹烛纵黯淡，权平北斗自光芒。<br>天权之衡，步北斗，踏天罡。<br><br><b>【玉衡】</b><br>玉衡指孟冬，众星何历历。<br>玉衡璀璨，以正廉贞。<br><br><b>【开阳】</b><br>开阳升烽燧，残月落边城。<br>星辅双合，共行开阳。<br><br><b>【摇光】</b><br>摇光一转动北斗，失路荒芜指迷津。<br>摇光破军，德全七政。<br><br><b>【死亡】</b><br>人生不复见，动如参与商……<br><br><br><br><br>');
    createIntroAndTaici('sdxl_huodu', '霍都是蒙古王子，蒙古国师金轮法王的第三个弟子，达尔巴的师弟，武器为钢骨磨扇。为人阴险狡诈，善使诡计。在全真教教一战中，师父金轮法王不敌杨过，假意与达尔巴共同救师，旋即用诈术骗师兄独力支持，说要回去修练十年，抛弃恩师，自行脱身逃跑，天性之凉薄可见一斑。后来以何师我之名隐身丐帮十余年，并用奸计杀害鲁有脚，夺取打狗棒。最后被杨过和黄药师合力诛杀。', '大熊小猫', '霸天', '药仰', '<b>【脱壳】</b><br>留得青山在，不怕没柴烧！<br>金蝉脱壳，险中求生！<br>三十六计，走为上策！<br>此仇不报，非君子！<br><br><b>【倨傲】</b><br>本王子大驾中原，尔等，为何不跪？<br>龙骨为扇，杀人，如狂风迅雷！<br><br><b>【险诈】</b><br>你我师徒情分，今日一刀两断！<br>什么师父？我是主，你为仆！<br><br><br><b>【阵亡】</b><br>金蝉脱壳，螳螂在后……<br><br><br><br>');
    createIntroAndTaici('sdxl_xie_gongsunzhi', '公孙止是在金庸小说《神雕侠侣》中登场的反派人物，绝情谷谷主，身穿宝蓝缎子袍子，面目英俊，举止潇洒，颏下留有微髭。谷里种满情花，此花剧毒无比，中了此毒，只要心中对意中人所念所想，皆会毒发生全身，痛不欲生，可谓伤尽天下有情人，杨过与李莫愁皆为此毒爱害者。为逼迫小龙女嫁给自己，曾与杨过三度交锋，第三战因裘千尺从旁指点杨过而落败，闭穴功被破，更中了枣核钉而导致右目失明，仓皇逃离绝情谷。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【焚情】</b><br>烈焰焚情，火海葬心！<br>碧焰烧干千层泪，赤血染花两边心！<br><br><b>【薄情】</b><br>我纵得不到你的心，也要得到你的人！<br>若不与我拜堂成亲，你的爱郎休想踏出这绝情谷！<br><br><b>【无情】</b><br>无情伤尽有情人，有情自伤无情物！<br>自古多情空余恨，多情总被无情伤！<br><br><b>【解情】</b><br>情花伤情深，断情需绝情！<br>欲治情毒草，断肠为良药！<br><br><b>【阵亡】</b><br>情之一物，最是伤人，哈哈哈哈哈……<br><br><br><br>');
    createIntroAndTaici('sdxl_jue_yanggaizhi', '杨过是杨康的遗腹子，因父亲生前卖国求荣被整个江湖所不耻，所以杨过自小也不受黄蓉待见，养成孤僻又叛逆的性格。随着阅历的增长，他逐渐认识真相、接受真相。在与小龙女几经生离死别之后，终于有情人终成眷属。十六来年行侠仗义，誉满江湖。后协助郭黄夫妇在襄阳大战击杀蒙哥。在最后一次华山论剑中，他被称为“西狂”。', '大熊小猫', '霸天', '末生', '<b>【改之】</b><br>过而能改，善莫大焉！<br>父孽子还，功过相赎！<br>知过不讳，改过不惮！<br>若非郭伯伯教诲如子，过儿焉有今日？<br><br><b>【伤情】</b><br>此情未待成余恨，只是伤心到尽头！<br>情思莫共情花绽，一寸别离一寸伤！<br>碧落黄泉难寻见，幽梦恐别恨天长！<br>断肠肠断泪难断，伤情情伤心亦伤！<br><br><b>【西狂】</b><br>是是非非何时了，恩恩怨怨几时休！<br>古来英豪皆寂寞，天下谁人复我敌？<br><br><b>【阵亡】</b><br>他日江湖若相逢，把酒千盏再言欢……<br><br><br><br>');
    createIntroAndTaici('sdxl_xiaoxiangziyinkexi', '潇湘子，湘西名宿，擅使藏毒的哭丧棒。尹克西，波斯胡商，擅使嵌宝金龙鞭。 两人效力于蒙古，在终南山被杨过打败，十六年后贼心不死，同行至少林寺窃取经书。后在华山为瞒觉远等人，两人将九阳真经藏在猿猴腹中。但是二人互相猜忌，至昆仑山互斗而死。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【窃经】</b><br>尹：既入少林宝地，岂能空手而归？<br>潇：瞒天之计已成，速速脱壳抽身！<br><br><b>【互忌】</b><br>尹：潇湘兄，休要独占宝书！<br>潇:自古无奸不成商，莫要打这如意算盘！<br><br><b>【阵亡】</b><br>经……在猴中……<br><br><br><br>');
    createIntroAndTaici('sdxl_juezhoubotong', '周伯通是《射雕英雄传》和《神雕侠侣》中的人物，中神通王重阳的师弟，全真七子的师叔。他天性纯真，爱捉弄别人，故有“老顽童”之称。他不拘小节，与晚辈郭靖结拜为兄弟，和神雕侠侣成为忘年之交。于第三次华山论剑之时得“中顽童”之号，被推为新“天下五绝”之首。', '大熊小猫', '霸天、藏海', '狗子', '<b>【互搏】</b><br>心无杂念，自成方圆!<br>以一人之力，展二人之威！<br><br><b>【空明】</b><br>大成若缺，其用不弊！<br>大盈若冲，层出不穷！<br><br><b>【逐戏】</b><br>华山论剑？好玩儿好玩儿好玩儿！<br>情情爱爱惹人烦，还是养蜜蜂好玩！<br><br><b>【阵亡】</b><br>春波碧草，晓寒深处，相对浴红衣……<br><br><br><br>');
    createIntroAndTaici('sdxl_gongsunlve', '公孙绿萼是《神雕侠侣》中的人物，绝情谷公孙止和裘千尺的女儿。清秀美丽、善良多情，初识杨过便倾心于他，瞒着父亲偷偷相助他和小龙女。为救杨过去偷绝情丹，甚至不惜与杨过一起被打落深潭。后来眼见父母相残的惨剧上演，心灰意冷，为给杨过换解药而自杀。', '大熊小猫', '藏海、霸天', '奶诗', '<b>【献丹】</b><br>女为悦已者容，亦可为已悦者死！<br>飞蛾扑火，芳心无悔！<br><br><b>【困情】</b><br>弱水三千，只取一瓢！<br>情网如织，我心如茧！<br><br><b>【阵亡】</b><br>杨大哥，今生缘悭，来世再见……<br><br><br><br>');
    createIntroAndTaici('sdxl_daerba', ' 达尔巴是《神雕侠侣》中的人物，金轮法王的二徒弟，属于蒙古密教金刚宗。他性格憨厚，头脑简单，但是力大无穷，是大蒙古国帐下不可多得的勇士。达尔巴曾在丐帮的比武大会上打败金轮法王的叛徒霍都，霍都当即诈死，达尔巴念及同门之情，在一旁念了三遍往生咒后便飘然而去。', '大熊小猫', '霸天', '无忆CHENG', '<b>【气吞】</b><br>拔地参天，力贯苍穹！<br>攻城拔寨，所向无敌！</b><br>遇山开山，逢水劈水！<br><br><b>【狂杵】</b><br>大力金刚杵！！<br>夺命狂杵，取你性命！<br>中原武林，尽是鼠辈！<br><br><b>【阵亡】</b><br>我的力气，也耗尽了……<br><br><br><br>');
    createIntroAndTaici('sdxl_luzhanyuan', '李莫愁不顾男女之嫌为负伤的陆展元疗伤，两人日久生情订下婚约，李莫愁赠他一抹方帕，却再也不见心上人归来。陆展元与何沅君两情相悦、携手成婚，李莫愁一场爱恋转眼成空，性情大变，由爱生恨，终变成一代女魔头。在李莫愁寻仇之际，陆展元为保女儿和侄女平安，将李莫愁赠予的锦帕撕为两半分别交给她们，希望李莫愁顾念旧情而饶她们一命。', '大熊小猫', '落影逝尘', '李二汪', '<b>【问情】</b><br>欢乐趣，离别苦，就中更有痴儿女！<br>千山暮雪，只影向谁去！<br><br><b>【怀绢】</b><br>你们藏好这方锦帕，可保一时平安！<br>愿女魔头赌物思人，饶你们性命！<br><br><b>【阵亡】</b><br>问世间，情是何物……<br><br><br><br>');
    createIntroAndTaici('sdxl_shendiao', '神雕是金庸小说《神雕侠侣》中的角色，剑魔独孤求败的伙伴。乃稀有的大型猛禽，天生神力，身形甚巨，形貌丑陋，全身羽毛疏疏落落，钓嘴弯曲，羽毛呈黄黑，显得甚是肮脏，然亦威武气概。 与独孤求败相处太久因此也拥有骇人的搏击技巧。独孤求败死后独自守护剑冢，后将玄铁重剑和孤独九剑交与杨过，是杨过的半师半友，在杨过在等待小龙女的16年期间与其共同闯荡江湖。', '大熊小猫', '落影逝尘', '狗子', '<b>【守冢】</b><br>得雕兄慷慨相赠，小弟便不客气了！<br>如此宝剑，小弟愧不敢收！<br><br><b>【督武】</b><br>雕兄真是严师出高徒啊！<br>（雕鸣）<br><br><b>【阵亡】</b><br>（无）');
    createIntroAndTaici('sdxl_spyangguo', '父母双亡的杨过一生命运坎坷，因郭靖所托非人，幼年杨过遭受全真教教众欺侮，因缘际会下拜小龙女为师。师徒二人挑战世俗传统，成为结发夫妻。两人屡遭迫害，历经劫难，后小龙女在绝情谷坠崖失踪。心灰意冷的杨过和神雕苦练武功，仗义行侠。夫妻二人重聚后，共助郭家对抗外敌。', '大熊小猫', '落影逝尘', '狗子', '<b>【葬情】</b><br>哀莫大于心死，而人死亦次之！<br>世界上最遥远的距离，莫过于阴阳两隔！<br><br><b>【流放】</b><br>彼岸花开开彼岸，奈何桥前可奈何！<br>生死两茫茫，何处话凄凉？<br><br><b>【销魂】</b><br>断肠之殇，锥心之痛！！<br>黯然销魂者，唯别而已矣！<br><br><b>【阵亡】</b><br>古墓，是我们最好的归宿……<br><br><br><br>');
    createIntroAndTaici('sdxl_zhenzhibing', '甄志丙是丘处机座下二弟子，也是全真教三代弟子的首席翘楚，风度翩翩，但因按耐不住欲望犯了大忌玷污了小龙女，后来知道自己犯了大错便以死谢罪；甘愿自刎在小龙女剑下，跪求小龙女的原谅。同时在应对蒙古入侵的问题方面，保持了应有的气节，所谓小节有损，大节不亏。', '大熊小猫', '落影逝尘', '狗子', '<b>【窃玉】</b><br>一亲姑娘芳泽，甄某死而无憾！<br>姑娘美若天仙，怎教在下不心驰神往？<br><br><b>【大节】</b><br>小节有损，大节不亏！<br>鞑子挥师入中原，全真教必身先士卒！<br><br><b>【阵亡】</b><br>甄某之过，非一死而能赎罪……<br><br><br><br>');
    createIntroAndTaici('sdxl_fengmofeng', '冯默风是桃花岛黄药师的小徒弟，黄药师爱妻去世期间，梅超风和陈玄风合伙盗走《九阴真经》下部，黄药师愤而挑断所有弟子脚筋并逐出师门。冯默风再次登场是替杨过等人解围。他假意应召入蒙古军队锻造兵器，实为窃取军情。后为护送郭靖杨过出营被金轮击杀。', '大熊小猫', '落影逝尘', '小林', '<b>【巧匠】</b><br>天工所至，精器为开！<br>枭贼匪乱助胡虏，精兵利器定神州！<br>铸神兵利刃，驱流寇奸宄！<br><br><b>【潜营】</b><br>病体残躯何所惜，匡助危城驱蛮夷！<br>不入虎穴，焉得虎子！<br><br><b>【阵亡】</b><br>犹记当年桃花开……<br><br><br><br>');
    createIntroAndTaici('sdxl_jue_duguqiubai', '独孤求败是在《神雕侠侣》中首次被提及的江湖传说，毕生求一败而不可得，最后埋剑于剑冢，郁郁而终。其事迹只在极少数武林人士之间口耳相传。其性格率直孤傲，行事不喜拘束，倏然而出，倏然又隐，独创了冠绝天下的剑法《独孤九剑》。', '大熊小猫', '落影逝尘', '小林', '<b>【无招】</b><br>无招胜有招。<br>无剑胜有剑。<br>遍寻天下，但求一败。<br>败尽英雄，天下无双。<br>不滞于物，草木皆兵。<br>高处不胜寒！<br>自古高手皆寂寞！<br><br><b>【葬剑】</b><br>隐居深谷，埋剑于此！<br>群雄束手，长剑空利，不亦悲夫！<br><br><b>【阵亡】</b><br>我，是自己最大的敌人……<br><br><br><br>');
    createIntroAndTaici('sdxl_chengying', '程英是说《神雕侠侣》中的人物，陆家庄表小姐，陆无双表姐。本性温柔善良，武功成就颇高。陆家庄遭李莫愁屠杀时侥幸得命，被黄药师收为关门弟子，传授她桃花岛武功和五行阵法。程英曾与黄蓉一起夜探蒙古大营，全身而退。与杨过萍水相逢，几次相救后对他心生爱慕，杨过对她极为敬重。绝情谷一役后，小龙女离去，杨过与程陆姐妹义结金兰，三人兄妹相称。', '大熊小猫', '银汉贯苍穹', '大绿_Midori酱', '<b>【神通】</b><br>小小碎石，亦可力破千钧！<br>金铮之音，非袖而聚其势！<br><br><b>【箫剑】</b><br>桃花影落飞神剑，碧海潮生按玉箫。<br>箫声一付，空谷幽兰。<br><br><b>【阵亡】</b><br>契若金兰，莫逆于心……<br><br><br><br>');
    createIntroAndTaici('sdxl_guojinghuangrong', '《神雕侠侣》时期的郭靖是武林的领袖，携带家人长期守护南宋襄阳前线边境，受万民景仰。守城期间，襄阳城防事务几乎全靠郭靖主持，因而郭靖被襄阳军民们视为神州大地的中流砥柱。最终襄阳城失陷，靖蓉夫妇双双殉国，贯彻其一生“为国为民，侠之大者”的高尚节操。', '寰宇星城', '寰宇星城', '炎凉、狗子', '<b>【固守】</b><br>神兵在手，斩敌击寇；奇书在旁，固守襄阳！<br>且缮义勇三千甲，四方执锐固襄阳！<br><br><b>【缨冠】</b><br>得义士援助，襄阳可守！<br>血海激涛护城河，刃映寒锋困森罗！<br><br><b>【危城】</b><br>兵临城下襄阳危，铁胆英豪铸堡垒！<br>城池危在旦夕，我等当戮力同心！<br><br><b>【浴血】</b><br>望眼尸山砌忠骨，狼烟燃铸英雄魂！<br>鞑虏噬骨如蚁附，援纳百川聚海流！<br><br><b>【援守】</b><br>捐躯赴国难，视死忽如归！<br>男儿有志报沙场，马革裹尸守襄阳！<br><br><b>【阵亡】</b><br>铁血襄阳终难守，留取丹心照后人……<br><br><br><br>');
    createIntroAndTaici('sdxl_yangguoxiaolongnv', '在金庸作品《神雕侠侣》中，杨过和小龙女是一对颇具争议的情侣，虽然曾受尽世人眼冷，但他们不离不弃、沧海桑田的爱情终成为一段佳话流传于世。两人分别使用全真剑法和玉女剑法，可以双剑合璧，威力大增，能克制全真教的道士，也曾凭此剑法力战金轮法王。', '大熊小猫', '落影逝尘', '黑兔、孑然', '<b>【璧合】</b><br>古墓全真，相生相克！<br>玄铁重势，可破万法！<br>剑舞轻灵，以柔克刚。<br><br><b>【仙侣】</b><br>经年历尽千霜雪，不渝白首始如新！<br>沧海桑田，不离不弃！<br><br><b>【阵亡】</b><br>神雕侠侣，绝迹江湖……<br><br><br><br>');
    createIntroAndTaici('sdxl_hubilie', '忽必烈是蒙古监国拖雷第四子，元宪宗蒙哥之弟。在《神雕侠侣》中，其招募多名武林高手于麾下，以高官厚禄作为诱惑令他们刺杀郭靖。后刺杀未果，便以郭靖世侄的身份邀请郭靖至帐中叙谈，以仁义之师和吊民伐罪的名义自居，企图劝降郭靖，被郭靖当场怒斥。', '寰宇星城', '落影逝尘', '沃声_风飞语', '<b>【犒赏】</b><br>重赏之下，必有勇夫！<br>立此汗马功劳，定享高官厚禄！<br><br><b>【劝降】</b><br>我等吊民伐罪，实乃仁义之师！<br>郭叔父盖世英雄，何苦事奉昏君？<br><br><b>【阵亡】</b><br>千古霸业一场梦……<br><br><br><br>');
    createIntroAndTaici('sdxl_guofuX', '郭芙是郭靖和黄蓉的长女，从小娇生惯养，黄蓉将软猬甲和汗血宝马都送给了她。更被大武小武视若公主，养成高傲任性的性格 。后与杨过发生争执怒而削其臂膀。虽是个固执的大家小姐，亦有保家卫国的情怀，与家人一起守卫襄阳，在与蒙古大军交战的过程中死于战场。', '大熊小猫', '落影逝尘', '地鼠', '<b>【骄恣】</b><br>杨过，我跟你不共戴天！<br>本大小姐可不好惹！<br><br><b>【耽溺】</b><br>桃花岛大小姐在此，谁敢放肆？<br>大武小武，给我教训这个臭小子！<br><br><b>【宝甲】</b><br>宝甲在身，你蔫能伤到我半根毫毛！<br>我是娘的掌上明珠，这软猬甲自然归我所有！<br><br><b>【怒马】</b><br>春入眉心一点愁，芳华共争国事忧！<br>襄阳凭栏对狼烟，红衣怒马复少年！<br><br><b>【阵亡】</b><br>错尽悔不知，再见亦如斯……<br><br><br><br>');
    createIntroAndTaici('sdxl_yangguo', '《神雕侠侣》男主角，杨康与穆念慈之子，因杨康一生犯错，郭靖将其起名为杨过，愿其有过而知改。自小与师父小龙女在古墓长大，后来发展出一段惊世骇俗的爱情。小龙女在绝情谷身中剧毒而投崖，杨过万念俱灰中悟出绝世武功黯然销魂掌。十六年后终与小龙女重逢，夫妻二人帮助郭家保卫襄阳。', '大熊小猫', 'SUKINCEN', '清酒摇舟', '<b>【黯然】</b><br>莫道黯然销魂，何处柳暗花明？<br>一十六载，魂断天涯！<br><br><b>【别赋】</b><br>绝情断崖处，伊人今在否？<br>相思无用，唯别而已，别期若有定，千般煎熬又何如？<br><br><b>【伤离】</b><br>多情自古伤离别！<br>十年生死两茫茫，不思量，自难忘！<br><br><b>【阵亡】</b><br>未知今夕何夕……<br><br><br><br>');
    createIntroAndTaici('sdxl_xiaolongniv', '《神雕侠侣》女主角，终南山古墓派弟子，一生恪守师父遗言守在古墓，不食人间烟火。清新脱俗，清冷婉约。因孙婆婆临终遗言，被迫收下男徒杨过并与其发展出轰轰烈烈的师徒恋。虽不为世人所容，但历经磨难终成佳眷。在杨过小时候曾教他用天罗地势网练习捕捉麻雀；两人亦曾共同修炼绝学玉女素心剑法。', '大熊小猫', 'SUKINCEN', '草莓味少女', '<b>【罗网】</b><br>待你习就双掌罗雀，便是我古墓派入室弟子了。<br>在这天罗地网中，了此残生吧！<br><br><b>【合璧】</b><br>此乃本门绝学，需二人合璧修炼。<br>双剑合璧，技压全真。<br><br><b>【墓宗】</b><br>野径斜入终南山，冷冷秋色古墓寒！<br>十六载，相思染，携手归隐终南山。<br><br><b>【阵亡】</b><br>人间烟火，山河远阔，无一是你，无一不是你……<br><br><br><br>');
    createIntroAndTaici('sdxl_jinlunfawang', '《神雕侠侣》第一反派。金轮法王属蒙古密教金刚宗，同时也是蒙古的国师。擅使五轮兵器，内功方面精研龙象般若功，最高练到第十层境界，威力无穷，几乎可与杨过的黯然销魂掌匹敌。后以蒙古国师身分协助由忽必烈统率的蒙古南侵大军攻打南宋，在中原大地上与杨过、小龙女等结下不解之仇，后败于黯然销魂掌。', '大熊小猫', '落影逝尘', '狗子', '<b>【龙象】</b><br>吃我一记龙象般若掌！<br>掌如霹雳，无坚不摧！<br><br><b>【密宗】</b><br>待我习得龙象般若十三层，定能纵横中原武林！<br>金刚密宗，擎天撼地！<br><br><b>【阵亡】</b><br>难道我龙象般若掌，竟不如这黯然销魂掌……<br><br><br><br>');
    createIntroAndTaici('sdxl_mengge', '孛儿只斤·蒙哥是大蒙古国的大汗，1251至1259年在位，史称蒙哥汗。为元太祖成吉思汗之孙、拖雷长子。《神雕侠侣》中的蒙哥，在率军攻打南宋的期间，为了迫使镇守襄阳城的郭靖投降，命令金轮法王捉拿了郭靖之女郭襄作为人质，将她绑在两军阵前的高台上，扬言要烧死她。后被杨过射死。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【挟制】</b><br>你是选你女儿，还是选襄阳城的百姓？<br>你若不肯降顺，我便当着两军将士的面，烧死你宝贝女儿！<br>在你宝贝女儿和襄阳城之间，做个抉择吧！<br>我要当着天下英雄的面，让你女儿葬身火海！<br><br><b>【阵亡】</b><br>马背上的民族，当战死沙场……<br><br><br><br>');
    createIntroAndTaici('sdxl_gongsunzhi', '公孙止是绝情谷的谷主，面目英俊举止潇洒，上唇与颏下留有微髭。家传武功为闭穴功、阴阳倒乱刃法和渔网阵，后又从妻子处学来铁掌功。因恼恨裘千尺害死情人柔儿，施计将其手脚筋挑断後抛进炼丹房下的鳄鱼潭。为人虚伪绝情，谷中开满能令人身中剧毒的情花，二者可谓交相辉映。', '大熊小猫', '落影逝尘', '李二汪', '<b>【情蛊】</b><br>情花之毒，断肠之痛！<br>肝肠寸断未忘情，却问情之为何物？<br><br><b>【阵网】</b><br>必要将尔等，一网打尽！<br>如此阵网，插翅难逃！<br><br><b>【阵亡】</b><br>萼儿，爹对不起你……<br><br><br><br>');
    createIntroAndTaici('sdxl_zhaozhijin', ' 赵志敬是全真教第三代“志”字辈弟子里武功最强的一个，甄志丙的师兄。其为人心胸狭窄，卑鄙阴险，利用甄志丙侮辱小龙女的把柄多番对进进行要挟，后为夺全真教掌教之位，与蒙古人勾结，最终咎由自取，死于玉蜂毒下。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【凌胁】</b><br>若非你行苟且之事，又怎会受制于我呢？<br>甄师弟莫非忘了终南山那个风花雪月之夜？<br><br><b>【通庇】</b><br>天下大势已定，何不接受蒙古册封？<br>大汗乃天命所归，全真教愿听候差遣！<br><br><b>【逼禅】</b><br>我，才是全真教掌门人的不二人选！<br>全真教生杀大权，由我一人掌控！<br><br><b>【阵亡】</b><br>这就是多行不义必自毙吗……<br><br><br><br>');
    createIntroAndTaici('sdxl_spguoxiang', '郭襄在风陵渡口听江湖中人说起神雕大侠的奇闻轶事，自此心生仰慕，誓要见上这位武功绝世的大侠一面，却不知一见杨过误终身。杨过曾经交给这位天真无邪又略带固执的小妹妹三枚金针，期许她三个愿望。郭襄自知杨过和小龙女是神仙眷侣，两人的爱情更是海枯石烂。华山一别之后，郭襄浪迹天涯寻找杨过，却成为终身的遗憾。后来顿悟出家，开创峨眉派。', 'SUKINCEN', '落影逝尘', '浅笑安然', '<b>【任侠】</b><br>江湖纷乱，自有我一剑承担！<br>社稷危亡，承继侠者之光！<br><br><b>【倾慕】</b><br>人间自有情难老，不信娇女白发生！<br>华山诀别江湖远，风陵不见神雕侠！<br><br><b>【芳踪】</b><br>君生我未生，我生君已老！<br>祝大哥哥和杨大嫂合百年之好！<br><br><b>【恻隐】</b><br>一去江湖远，何时再少年？<br>花有重开日，人无再少年！<br><br><b>【惜缘】</b><br>错付痴心亦无悔，青灯古佛伴余生！<br>人生如梦亦如幻，缘生缘灭还自在！<br><br><b>【归宗】</b><br>峨眉女眷，不为情痴！<br>一心向道，不恋红尘！<br><br><b>【阵亡】</b><br>大哥哥，多想再见你一面……<br><br><br><br>');
    createIntroAndTaici('sdxl_limochou', '古墓派弟子，小龙女之师姐。曾因倾心陆展元被师父逐出师门，又遭陆展元背叛而因爱生恨，变成蛇蝎美人，纵横江湖，凭借冰魄银针、三无三不手杀人如麻，令人闻风丧胆。但其良心未泯，曾抚养襁褓中的郭襄。在绝情谷中身中情花剧毒，仍不忘陆展元，最后葬身于焚烧情花的大火中。', '大熊小猫', '冷雨', '仙女桥', '<b>【蚀心】</b><br>情花如蛊，万蛇噬心！<br>问世间情为何物，直教人生死相许？<br><br><b>【冰魄】</b><br>你蔫能逃得出我的手掌心？<br>不交出《玉女心经》，我要你万针穿心！<br><br><b>【三无】</b><br>你已无路可逃，还不交出经书？<br>今日便是我掌管古墓派的大好时机！<br><br><b>【阵亡】</b><br>天南地北双飞客，老翅几回寒暑……<br><br><br><br>');
    createIntroAndTaici('sdxl_qiuqianchi', '裘千尺是裘千仞的妹妹，嫁给绝情谷谷主孙公止后，组成了一个男弱女强的家庭，因咄咄逼人并害死公孙止情人，被其残忍迫害掉进鳄鱼潭，顽强求生。在潭底的几十年，练就深厚体力并靠击落枣子为生，更擅长用枣核钉进行攻击。最后引诱公孙止，与其一起掉进鳄鱼潭同归于尽。', '大熊小猫', '落影逝尘', '白', '<b>【果腹】</b><br>亏得这棵枣树，老娘早成饿死鬼了！<br>他要我死，我偏不死！<br><br><b>【核击】</b><br>有种的，就接我三枚枣核钉！<br>天下利刃，皆敌不过我枣核钉！<br><br><b>【自缚】</b><br>哼，不怕公孙止这老贼不上钩！<br>作茧自缚，也要和狗贼同归于尽！<br><br><b>【阵亡】</b><br>从今起，你中有我，我中有你，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('sdxl_guopolu', '郭破虏是郭靖与黄蓉的小儿子，因出生在兵荒马乱的年代，父母为了寄托驱逐鞑虏的寓意而起名为破虏。郭破虏在书中的出场率不高，从小便随父母一同守卫襄阳，抵抗蒙古人的入侵。襄阳告急，郭黄夫妇将玄铁重剑打造成倚天剑与屠龙刀两把利器，并将武穆遗书藏于刀剑之中，授刀于郭破虏。后与家人一同战死沙场。', '大熊小猫', '落影逝尘', '洛', '<b>【逐虏】</b><br>休让鞑虏，犯我河山！<br>舍身取义，为民请命！<br><br><b>【忠骨】</b><br>鞑子兵临城下，襄阳全民皆兵！<br>遍地狼烟埋忠骨，碧血丹心佑襄阳！<br><br><b>【阵亡】</b><br>襄阳沦陷，我愿以死殉城……<br><br><br><br>');
    createIntroAndTaici('sdxl_wusechanshi', '无色禅师是金庸小说《神雕侠侣》和《倚天屠龙记》里的虚构人物。无色禅师少年时出身绿林，后来入少林出家为僧，在禅门中数十年修持，佛学精湛，成为少林罗汉堂首座，但往日豪气仍是不减，与神雕侠杨过是多年好友。在襄阳英雄大会之时，托人为郭襄送上两个精铁铸成的罗汉作为生日礼物，并与各路豪杰夜袭南阳蒙古军帐，烧掉蒙古军的草料、火药。多年后，“昆仑三圣”何足道要挑战少林寺时，无色禅师再次登场，并与郭襄、张君宝会面，共同在觉远圆寂时听到了部分《九阳真经》 ，练成“少林九阳功”。', '吃饱睡睡醒吃', '霸天', '大宝', '<b>【赠偶】</b><br>一点小玩意儿，还请郭姑娘笑纳！<br>姑娘果然是人中英侠，老纳便交了你这个朋友！<br><br><b>【博研】</b><br>他山之石，可以攻玉！<br>截彼之长，补我之短！<br><br><b>【戆直】</b><br><br>嘿嘿，酒肉穿肠，大块朵颐！<br><br><br><b>【死亡】</b><br>舍却危脆体，无嗔亦无忧……<br><br><br><br><br>');
    //倚天屠龙记
    createIntroAndTaici('yttl_wangnangu', '王难姑是《倚天屠龙记》中胡青牛的妻子，他们又斗气，又恩爱，“耍花枪”招数凶险。胡青牛又分明对妻子爱极，到了盲目程度，在他眼中，她所做的一切绝无半点不对。胡青牛与王难姑分属同门，他研究医术有成，人称“医仙”，她研究毒经，下毒高明，人称“毒仙”，毒仙不高兴她下毒之人可被医仙治好，于是恼怒起来，跟丈夫斗气，矢志要做到下毒方法高明得丈夫治不好为止。大概医仙技术比毒仙高明多多，她怎样下毒，他都治得好，但为“免伤夫妇和气”，给她下毒的人，他一概不治。后来她故意隐藏下毒手法，使他不知道是她下的毒，他无意中治好了，她又大大生气，医仙唯有决定不是明教中人不治，因为知道毒仙不会毒害教友，这样一来，他便得了个“见死不救”的外号。好端端逼使丈夫变成“见死不救”，这位王难姑女士真是古今独步。', '吃饱睡睡醒吃', '霸天', '鲜女不吃鱼', '<b>【毒招】</b><br>且看是毒仙的本事大，还是医仙的手段高！<br>毒理深奥，杀人无形，岂是医道所能及？<br><br><b>【毒经】</b><br>人有七益，调阴阳则为医，乱五行则为毒。<br>有名毒物三千六，无名毒物不胜数！<br><br><br><br><b>【死亡】</b><br>你宅心仁厚，持此毒经，当有裨益……<br><br><br><br><br>');
    createIntroAndTaici('yttl_xuda', '徐达是元末明初大将。在金庸小说《倚天屠龙记》中属明教凤阳分坛坛主朱元璋属下，洪水旗旗下弟子。曾救张无忌和杨不悔性命，后来张无忌退出明教，将《武穆遗书》授授予徐达，从而成为一方大将，用兵如神，率领起义军大败元兵，威震漠北，是明教覆灭元朝的一大功臣。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【征虏】</b><br>当北征元室，驱逐鞑虏！ <br>长车踏破贺兰山，王师直捣黄龙府！<br><br><b>【虎略】</b><br>去其屏藩羽翼，而后进兵，不战可胜！<br>我军既克大都，余地，自可席卷而下。<br>鹊巢鸠占百余载，归来无恙复河山！<br><br><b>【承志】</b><br>属下蒙教主授此宝书，愿为苍生剖肝沥胆！<br>承遗志效法武穆，逐胡虏克复中原！ <br><br><br><b>【死亡】</b><br>得见九州归一，虽死无憾矣……<br><br><br><br><br>');
    createIntroAndTaici('yttl_kongjian', '空见是《倚天屠龙记》中的人物，少林派空字辈弟子之一，内功与外功均登峰造极，修复得金刚不坏之身。为人慈悲为怀，为求感化明教四大护教法王之一金毛狮王谢逊，自愿代替谢逊的仇人被他以拳殴一十三拳，空见毫发无损。谢逊倍受打击，准备自杀，空见为救谢逊，却在毫无提防的情况下被谢逊使七伤拳袭击，因未运功护体，内脏震裂，死前告诉谢逊找到屠龙刀方可报仇。', '大熊小猫', '霸天、藏海', '末生', '<b>【铁躯】</b><br>本无我相无人相，岂有金刚不坏身！<br>金刚铁骨，刀枪不入！<br><br><b>【释厄】</b><br>欲消宿仇除冤孽，需藏慈心化杀劫！<br>这十三记七伤拳，谢施主便加诸老衲之身罢！<br><br><b>【渡劫】</b><br>折诸般烦恼，降众世嗔心！<br>众生需渡无量劫，离开深狱一执念！<br><br><b>【金刚】</b><br>慈心悲悯，普度众生！<br>舍此空皮囊，渡彼怨憎会！<br><br><b>【阵亡】</b><br>还望谢施主放下屠刀，立地成佛……<br><br><br><br>');
    createIntroAndTaici('yttl_jue_zhangwuji', '张无忌是金庸武侠小说《倚天屠龙记》男主角，中土明教第三十四代教主。幼时中玄冥神掌寒毒命危，后在蝴蝶谷带病习医。义送孤儿杨不悔至西域，在昆仑仙谷绝处逢生。忍受寒毒煎熬七年，福缘际会，融合九阳神功、乾坤大挪移等神功，当世无敌。此外还精研医术和毒术，术绝尘寰。为人仁侠仗义，一生救人无数，常制服敌人而不杀害。', '大熊小猫', '霸天', '彻君', '<b>【天逆】</b><br>日有晦朔，月有盈亏，天地尚无完体。<br>攻守可化，是非可逆，乾坤亦能颠倒。<br><br><b>【天愈】</b><br>参破死生之境，惟存医者仁心。<br>我已尽力施救，康愈与否，尚待天意。<br><br><b>【天阳】</b><br>抱元含一，呼吸九阳！<br>天生浩气，纯阳无极！<br><br><b>【阵亡】</b><br>明教善道，不解人世疾苦；医者仁心，难救大厦将倾……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_zhaomin', '赵敏本名敏敏·特穆尔，是汝阳王察罕特穆尔之女。虽为女儿身，但期许自己能创一番大事业，奉命剿灭反贼，下毒囚禁六大门派于万安寺。自从绿柳山庄事件之后，对敌军首领张无忌一往情深。她敢爱敢恨、追求爱情勇往直前，并不像传统女子的怔促作态，在濠州婚礼上以谢逊毛发为要挟从周芷若手中带走张无忌。此后放弃荣华富贵和郡主的身份，为爱追随张无忌。', '大熊小猫', '霸天', '许浞', '<b>【赫赫】</b><br>家父汝阳王，敢动本姑娘，仔细自己的脑袋！<br>爹爹战功赫赫，实乃元室之幸！<br>挥鞭纵马，肃反剿贼！<br><br><b>【软禁】</b><br>谁言女子非英物，六派皆为阶下囚！<br>中原武林，不过尔尔！<br>任诸位武艺高绝，都得倒在本郡主的软筋散下！<br><br><b>【劫亲】</b><br>这第二件事，今日不能与周姑娘成亲！<br>男子汉婆婆妈妈，会抱憾终生的！<br>我偏要勉强<br><br><b>【阵亡】</b><br>什么华夷之分、权势威名，我心中只你一个……');
    createIntroAndTaici('yttl_shaolinsandu', '渡厄、渡劫、渡难为少林寺辈份最高的三大高僧，人称“少林三渡”。渡厄为三渡之首，黄面眇目，渡劫白面；渡难则是黑面；渡劫武功高明。三人阵法为金刚伏魔圈，张无忌在二战金刚伏魔圈时，双方胜败的关键在渡劫和殷天正。渡劫和殷天正分别面对强敌，杨逍测度形势，以圣火令作为暗器攻击渡劫，使渡劫陷入极大的危机中，但渡厄出手相助，金刚伏魔圈得以不失。', '大熊小猫', '霸天', '狗子', '<b>【金刚】</b><br>诸法空相，不生不灭！<br>无众生相，无寿者相！<br><br><b>【魔伏】</b><br>众生皆苦，唯有自渡！<br>是法平等，无有高下！<br><br><b>【无界】</b><br>佛法无边，不渡无缘人；天雨辽阔，不润无根草!<br>跳出三界外，不在五行中！<br><br><b>【阵亡】</b><br>无妄一心是一佛国；有妄一心是一地狱……');
    createIntroAndTaici('yttl_shuobude', '说不得是《倚天屠龙记》中的人物，人称“布袋和尚”， 为明教五散人之一。他的轻功很不错，性格爱说笑，与青翼蝠王韦一笑是好朋友。擅长用布袋出其不意地装敌人进去，曾以此技擒住不少高手，包括张无忌，但任何利器均刺不穿的“乾坤一气袋”被张无忌以“九阳神功”冲破了。', '大熊小猫', '吃朵棉花糖', '狗子', '<b>【行囊】</b><br>我有一布袋，虚空无挂碍！<br>背起行囊，游方去也！<br>若言包得太虚空，虚空却在布袋外。<br>行也布袋，坐也布袋，放下布袋，多少自在！<br><br><b>【破隙】</b><br>宝袋一破，奇珍尽泄！<br>千古一奇缘，袋破再无修！<br><br><b>【阵亡】</b><br>忽抛布袋归何处，地下天高一阁空……');
    createIntroAndTaici('yttl_chengkun', '成昆是金庸武侠小说《倚天屠龙记》中的重要反派角色，江湖人称“混元霹雳手”。他武功高强，精通混元功和霹雳掌。成昆性格阴险狡诈，。他曾因私怨与明教教主阳顶天结仇，后因爱生恨，害死阳顶天，投靠元朝，成为朝廷的鹰犬。他利用自己的武功和智谋，多次策划陷害明教，企图摧毁明教，以实现自己的野心。', '大熊小猫', '霸天', '大宝', '<b>【混元】</b><br>混元心法，精锐持修！<br>混清浊之气，辟[pì]丹田之元！<br><br><b>【霹雳】</b><br>掌携雷霆，威慑群小！<br>掌如雷霆之怒，气似狂风啸天！<br><br><b>【群策】</b><br>借谢逊之手，树明教之敌，哈哈哈……<br>覆灭明教，以慑贼党！<br>郡主借刀杀人奇策，可谓百般高明！<br><br><br><b>【死亡】</b><br>元庭衰微，欲除明教，当另觅他策……<br><br><br><br><br>');
    createIntroAndTaici('yttl_ruyangwang', '察罕特穆尔，汉名姓李，系金庸小说《倚天屠龙记》中赵敏之父。原型为中国历史上的元朝末年将领察罕帖木儿，爵封汝阳王，官居太尉，执掌天下兵马大权，智勇双全，是大元朝廷中的一位能人。统兵有方，曾屡次击败各地义军起事。', '大熊小猫', '吃朵棉花糖、霸天', '随遇而安', '<b>【平乱】</b><br>此患不除，如鲠在喉！<br>明教兴兵作乱，末将愿请兵出战！<br><br><b>【遣兵】</b><br>贼势已颓，千秋基业犹可存！<br>飞随银鹘弓刀满，晓驾黑云日月翻！<br><br><b>【强虏】</b><br>擒得贼首，重重有赏！<br>射人先射马，擒贼先擒王！<br><br><b>【阵亡】</b><br>我大元雄兵百万，怎至如此田地……');
    createIntroAndTaici('yttl_yangdingtian', '阳顶天别名杨破天，是金庸武侠小说《倚天屠龙记》中的人物，中土明教第三十三代教主，执掌明教二十余年，在位期间将中土明教治理的十分兴盛，并拒绝波斯明教总教的降元命令，怀有驱除鞑虏之宏愿。武功极为高强，将明教镇教武学“乾坤大挪移”修炼至第四层，除了武当派的张三丰真人几乎是当世无敌。', '大熊小猫', '吃朵棉花糖、霸天', '随遇而安', '<b>【抗元】</b><br>天地存续留砥柱，江山有此障狂澜！<br>蝼蚁尚有种，麒麟岂能逃！<br><br><b>【牵移】</b><br>拼将十万心头血，乾坤逆转未可知！<br>刚柔颠倒，沛莫能御！<br><br><b>【明尊】</b><br>不居其位，不明其难；护国救民，纵死留香！<br>敝履荣华，浮云生死，此身何惧！<br>塞虏欲南饮，天兵伏北境！<br><br><b>【阵亡】</b><br>崇义卫国，终失所爱……');
    createIntroAndTaici('yttl_dudajin', '都大锦是龙门镖局的总镖头，江湖人称“多臂熊”，是少林俗家弟子。殷素素使用蚊须针将俞岱岩击伤后，委托龙门镖局将其托运至武当山，送镖途中误将俞三侠交给假扮武当门人的阿三等人，致使俞三侠落入虎口，被大力金刚指折断手足，全身残废，因此龙门镖局上下七十余口被殷素素灭门。', '大熊小猫', '霸天', '冬赫、兔猪', '<b>【押镖】</b><br>镖行天下义当先，江湖人缘是饭缘！<br>途经宝地，望诸位当家的行个方便！<br>何方高人，还请现身赐教！<br>多说无益，亮家伙吧！<br><br><b>【释罪】</b><br>老都失信于人，前来负荆请罪！<br>俞三侠遭此劫难，我等万死莫赎！<br><br><b>【阵亡】</b><br>贪心起，横祸至……<br><br><br><br>');
    createIntroAndTaici('yttl_zhangwujizhaomin', '张无忌赵敏是元末乱世下的一对恩爱情侣。身为明教教主的张无忌在击溃元军后，放弃了坐拥江山的大好前程，主动将兵权交给朱元璋，与赵敏一起归隐江湖。张无忌优柔寡断的性格或许不适合成为一个帝王，所以在解救天下苍生于苦难之后，不要江山要美人。', '大熊小猫', '霸天', '冬赫、兔猪', '<b>【挪移】</b><br>一法通万法，一力降百力！<br>气转阴阳，混元一体！<br><br><b>【释权】</b><br>纵有经天纬地之才，然无气吞山河之志！<br>而今山河相奉，愿君还以盛世！<br><br><b>【归田】</b><br>管这天下，姓赵也好，姓朱也罢，便与我们无关！<br>我要你，天天为我画眉！<br><br><b>【阵亡】</b><br>这一世，为你画眉……<br><br><br><br>');
    createIntroAndTaici('yttl_dingminjun', '丁敏君是峨眉派灭绝师太的徒弟，纪晓芙和周芷若的师姐。为人尖酸伶俐，爱耍阴谋诡计，资格平平却屡生事端。每每仗着自己是大师姐，造谣生事，抹黑周芷若，阻挠她登上掌门之位。后被周芷若使用九阴白骨爪轻易制服，从此对其服服帖帖。', '大熊小猫', '藏海', '谢声繁', '<b>【诽议】</b><br>周芷若勾结魔教，包藏祸心，实乃峨眉之耻！<br>你弑师夺位、蒙羞峨眉，当门规处置！<br><br><b>【争锋】</b><br>掌门之位，能者居之！<br>我们，还是刀剑底下见真章吧！<br><br><b>【阵亡】</b><br>掌门师妹饶命，敏君不敢造次了……<br><br><br><br>');
    createIntroAndTaici('yttl_juezhangsanfeng', '张三丰是金庸武侠小说《倚天屠龙记》中登场的人物，宽和从容，颇有仙风道骨之姿，是当世无出其右的武学奇才。百岁时自创太极拳剑，将武当派发扬光大，威名远播，江湖豪杰、黑白两道无不拜服。门下七位徒弟有武当七侠之称。', '大熊小猫', '霸天', '狗子', '<b>【两仪】</b><br>开天辟地化万物，凿破鸿蒙分太极！<br>太极未分混沌，两仪已非其中！<br>道存天地养万物，德化乾坤育众生！<br><br><b>【四象】</b><br>一粒刀圭开四象，两般枪法杀三尸！<br>太极功法，绵里藏针！<br><br><b>【阵亡】</b><br>物我相亲，天人合一……<br><br><br><br>');
    createIntroAndTaici('yttl_dujie', '渡劫是金庸《倚天屠龙记》中的人物，少林三渡之一。是渡厄的师弟，度难的师兄。渡劫白面，武功高明，绝学为金刚伏魔圈和大力金刚指，三渡在屠狮大会上接受各派的挑战仍不落下风，集攻守和防御于一体。', '大熊小猫', '霸天', '狗子', '<b>【无界】</b><br>佛法无边，不渡无缘人；天雨辽阔，不润无根草！<br>跳出三界外，不在五行中！<br><br><b>【恶相】</b><br>金刚伏魔，天罗地网！<br>因果轮回，善恶终报！<br><br><b>【阵亡】</b><br>佛度苦厄，何不渡我……<br><br><br><br>');
    createIntroAndTaici('yttl_yulianzhou', '俞莲舟是武当派创始人张三丰的二徒弟，武当七侠之一，在七侠里武功最强的，故而深得张三丰器重，武当派上下都对其十分敬畏。曾依据张三丰所授之武功加以改良，自创“虎爪绝户手”，后来又尽得“太极拳”真传，成为武当派第二代掌门。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【绝户】</b><br>仙人摘桃，险中求胜！<br>此招阴损，诸君慎用！<br><br><b>【柔拳】</b><br>至刚而易折，至柔则无损！<br>强极则损，弓满则折！<br>至柔绕指刚则折，善而藏之吞明月！<br><br><b>【传道】</b><br>传道授业，桃李满园！<br>薪火相传，生生不息！<br>桃李满天下，学子尽乾坤！<br><br><b>【阵亡】</b><br>星星之火，不能灭……<br><br><br><br>');
    createIntroAndTaici('yttl_zhangsongxi', '张松溪是金庸武侠小说《倚天屠龙记》中武当派张三丰的徒弟，在武当七侠排行第四。在众师兄弟中，他以机智著称。张松溪最出色的表现，当数在张翠山失踪的十年里不间断地施恩于三大镖局，为日后的故事情节发展作出铺垫。', '大熊小猫', '落影逝尘', '冰霜墨菊', '<b>【施恩】</b><br>施恩莫望报，望报莫施恩！<br>铁肩担道义，仁心施大爱！<br>见死不救非英雄！<br>扶弱助困，乃侠义之本！<br><br><b>【柔道】</b><br>水满则溢，物极必反！<br>智圆行方，曲中求直！<br>至柔者至刚，至弱者至强！<br>反者道之动，弱者道之用！<br><br><b>【阵亡】</b><br>人间正道，永恒之光……<br><br><br><br>');
    createIntroAndTaici('yttl_xinran', '辛然是金庸小说《倚天屠龙记》中的人物，生性豪迈，他是明教烈火旗的掌旗，是锐金旗掌旗吴劲草的至交好友，烈火炼金是他的拿手本事，常和吴劲草配合锻造兵器，是明教中不可多得的人才。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【淬火】</b><br>烈火炼真金，疾风知劲草！<br>炉火红红，百炼成钢！<br>铁打的营盘，流水的兵！<br><br><b>【搧风】</b><br>星星之火，可以燎原！<br>东风正劲，利箭满弦！<br><br><b>【阵亡】</b><br>熊熊圣火，焚我残躯……<br><br><br><br>');
    createIntroAndTaici('yttl_huangshannv', '黄衫女是杨过与小龙女的后代，仅在《倚天屠龙记》出场过两次，被史红石称呼为“杨姊姊”，是金庸小说中的神秘人物之一。黄衫女大约二十六七岁，容貌极美，态拟神仙。她身负古墓派和《九阴真经》绝世武学，曾在屠狮大会上以摧坚神爪大败周芷若九阴白骨爪，随后飘然而去。', '大熊小猫', '落影逝尘', '谢声繁', '<b>【太阴】</b><br>天下至柔，可破至坚！<br>水之无形，因缘而化！<br>弱之胜强，柔之胜刚，天下莫不知，莫能行！<br><br><b>【仙踪】</b><br>终南山后，活死人墓，神雕侠侣，绝迹江湖！<br>古墓仙踪今犹在，故人一去不复返！<br><br><b>【阵亡】</b><br>绿水常流，后会有期……<br><br><br><br>');
    createIntroAndTaici('yttl_zhoudian', '周颠是明教五散人之一，行事怪僻，说话颠三倒四，动辄骂人，行为疯疯癫癫，专好斗嘴，在小说中金句频出，令人印象深刻。在《方技传》里他是一个传奇人物，他是一个疯子，还是一个和尚，也是一个道士，他甚至连正式的名字都没有，被人唤作“周神仙”。', '大熊小猫', '落影逝尘', '狗子', '<b>【颠仙】</b><br>你说话牛头不对马嘴，掌嘴掌嘴！<br>你前言不搭后语，后语不接前言，委实可笑！<br><br><b>【逆战】</b><br>以彼之矛，破彼之盾，稳如天算！<br>一寸长，一寸强，胜算就在一寸间！<br><br><b>【阵亡】</b><br>你！满口胡言乱语……<br><br><br><br>');
    createIntroAndTaici('yttl_hanliner', '韩林儿是元末农民起义领袖，韩山童的儿子。正十五年，被刘福通等迎至亳州立为帝，称“小明王”国号大宋。龙凤十二年，被朱元璋部将廖永忠溺死于瓜洲，年仅二十六岁。在《倚天屠龙记》中，他是明教的一位高级将领，是张无忌的部下，对张无忌这位教主十分尊崇爱戴。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【孤勇】</b><br>谋事在人，成事在天！<br>什么成王败寇，我韩氏一族，从不认命！<br><br><b>【角逐】</b><br>群雄逐鹿，胜者为王！<br>事在人为，人定胜天！<br>以退为进，以守为攻！<br><br><b>【阵亡】</b><br>大好江山，岂能拱手相让……<br><br><br><br>');
    createIntroAndTaici('yttl_moshenggu', '莫声谷是金庸武侠小说《倚天屠龙记》中的角色，他是张三丰的徒弟，在武当七侠中排行第七。莫声谷少年老成，一得魁梧奇伟。曾参与六大派围剿光明顶一战，用武当绝学“绕指柔剑”小胜白眉鹰王殷天正。后在教训偷窥峨眉女舍的宋青书时，被陈友谅和宋青书合谋杀害。', '大熊小猫', '落影逝尘', '狗子', '<b>【柔剑】</b><br>你有金刚钻，我有绕指柔！<br>铁杵成针，滴水穿石！<br><br><b>【训诫】</b><br>身体发肤，受之父母，岂可轻易舍之！<br>青书，苦海沉舟，及早回头！<br><br><b>【阵亡】</b><br>你弑叔犯上，必遭天谴……<br><br><br><br>');
    createIntroAndTaici('yttl_doujiushenseng', '斗酒神僧是新修版《倚天屠龙记》里《九阳真经》的作者。曾与王重阳斗酒胜过他，借阅《九阴真经》后，认为该秘籍只重以柔克刚，以阴胜阳，不及阴阳互济之妙，于是投身少林，钻研武道禅宗心得写出《九阳真经》，自觉更有阴阳调和刚柔互济的中和之道。', '大熊小猫', '落影逝尘', '白夜', '<b>【极阳】</b><br>阴阳调和，刚柔并济？<br>天地万物，分两极！<br><br><b>【酒圣】</b><br>酒逢知己，千杯少！<br>醉酒提壶力千钧！<br>酒不醉人，人自醉！<br><br><b>【阵亡】</b><br>世人皆醉，我独醒……<br><br><br><br>');
    createIntroAndTaici('yttl_wujincao', '吴劲草是明教锐金旗副掌旗使，其为人刚烈正直，曾在六大派围攻光明顶的战役中被灭绝师太斩下一臂，幸得张无忌相救方可保住性命。张无忌成为明教教主后，其接任死去的庄铮成为锐金旗掌旗使。少林寺大战结束后，奉张无忌之命，凭借高超的锻铸本领重铸屠龙刀。但因其厌倦倚天剑杀戮太多拒绝修复之。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【锻铸】</b><br>男儿到死心如铁，看试手，补天裂！<br>炉火照天地，红星乱紫烟！<br><br><b>【整旗】</b><br>锐金旗下，听我号令！<br>枪斧索命，刀箭穿心！<br><br><b>【阵亡】</b><br>打铁还需自身硬……<br><br><br><br>');
    createIntroAndTaici('yttl_yintianzheng', '殷天正是明教四大法王之一白眉鹰王，为人豪气干云，刚正不阿，是个慷慨磊落的侠义之士。当年明教教主阳顶天失踪后自立天鹰教，与明教分庭抗礼。后六大派合剿光明顶，殷天正义无反顾地率天鹰教主力支援明教，后来张无忌被推举为明教教主后，殷天正以外公之尊亲，元老之资历忠心耿耿地服从张无忌的领导。', '大熊小猫', '落影逝尘', '小林', '<b>【鹰袭】</b><br>日月光照，鹰王展翅！<br>鹰爪之下，片甲不留！<br><br><b>【义援】</b><br>明教有难，老夫岂能置身事外？<br>本教与明教同气连枝！<br>当捐弃旧怨，群策群力！<br><br><b>【阵亡】</b><br>喜乐悲愁，皆归尘土……<br><br><br><br>');
    createIntroAndTaici('yttl_zhuchangling', '朱长龄一灯大师弟子朱子柳的曾孙，有一女朱九真，看家本领是一阳指和判官笔。奸诈异常，为骗张无忌说出谢逊及屠龙刀下落，可谓费尽心思、落足本钱，利用女儿设美人计，把自己的华厦庄院烧成废墟，进行苦肉计。终骗得心地善良的小张无忌吐露真相，岂料功亏一篑，终被无忌识破计谋。', '寰宇星城、大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【谋陷】</b><br>此计天衣无缝，定得屠龙宝刀！<br>既是五侠之子，便是我座上贵宾！<br><br><b>【匕见】</b><br>你，中了老夫的计了！<br>你已穷途末路！<br><br><b>【焚庄】</b><br>欲得屠龙刀，作戏作全套！<br>区区旧宅，不足为惜！<br><br><b>【阵亡】</b><br>奇谋秘计，终是幻梦泡影……<br><br><br><br>');
    createIntroAndTaici('yttl_spsongyuanqiao', '宋远桥是武当七侠之首，在张三丰退出俗务期间掌管武当派大小事务，武林威望自然很高，隐然可以和少林派众高僧相提并论。其武功绝学包括绵掌、武当剑法和虎爪绝户手。曾经不远千里前往光明顶援助五大派一起围剿明教。宋远桥虽然为人谦逊正派，却是教子无方，导致其子宋青书在歧途上越走越远。', '7Ace', '落影逝尘', '沃声_风飞语', '<b>【援盟】</b><br>讨伐魔教，武当义不容辞！<br>前赴后继，只为斩除顽恶！<br><br><b>【太极】</b><br>阴阳交汇，变化无穷！<br>行云流水，延绵不绝！<br><br><b>【阵亡】</b><br>为父一世英名，尽毁你手……<br><br><br><br>');
    createIntroAndTaici('yttl_zhujiuzhenwuqingying', '朱九真是朱武连环庄庄主朱长龄独女，与武青婴合称雪岭双姝。同为一灯大师座下弟子的后人，美艳无比却又心思歹毒。朱九真喜训练猛犬咬人，将猛犬命名为车骑将军。为套取屠龙刀下落，被父亲指使欺骗谢逊义子张无忌的感情。朱武二人共同喜欢表哥卫璧，两人常常为此争风吃醋。', '大熊小猫', '落影逝尘', '桃子玥', '<b>【纵犬】</b><br>“车骑”将军，给我上！<br>捉住那小子，赏你肉骨头！<br><br><b>【醋海】</b><br>师兄，你怎么净帮真姐说话？<br>表哥，我哪里比不上武妹妹？<br><br><b>【阵亡】</b><br>卫哥，你怎能如此偏心……<br><br><br><br>');
    createIntroAndTaici('yttl_songyuanqiao', '宋远桥是张三丰的大弟子，武当派的大师兄，为人恂恂儒雅，颇具君子风范，武功高强，为人处事又极为公道，在江湖上的颇有声望，远在一般门派掌门之上。曾代替师父率领武当派远征光明顶一战，与六大派共同对抗明教顽敌，杀入光明顶后与明教护法白眉鹰王殷天正比掌。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【征援】</b><br>远桥援救来迟，还望师太宽恕！<br>武当与贵派辅车相依，唇亡齿寒。<br><br><b>【歃盟】</b><br>明教乃武林公敌，理当同仇敌忾！<br>明教不除，联盟不灭！<br><br><b>【阵亡】</b><br>养子不教，父之过……<br><br><br><br>');
    createIntroAndTaici('yttl_zhangsanfeng', '张三丰悟性超然，天赋卓绝，自创武当派，能同少林寺分庭抗礼，是名扬天下的一代宗师，除七个入室弟子外，桃李遍天下。为人正气凛然，颇有仙风道骨之姿，是当世无出其右的武学奇才。出名绝学繁多，其中太极拳法以静制动，以柔克刚；太极剑更是达到无招胜有招的境界。', '大熊小猫', 'SUKINCEN', '狗子', '<b>【太极】</b><br>以静制动，以柔克刚！<br>太极生两仪，八卦生万物！<br><br><b>【纯阳】</b><br>此时无招胜有招！<br>草木皆为刃，四两拨千斤！<br><br><b>【桃李】</b><br>学武先做人，忠厚为根本！<br>中华太极门，正气满乾坤！<br><br><b>【阵亡】</b><br>花开有落时，人生容易老……<br><br><br><br>');
    createIntroAndTaici('yttl_yangxiao', '杨逍样貌俊雅，风度翩翩，与范遥人称逍遥二仙，是明教光明左使。为人亦正亦邪，孤傲不羁，少年时与峨眉派男弟子孤鸿子比武，夺剑后掷地而去，气死孤鸿子，从此与峨眉派结怨。六大派围攻明教光明顶时，携教众奋力抵抗，成为对抗六大派的中坚力量，最后在张无忌相助之下取得胜利。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【兴师】</b><br>你们谁，第一个出来受死啊？<br>想上光明顶，先过我这关！<br><br><b>【桀骜】</b><br>什么六大派七大派，不过是乌合之众！<br>所谓名门正派，都是三教九流之徒！<br><br><b>【阵亡】</b><br>我就算死，也要死得有尊严……<br><br><br><br>');
    createIntroAndTaici('yttl_fanyao', '范遥是金庸武侠小说《倚天屠龙记》中的人物，在明教中担任光明右使，与光明左使杨逍合称“逍遥二仙”。范遥自负于天下武学无所不窥，武功正邪兼修，渊博无比，剑法神奇。明教教主阳顶天失踪后，他甘心自毁俊颜，潜入汝阳王府，探取情报。', '寰宇星城', '寰宇星城', '沃声_风飞语', '<b>【潜卧】</b><br>苦心十年潜敌营，一片赤心向光明！<br>忍豫让之辱，护明教基业！<br>玉面毁尽栖龙虎，世间再无逍遥仙！<br><br><b>【归教】</b><br>光明右使范遥，参见张教主！<br>光明二使齐聚，紫白金青归位！<br><br><b>【阵亡】</b><br>圣火，要熄灭了吗……<br><br><br><br>');
    createIntroAndTaici('yttl_yinli', '明教护法殷天正的孙女，因痛恨二娘欺负母亲而杀之，致使父女关系决裂。为练习千蛛万毒手不惜以血饲蛛，因而变得容貌丑陋。后因周芷若嫉妒她是张无忌未婚妻而对其狠下杀手，死里逃生的殷离因毒素流尽而回复绝美容颜。与张无忌重逢时表明自己爱的是当年在蝴蝶谷相遇的曾阿牛而非现在长大的张无忌。', '大熊小猫', '落影逝尘', '阿九', '<b>【蝥毒】</b><br>宿仇难消，朱颜渐憔！<br>此毒，攻心！<br><br><b>【初心】</b><br>眷眷往昔时，忆此断人肠！<br>吾心所系，唯昔日曾阿牛也！<br><br><b>【阵亡】</b><br>人生若只如初见……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_zhuer', '蛛儿名为殷离，是殷天正孙女、殷野王之女、张无忌的表妹。性格倔强刚烈，歌声轻柔飘渺。因二娘与兄长欺负母亲，一刀击杀二娘，导致母亲也因此自尽。为了替母报仇，不惜练习至邪的千蛛万毒手，剧毒入脉，蛛儿因此容貌全毁。后遇金花婆婆救其性命。幼时，在蝴蝶谷初遇少年的张无忌，心存爱慕，欲带他一同前往灵蛇岛作玩伴，被他挣扎咬伤手背，殷离因此对他一咬定情，情根深种。直到多年后她方才明白，人生若只如初见，她爱的只是当年的小张无忌，不是成年后的张无忌。', '大熊小猫', '霸天', '陈九', '<b>【千蛛】</b><br>千蛛万毒注八脉，杀尽天下薄情人！<br>千蛛万毒，不及情之一字！<br><br><b>【万毒】</b><br>以身试毒毒攻心，将心换爱爱何求！<br>情如含笑饮砒霜，断肠蚀骨皆所愿！<br><br><b>【共患】</b><br>我的心，早已许给那个短命鬼小张无忌！<br>终有弱水替沧海，再无相思寄巫山！<br><br><br><b>【死亡】</b><br>人生到处知何似，应似飞鸿踏雪泥……<br><br><br><br><br>');
    createIntroAndTaici('yttl_zhuyuanzhang', '金庸小说《倚天屠龙记》中的朱元璋，本是明教中的义军元帅，属张无忌的部下。在结尾大破元军之后，朱元璋表现出了超强的权欲野心，因其忌惮张无忌地位稳固，他用计成功挑拨了张无忌和徐达、常遇春的关系，导致其为了明哲保身而退出明教。他拉拢人心，工于心计，终成明朝开国皇帝。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【邀赂】</b><br>眼中钉，肉中刺，不除不快！<br>为君者，切不可亲小人而远贤臣！<br><br><b>【清侧】</b><br>今日助我大业，他日加官进爵！<br>得此良将，霸业可图！<br><br><b>【阵亡】</b><br>得到天下，却失去了兄弟情谊……<br><br><br><br>');
    createIntroAndTaici('yttl_changbaisanqin', '郭公破虏保卫襄阳战死沙场之后，其屠龙宝刀流落江湖，不知所踪。在小说《倚天屠龙记》中首次出现，是在来自三白山的三大枭雄手中。长白三禽不能悟出宝刀秘密，于是决定使用烈火对其进行焚烧，希望能看透个中蹊跷。随后屠龙宝刀被海沙帮的人劫走，自此，拉开了《倚天屠龙记》故事的序幕。', '大熊小猫', 'SUKINCEN', '青灯折扇不语', '<b>【焚刀】</b><br>烈火焚之，定能窥探宝刀奥秘！<br>既得屠龙宝刀，何以难解刀中玄机？<br><br><b>【窥觎】</b><br>武林至尊，屠龙宝刀！<br>宝刀在手，纵横武林指日可待！<br><br><b>【阵亡】</b><br>追逐一生，终酿成横祸……<br><br><br><br>');
    createIntroAndTaici('yttl_due', '渡厄与渡难、渡劫为当时少林寺辈分最高的高僧，渡厄为三僧之首。三僧共同设金刚伏魔圈看守关押在少林寺的谢逊。张无忌等一众明教高手屡次前来破阵营救谢逊都无法得手，其枯禅功夫更能达到物我两忘的境界。最后渡厄与谢逊化解了一切恩怨并收其为徒，仍赐其法名为“谢逊”。', '大熊小猫', 'SUKINCEN', '觅阳', '<b>【金刚】</b><br>诸法空相，不生不灭！<br>无众生相，无寿者相！<br><br><b>【伏魔】</b><br>众生皆苦，唯有自渡！<br>是法平等，无有高下！<br><br><b>【枯禅】</b><br>静心听佛语，佛渡有缘人！<br>垂老抱佛脚，愿渡苦海人！<br><br><b>【阵亡】</b><br>无妄一心是一佛国；有妄一心是一地狱……<br><br><br><br>');
    createIntroAndTaici('yttl_lengqian', '冷谦是金庸武侠小说《倚天屠龙记》中的人物，人称冷脸先生，与说不得、张中、彭莹玉及周颠并称“明教五散人”。冷谦是五散人中武功最高的，性格冷静沉稳，从来不说半句废话，为人正真忠实，也不爱处理大事。在张无忌掌管明教之后，冷谦负责明教的司法工作，执法过程中冷面无私、赏罚分明。', '吃饱睡睡醒吃', '霸天', '虚静', '<b>【惜字】</b><br>雄辩是银，沉默是金。<br>惜字如金，三缄其口。<br>此时无声，胜有声。<br>话不投机，半句多。<br><br><b>【冷面】</b><br>教令森严，犯则重处！<br>治教以严，赏罚有度！<br>略施薄惩，以儆效尤。<br>赏罚分明、恩威并重！<br><br><br><br><b>【死亡】</b><br>言多，必有失……<br><br><br><br><br>');
    createIntroAndTaici('yttl_jinhuapopo', '明教紫衫龙王黛绮丝和丈夫韩千叶退出江湖之后，以金花银叶的绰号隐居在灵蛇岛。韩千叶因寒疾死后，黛绮丝易容为金花婆婆，行走在江湖中，其暗器金花镖令人闻风丧胆。她命令徒弟小昭潜伏在明教打探乾坤大挪移的心法，并上冰水岛向谢逊求借屠龙刀，以雪当年败给灭绝师太之辱。', '大熊小猫', '落影逝尘', '遂非', '<b>【寒疾】</b><br>落此伤寒，终身不愈。<br>老身抱恙在身，不便现身相见！<br><br><b>【借刀】</b><br>灭绝老尼仗剑伤我，还望谢老前辈赐刀一用！<br>借此宝刀，定要灭绝跪地求饶！<br><br><b>【阵亡】</b><br>生死到头都成空……<br><br><br><br>');
    createIntroAndTaici('yttl_changyuchun', '常遇春，字伯仁，号燕衡，元末红巾军杰出将领，明朝开国名将。元顺帝至正十五年，归附朱元璋，自请为前锋，力战克敌，尝自言能将十万众，横行天下，枚军中称常十万。曾在汉水边为救少主与四名番僧和七八名蒙古武官打斗被伤，被经过的张三丰搭救，后带小张无忌去蝴蝶谷求助胡青牛为其疗伤，使得张无忌成为胡青牛医术的传人。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【先锋】</b><br>我老常，愿为教主鞍前马后！<br>急流勇进，身先士卒！<br><br><b>【骁勇】</b><br>匹夫之勇，亦可破敌！<br>定要打得元军，落花流水！<br><br><b>【阵亡】</b><br>大丈夫，当马革裹尸而还……<br><br><br><br>');
    createIntroAndTaici('yttl_changbaoshu', '波斯明教教主座下十二宝树王之一，在十二宝树王中排名第三，武功最高。常胜宝树王在败于张无忌后，因对方爱才之心未被擒拿，故而常胜王既感激又羞愧。后与大圣、智慧二王一同出使中土，在与中华明教教主张无忌交换礼物后，学得了张无忌所传授的一部分乾坤大挪移和圣火令神功。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【令箭】</b><br>我等奉教主之命，前来捉拿教内叛徒！<br>明教圣女，还不速速伏法！<br><br><b>【奇招】</b><br>番域奇功，变幻莫测！<br>中原武学，不过花拳绣腿！<br><br><b>【阵亡】</b><br>张教主宅心仁厚，实在令人敬佩……<br><br><br><br>');
    createIntroAndTaici('yttl_yinliting', '殷梨亭在武当七侠中排行第六，但七师弟少年老成，他倒显得最为稚嫩文弱。殷梨亭素来情感细腻、悲春伤秋，因少年时期情感失利而终生郁郁寡欢，一颗心已系在纪晓芙身上。奈何人心肉长，在纪晓芙之女杨不悔的努力坚持下，殷梨亭终于被打动，两人总算修成正果，结局圆满。', '大熊小猫', 'SUKINCEN', '神齐大叔', '<b>【孱懦】</b><br>若非我软弱无能，芙妹怎会见异思迁？<br>男儿有泪不轻弹，只是未到伤心处！<br><br><b>【同寿】</b><br>哀莫大于心死！<br>曾经沧海难为水，除却巫山不是云！<br><br><b>【太极】</b><br>不忘初心，方得始终！<br>上善若水，刚柔相济！<br><br><b>【阵亡】</b><br>我本将心向明月，奈何明月照沟渠……<br><br><br><br>');
    createIntroAndTaici('yttl_luhe', '鹿杖客鹤笔翁是同门师兄弟，前者好色，后者好酒，人称玄冥二老。两人武功高强却投身王府以供驱策，成为蒙元朝廷的鹰犬。玄冥二老的武功绝学是玄冥神掌，至阴至寒，闻名江湖。两人曾在万安寺看守六大派期间被酒色迷惑，以至六大派被张无忌等人救走，误了郡主赵敏的大计。', '大熊小猫', '落影逝尘', '弈声传媒有声工作室', '<b>【玄冥】</b><br>你已身中寒毒，命不久矣！<br>玄冥神掌，至阴至寒！<br><br><b>【酣淫】</b><br>不该沉迷酒色，误了郡主大事！<br>昨与美人对尊酒，朱颜如花腰似柳！<br><br><b>【阵亡】</b><br>晚节不保，晚节不保啊……<br><br><br><br>');
    createIntroAndTaici('yttl_miejue', '峨眉掌门人，性情刚烈，正邪不两立，嫉恶如仇但并非不讲道理，保持宗师风度。凭祖传倚天剑行走江湖，光明顶一役后被赵敏囚于万安寺内，将掌门之位传给周芷若，毅然跳下万安寺，张无忌欲用乾坤大挪移相救，但其绝不受明教恩惠，遂以毕生功力发掌相抗，导致自己摔死于万安寺塔下。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【仗剑】</b><br>驱逐鞑虏，还我汉人河山！<br>领袖群伦，光耀峨眉！<br><br><b>【回鞘】</b><br>倚天不出，谁与争锋？<br>芷若，倚天剑的秘密，你定当铭记！<br><br><b>【嫉恶】</b><br>你一刀杀了杨逍，我便立你为掌门！<br>魔教余孽，祸国殃民！<br><br><b>【阵亡】</b><br>芷若，勿忘为师遗训……<br><br><br><br>');
    createIntroAndTaici('yttl_songqingshu', '宋青书是武当七侠之首宋远桥之子，本是武当第三代传人中的佼佼者，文武双全出类拔萃，但因心爱的周芷若倾心于张无忌，加上张无忌年纪轻轻便武功卓越，闻名江湖，宋青书对其妒火中烧。宋青书曾被丐帮陈友挑唆加入丐帮，被逼向武当张三丰下毒，但未真正付诸行动。后被张三丰击毙。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【嫉贤】</b><br>张无忌，你为何要横刀夺爱？<br>我和周师妹，才是天造地设的一对！<br><br><b>【逆施】</b><br>我待世人如亲故，世人欺我如刍狗！<br>若得刹那芳华，飞蛾扑火又有何惧？<br><br><b>【阵亡】</b><br>我早已厌倦这不公的世界……<br><br><br><br>');
    createIntroAndTaici('yttl_zhangwuji', '武当张翠山和天鹰教殷素素之子，自小在冰火岛过着原始生活，踏足中原后便幼失怙恃，回到武当张真人门下。因缘巧合下学会九阳神功和乾坤大挪移，可以对敌人的武功进行牵引挪移，更是治好了缠身多年的玄冥神掌之毒，武艺绝世且又以德服人，被处于危亡中的明教教众推举为第三十四任教主，英雄出少年。', '大熊小猫', '落影逝尘', '林写', '<b>【逆绝】</b><br>力拔千钧，斗转星移！<br>转换阴阳二气，一击制敌！<br><br><b>【九阳】</b><br>他强由他强，清风拂山冈。<br>他横任他横，明月照大江。<br><br><b>【楚翘】</b><br>无忌愿与明教共进退！<br>挽狂澜于既倒，扶大厦之将倾！<br><br><b>【阵亡】</b><br>江山可弃，红颜难负……<br><br><br><br>');
    createIntroAndTaici('yttl_zhangcuishan', '张翠山在武当七侠中排行第五，江湖人称铁划银勾。俞岱岩被大力金刚指弄断双腿后，张翠山在追查元凶的过程中与殷素素结识，两人与谢逊一同漂流到冰火岛，在岛上的十余年内相爱，并生下儿子张无忌。回到中原后，得知妻子殷素素便是伤害俞三侠的元凶，侠义包天的他，自刎谢罪而死。', '大熊小猫', '落影逝尘', '白', '<b>【引咎】</b><br>素素是我发妻，就让我代她受过！<br>素素犯下弥天大错，翠山唯有自刎谢罪！<br><br><b>【太极】</b><br>百炼钢，成绕指柔！<br>冰冻三尺，非一日之寒！<br><br><b>【阵亡】</b><br>不管你做过什么，我从不后悔娶了你……<br><br><br><br>');
    createIntroAndTaici('yttl_daiqisi', '原为波斯明教三圣女之一，加入中土明教后出任护法紫衫龙王。因代替教主阳顶天接受韩千叶的挑战而被重用，却与韩千叶沉迷爱河叛离明教。韩千叶死后，她易容为金花婆婆，并将女儿小昭当作丫头安插在明教暗中打探乾坤大挪移心法的下落。善于使用金花暗器，江湖人士无不闻风丧胆。', '大熊小猫', '落影逝尘', '徐安', '<b>【密令】</b><br>你要给我好好打探乾坤大挪移心法的下落！<br>明教一有风吹草动，立时向我禀报！<br><br><b>【金花】</b><br>此乃我囊中之物！<br>金花银叶，重出江湖！<br><br><b>【阵亡】</b><br>谁不愿做平凡儿女……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_daiqisi', '黛绮丝是金庸武侠小说《倚天屠龙记》中的人物，原是波斯明教总坛的圣女，为盗窃“乾坤大挪移”而奉命前往中原，潜伏于明教中，代替阳顶天入碧水寒潭同韩千叶决斗，胜后获封“紫衫龙王”，同韩千叶相恋。为避免总坛追杀自己，黛绮丝潜入密道探寻“乾坤大挪移”，被光明右使范遥发现后，黛绮丝脱离明教，同韩千叶浪迹江湖。后来则携丈夫前往胡青牛处医治疾病，但遭到”非明教不医“的拒绝。后来受到明教波斯总坛的追究捕，最终以女儿小昭代为前往波斯担任教主，黛绮丝随同前往而告终。 黛绮丝为爱执着，脱离明教，背弃圣女身份。韩千叶死后，黛绮丝疯狂，手段残忍，不念旧情地对好友谢逊出手。她也有温情的一面，尤其是在面对女儿小昭时，她会卸下所有的伪装。', '吃饱睡睡醒吃', '霸天', '安生', '<b>【潜伏】</b><br>暗伏中土，以窥奇功！<br>觅得乾坤心法，盼能将功折罪！<br><br><b>【暗潮】</b><br>碧水潭暗潮涌动，却难湿我紫衫分毫。<br>冰火岛虽远在北冥，我视之如咫尺之地。<br><br><b>【圣女】</b><br>若得长相厮守，破门出教又何妨！<br>哪一位不同意此婚事，便来试试我手中长剑！<br><br><br><b>【死亡】</b><br>黛绮丝叛教而出，愿领罪受罚……<br><br><br><br><br>');
    createIntroAndTaici('yttl_hanqianye', '韩千叶是海外灵蛇岛岛主，因父亲当年与明教教主阳顶天结下仇怨，年纪轻轻便登上光明顶进行挑战。紫衫龙王黛绮丝主动请缨，与他在碧水寒潭一决胜负。韩千叶因寒成疾，黛绮丝主动照顾，病榻之畔，因怜生爱。后两人不顾世俗的反对结成夫妇，并以“金花银叶”的称号隐退江湖。', '大熊小猫', '落影逝尘', '林三', '<b>【孤胆】</b><br>我孤身前来，就没打算活着回去！<br>今日我登门挑战，不成功，便成仁！<br><br><b>【奇缘】</b><br>身中寒毒，心中情毒！<br>觅得红粉佳人，父仇不报也罢！<br><br><b>【隐市】</b><br>我愿为你却抛家仇，隐姓埋名！<br>从此这世间，只有银叶先生！<br><br><b>【阵亡】</b><br>今夜，好冷……<br><br><br><br>');
    createIntroAndTaici('yttl_spzhouzhiruo', '周芷若自小丧父，投入峨眉派门下，深受师父灭绝师太器重，却引来同门师姐妹嫉妒。本来是个无欲无争的弱女子，却因为与张无忌的感情破灭而变得心狠手辣，为达目标不择手段，获得倚天剑中的《九阴真经》练成绝世武功，令众师姐妹无一不服；更与苦恋自己的宋青书成亲，用折磨对方的方式来治疗情伤。', '大熊小猫', '落影逝尘', '地鼠', '<b>【断刃】</b><br>此剑，暗藏玄机！<br>情随剑断，欲从心起！<br><br><b>【决绝】</b><br>自古男儿皆薄幸！<br>是你先不仁，休怪我无义！<br><br><b>【阵亡】</b><br>忘不了的，汉水河畔……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_yintianzheng', '殷天正是金庸武侠小说《倚天屠龙记》中的重要角色，是明教四大护教法王之一，因长眉胜雪，又以绝技鹰爪擒拿手闻名，故绰号白眉鹰王。性格为人豪气干云，严己律己，刚正不阿，是个慷慨磊落的奇男子，性子偏激，为人行事一板一眼。当年明教教主阳顶天失踪后（实际上是死在秘道之中，但明教中人不知道），明教陷入群龙无首的局面，“光明左使”杨逍、五散人、五行旗等明教高层为了争夺明教的控制权相互争斗，殷天正无法忍受这种混乱的状况，又不想搅进这一潭混水之中，于是愤而出教，自立教门“天鹰教”，与明教分庭抗礼，其豪气干云之势，令人思之神往。', '吃饱睡睡醒吃', '霸天', '大宝', '<b>【鹰掠】</b><br>自立门户，宝刀镇教！<br>武林至尊，宝刀屠龙，号令天下，谁敢不从！<br>今得宝刀屠龙，当于王盘山立刀扬威！<br>得此宝刀，我当为武林至尊，哈哈哈哈……<br><br><b>【鹰击】</b><br>振翅摩云瞰万物，锐爪穿风破金汤！<br>鹰击长空风雷涌，卷尽暗云澈九霄！<br><br><b>【鹰扬】</b><br>雄鹰昂扬靖寰宇，日月光耀谱千秋！<br>尽除人间不平事，鹰扬九天看河山！<br><br><br><b>【死亡】</b><br>苍鹰铩羽圣火黯，天地何时复光明……<br><br><br><br><br>');
    createIntroAndTaici('yttl_yinsusu', '明教护法殷天正的女儿，紫薇堂堂主。智计百出，亦正亦邪。为夺得屠龙刀用暗器偷袭俞岱岩后托龙门镖局将他送回武当山，半途俞岱岩被番僧阿三使用大力金刚指重伤致使终身残废，殷素素一怒之下将龙门镖局灭门。后与张翠山被迫远走冰火岛并相爱生子，回到中土真相大白后，张翠山自刎谢罪，殷素素随殉夫。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【托镖】</b><br>此镖牵连甚广，若有闪失，休怪我手下无情！<br>尔等须确保此镖万无一失，否则难逃其罪！<br><br><b>【从善】</b><br>从善如流，从恶如崩！<br>素素自知罪孽深重，愿洗心革面！<br><br><b>【阵亡】</b><br>不该再踏足中原……<br><br><br><br>');
    createIntroAndTaici('yttl_yangbuhui', '杨不悔是纪晓芙和杨逍之女，在照顾双腿残疾的殷梨亭殷六叔的过程之中，逐渐被他对母亲纪晓芙的深情感动。因母亲生前有负殷梨亭，杨不悔因怜生爱，坚心不移地爱上了殷梨亭。在父亲杨逍的强烈反对下和殷梨亭的多番逃避下，她依然情深不移，殷梨亭最终钢铁心化绕指柔，二人结成正果，甜蜜幸福。', '大熊小猫', '落影逝尘', 'Yinke.吟可', '<b>【鹣鲽】</b><br>大丈夫，怎能执念过往？<br>过去终成过去，眼前还需珍惜！<br><br><b>【比翼】</b><br>花开终成果，不负有心人。<br>只羡鸳鸯，不羡仙！<br><br><b>【阵亡】</b><br>六哥，我们总算，在一起了……<br><br><br><br>');
    createIntroAndTaici('yttl_spyangdingtian', '阳顶天是中土明教第三十三代教主，执掌明教二十余年，在位期间将中土明教治理得十分兴盛，并拒绝波斯明教总教的降元命令，怀有驱除鞑虏之宏愿。阳顶天武功高强，将明教镇教武学“乾坤大挪移”修炼至第四层，是当时明教乃至武林的绝顶高手。他强娶了师弟成昆的心上人，后撞破其二人的奸情，走火入魔而死。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【移形】</b><br>移形换影，逆转乾坤！<br>牵引挪移，摧枯拉朽！<br><br><b>【强媒】</b><br>郎情妾意，天作之合！<br>大丈夫，何患无妻？<br><br><b>【阵亡】</b><br>师妹，你怎能背叛我……<br><br><br><br>');
    createIntroAndTaici('yttl_chenyouliang', '陈友谅是混元霹雳手成昆的徒弟，同时是丐帮八袋长老，生性多疑，行事缜密周全。为人阴险狠毒，善于权谋。曾挑唆宋青书击杀师叔莫声谷。宋青书因嫉妒张无忌年少有为，江湖地位崇高又获得周芷若芳心，于是投靠丐帮。陈友谅利用他的人性弱点和性格软肋，教唆他向武当门人下毒以便谋取明教和武当派。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【策反】</b><br>立下此功，武当掌门非你莫属！<br>宋兄弟乃人中龙凤，怎甘追驸骥尾？<br><br><b>【恫疑】</b><br>此事，莫非有诈！<br>容我多番思虑。<br><br><b>【阵亡】</b><br>多疑反被误……<br><br><br><br>');
    createIntroAndTaici('yttl_yin_fanyao', '范遥，号称苦头陀，金庸武侠小说《倚天屠龙记》中的人物，是明教教主座下光明右使，人称范右使，杨逍、范遥当年江湖上与杨逍并称“逍遥二仙”，都是英俊潇洒的美男子。范遥自负于天下武学无所不窥，武功正邪兼修，渊博无比，剑法神奇。与杨逍在明教之中同为一等高手。明教教主阳顶天失踪后，他为了给明教除去隐患，不惜自毁俊颜，设法潜入汝阳王府，扮作哑巴，易名“苦头陀”，在王府传授指导郡主赵敏的武功，伺机行动。', '吃饱睡睡醒吃', '霸天', '污名', '<b>【毁容】</b><br>某愿以身为烛，重燃明教圣火！<br>自今日始，世上再无范瑶此人！<br><br><b>【暗控】</b><br>不为王府心腹，难知元室机密！<br>好一招移祸之计！我当助明教化险为夷！<br><br><b>【赤胆】</b><br>蒙郡主深信之恩，范遥岂能不告而别？<br>再与郡主相见，你我便是死敌了！<br><br><b>【燎原】</b><br>举火燎天，燃尽晦暗！<br>光明圣火，终将燎原！<br><br><b>【死亡】</b><br>得见圣火重燃，虽死…无憾矣……<br><br><br><br><br>');
    createIntroAndTaici('yttl_aerasan', '阿二、阿三是西域金刚门火工头陀的传人，两人均为元室赵敏手下的爪牙。内外功皆属上乘，掌握大力金刚指和少林正宗最顶级的武学金刚伏魔神通。阿二是一名秃头老者，天生神力，练成一身极强的内；阿三精壮结实，虎虎有威，脸上、手上、项颈之中，身上尽皆盘根虬结。二人在六大派围攻光明顶失败后，率众围攻殷梨亭并将其活捉，随后阿三以大力金刚指损伤其四肢，弃于沙谷之中。在刚相偷袭张三丰时，随赵敏攻上武当，被张无忌以九阳神功迫回内劲震断双臂臂骨、胸前肋骨、肩头锁骨。使用本门秘药黑玉续断膏重接伤骨时，也让赵敏顺水推舟，用七虫七花膏算计张无忌。', '吃饱睡睡醒吃', '霸天', '佚名', '<b>【碎骨】</b><br>你这胳膊和腿，怕是保不住了！<br>金刚门的指功，比之少林又如何啊？哈哈哈哈……<br>事急从权，身受重伤也说不得了！<br>郡主知遇之恩，当出生入死为报！<br><br><b>【逼供】</b><br>识相的，就说出屠龙刀的下落！<br>二十年败体残躯，这滋味儿，还好受吗？<br><br><br><br><b>【死亡】</b><br>这粉身碎骨之痛，竟如此生不如死……<br><br><br><br><br>');
    createIntroAndTaici('yttl_yinyewang', '殷野王是明教白眉鹰王殷天正之子，殷素素的哥哥。阳顶天失踪后，明教群龙无首，四分五裂，殷氏父子独自创立了天鹰教。为了令天鹰教名扬江湖，他和殷素素使用暗器偷袭俞三侠，获得了屠龙宝刀，并在王盘山举行扬刀大会进行立威。后来屠龙刀在王盘山被金毛狮王谢逊劫走。', '大熊小猫', '落影逝尘', '莫无殇', '<b>【飞钉】</b><br>明枪易躲，暗箭难防！<br>俞三侠武功卓绝，只可智取，不可硬来！<br><br><b>【扬威】</b><br>今日，是我天鹰教扬刀立威的大好时机！<br>得此宝刀镇教，必定扬名立万！<br><br><b>【阵亡】</b><br>江湖险恶，不该如此张扬……<br><br><br><br>');
    createIntroAndTaici('yttl_spxuanmingerlao', '玄冥二老是江湖中少有的一流高手，年高却德薄，心甘情愿做蒙元朝廷的走狗，助其攻击中土明教，空有一身高强武艺。凭借其绝学玄冥神掌纵横武林，曾用此掌伤了幼年的张无忌，导致其几番求医都无果，最后张无忌练习了九阳神功，方才化解体内淤积多年的寒毒。', '大熊小猫', '落影逝尘', '弈声传媒有声工作室', '<b>【玄阴】</b><br>你，还是早些料理身后事吧！<br>普天之下，无人可解我这至寒之毒！<br><br><b>【名缰】</b><br>愿为郡主，肝脑涂地！<br>功名利禄，皆我所图！<br><br><b>【阵亡】</b><br>只求蝇头利，何计身外名……<br><br><br><br>');
    createIntroAndTaici('yttl_xiexun', '明教四大护法之一，因头发金黄，故人称金毛狮王。魁伟雄奇，性烈如火，全家一十三口均被师父成昆所杀，不惜滥杀无辜引出成昆。曾杀少林空见神僧，终生愧疚。以狮子吼震败王盘山群雄，抢夺屠龙刀，在冰火岛独居二十年参悟刀中秘密。后与义子张无忌重逢，其大败成昆后，归于佛门。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【狮吼】</b><br>啊……<br>纵声长啸，无坚不摧！<br><br><b>【悟刀】</b><br>武林至尊，屠龙宝刀；号令天下，莫敢不从！<br>我离群索居二十载，终未悟出屠龙刀的秘密！<br><br><b>【阵亡】</b><br>无忌孩儿，就让义父皈依佛门，洗尽一身罪孽……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_xiexun', '谢逊是金庸武侠小说《倚天屠龙记》中的人物，在明教四大护教法王中排行第三，因满头金发，又擅长狮子吼，故绰号金毛狮王。他身形高大魁梧，性如烈火，年轻时全家惨遭师父成昆灭门，为此不惜滥杀无辜引出成昆。因用七伤拳击杀空见而终生愧疚。后来在寻找屠龙刀的过程中与殷素素、张翠山一同流落冰火岛。后遭到周芷若暗算，又被成昆从丐帮夺走，被囚于少林寺中，每日听高僧念诵佛经而大彻大悟。张无忌率明教群雄硬闯少林寺，谢逊却不愿离开，在大败成昆、报复家仇之后，被渡厄收为徒儿，归于佛门。', '吃饱睡睡醒吃', '霸天', '前轮', '<b>【失心】</b><br>阴阳崩裂仇未泯，黄泉逆流恨难平！<br>心脉俱损情激愤，血染神智性癫狂！<br>我要让这里，血流成河，哈哈哈……<br><br><b>【铭恨】</b><br>以怨报怨，以杀还杀！<br>百世之仇，犹可报之！<br>一十三口的血债，只要你一人偿还！<br><br><b>【释心】</b><br>血仇似幕催狂性，往事如尘动良知！<br>杀戮可止仇未止，心魔易消罪难消。<br><br><br><b>【死亡】</b><br>让我永远，流放在这冰火岛上吧……<br><br><br><br><br>');
    createIntroAndTaici('yttl_zhouzhiruo', '周芷若幼时父亲遭元兵杀害，遇张三丰相救，与少年张无忌在汉水舟中邂逅，后被送至峨眉派成为灭绝师太器重的弟子，灭绝师太自尽前传其掌门之位并告知其倚天剑的秘密。周芷若时运不济，在登上掌门之位的路上屡受阻拦，更遭同门师姐妹排挤和追杀。后获得倚天剑练成九阴白骨爪，终执掌峨眉派大权。', '大熊小猫', 'SUKINCEN', 'Stella薇', '<b>【哑忍】</b><br>忍一时之辱，铭先师遗志！<br>今芷若所受之辱，他日必当悉数奉还！<br><br><b>【掌权】</b><br>峨眉弟子听令：剿灭魔教，秉承先志！<br>恩师亲传扳指在此，谁敢不从？<br><br><b>【伐异】</b><br>你躲得过初一，躲不过十五！<br>峨眉乃名门正派，断不与魔教勾结！<br><br><b>【阵亡】</b><br>芷若泥足深陷，误入歧途，愧对恩师器重……<br><br><br><br>');
    createIntroAndTaici('yttl_xiaozhao', '小昭是紫衫龙王黛绮丝和银叶先生韩千叶之女。奉母之命扮作丑陋容貌混入光明顶，盗取乾坤大挪移心法。张无忌处处对她维护有加，使其心生感激并爱上张无忌，一直以丫头的名义侍奉左右。容貌秀丽且性情温和，精通五行八卦术。曾为张无忌翻译圣火令神功，助其击退波斯明教十二宝树王。后代替母亲作为圣女回到波斯。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【怜香】</b><br>公子千金之躯，怎能为我抵挡凶险！<br>能得公子垂怜，小昭三生有幸！<br><br><b>【义婢】</b><br>公子待我情深义重，我愿一生侍奉左右！<br>公子，我来为你译读这圣火令神功！<br><br><b>【阵亡】</b><br>公子，请多保重……<br><br><br><br>');
    createIntroAndTaici('yttl_weiyixiao', '韦一笑是金庸笔下轻功第一高手，可谓无人能比。韦一笑是明教四大护法之一，人称青翼蝠王。他在修练至阴至寒的“寒冰绵掌”时走火入魔，经脉中郁积了寒毒，要吸人血才能免去全身血脉凝结成冰。后来得到张无忌九阳神功的治疗，除去了寒毒，摆脱吸血的命运。', '大熊小猫', '落影逝尘', '狗子', '<b>【冰掌】</b><br>玄阴绵绵，冰魄冻天！<br>寒入五脏悔今时，霜侵六腑堪凌迟！<br><br><b>【血蝠】</b><br>三阴错乱难展翼，且息獠牙藏锋芒！<br>三阴俱损，痛不欲生！<br><br><b>【阵亡】</b><br>承蒙大恩，不必再茹毛饮血……<br><br><br><br>');
    createIntroAndTaici('yttl_guoxiang', '郭襄是郭靖和黄蓉之女，秀美豪迈。十五岁时遇到杨过，杨过为她在丐帮大会中大办生日宴，使她终生难忘，十八岁离家出门游历，一生追寻神雕侠未果。少林觉远大师圆寂之际，呓语九阳真经，郭襄默记了一部分。襄阳城破，她持倚天剑逃生。四十岁顿悟出家为尼并创立峨眉派，继承父志。', '大熊小猫', '落影逝尘', '浅笑安然', '<b>【遍寻】</b><br>华山一别无觅处，余生共谁度？<br>遍寻天涯，不见侠影！<br><br><b>【长忆】</b><br>一见杨过，误终身！<br>少室山头琴未冷，风陵渡口似闻声！<br><br><b>【道隐】</b><br>万事汇宗皆作土，飘然绝尘去！<br>峨眉慧剑削发，遁身空门绝尘！<br><br><b>【立宗】</b><br>襄阳之殇，永志不忘！<br>承父之志，驱逐鞑虏！<br><br><b>【阵亡】</b><br>红颜弹指老，不见神雕侠……<br><br><br><br>');
    createIntroAndTaici('yttl_jueyuandashi', '身为少林寺管理经书的和尚，觉远无意间学会了《楞伽经》夹缝中的《九阳真经》。后来经书遗失，加上何足道上少林挑战，觉远因使用九阳神功击败何足道而犯下寺规。为维护徒弟，身挑张君宝、郭襄出逃，为此大耗真力，在圆寂之时呓语部分《九阳真经》经文，张君宝、郭襄、少林无色禅师各听得一部分，最终三人将各自记下的内容悟出武当九阳功、峨眉九阳功、少林九阳功，张君宝和郭襄也因此功开创武当派和峨眉派。', '大熊小猫', '落影逝尘、SUKINCEN', '觅阳', '<b>【藏经】</b><br>纸上得来终觉浅，绝知此事要躬行！<br>书中自有黄金屋！<br><br><b>【护犊】</b><br>扫地恐伤蝼蚁命，爱惜飞蛾纱罩灯！<br>君宝，郭女侠，你们自求多福吧！<br><br><b>【狂呓】</b><br>九阳神功，不可失传！<br>领悟高低，全凭造化！<br><br><b>【烈阳】</b><br>工弥久而技弥精！<br>劲断意不断！<br><br><b>【博阳】</b><br>阴阳互补，互生互济！<br>由己则滞，从人则活！<br><br><b>【真阳】</b><br>彼不动，己不动，彼微动，己已动。<br>曲中求直，蓄而后发。<br><br><b>【阵亡】</b><br>仿佛听到，佛祖的召唤……<br><br><br><br>');
    createIntroAndTaici('yttl_yudaiyan', '俞岱岩是武当张三丰的弟子，排行第三。作为小说《倚天屠龙记》的开篇人物，引出了全书的故事。早年奉师父之命前往福建铲除当地一帮强盗巨匪，无意间得到屠龙刀，后被殷素素和殷野王设计陷害，取走屠龙刀，俞岱岩在被龙门镖局送回武当的途中被成昆用大力金刚指重伤，终身残疾。', '大熊小猫', '落影逝尘', '狗子', '<b>【诛寇】</b><br>欺压平民百姓，算什么英雄好汉！<br>尔等欺男霸女之徒，还不速速领死？<br><br><b>【追赃】</b><br>大丈夫，怎可取不义之财！<br>物归原主，完璧归赵！<br><br><b>【阵亡】</b><br>我俞三侠，怎会落得如斯田地……<br><br><br><br>');
    createIntroAndTaici('yttl_zhaomin', '汝阳王之女，时而明艳不可方物，时而端严之至，令人不敢逼视。直率豪爽，具有雄才大略。曾经奉命剿灭反贼，对六大派下毒手，屡立奇功，受到蒙元朝廷的封赏。影视版本中的赵敏因不堪受平南王多番骚扰，与其斗智斗勇，在陶然山庄设下空城计，将其与部下一网打尽，全部消灭。后与张无忌归隐江湖。', '大熊小猫', '落影逝尘', '兔猪', '<b>【诱诛】</b><br>这陶然山庄，便是他葬身之所！<br>枉自聪明平南王，聪明反被聪明误！<br><br><b>【封赐】</b><br>你等围剿明教有功，大大有赏！<br>立下此功，他日定可平步青云！<br><br><b>【阵亡】</b><br>说好的，一世为我画眉呢……<br><br><br><br>');
    createIntroAndTaici('yttl_yuanzhen', '绰号混元霹雳手，早年是江湖上有名的高手。因其和明教前教主阳顶天及其夫人的感情纠葛，他深深不忿，利用徒弟明教法王谢逊展开报仇计划，令谢逊家破人亡，激其杀人如麻，通过谢逊满手血污令明教成为武林公敌，从而引发六大派。事发败露后曾在光明顶假死，骗过少林寺，死里逃生，投靠蒙元朝廷。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【策乱】</b><br>剿灭魔教，当立奇功！<br>明教乃武林公敌，人人得而诛之！<br><br><b>【诈亡】</b><br>唯有此计，方可绝处逢生！<br>如今死里逃生，且待东山再起！<br><br><b>【阵亡】</b><br>策乱一生，终是竹篮打水一场空……<br><br><br><br>');
    createIntroAndTaici('yttl_jixiaofu', '纪晓芙原是峨眉派灭绝师太器重的弟子，本有望继承衣钵，无奈情关难闯，爱上明教左使杨逍。正邪不两立，面对师父强硬的反对态度，她亦不屈不折，从不后悔自己的选择，更为诞下的杨逍骨肉取名不悔，表明自己从来不后悔这段爱情。后来因拒绝灭绝师太击杀杨逍的要求，被其一掌劈死。', '大熊小猫', '落影逝尘', '辣鸭', '<b>【私授】</b><br>愿我如星君如月，夜夜流光相皎洁！<br>此情，以天为媒，以地为证！<br><br><b>【不渝】</b><br>衣带渐宽终不悔，为伊消得人憔悴！<br>纵是万劫不覆，我亦无怨无悔！<br><br><b>【阵亡】</b><br>师父大恩，再世再报……<br><br><br><br>');
    createIntroAndTaici('yttl_huqingniu', '居于蝴蝶谷，因医术超群人称蝶谷医仙。著有《子午针灸经》、《无名医书》、《带脉论》等。胡青牛向来不救非明教中人，所以对身受寒疾的韩千叶见死不救，因此黛绮丝对于愤恨有加，以致后来将其击杀。胡青牛曾教给少年张无忌医理，虽未治好他玄冥神掌之毒，却为他积累不少医学知识。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【回天】</b><br>若非明教人，生死不过问！<br>你阳寿未尽，命不该绝！<br><br><b>【砭灸】</b><br>此灸可助你内力精进！<br>半身不遂谷外关，肩鶻曲池三里还！<br><br><b>【阵亡】</b><br>恨不能，解脱世人……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_zhouzhiruo', '周芷若是汉水河畔渔夫之女，因天赋异禀而被师父灭绝师太器重，更在万安寺跳塔身亡之前将掌门之位传于她，并将屠龙刀和倚天剑的秘密告诉她。因为灭绝师太的个人成见和误会，视明教为魔教，便要周芷若发毒誓，此生以光耀峨眉为己任，且不得与张无忌产生儿女私情。为了完成师父遗愿，周芷若在灵蛇岛设毒计偷走屠龙刀并嫁祸给赵敏。周芷若终获得藏于屠龙宝刀中的九阴真经和降龙十八掌，习得九阴白骨爪和白蟒鞭法，傲视武林雄群。', '大熊小猫', '霸天', '酱子', '<b>【刀光】</b><br>慧剑斩情丝，烈刃断红尘！<br>倚天屠龙，上斩贼虏，下诛魔教！<br><br><b>【遗命】</b><br>黄天在上，他日徒儿有辱师命，天诛地灭！<br>苍天为鉴，我周芷若与姓张的，恩断义绝！<br><br><b>【光宗】</b><br>剑锋耀金顶，薪火照神州！<br>恩师有知，含笑九泉！<br><br><b>【剑影】</b><br>不见青丝红颜老，只留正气满乾坤！<br>本是青灯不归客，只因浊酒留风尘！<br><br><b>【阵亡】</b><br>刀光冷，剑影寒，偏白了，青丝三千……<br><br><br><br>');
    createIntroAndTaici('yttl_xie_weiyixiao', '韦一笑是金庸武侠小说《倚天屠龙记》中的人物。在明教四大护教法王“紫、白、金、青”中排行第四，因其轻功绝顶，又吸食鲜血，故绰号青翼蝠王。与布袋和尚说不得是生死之交。其轻功可谓无与伦比，当世无双，修炼寒冰绵掌时出了差错，经脉积了寒毒，一用内力寒毒就会发作，要吸人血，以免全身血脉凝结成冰。后得到张无忌“九阳神功”治疗，祛除了寒毒摆脱嗜血的命运。', '吃饱睡睡醒吃', '霸天', '全职卤蛋', '<b>【魅影】</b><br>神出如影，鬼魅随行！<br>如鬼附身，如魅驱魂！<br>没猜到我的存在吧？哈哈哈……<br>我会成为你，而你…将就此消失！<br>你的大意，就用你的鲜血来偿还吧！<br>好好记住，这张终结你生命的脸！<br><br><b>【寒脉】</b><br>血脉凝冰难自抑，阴寒摧命不欲生!<br>寒伤入血脉，阴毒不可驱！<br>这加倍的恐惧，将融入你们的血液！<br>今晚的月光照亮的，会是你们的尸体！<br><br><br><br><b>【死亡】</b><br>呃……不要高兴的太早，我在光明顶上等着你们！<br><br><br><br><br>');
    //笑傲江湖
    createIntroAndTaici('xajh_xie_dongfangbubai', '东方不败是金庸武侠小说《笑傲江湖》中的男配角，本是日月神教奖学光明左使，为修炼《葵花宝典》，不惜挥刀自宫练就一身绝世武功，当世无敌，趁任我行走火入魔之际发动叛乱，夺得教主之位，号东方不败，武功天下第一，明白了天人化生、万物滋长的妙道。但心性也因此大变，拥有权利后却迷恋起雕龙绣凤的女红之活来，且宠幸小人杨莲亭无法自拔，为护杨莲亭周全而分心，被令狐冲、任我行联手击中背上要害而战败，最后被任我行击杀。', '大熊小猫', '霸天', '雪橙', '<b>【针锋】</b><br>莫言刀兵杀人，绣红之物亦锋！<br>针锋如迅电雷出，虽瞬息，亦难挡！<br><br><b>【逼宫】</b><br>神教教主之位，已在我掌握之中！<br>识时务者为俊杰，通机变者为英豪！<br><br><b>【断袖】</b><br>修容仪态改，甘为女儿身！<br>教中事物，莲弟代为处分即可！<br>你得罪我便罢，得罪莲弟就万万不可！<br>莲弟要你死，我也……莫可奈何！<br><br><br><b>【死亡】</b><br>东方不败既已败，那也不会……再活在这个世上了……<br><br><br><br><br>');
    createIntroAndTaici('xajh_xie_zuolengchan', '左冷禅野心勃勃，为了成为武林霸主，布下庞大而长远的阴谋，包括多年前便秘密派弟子劳德诺投身华山派，作为卧底。华山派有卧底，其他各派自然都有。他在每一派之中兴起分裂，协助他夺权，例如华山派上代有剑宗、气宗之分，他就怂恿落败而被逐出派的剑宗传人，到华山向岳不群挑战。对于坚决不肯臣服于他的人，左冷禅采用的是杀戮手段，或借名目明杀，加以结交邪派为名目，屠杀刘正风全家；或是乔装暗杀，例如蒙面拦途攻击岳不群夫妇及华山弟子。后来在铸剑谷围攻定闲、定逸及恒山弟子，则是由乔装斗至露出真面目。总之，不能暗谋，便是明攻，务要得手，左冷禅是个不择手段向目标迈进的人。但他终于在心计阴谋上棋差一着，输了给岳不群，封禅台上，他的假辟邪剑谱敌不过岳不群的真辟邪剑谱，惨然落败，落得为他人作嫁。不过，左冷禅不愧是左冷禅，他惊怒一瞬即逝，虽败也极力保持风度。而且，他始终不心死，仍图谋他日卷土重来。左冷禅是个可怕亦是可悯的人物。', '僵尸王', '霸天', '前轮', '<b>【隐功】</b><br>台前定波涛，幕后乱风云！<br>隐手布棋子，功成身入局！<br><br><b>【寒谋】</b><br>气似冰雪掌如霜，奇谋予君君可寒？<br>此谋时机未至，可以暂缓行之。<br><br><b>【并岳】</b><br>五岳合并之势，皆在我之掌握！<br>并派之路多险阻，天若阻我亦灭天！<br><br><b>【兼并】</b><br>五岳并派，众心所归！<br>正派左道，皆伏我号令！<br><br><b>【死亡】</b><br>到底……算错了哪一步……<br><br><br><br><br>');
    createIntroAndTaici('xajh_lvzhuwong', '绿竹翁是金庸武侠小说《笑傲江湖》中人物，是位隐居在洛阳绿竹巷中的高人，不仅善于弹琴吹箫，更是日月神教中的武学好手。绿竹翁俨然是位世外高人，只是他不隐居在深山僻野，而隐居在洛阳城的绿竹巷中。他无权无位，以编织竹器为生，无名无姓，就叫绿竹翁。他并不是离世独活，只不过不与权贵往来，只交志趣相投的朋友，而志趣相同，便不管是落拓江湖子弟还是账房师爷，也可以诚意交往。绿竹翁与世无争，以琴萧会友，江湖风波险恶，绿竹巷却仿佛是世外桃源，而巷中的绿竹翁，是遁世避乱的隐者。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【鉴谱】</b><br>此谱非凡物，不可湮于俗人之手。<br>天下能奏此曲者，不过寥寥数人尔。<br><br><b>【玉液】</b><br>为君持酒劝斜阳，且向花间留晚照。<br>金樽玉液映澄黄﹐醇醪未品醉人香。<br><br><b>【竹韵】</b><br>绿竹通幽清凉境，青松忘返自在心。<br>回首萧瑟无晴雨，一巷青竹任平生。<br><br><br><b>【死亡】</b><br>俗世凡尘多纷扰，竹篱茅舍自甘心……<br><br><br><br><br>');
    createIntroAndTaici('xajh_xiangwentian', '向问天是《笑傲江湖》中的人物，日月神教光明左使，江湖外号天王老子，武功高强，性情豪迈，足智多谋，连东方不败亦承认他是一个人才。向问天容貌清癯，颏下疏疏朗朗一丛花白长须，垂在胸前。他与令狐冲称兄道弟，并一直对日月神教前任教主任我行和其独女任盈盈忠心耿耿。后来在令狐冲“协助”下成功救出任我行，之后与令狐冲和任盈盈一起上黑木崖对付东方不败，帮助任我行重夺教主之位，任我行死后接替成为日月神教教主。', '吃饱睡睡醒吃', '霸天', '药仰', '<b>【孤军】</b><br>你们这些小罗罗，还不够爷塞牙缝呢！<br>天王老子就是我，你们，一起上！<br><br><b>【联袂】</b><br>你我联手，定叫那些兔崽子落荒而逃！<br>能与令狐少侠携手酣战，实乃人生一大快事！<br><br><b>【营救】</b><br>李代桃僵，只为营救故主！<br>偷天换日，以愈手足之伤！<br><br><br><b>【阵亡】</b><br>酩酊一场，不负结义之情，取酒来！<br><br><br><br>');
    createIntroAndTaici('xajh_xie_renwoxing', '任我行是《笑傲江湖》中的人物，日月神教的教主，武学修为深不可测，是江湖上数一数二的人物。虽然名副其实的自大狂妄，专横骄傲，却也不只一味自大，拥有类似政治家的精明眼光与手腕。其绝学吸星大法专吸他人内力，实乃武林人士心中的梦魇。后走火入魔，教主之位曾一度被东方不败夺去，最终与令狐冲等人合力夺回教主之位，击杀东方不败，但仍被东方不败的绣花针击中失去一眼。夺教主之位后野心更胜从前，一心统一江湖，但在华山上进攻五岳剑派时，因年老体衰，晕眩而逝。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【煞气】</b><br>服从或是死亡？做出你们的抉择吧！<br>煞气蔽天地，凶神临世间！<br><br><b>【汲星】</b><br>你们的真气，不过是我的下酒菜，哈哈哈哈哈……<br>吸星大法，纵日月星辰，亦可取之！<br><br><b>【魔威】</b><br>日月神教，文成武德！<br>圣主威名，无人不尊！<br><br><br><b>【阵亡】</b><br>日月光照，泽被苍生，哈哈哈（突然断气）……<br><br><br><br>');
    createIntroAndTaici('xajh_yuehou', '乐厚属《笑傲江湖》中的反面人物，嵩山派掌门人左冷禅师弟，外号大阴阳手，擅长掌法，双掌掌力不同一阴一阳，威力极大。曾被令狐冲用独孤九剑打败。乐厚一心想帮助其师兄左冷禅实现统一五岳剑派的野心，曾上恒山阻止令狐冲接任恒山掌门，却被任盈盈和蓝凤凰戏弄。', '大熊小猫', '棉花糖', '攀', '<b>【阴阳】</b><br>阴阳二气皆天生，善驭阴阳则功成！ <br>掌分阴阳，绵绵不绝！<br><br><b>【双掌】</b><br>少侠好剑法，且再试试我这大阴阳手！<br>阴阳双掌，后发先至！<br><br><br><b>【阵亡】</b><br>双掌既损，我的功夫……全废了……<br><br><br><br>');
    createIntroAndTaici('xajh_linzhennan', '林震南是威震江南的福威镖局总镖头，其祖父林远图下创威震武林的辟邪剑法并以此作为祖传信物。后剑法引得青城派觊觎，惨遭灭门大祸，与夫人被木高峰虐待，夫妻惨死。临死前请求令狐冲代为向林平之转达祖传遗言——向阳巷老宅中的祖先遗物不可妄自翻看。', '大熊小猫', '霸天', '冰霜墨菊', '<b>【起镖】</b><br>我林家世代行镖，素来信义当先！<br>福威镖局走镖，请诸位好汉行个方便！<br><br><b>【怀璧】</b><br>匹夫无罪，怀璧其罪！<br>慢藏诲盜，明于耳目！<br><br><b>【阵亡】</b><br>祖宅之物，不可擅动……');
    createIntroAndTaici('xajh_qufeiyan', '曲非烟是金庸《笑傲江湖》中的悲剧式人物，她是魔教长老曲洋孙女，小名非非，十三四岁。曲长老与小孙女相依为命，琴剑飘零。曲非烟聪明伶俐，调皮可爱，她对小师傅仪琳的少女心思看在眼里，乐在心里，曾在仪琳和令狐冲之间替他们互通情愫。最后被嵩山派掌门左冷禅四师弟费彬击杀，临死前将《笑傲江湖》曲谱托付给令狐冲。', '大熊小猫', '藏海、美妙的世界', '一叶米粥', '<b>【妁言】</b><br>男追女，隔重山；女追男，隔层纱！<br>嘻嘻…令狐哥哥，你哪懂女儿家的心思！<br><br><b>【烟灭】</b><br>恩怨情仇皆如尘，郁结憾恨一念泯！<br>倚楼听风雨，淡看江湖路！<br><br><b>【阵亡】</b><br>此生路未远，江湖不再来……<br><br><br><br>');
    createIntroAndTaici('xajh_dingxianshitai', '定闲师太是金庸武侠小说《笑傲江湖》中的人物，恒山派掌门，与其师姐定静师太，师妹定逸师太并成为“恒山三定”。为人随和，武功卓绝，见识广博。生前极力反对五岳剑派并派，最后与定逸师太在少林寺被岳不群所杀，临终之时为保大局，将恒山派掌门之位传予令狐冲。', '大熊小猫', '藏海、霸天', '谢声繁', '<b>【烈胆】</b><br>我辈虽女流，烈胆胜须眉！<br>左掌门并派之议，敝派决不屈从！<br><br><b>【盟守】</b><br>任老魔称霸武林，五岳剑派当同仇敌忾！<br>五岳同盟除奸邪，不教魔道改日月！<br><br><b>【授位】</b><br>生死关头，少侠切莫推辞！<br>上天有好生之德，公子必有福报！<br><br><b>【阵亡】</b><br>恒山派，就交给少侠了……<br><br><br><br>');
    createIntroAndTaici('xajh_jiangnansiyou', '江南四友，是《笑傲江湖》中的人物，老大黄钟公，老二黑白子，老三秃笔翁，老四丹青生。合称“江南四友”。受东方不败之命在杭州西湖梅庄看守被囚的任我行十二年。在这十二年中，四人脱离权力斗争，潜心钻研琴棋书画，享受人生。但好景不长，终于被向问天设下计谋，用琴棋书画为诱饵，成功营救了任我行。', '大熊小猫', '落影逝尘', '无忆CHENG', '<b>【珍醉】</b><br>金樽盛美酒，郁郁胡不乐？ <br>兰陵美酒郁金香，玉碗盛来琥珀光！<br><br><b>【对弈】</b><br>我爱敲棋君善饮，人称豪客与闲仙！<br>人生如棋，落子无悔，哈哈哈……<br><br><b>【点睛】</b><br>世间无限丹青手，一片伤心画不成！<br>挥毫落纸墨痕新，几点♣️️最可人！<br><br><b>【挥毫】</b><br>池墨泼飞云，紫毫挥广宇！<br>行云流水间，落笔如云烟！<br><br><b>【阵亡】</b><br>譬如朝露，去日苦多……<br><br><br><br>');
    createIntroAndTaici('xajh_sp_tianboguang', '田伯光刚出场时是一名让人闻之色变的采花大盗，极具反派色彩。他刀法干净利落，轻功驾轻就熟，人称万里独行。但其为人豪爽耿直，行事作派又光明磊落，是金庸惯用的欲扬先抑的塑造手法。后来在不戒和尚的逼迫下到恒山派出家，成为仪琳的徒弟，甘愿做起了仪琳的护花使者。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【快刀】</b><br>天下武功，唯快不破！ <br>兄台，看刀！<br>破空如龙吟，刀锋似虎啸！<br><br><b>【乱红】</b><br>品酒辨丈夫，闻香识女人！<br>宝马配好鞍，红粉赠佳人！<br>良玉比君子，名花拟[nǐ]美人！<br><br><b>【阵亡】</b><br>得遇红颜与知己，此生何其有幸……<br><br><br><br>');
    createIntroAndTaici('xajh_liangfa', ' 梁发是华山派掌门岳不群的三弟子，令狐冲的师弟，为人忠厚老实，宁死不屈，对师兄弟的感情很深厚。华山派一行人前往福州路经破庙时，遭遇左冷禅雇用的杀手伏击，众人被俘后，为了维护华山派的名声而出言顶撞悍匪，被灭绝人性的悍匪一刀斩下头颅，英勇献身。', '大熊小猫', '落影逝尘', '儒风', '<b>【英杰】</b><br>举觞白眼望青天，皎如玉树临风前！<br>今宵且尽一杯酒，与君同销万古愁！<br><br><b>【死节】</b><br>何方贼头，报上名来！<br>鬼鬼祟祟藏头露尾，算什么正人君子？<br><br><b>【阵亡】</b><br>义心如石，死节不移……<br><br><br><br>');
    createIntroAndTaici('xajh_wumingtaijian', '在金庸修订版《笑傲江湖》中，《葵花宝典》是由前朝宫中无名宦官所创，但到底为何这样的一个绝世高手会担任后宫太监，却无人知晓。《葵花宝典》虽然精奥，当中却留下不少难题留待后人解答，但这部秘笈如何流落到民间，却是不得而知。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【宦海】</b><br>宦海沉浮，不如流浪于江湖！<br>这深宫内院，步步杀机，人人自危！<br>萧墙祸起，是时候离开这波谲[jué]云诡之地了！<br><br><b>【邪典】</b><br>欲练神功，引刀自宫！<br> 采阴补阳，天人化生！<br>气血双修，事半功倍！<br>奇书一出，天下必乱！<br><br><b>【阵亡】</b><br>这血雨腥风的序幕，才刚刚开启……<br><br><br><br>');
    createIntroAndTaici('xajh_fengqingyang', '风清扬属于华山派剑宗’熟习独孤九剑，武功盖世，剑术神通剑气内斗时，曾被气宗骗得远走他乡去成亲，错过剑气二宗对决，以致剑宗落败，随后一直隐居华山思过崖，立誓从此不再涉足江湖之争。与令狐冲相识后’将剑魔独孤求败的独孤九剑一一传授给他，使得令狐冲成为当世绝顶高手。', '大熊小猫', '落影逝尘', '狗子', '<b>【授剑】</b><br>以剑御气，以剑修心！<br>剑术若入化臻之境，草木竹石皆可为剑！<br><br><b>【剑宗】</b><br>天下唯我剑气长，一剑纵横三万里！<br>剑锋所指，心之所至！<br><br><b>【阵亡】</b><br>什么剑气之争，皆是过眼云烟……<br><br><br><br>');
    createIntroAndTaici('xajh_ningzhongze', '宁中则是金庸武侠小说《笑傲江湖》中的悲剧式人物，出嫁前江湖人称宁女侠，出嫁后多称岳夫人，华山派气宗高手。她为人正派，慷慨大义，不为权势所逼，是不可多得的女中豪杰。她为了令狐冲多次和丈夫岳不群口角相争，后得知丈夫是个伪君子，又遭女儿去世，心灰意冷、了无牵挂之下自杀身亡。', '大熊小猫', '落影逝尘', '谢声繁', '<b>【气宗】</b><br>筑根强基，以气练剑！<br>宁氏一剑，无双无对！<br><br><b>【兰心】</b><br>做人当如君子兰，择居幽谷而不争！<br>上善若水，为而不争！<br>一杯清酒聚知音，半生相知有几人！<br><br><b>【阵亡】</b><br>错付一生，所托非人……<br><br><br><br>');
    createIntroAndTaici('xajh_feibin', '费彬是嵩山派掌门左冷禅的四师弟，其武艺高强，掌力惊人，绰号“大嵩阳手”。在衡山派刘正风金盆洗手决定退出江湖时，左冷禅派费彬等人前来兴师问罪，指责衡山派的刘正风勾结日月神教长老曲洋，先杀了刘正风全部家小，再逼刘正风认罪自杀。刘正风被曲洋救走后欲赶尽杀绝，被莫大袭击身亡。', '大熊小猫', '落影逝尘', '狗子', '<b>【讨罪】</b><br>人就是江湖，你如何退出？<br>恩未尽怨未了，刘掌门岂能一退了之！<br>什么金盆洗手，不过是你开脱罪名的借口！<br><br><b>【杀绝】</b><br>衡山派勾结魔教，遗祸武林，论罪当诛！<br>尔等包藏祸心，实乃武林公敌！<br>正邪不两立，我等替天行道矣！<br><br><b>【阵亡】</b><br>你，竟敢暗算我……<br><br><br><br>');
    createIntroAndTaici('xajh_linghuchongrenyinyin', '令狐冲是华山派大弟子，名门之派出身，却放荡不羁，不拘小节，喜好以酒会友。任盈盈为魔教之后，两人在看透江湖上的刀光剑影、血雨腥风之后决定退隐江湖，以酒作乐，琴瑟和鸣。两人是在这充满政治隐喻的大环境下淡泊名利的象征，不愿随波逐流，算计人心。', '大熊小猫', '落影逝尘', '狗子、大绿_Midori酱', '<b>【酒赋】</b><br>一曲长歌一杯酒，半世漂泊半生缘！<br>醉饮千觞不知愁，红颜相伴了无忧！<br>烈酒过喉畅鲸饮，横剑醉梦不自知！<br>举案莫问君几醉，小杯清陈又一樽。<br><br><b>【琴心】</b><br>琴音藏雅意，弦歌寄真心！<br>琴鸣酒乐两相得，一杯不啻千钧金！<br><br><b>【阵亡】</b><br>琴心剑魄今何在，梦断浮生一曲终……<br><br><br><br>');
    createIntroAndTaici('xajh_tianmendaozhang', '天门道长是《笑傲江湖》中“泰山派”的掌门人。比玉矶子玉音子等人低一辈。他正气凛然，嫉恶如仇，但脾气暴躁，性子刚烈，缺乏应变能力。天门道长极端反对左冷禅吞并五岳各派的野心，后来被陷害主动交出掌门人的位置，在与左冷禅请来的杀手决斗时自断经脉，与敌人玉石俱焚而死。', '大熊小猫', '寰宇星城', '沃声_风飞语', '<b>【血勇】</b><br>并派一事，我泰山派恕难从命！<br>左掌门野心昭昭，不怕江湖中人耻笑？<br><br><b>【刚决】</b><br>宁为玉碎，不能瓦全！<br>血染岱宗，玉石俱焚！<br><br><b>【阵亡】</b><br>筋络寸断，誓死一博……<br><br><br><br>');
    createIntroAndTaici('xajh_lanfenghuang', '蓝凤凰年龄约莫二十三四岁，是云南五毒教教主，同时也是日月神教圣姑任盈盈的属下。喜欢养毒蛇，能炼制传说中苗族人的蛊毒，还善于配置各种剧毒。喜欢吹洞箫和口哨。蓝凤凰千娇百媚，风韵甚佳，声音娇柔宛转荡人心魄。令狐冲曾身中剧毒，本已回天乏术，蓝凤凰命令教众施用血蛭转血术，方救他一命。', '大熊小猫', '落影逝尘', '遂非', '<b>【五毒】</b><br>奉劝阁下，早点儿准备棺材吧！<br>你已全身是毒，药石无医！<br><br><b>【转血】</b><br>亏得我转血之术，你已重获新生。<br>五毒尽除，脱胎换骨！<br><br><b>【阵亡】</b><br>救得了别人，救不了自己……<br><br><br><br>');
    createIntroAndTaici('xajh_liuzhengfengquyang', '刘正风是武林衡山派的人物，曲洋则是邪派日月神教长老，虽然身处于水火不容的两个派别，但因为都酷爱音律，两人成为莫逆之交，两人琴箫合奏的《笑傲江湖》曲更是冠绝武林。在遭受到“正派”人士的追杀后，两人临死前将曲谱交给令狐冲保管。', '大熊小猫', '落影逝尘', '小林', '<b>【迭奏】</b><br>沧海一声笑，红尘俗世知多少！<br>不问恩怨不问情，琴箫合鸣觅知音！<br><br><b>【绝唱】</b><br>我送故人三万里，以血践盟歌咏志！<br>广陵散，成绝响，一曲江湖还笑傲！<br><br><b>【绝谱】</b><br>此去江湖与君绝，何日再闻笑傲曲？<br>初闻不知曲中意，再听已是曲中人！<br><br><b>【阵亡】</b><br>人生得一知音，足矣……<br><br><br><br>');
    createIntroAndTaici('xajh_yuelingsan', '岳灵珊是华山派常门人岳不群和女侠宁中则的掌上明珠，和大师兄令狐冲是青梅竹马，自小一起合创冲灵剑法。令狐冲一生痴恋岳灵珊，她却对林平之情有独钟，成亲后即使因林平之自宫而从未有过夫妻之实，却甘心无悔守护在他身边，纵使被狠辣绝情的丈夫刺杀，临终前口里念的还是他。', '大熊小猫', '落影逝尘', '槐生', '<b>【剑舞】</b><br>青梅如豆，柳叶似眉！<br>冲灵剑舞，情意绵长！<br><br><b>【蕙质】</b><br>幡幡瓠叶，采之亨之，君子有酒，酌言尝之！<br>诗酒趁年华，年华如豆蔻。<br><br><b>【芳魂】</b><br>海枯石烂，此情不渝！<br>与君同饮三杯酒，来世再做结发人！<br><br><b>【阵亡】</b><br>大师兄，替我照顾平之……<br><br><br><br>');
    createIntroAndTaici('xajh_xieyuebuqun', '岳不群是《笑傲江湖》中华山派掌门，江湖号称君子剑，实乃彻底的伪君子。他外表谦虚文雅，正气凛然，背后实则阴狠毒辣，富有智计和野心，为得辟邪剑谱，不惜迫害自己的徒儿、妻子和女儿，后为练辟邪剑谱而自宫。夺得五岳掌门后，企图尽诛异己。后被陷阱中的令狐冲用吸星大法吸住无法脱身，于是提剑刺向令狐冲，快击杀令狐冲之际，被恒山派救人心切的仪琳击杀。', '吃饱睡睡醒吃', '霸天', '林木', '<b>【伪善】</b><br>华山门下，当笃行君子之仁。<br>知者不惑，仁者不忧。<br>义人纵渴，不饮盗泉之水！<br>信义行于君子，而诡诈施于小人。<br>武林相逢，我辈当以礼为先。<br>明礼而知进退，自省而全得失。<br><br><b>【口蜜】</b><br>你我师徒恩义已断，毋宁多言！<br>正邪不两立，休怪岳某手下无情！<br><br><b>【腹剑】</b><br>既得辟邪剑谱，威震五岳，近在咫尺！ <br>比剑夺帅，兼收并蓄，盟主之位尽在囊中！<br><br><br><b>【死亡】</b><br>面具，终究被揭穿了……<br><br><br><br><br>');
    createIntroAndTaici('xajh_yuebuqun', '华山派气宗势力的掌门，号称君子剑，实乃伪君子。前期伪装隐忍，后期野心渐露。假意收养林平之，实则为了图获《辟邪剑谱》。在与左冷蝉的暗中较量中，采取按兵不动，趁势而起的手段，坐收渔人之利，实乃高明。为了一统江湖，不惜自宫练剑，导致众叛亲离，后被仪琳误杀。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【剑邪】</b><br>君子当藏器于身，待时而动。<br>放长线，钓大鱼！<br>忍一时荣辱，成千古霸业！<br><br><b>【巧伪】</b><br>人在江湖，身不由己！<br>岳某当尽绵力，替你主持公道！<br><br><b>【渔利】</b><br>鹬蚌相争，渔人得利！<br>螳螂捕蝉，黄雀在后！<br>作壁上观，不如浑水摸鱼！<br><br><b>【阵亡】</b><br>苦心经营王霸计，竹篮打水一场空……<br><br><br><br>');
    createIntroAndTaici('xajh_dongfangbubai', '东方不败是日月神教的光明左使，本来一副忠厚老实的样子，教主任我行对他极其信任，甚至将武学秘籍《葵花宝典》交由他保管。任我行负伤闭关修炼期间，表面上效忠教主的东方不败发动了叛乱，将任我行囚禁在西湖底，自己成功成为日月神教新教主。后来为了修习神功，不惜挥刀自宫。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【伪忠】</b><br>都说我负天下人，可天下人何曾善待我？<br>为了你，我可以背叛全世界！<br><br><b>【蹈隙】</b><br>任我行已是行将就木，你们还不弃暗投明？<br>凤鸣于野，栖梧之志！<br><br><b>【阵亡】</b><br>失去你，得到全世界，又如何……<br><br><br><br>');
    createIntroAndTaici('xajh_yanglianting', '杨莲亭原是日月神教里一名职务低微的教众，东方不败发动叛乱、夺得教主之位后，因杨莲亭身材魁梧、雄健威武，自宫后的东方不败阴阳倒乱，开始对他宠幸起来，提拔他做了总管，甚至将一切教务将由他打理，俨然成了东方不败的男宠。后来任我行等夹攻东方不败，东方不败为救杨莲亭，分心被任我行等击亡。', '大熊小猫', '落影逝尘', '林三', '<b>【恃宠】</b><br>还望教主，替属下作主！<br>孰是孰非，自有教主定夺！<br><br><b>【欲壑】</b><br>得权利者，得天下！<br>生杀予夺，大权在握！<br><br><b>【阵亡】</b><br>不该恃宠生骄，迷失在权利的漩涡中……<br><br><br><br>');
    createIntroAndTaici('xajh_tongbaixiong', '童百熊是金庸武侠名著《笑傲江湖》中的人物，是日月神教风雷堂堂主，武功高强。他是东方不败的多年好兄弟。曾为救性命垂危的东方不败舍命与潞东七虎相拼，救下受伤的东方不败；东方不败双亲去世无以为葬，也是他出手相助。后来，东方不败谋害任我行，篡夺教主之位，教里的长老不服，也是童百熊力排众异、铲除异己。但后来，竟因与东方不败的男宠杨莲亭结怨，最终被毫不念旧情的东方不败用绣花针击杀而死。', '大熊小猫', '霸天', '大宝', '<b>【笃义】</b><br>手足情深，何惜两肋插刀！<br>你我铁血之盟，尽在不言中！<br><br><b>【断恩】</b><br>潞东之战，怪我救虎为患！<br>拥主之过，童某有眼无珠！<br><br><b>【锄奸】</b><br>邪祟乱教，锄奸务尽！<br>奸佞当道，必当锄之！<br><br><br><b>【死亡】</b><br>任大教主，童百熊大罪难赦，先行谢罪了……<br><br><br><br><br>');
    createIntroAndTaici('xajh_ludayou', '陆大有自幼拜入华山派门下，因排行第六，又喜爱猴子，是故人称“六猴儿”，为人活泼诙谐，略带风趣。打小与大师兄令狐冲交好，处处为其着想，视其为榜样。令狐冲受伤后，偷偷将小师妹岳灵珊偷来的《紫霞秘笈》念给令狐冲听，希望他以此疗伤，却被其点穴后离开，被前来盗取秘笈的二师兄劳德诺杀害。', '大熊小猫', '朱阳光', '神齐大叔', '<b>【弟恭】</b><br>我自幼无依，视大师兄为手足至亲！<br>大师兄，你要照顾我一辈子哦！<br><br><b>【念诀】</b><br>你且运功疗伤，日后再向师父请罪！<br>人命关天，你快按我念的要诀运气调息！<br><br><b>【阵亡】</b><br>我大师兄行侠仗义，一定不会放过你……<br><br><br><br>');
    createIntroAndTaici('xajh_renwoxing', '日月神教教主，有一统江湖的野心，早年在嵩山大会上被左冷禅寒冰真气所伤，于是闭关修炼并将教中事务交给东方不败打理，不料东方不败心存异心夺走教主之位。任我行善使用邪功吸星大法，能迅速吸收敌人体力。后来在向问天、令狐冲的合力协助之下，击败东方不败，夺回教主之位。', '大熊小猫', '朱阳光', '冷淘', '<b>【闭关】</b><br>教中事务，全由东方兄弟打理。<br>老夫修炼期间，尔等尽忠护法！<br><br><b>【吸星】</b><br>哼！蝼蚁之命，怎与天地齐寿？<br>你只是老夫的垫脚石！<br><br><b>【出山】</b><br>神功大成之日，便是我一统江湖之时！<br>东方狗贼，今天必要取你狗命！<br><br><b>【权柄】</b><br>千秋万载，一统江湖！<br>踏平五岳，威震四海！<br><br><b>【阵亡】</b><br>难道老夫竟也是肉体凡胎……<br><br><br><br>');
    createIntroAndTaici('xajh_linghuchong', '自小由华山派掌门岳不群抚养长大，为华山派大弟子，后受定闲师太所托，成为恒山派掌门。生性放荡不羁，爽朗豁达，虽不拘小节，却有侠肝义胆。令狐冲嗜酒如命，一壶小酒，一个朋友。于思过崖面壁期间得到剑宗风清扬传授独孤九剑，曾在左冷禅围剿之际，以此招数解救华山派于危难。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【剑豪】</b><br>快意天涯三尺剑，风流落拓一声箫！<br>长剑无招，从来胜败天知晓！<br><br><b>【醉侠】</b><br>今朝有酒今朝醉，明日愁来明日愁。<br>五岳归来三杯醉，江湖人去万事空。<br><br><b>【忘忧】</b><br>漂泊半世一壶酒，知己天涯三两人。<br>皇图霸业谈笑中，不胜人间一场醉。<br><br><b>【阵亡】</b><br>抽刀断水水更流，举杯浇愁愁更愁……<br><br><br><br>');
    createIntroAndTaici('xajh_moda', '莫大先生是衡山派掌门，人称“潇湘夜雨”。莫大身材瘦长脸色枯槁，披著一件青布长衫，洗得青中泛白，形状落魄。他以一曲《潇湘夜雨》名动江湖，如泣如诉，听得人眼泪也会掉下来。琴中藏剑、剑发琴音这八字，是他一生武功的写照。虽然在血雨腥风的江湖中明哲保身，但其亦具有侠者风范，多次相救令狐冲。', '大熊小猫', '落影逝尘', '林三', '<b>【琴剑】</b><br>琴中藏剑，剑发琴音！<br>此去江湖无归期，空余琴音瑟瑟鸣！<br><br><b>【忠诉】</b><br>一首潇湘雨，唱断英雄魂！<br>江湖悠悠一壶酒，曲高和寡诉衷肠！<br><br><b>【阵亡】</b><br>谁解琴中意，谁怜歌中人……<br><br><br><br>');
    createIntroAndTaici('xajh_tianboguang', '田伯光轻功卓越，刀法出众，江湖人称万里独行。但其人又好色成性，故又被武林正派中人称为采花大盗。曾掳劫仪琳，令狐冲为救恒山小师妹而与其斗智斗勇，所谓不打不相识，最后竟结拜成为兄弟。愿赌服输的他也自甘拜小尼仪琳为师，落发为僧，从此与正派人士共同对抗魔教。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【寻芳】</b><br>窈窕淑女，君子好逑！<br>春宵一刻值千金！<br><br><b>【傲徒】</b><br>决断阴阳割分晓，缁衣为师斩寇雠！<br>师父在上，请受徒儿一拜！<br><br><b>【阵亡】</b><br>良师益友惧得，人生何憾……<br><br><br><br>');
    createIntroAndTaici('xajh_renyingying', '日月神教教主任我行独生女，东方不败夺权后被人尊为“圣姑”。容貌绝色，秀丽绝伦。行事果决，颇有心计。任盈盈极擅音律，可以一人琴箫分奏《笑傲江湖曲》。其御下时恩威并施，临敌果断狠辣，颇显圣姑手段。曾教令狐冲练习《清心普善咒》为其疗伤，与其成为知音并相爱归隐。', '大熊小猫', '落影逝尘', '水烟箩卜', '<b>【曲高】</b><br>弦挑流水洗客愁，此声最断肠。<br>千金易得，知音难觅。<br><br><b>【和鸣】</b><br>高山流水，琴瑟和鸣！<br>朝露润花花愈香，琴音解愁愁更长。<br><br><b>【阵亡】</b><br>尘世如潮人如水，只叹江湖几人回……<br><br><br><br>');
    createIntroAndTaici('xajh_zhuqianqiu', '祖千秋与老头子并称为“黄河老祖”。祖千秋博才多学，对饮酒用杯颇有研究。令狐冲被桃谷六仙重伤期间遇到祖千秋，两人因酒结缘，大论饮酒之道。后祖千秋将老头子耗时多年采用名贵药材炼制来救女儿的续命八丸泡在酒中送给令狐冲饮下，治好令狐冲连平一指也无可奈何的顽疾。', '大熊小猫', '落影逝尘', '临自灵', '<b>【论杯】</b><br>葡萄美酒夜光杯，欲饮琵琶马上催！<br>红袖织绫夸柿蒂，青旗沽酒趁梨花！<br><br><b>【酒药】</b><br>此酒，只与有缘人饮！<br>服下此药，可起死回生！<br><br><b>【阵亡】</b><br>记得，以酒祭我……<br><br><br><br>');
    createIntroAndTaici('xajh_linpingzhi', '林平之生于富庶商人家庭，自幼被万千宠爱，不识人间险恶，本性善良又至美至孝。因祖传《辟邪剑谱》遭武林中人觊觎而惨被灭门，血海深仇加身，被迫踏入江湖，在颠沛流离中被所谓恩师连番利用，激发人性极端，变得狠辣绝决，为报仇雪恨自宫练习神功，并为靠拢左冷禅而杀妻殉志。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【忍辱】</b><br>君子报仇，十年不晚！<br>且待我练就神功，再报这灭门之仇！<br><br><b>【去势】</b><br>尘世已不足恋，唯有父仇难消！<br>只要大仇得报，他日无怨无悔！<br><br><b>【雪耻】</b><br>千杯难消心头恨！<br>不将你挫骨扬灰，何以祭先父之灵！<br><br><b>【阵亡】</b><br>再也没有什么可以失去的了……<br><br><br><br>');
    createIntroAndTaici('xajh_laodenuo', '劳德诺带艺投师拜入华山派门下，为人老实木讷，少言寡语而又外貌平平，却实为左冷禅安排在岳不群身边监视他、掌握他一举一动的的卧底。他击杀被点穴的陆大有，盗走《紫霞秘笈》并处心积虑嫁祸给令狐冲。后因陆大有平生爱猴，任盈盈便将两只大马猴拴在他的左右手上，使其生不如死。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【潜行】</b><br>趁敌内乱，浑水摸鱼！<br>不动声色，祸起萧墙！<br><br><b>【暗袭】</b><br>踏破铁鞋无觅处，得来全不费工夫！<br>勿怪二师兄心狠手辣，怪只怪你身在江湖！<br><br><b>【阵亡】</b><br>六猴儿，二师兄向你陪罪了……<br><br><br><br>');
    createIntroAndTaici('xajh_spdongfangbubai', '东方不败受任我行提拔成为日月神教左使，仍对权利不满足，在任我行闭关养伤期间发动叛乱成为了新教主，更自宫修炼葵花宝典，武功绝世。后任我行回来复仇，东方不败以绣花针轻易拨开三人的刀剑兵器。自宫后的他心性大变，乐于在深闺中绣花，不再恋栈权利，开始宠幸男宠杨莲亭并将权利交给他。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【飞针】</b><br>秧针刺水剑锋齐，点点血色白绫飘！<br>金针不见血，却染残阳斜！<br><br><b>【嬗变】</b><br>天人化生，阴阳逆变！<br>阴阳迭用事何穷，此乃乾坤妙用！<br><br><b>【女红】</b><br>慵针懒线，几曾做女红。<br>薄施粉黛，淡扫娥眉。<br><br><b>【纵权】</b><br>何人不服我莲弟？<br>天下风云出我辈，一入江湖岁月催！<br><br><b>【阵亡】</b><br>愿来世，赐我女儿身……<br><br><br><br>');
    createIntroAndTaici('xajh_pingyizhi', '平一指居于开封府，人称“杀人名医”，即认为生老病死自有老天的道理，所以他医一人，杀一人；杀一人，医一人。他认为世上人多人少，老天爷和阎王心中自然有数，所以他救活一人，便须杀一人来抵数，同样杀了一个人便要救活一人。最后由于无法医治令狐冲被桃谷六仙注入六道真气的怪症，气死于五霸冈上。', '大熊小猫', '落影逝尘', '林三', '<b>【天道】</b><br>生死皆有定数，怎能不顾天理！<br>万物枯荣，生死轮回，自有天定！<br><br><b>【歧黄】</b><br>如此奇症，非药石可医，非神仙能救！<br>老夫平生从未见过如此玄奇之症！<br><br><b>【阵亡】</b><br>佞臣误国，庸医害人哪……<br><br><br><br>');
    createIntroAndTaici('xajh_zuolengchan', '嵩山派掌门人，其人颇有城府，机关算尽设计五岳并派，却为岳不群做嫁妆。左冷禅自称武林正道，但其门派弟子所作所为与禽兽无异，实为武林同道所不齿。曾在嵩山大会上使用寒冰真气挫伤任我行致其闭关修炼。在并派道路上恩威并施，雇用各路高手围剿反对并派的恒山派及华山派等。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【凛寒】</b><br>吸星大法，不足为惧！<br>在寒冰地狱瑟瑟发抖吧！<br><br><b>【围歼】</b><br>此人碍我大业，欲除之而后快。<br>此次设伏，只可成功，不许失败！<br><br><b>【并派】</b><br>五岳剑派，同气连枝！<br>五岳合并，众望所归！<br><br><b>【阵亡】</b><br>竟为他人作嫁衣……<br><br><br><br>');
    createIntroAndTaici('xajh_yilin', '恒山派定逸师太的弟子，不戒和尚和敲钟哑婆婆之女。单纯似水，天真无邪。令狐冲将她从田伯光手中救出之后，心生感激，凡心渐生，奈何身在佛门，无奈之下只好向哑婆婆倾诉心事。曾为报恩偷西瓜给令狐冲吃，害怕佛祖怪罪又不忍令狐冲受苦，内心十分挣扎。她坚信观音菩萨会帮助她，这种善良的愿望让人心酸。', '大熊小猫', '落影逝尘', '草莓味少女', '<b>【竭诚】</b><br>若救得令狐师兄，我愿承受三世业障！<br>佛祖恕罪，一切业报，弟子一人承担！<br><br><b>【梵心】</b><br>欲断三千烦恼丝，长点青灯伴古佛！<br>取次花丛懒回顾，半缘修道半缘君。<br><br><b>【祈愿】</b><br>慈航普度，愿君安好！<br>求菩萨保佑令狐大哥化险为夷！<br><br><b>【阵亡】</b><br>一心向佛，无怨无悔……<br><br><br><br>');
    createIntroAndTaici('xajh_yucanghai', '青城派掌门，松风观观主，擅用铁索白袍袖缠住敌方身体或武器。为谋取林家《辟邪剑谱》而用摧心掌将其灭门。央视版中的余沧海将武功融合于川剧变脸术，变幻莫测。', '大熊小猫', '落影逝尘', '狗子', '<b>【变脸】</b><br>见人说人话，见鬼说鬼话！<br>当面是人，背面是鬼，哈哈哈……<br><br><b>【摧心】</b><br>摧心剖肝，杀人无形！<br>神功夺魂五脏碎，烈掌索命六脏摧！<br><br><b>【索袖】</b><br>绊敌于方寸，一举歼灭之！<br>你们，就结伴赴黄泉吧！<br><br><b>【灭门】</b><br>用剑谱来交换你们林家的人命吧！<br>交出《辟邪剑谱》，可留你一条狗命！<br><br><b>【阵亡】</b><br>竟死在这黄毛小子手上……<br><br><br><br>');
    createIntroAndTaici('xajh_dongfangbubaiyanglianting', '权欲薰心的东方不败篡夺教主之位后，权利达到了巅峰，反而因自宫习武后阴阳倒乱，做起了绣花功夫，连武器都是绣花针。他宠幸男宠杨莲亭，权利都下放给他，导致杨莲亭在教中为所欲为，无人不忌惮他三分。后来任我行归来，与令狐冲等合力攻击东方不败，东方不败本可轻松应付，任盈盈以杨莲亭作要挟，致使东方不败大败。', '大熊小猫', '朱阳光', '青灯折扇不语', '<b>【纵情】</b><br>对酒当歌，人生几何！<br>莲弟，能和你在一起，世界末日又有何惧！<br><br><b>【索欲】</b><br>欲望尽头，是寂寞。<br>就算死亡，也不能把我们分开！<br><br><b>【阵亡】</b><br>我要你们，统统都给莲弟陪葬……<br><br><br><br>');
    createIntroAndTaici('xajh_taoguliuxian', '桃谷六仙是《笑傲江湖》中的角色。他们轻功极高，膂力极强，互相配合无懈可击。六兄弟亦正亦邪，动不动将人撕成四块，手法残忍。曾将怪异的真气输入令狐冲体内，令其四处求医。六兄弟除了性格怪诞，平时热衷于互相拌嘴，他们往往自相矛盾、令人捧腹。', '大熊小猫', '落影逝尘', '李二汪', '<b>【舌剑】</b><br>能和我们讲道理的人，还没出世呢！<br>六个臭皮匠，赛过诸葛亮！<br><br><b>【自辩】</b><br>六弟，休要胡说八道！<br>是福不是祸，是祸躲不过！<br><br><b>【诡辞】</b><br>我们兄弟只有六人，怎么能说是丑八怪？<br>有理走天下，无理寸步难！<br><br><b>【神膂】</b><br>定要将你，大卸八块！<br>兄弟齐心，其利断金！<br><br><b>【阵亡】</b><br>病从口入，祸从口出啊……<br><br><br><br>');
    createIntroAndTaici('xajh_xie_taoguliuxian', '桃谷六仙是金庸武侠小说《笑傲江湖》及其衍生作品中的人物组合。六仙分别为桃根仙、桃干仙、桃枝仙、桃叶仙、桃花仙、桃实仙，他们轻功极高，膂力极强，互相配合无懈可击。桃谷六仙在小说中以他们独特的性格和行为方式，给读者留下了深刻的印象。他们虽然武功平平，但彼此之间的兄弟情谊深厚，经常一起行动，善于插科打诨、唇枪舌剑，做一些搞笑的事情。他们的行为虽然有时显得有些荒诞，但也充满了人情味和生活气息，极受读者喜爱。', '吃饱睡睡醒吃', '霸天', '白狗', '<b>【桃仙】</b><br>死缠烂打，阴魂不散！<br>唇枪舌剑，妙语连珠！<br><br><b>【精怪】</b><br>吃饭喝酒，尚在其次；不能说话，乏味之极！<br>六仙乃世外高人，岂和你一般见识？<br><br><b>【话柄】</b><br>蒙郡主深信之恩，范遥岂能不告而别？<br>再与郡主相见，你我便是死敌了！<br><br><b>【移题】</b><br>我原是记得的，不过现在忘了！<br>你不和人说话，岂不辜负老天给你的一张嘴？<br><br><b>【饰言】</b><br>要论打赌，桃谷六仙从无败绩！<br>拾人牙慧，这可就是你的不是了！<br><br><b>【强辩】</b><br>诡辩如簧，舌灿莲花！<br>滔滔不绝，口若悬河！<br><br><b>【妄语】</b><br>有话请说，有屁快放！<br>若论见多识广，当数桃谷六仙！<br><br><b>【夺理】</b><br>哈！天下之事，抬不过一个理字！<br>好事都被你占了去？真是岂有此理！<br><br><b>【信口】</b><br>掌门轮流做，明天到我家！<br>得理不饶人，无理辩三分！<br><br><b>【死亡】</b><br>不曾结舌有今日，安能辩叱如古人……<br><br><br><br><br>');
    createIntroAndTaici('xajh_shangguanyun', '上官云是《笑傲江湖》中的人物，日月神教白虎堂长老，武功高强，为人又极耿直，江湖送绰号“雕侠”。奉日月神教教主东方不败之命上恒山擒拿恒山派掌门令狐冲，后归顺前教主任我行。 在黑木崖上，与任我行、右使向问天、令狐冲、任盈盈共战东方不败，在此役里，上官云的右眼被东方不败的绣花针刺瞎。', '银汉贯苍穹', '微尘', '无忆', '<b>【顺势】</b><br>另投明主，不事奸小！<br>愿随教主共诛逆贼！<br>见风转舵，实乃时势所逼！<br><br><b>【逢迎】</b><br>教主神威，冠绝江湖！<br>教主神功盖世，威慑五岳四海！<br><br><b>【阵亡】</b><br>追随教主，此生无悔……<br><br><br><br>');
    //鹿鼎记
    createIntroAndTaici('ldj_fulin', '顺治（福临）是《鹿鼎记》中出场的人物，出场时已是五台山一名法号叫行痴 的僧人。因爱妃董鄂妃病死而消沉，落发为僧。虽然远离紫禁城、躬耕田野，但他仍然念念不忘董鄂妃的离奇死因，秘密安排公公海大富潜伏中宫中暗查董鄂妃的真正死因，以图为她报仇。后与儿子康熙帝团聚，并语重心长地告诫儿子为君之道：当视祸福如草芥，履水火如平地，亲近万物，奉行天意。', '大熊小猫', '霸天', '小林', '<b>【密旨】</b><br>务必查出真凶，以慰鄂妃在天之灵！<br>后宫诡谲[jué]多变，你须万事提[dī]防！<br><br><b>【空门】</b><br>六根清净何曾净，五蕴[yùn]皆空未必空！<br>甘舍万乘空寄情，幽室参禅难忘影！<br><br><b>【佛缘】</b><br>王权富贵，不过炫人耳目、梦幻泡影！<br>贫僧行痴，你我已无君臣之分、尊卑之别！<br><br><br><b>【死亡】</b><br>繁华转瞬，水月镜花……<br><br><br><br><br>');
    createIntroAndTaici('ldj_dongefei', '董鄂妃是《鹿鼎记》中被提及的人物，原型是孝献皇后，世称董鄂妃。 内大臣鄂硕之女，抚远大将军费扬古之姐，满洲正白旗人，清世祖的嫔妃。在小说中，董鄂妃在入宫之后与孝惠章皇后争宠，受到顺治万千宠爱，致使顺治一度有废后的想法，帝后关系恶劣。之后董鄂妃便不明不白地非正常死亡，顺治亦于五台山出家为僧，派海大富暗中侦查董鄂妃的真正死因。', '大熊小猫', '棉花糖', '鲨鲨', '<b>【专宠】</b><br>臣妾并无所出，错蒙陛下谬[miù]爱！<br>万千宠爱，一枝独秀！<br>独占春色，圣宠隆恩！<br>后宫佳丽三千人，三千宠爱在一身！<br><br><b>【非命】</b><br>红颜胜人多薄命，莫怨春风当自嗟[jiē]！<br>自古红颜天犹妒，香消玉殒谁人怜？<br>木秀于林，风必摧之！<br><br><br><br><b>【死亡】</b><br>我做鬼……也不会放过你……<br><br><br><br><br>');
    createIntroAndTaici('ldj_jue_weixiaobao', '韦小宝是一名无任何背景的江湖混混，父亲不详，母亲韦春花在丽春院打工。有三寸不烂之舌，武功稀松平常，逃跑功夫一流。凭借左右逢源的本领在黑白两道都混得风生水起。结拜兄弟有索额图、康亲王、葛尔丹、孙思克、王进宝等；正式拜师的有九难、陈近南等。贪墨财产不计其数，收礼不计其数，此外，还有从鳌拜家中抄家所得金银珠宝，以及四十二章经中未曾挖掘的宝藏。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【花差】</b><br>上场不分大小，只收金银元宝！<br>英雄好汉，越输越笑；王八羔子，赢了就跑！<br>这十几万两银票，就劳烦兄弟们帮我花差花差！<br>人生难得几回搏，此时不博何时博！<br><br><b>【贿交】</b><br>我不去大杀三方，你也别想铲我的桩！<br>二一添作五，不输不赢，不杀不赔！<br>来来来，下注下注下注！<br><br><b>【通吃】</b><br>咱们井水不犯河水，岂不两全其美？<br>庙堂逢源，贵人相助；江湖交友，义薄云天！<br>四海之内皆兄弟，不可伤了和气！<br><br><br><b>【死亡】</b><br>朝廷草莽，里外难做，老子…不干了！<br><br><br><br><br>');
    createIntroAndTaici('ldj_zhengkeshuang', '郑克塽是金庸《鹿鼎记》中的人物，是台湾郑氏之后，延平郡王之子。为人纨绔子弟，目中无人，曾勾结师傅冯锡范害死天地会总舵主陈近南。康熙二十二年，郑克塽兵败后投降大清，全家被送往京师，隶属汉军正红旗，受封为海澄公。', '大熊小猫', '霸天', '紫衫喵', '<b>【纨绔】</b><br>陈永华党羽背主自立，给我拿下了！<br>我乃延平郡王之子，自有便宜行事之权！<br>承父祖之荫，受一等之爵。<br>名门之后，自有天恩！<br><br><b>【降清】</b><br>归顺大清，蒙恩受禄！<br>台湾郑氏，愿率众归服王化！<br><br><br><br><b>【死亡】</b><br>无颜对郑氏先祖，有愧于台湾百姓……<br><br><br><br><br>');
    createIntroAndTaici('ldj_wuzhirong', '吴之荣是《鹿鼎记》中的人物，《明史》文字狱致使七十余人冤死狱中，后吴之荣被起用，官至右金都御史。此人对于告密的路数处心积虑、蓄谋已久，屡次检举顾炎武、查伊璜等人。为达目的，不择手段，韦小宝因势利导，将计就计治罪吴之荣，救回查伊璜、顾炎武、吕留良三人，保住了吴六奇的性命，并将吴之荣诛于冤魂灵前。', '吃饱睡睡醒吃', '棉花糖', '全职卤蛋', '<b>【文狱】</b><br>犯忌之词，怎能留之！<br>此书大逆不道，岂可流毒天下？<br>清风不识字，何故乱翻书？反诗，反诗！<br><br><b>【冤罪】</b><br>此人讴歌前史，定怀谋逆之心！<br>此诗借古讽今，实有反清复明之图！<br><br><b>【兴案】</b><br>颠覆皇权，即刻满门抄斩！<br>欺君罔上，罪当诛连九族！<br><br><br><b>【死亡】</b><br>韦大人，饶命，饶命……啊……<br><br><br><br><br>');
    createIntroAndTaici('ldj_weishihougong', '韦小宝是金庸《鹿鼎记》中的男主，扬州人，青楼背景。因偶然事件来到北京，进入紫禁城，开启了他的奇妙之旅。在与清廷和天地会周旋过程中结识了七位娇妻，双儿青梅竹马、建宁金枝玉叶、沐剑屏玲珑小巧、方怡英武飒爽、曾柔软语依人、苏荃风姿绰约、阿珂翩若惊鸿。最后韦小宝携七位夫人归隐。', '大熊小猫', '霸天、藏海', '韦小宝：千狐（待配）<br>苏荃/方怡：谢声繁<br>双儿/建宁/阿珂：未眠<br>沐剑屏/曾柔：糖年糕<br>', '<b>【逢源】</b><br>欸，爵爷我的人气就是这么高！<br>相逢就是缘，交个朋友再走嘛！<br><br><b>【夫纲】</b><br>夫之有命，岂敢相违！<br>同声如鼓瑟，举案共齐眉！<br><br><b>【翻牌】</b><br>亲亲好老婆们，今晚谁来陪我呀!<br>一人一晚，不如大被同眠，来来来！<br><br><b>【冤种】</b><br>好冤家，别怜惜奴家，用力点嘛!<br>奴家的纤纤玉腿，爵爷喜不喜欢嘛？<br><br><b>【慧中】</b><br>一寸相思万千忆，情深几许望君知!<br>双鬟何窈窕，慧蕴巧心中！<br><br><b>【玲珑】</b><br>照灼连朱槛，玲珑映粉墙!<br>好哥哥，可不许欺负人家！<br><br><b>【秀外】</b><br>情难忍，举头望，烟锁柳眉!<br>侠侣梦，终得弃，共隐江湖！<br><br><b>【押注】</b><br>我天天陪你掷骰子，输了的可要打手心哦！<br>软语燕依人，共君坠红尘！<br><br><b>【惊鸿】</b><br>情从金玉散，逐影飞鸿来！<br>愿回知郎时，两心复如一！<br><br><b>【阵亡】</b><br>好老婆们，香一个……');
    createIntroAndTaici('ldj_sufeiya', '苏菲亚是韦小宝的编外老婆，两人做了一场露水夫妻。韦小宝到雅克萨城与其发生了一场历史邂逅，在韦小宝的油嘴滑舌下两国签下尼布楚条约，代价是韦小宝煽动其发动政乱，取代年幼的彼得摄政，沙俄历史上一段精彩绝伦的故事由此展开。', '大熊小猫', '霸天', '未眠', '<b>【缔约】</b><br>你我各取所需，何谈亏欠？<br>缔盟约誓，永不背弃！<br>划山而治，两国修好！<br><br><b>【政乱】</b><br>沙俄的勇士们，随我进军莫斯科！<br>彼得尚幼，由我摄政，有谁不服？<br>准备好接受女王的恩典吧！<br><br><b>【阵亡】</b><br>难忘那夜，露水情缘……');
    createIntroAndTaici('ldj_ake', '阿珂是《鹿鼎记》中的人物，她身世悲惨，是李自成和陈圆圆的女儿，九难为报国仇家恨，误以为她是吴三桂之女，将其盗走并命她刺杀吴三桂。韦小宝迷恋其美色，对其死缠烂打，但她倾心于王孙贵族郑克塽，对韦小宝态度冷漠，并多次险些伤害韦小宝性命。后又发现郑克塽本性凉薄，且逐渐意识到韦小宝对自己的好而转爱上他，成为韦小宝七位夫人之一，终随韦小宝归隐。', '大熊小猫', '藏海', '阿也', '<b>【绝色】</b><br>易求无价宝，难得有情郎！<br>晓看天色暮看云，行也思君，坐也思君！<br><br><b>【诛心】</b><br>红颜未老恩先断，最是无情帝王家！<br>昨夜承欢今余悲，可恨王孙早不归！<br><br><b>【阵亡】</b><br>我心匪石不可转，但求麟儿调琴瑟……<br><br><br><br>');
    createIntroAndTaici('ldj_weichunhua', '韦春花是金庸《鹿鼎记》中韦小宝的母亲，是扬州丽春院的一名妓女，连她自己也不知韦小宝生父是谁。在“十年一觉扬州梦，赢得青楼薄幸名”的小情小调中，韦春花就在这香艳颓靡的背景当中出场。作者一改以往磅礴大气的开场，用轻松诙谐的文字营造出青楼就是热门的皇宫、皇宫就是庄严的青楼的气氛。', '大熊小猫', '落影逝尘', '遂非', '<b>【勾栏】</b><br>什么王公贵胄、王侯将相，都得拜倒在我的石榴裙下！<br>莺歌燕舞华灯下，六朝蝴蝶竞芳华！<br><br><b>【瓦肆】</b><br>哎哟，大人，您多久没光临丽春院啦！<br>这年头笑贫不笑娼，有钱才是大爷！<br><br><b>【阵亡】</b><br>我果真是，人老珠黄了么……<br><br><br><br>');
    createIntroAndTaici('ldj_wuyingxiong', '应熊是《鹿鼎记》中的角色，他是平西王吴三桂之子。康熙帝为钳制吴三桂，特安排一场政治联姻，将建宁公主许配给他并如他入宫加封太子太保，实际上是将他幽禁在紫禁城内充当人质，彻底地沦为政治斗争的人质。后来在进京的途中被建宁公主阉割，该人物最终以悲剧形式收尾。', '大熊小猫', '咸鱼、落影逝尘', '冰霜墨菊', '<b>【联姻】</b><br>我，只不过是权利斗争的陪葬品！<br>皇权倾轧，你我都是棋子！<br><br><b>【押质】</b><br>我乃御封太保，尔等胆敢无礼！<br>紫禁城内，安有我半点自由！<br><br><b>【阵亡】</b><br>来世愿做寻常人，决计不入帝王家……<br><br><br><br>');
    createIntroAndTaici('ldj_weixiaobaojianning', '成长在烟花柳巷的韦小宝嗜赌如命，大大小小的赌馆都能见其踪影。误打误撞以小太监身份进入皇宫后，开启了他的传奇人生。在后宫结识了建宁公主并被其误破身份，本该陷入危境的他却与公主建立起令人难以启齿的虐恋关系。后来真公主变假公主，建宁便追随韦小宝一起隐退江湖。', '大熊小猫', '咸鱼、落影逝尘', '蚩宇、猴子', '<b>【豪赌】</b><br>人生就是一场赌，不是赢来便是输！<br>老子我大杀三方，金银财宝一箩筐！<br><br><b>【冤孽】</b><br>韦爵爷，让奴家伺候你快活嘛！<br>死奴才，还不给本公主爬过来！<br>想走？先问问本公主的鞭子答不答应！<br><br><b>【阵亡】</b><br>生是风流人，死做快活鬼……<br><br><br><br>');
    createIntroAndTaici('ldj_pangshoutoutuo', '胖瘦二陀是神龙教洪安通的爪牙，奉命外出寻找《四十二章经》。为了让他们死心塌地效命，洪教主使用毒药豹胎易筋丸控制他们。回岛复命之时因毒性发作，原本矮胖的胖头陀变得瘦高，瘦高的瘦头陀却变得矮小臃肿，兄弟两人的外型似乎发生了交换。瘦头陀与毛东珠是有实无名的夫妻，建宁公主是其亲生女儿。', '大熊小猫', '咸鱼', '无忆', '<b>【毒变】</b><br>剧毒封喉如疽附，噬皮噬骨又噬心！<br>此丹威力无穷，我等岂有不忠之心？<br><br><b>【复命】</b><br>教主神威，望宽恕小的无能！<br>此乃《四十二章经》，请教主过目！<br><br><b>【阵亡】</b><br>求教主慈悲，赐我们解药……<br><br><br><br>');
    createIntroAndTaici('ldj_mujianpin', '沐剑屏是金庸小说《鹿鼎记》中人物，云南沐王府的小郡主，明朝开国大将沐英的后代，是一个天真纯洁、善良高贵、情窦初开的少女。她同沐王府群豪一起为了国仇家恨到皇宫中展开刺杀行动，期间结识韦小宝，被韦小宝身上流露的英雄气概所吸引，最后成为他的小老婆，一同隐居。', '大熊小猫', '落影逝尘', '一叶米粥', '<b>【委身】</b><br>好哥哥，求你救我逃出生天！<br>眼下之计，唯有与哥哥共进退！<br>人家才不是茯苓花雕猪呢！<br><br><b>【遗珠】</b><br>小女身世坎坷，且听细细道来！<br>君王死社稷，儿女殉江山！<br><br><b>【阵亡】</b><br>好哥哥，我先睡了……<br><br><br><br>');
    createIntroAndTaici('ldj_fangyi', '方怡是明朝沐王府中四大家将中方氏后人，同沐王府群豪假扮吴三桂部下到宫中行刺，企图嫁祸给吴三桂，借皇权之手斩除国贼，是一个赤胆忠心的女中豪杰。她是小郡主沐剑屏的师姊，后来成为小宝七个老婆之一。开始她不把韦小宝放在眼里，直到韦小宝救下了刘一舟等人，才对他另眼相看。', '大熊小猫', '落影逝尘', '谢声繁', '<b>【诿罪】</b><br>不诛吴贼，国仇难平！<br>此番铤而走险，必报国仇家恨！<br><br><b>【忠继】</b><br>轻身为国，死亦无怨！<br>以吾血肉之躯，复我大明河山！<br><br><b>【阵亡】</b><br>愿得来世，山河无恙……<br><br><br><br>');
    createIntroAndTaici('qtpz_weixiaobao', '随母韦春花在扬州青楼丽春院长大，其生性嗜赌，油腔滑调。一次偶然事件，被江洋大盗茅十八带到北京，偶入皇宫，凭借三寸不烂之舌，屡次化险为夷，并在尔虞我诈的皇宫里平步青云，结识康熙帝，擒杀鳌拜，入天地会，奉命在五台山出家，平神龙岛，帮助索菲亚公主夺权，取得七位娇妻。', '大熊小猫', '落影逝尘', '神齐大叔', '<b>【押宝】</b><br>买定离手，听天由命！<br>小赌怡情，大赌伤身。<br><br><b>【巧舌】</b><br>大家好兄弟，讲义气！<br>三寸巧舌行天下，左右逢源登高堂。<br><br><b>【阵亡】</b><br>海老乌龟阴狠毒辣，这次死定了……<br><br><br><br>');
    createIntroAndTaici('qtpz_suquan', '苏荃，金庸小说《鹿鼎记》中人物，原为神龙教教主洪安通之妻，神龙教覆灭后，苏荃成为韦小宝七位夫人之一。原著描写中，苏荃容貌极美，艳丽无匹，武功高强，其人物原型是出自《西游记》中乱石山碧波潭龙宫的龙女万圣公主，她最后嫁给了韦小宝的故事，是从万圣公主招了驸马九头鸟的故事转化发展而来的，她派人偷盗佛经的故事，是从万圣公主偷盗九叶灵芝草的故事转化发展而来的。', '大熊小猫', '落影逝尘', '大绿_Midori酱', '<b>【正纲】</b><br>君为臣纲，夫为妻纲，有谁不服！<br>长幼有序，妻妾有别！<br><br><b>【移情】</b><br>昔年扬州误白龙，横陈燕翔锁情终！<br>可笑九尺鬓眉苍，何妄梨树压海棠！<br><br><b>【阵亡】</b><br>嫁鸡随鸡，夫唱妇随……<br><br><br><br>');
    createIntroAndTaici('qtpz_aobai', '《鹿鼎记》中的反派。鳌拜为清初权臣，出身瓜尔佳氏，后金开国五大臣之一费英东之侄，清朝三代元勋，康熙帝早年辅政大臣之一。以战功封公爵。前半生军功赫赫，号称满洲第一勇士，晚年则操握权柄、结党营私。小说《鹿鼎记》中，康熙在韦小宝等大臣的支持下和谋划下，在武英殿擒拿鳌拜。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【摄政】</b><br>一国之君，怎能妇人之仁！<br>为祸朝纲者，当处以极刑！<br><br><b>【营私】</b><br>权利的欲望，谁不迷恋？<br>翻手为云，覆手为雨！<br><br><b>【阵亡】</b><br>悔不该目中无人……<br><br><br><br>');
    createIntroAndTaici('qtpz_haidafu', '《鹿鼎记》中最早出场的反派。海大富是一名弓腰陀背、病体沉疴但老谋深算的老太监，充满灰暗的霉味，代表皇室中不可告人的丑恶。因练功急于求成而需每日服用毒药续命。善使能瞬间将尸体变成一滩血水的化尸粉。受顺治密令在宫中查找害死董鄂妃的凶手，夜访慈宁宫与冒牌太后当面对峙，出言激烈迫使她露出真面目。', '大熊小猫', '落影逝尘', '觅阳', '<b>【嗜毒】</b><br>病体沉疴，饮鸩止渴！<br>彼之砒霜，吾之蜜糖！<br><br><b>【愤激】</b><br>你我皆非善类，何不撕下面具？<br>你终于露出狐狸尾巴了！<br><br><b>【化尸】</b><br>就让你带着这秘密，永远消失吧！<br>怪只怪你，知道太多！<br><br><b>【阵亡】</b><br>老奴不才，未能手刃先帝仇人……<br><br><br><br>');
    createIntroAndTaici('qtpz_zengrou', '曾柔是前明遗留反清力量王屋派的弟子。脸蛋微圆，柔美可人。曾柔心思细密，她与同门行刺韦小宝失手被擒，韦小宝起初看在她美貌分上，掷骰子作弊饶了她们，她心怀感激，一直把这副灌铅骰子带在身上，作为留念，与韦小宝属于一见钟情。最后成为韦小宝的七位夫人之一。', '大熊小猫', '落影逝尘', '卿九', '<b>【掷骰】</b><br>两粒骰子，一片痴心！<br>愿君多采撷，此物最相思！<br><br><b>【赌注】</b><br>小宝，我的终身幸福，就托付给你了！<br>我知道，他一定会回来娶我的！<br><br><b>【阵亡】</b><br>望穿秋水，小宝，你在哪里……<br><br><br><br>');
    createIntroAndTaici('qtpz_hongantong', '洪安通是神龙教的教主，苏荃之夫，是江湖中数一数二的高手。洪安通野心勃勃，意图夺取《四十二章经》称雄天下，还曾与盘踞雅克萨的沙俄军官勾结。喜欢听教徒的奉承，要教徒参见他祝他仙福永享，寿与天齐。喜欢用“豹胎易筋丸”来控制教众，初服者觉得体力变得强健，但慢慢会经脉逆转，生不如死。', '大熊小猫', '落影逝尘', '林三', '<b>【豹胆】</b><br>别想跟我耍花样！<br>不想死，就乖乖听老夫的吩咐！<br><br><b>【傲尊】</b><br>仙福永享，寿与天齐！<br>这宝座，只属于老夫一人！<br><br><b>【阵亡】</b><br>你们为什么，都要反我……<br><br><br><br>');
    createIntroAndTaici('qtpz_maodongzhu', '毛东珠是神龙教安排在清廷后宫的一名下属，其潜伏于后宫多年，先后害死孝康皇后、荣亲王、端敬皇后等人并囚禁真太后。擅长使用化骨绵掌，被此掌击中的人开始浑如不觉，两个时辰后掌力发作，全身骨骼奇软如绵，处处寸断，脏腑破裂，惨不堪言。败露之后意欲出宫，被归辛树夫妇击杀。', '大熊小猫', '落影逝尘', '徐安', '<b>【乱闱】</b><br>区区太监，也敢妄议朝政！<br>不交出《四十二章经》，本宫要你人头落地！<br><br><b>【化骨】</b><br>喝了这杯，好赴黄泉！<br>你已命在须臾，倾刻粉身碎骨！<br><br><b>【阵亡】</b><br>潜伏数载，终究劫数难逃……<br><br><br><br>');
    createIntroAndTaici('qtpz_shuanger', '双儿是浙江湖州南浔人。为人重情重义，善解人意，体贴贤惠，诚实不欺，胸无城府而又忠肝义胆。自小和在丽春院长大的韦小宝互相照顾，一起出生入死，虽然她总当自己是个丫头，韦小宝对她却颇为尊重。每当韦小宝遇到危难，双儿总是奋不顾身地相救。', '大熊小猫', '落影逝尘', '地鼠', '<b>【伉俪】</b><br>我们生要一起生，死要一起死！<br>能一辈子侍奉小宝，是双儿最大的福分！<br><br><b>【相夫】</b><br>小宝，别怕，我来救你了！<br>双儿此生，只真心对待小宝一人！<br><br><b>【阵亡】</b><br>小宝，我们来世还要在一起……<br><br><br><br>');
    createIntroAndTaici('qtpz_sangjielama', '桑结是《鹿鼎记》中的角色，其原型是徳斯·桑结嘉措。桑结是西藏密宗的第一高手，大手印神功已练到登峰造极的境界。其多次派遣座下弟子混迹中原武林，目的是为了得到《四十二章经》。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【大印】</b><br>象躯撼地千潮退，龙吟啸天慑群雄！<br>胎藏天授，大日如来！<br><br><b>【密宗】</b><br>览密宗六法，嗔金刚之怒！<br>金刚怒目，轮转光明！<br><br><b>【阵亡】</b><br>狗皇帝！你……背信弃义……<br><br><br><br>');
    createIntroAndTaici('qtpz_wusangui', '明崇祯时吴三桂为辽东总兵，封平西伯，镇守山海关。崇祯十七年吴三桂降清，在山海关大战中大败李自成，封平西王。顺治十六年，吴三桂镇守云南，引兵入缅甸，迫缅甸王交出南明永历帝。康熙元年晋封为平西亲王，与耿精忠、尚可喜并称三藩。康熙十二年，下令撤藩，三藩之乱结束。', '大熊小猫', '落影逝尘', '黑兔', '<b>【献关】</b><br>李贼欺我太甚，唯有向睿亲王求救！<br>意气冲冠为红颜，从此不计身后名！<br><br><b>【藩乱】</b><br>唯今之计，只有占地为王！<br>男人大丈夫，怎可久居人臣？<br><br><b>【阵亡】</b><br>时不予我，时不予我啊……<br><br><br><br>');
    createIntroAndTaici('qtpz_weihutou', '韦虎头是韦小宝与阿珂之子，着墨不多。清廷平定三藩之后，康熙论功行赏，以二等通吃伯韦小宝举荐大将，建立殊勋，甚可嘉尚，特晋爵为一等通吃伯，荫长子韦虎头为云骑尉。后韦小宝保荐施琅而立此大功，特此升韦小宝为二等通吃侯，加太子太保衔，长子韦虎头荫一等轻车都尉。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【蒙童】</b><br>稚儿无知，莫怪，莫怪！<br>童言无忌，童言无忌！<br><br><b>【父荫】</b><br>平步青云，全仗父辈光芒！<br>皇天后土，赐我日月星辰！<br><br><b>【阵亡】</b><br>王侯将相，宁有种乎？');
    createIntroAndTaici('ldj_nanhuairentangruowang', '南怀仁和汤若望是金庸小说《鹿鼎记》中出场的角色。两人是清朝来华传教士，均在中国任过官员。南怀仁是天文学家，他设计的神威将军炮、神功军炮等被选入清代国家典籍《钦定大清会典》。他对清代火炮技术发展的另一重大贡献，是对火炮的准炮之法进行了系统研究，并写成专著《神威图说》等著论。汤若望著有《时宪历》和《火攻挈要》。', '吃饱睡睡醒吃', '霸天', '末生', '<b>【传道】</b><br>故尔三圣为一，坤舆宇内无二圣矣!<br>信我天主，当得救赎！<br><br><b>【镜学】</b><br>琉璃之透者，缘薄而聚，中洼而散。<br>质异者，光越而弯折；镜平者，则光反而射之。<br><br><b>【巨炮】</b><br>火炮之术未见繁杂，唯以钢铁为要！<br>巨炮击发，天崩地裂！<br><br><br><b>【死亡】</b><br>虽病老远东，亦无愧于我主……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_xuanye', '《鹿鼎记》男二号。少年康熙在练功房与假扮成小桂子的韦小宝相识而结为兄弟，对聪明机灵、单纯忠诚的小宝颇为信任和重用。康熙早期的劲敌为尚可喜、耿精忠和吴三桂这三大强藩，企图对当时的清朝分廷而治。知勇双全的康熙招降尚耿二藩之后，给予吴三桂重创；后收复宝岛台湾，创下“康乾盛世”。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【镇藩】</b><br>蝼蚁之患，不可放任！<br>三藩作乱，窃国之辈也！<br><br><b>【复疆】</b><br>尔等尽可戴罪立功。<br>宝岛台湾，终归我大清版图。<br><br><b>【盛世】</b><br>朱栏画栋最高楼，海色天容万象收！<br>战马初闲甲士欢，挥戈早已破楼兰！<br><br><b>【阵亡】</b><br>我真的还想再活五百年……<br><br><br><br>');
    createIntroAndTaici('qtpz_chenjinnan', '陈近南以玄天上帝信仰为掩护，成立秘密组织天地会。该会异姓结盟，拜天为父，拜地为母，从事反清复明的行动，成为让清廷头痛不已的秘密社会势力。小说中的陈近南身怀绝技凝血神爪，伤人之后可令人在 三天内血液慢慢凝固而后死去。为人忠厚任恕，即使一直效忠的郑家一直猜忌他甚至想杀了他，仍愚忠到底。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【凝血】</b><br>你已时日不多，可有临终遗言？<br>看你还怎么为害武林！<br><br><b>【忠恕】</b><br>小宝，我陈家世代效忠，切不可向郑家寻仇！<br>反清大业当前，怎可拘泥个人恩怨？<br><br><b>【阵亡】</b><br>勿忘复明大计……<br><br><br><br>');
    createIntroAndTaici('qtpz_jianninggongzhu', '康熙的妹妹，其实身世可怜，母亲为神龙教潜入宫中卧底成为冒牌皇太后的毛东珠，生父不明。韦小宝的七位夫人之一，刁蛮泼辣、胆大妄为。虽贵为金枝玉叶却心理极为变态，施虐狂兼受虐狂，常常暴打韦小宝一顿转瞬间就跪在地上大叫“桂贝勒”。后康熙欲将其赐婚给吴三桂之子吴应熊，途中却和小宝厮混怀孕。', '大熊小猫', '落影逝尘', '泥泥', '<b>【欲孽】</b><br>桂贝勒，你打得人家好舒服唷！<br>打是亲，骂是爱，男人越坏我越爱！<br><br><b>【违诏】</b><br>好哥哥，你带人家私奔好不好嘛？<br>吴狗熊已是阉奴，本公主岂能下嫁？<br><br><b>【阵亡】</b><br>爵爷鞭下死，做鬼也快活……<br><br><br><br>');
    createIntroAndTaici('qtpz_fengjizhong', '风际中是《鹿鼎记》中的人物，是天地会青木堂的成员，在会中绝不起眼，给人留不下什么深刻印象。但是老实人要骗人最可怕，此人沉默寡言，一副老实模样，木头木脑的，但谁也不会想到，他竟然是康熙安排在天地会中的卧底，专门收集并通报会中的大小秘密。最后被双儿用火枪击杀。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【谍报】</b><br>小人有要情禀报，望将军引见！<br>天地会狡兔三窟，皇上须多加防范！<br><br><b>【机变】</b><br>不如归顺清廷，尽享荣华富贵！<br>国泰民安，谁当皇帝，又有何区别？<br><br><b>【阵亡】</b><br>聪明反被聪明误啊……<br><br><br><br>');
    //其他篇章
    createIntroAndTaici('qtpz_axiu', '阿绣是金庸《侠客行》中的女主角。容貌清丽，温柔善良，斯文有礼，是石破天的恋人。阿绣是个好姑娘，一出场其温柔文雅，她最特别的地方，是全书中只有她一个人从来没有错认石破天为石中玉，她全凭直觉，一眼便知。她和石破天两个是彻头彻尾的良善人物，毫无私心、纯洁无比，两个都教人喜爱，是天造地设的一对。曾使金乌刀法的招式给石破天学习。石破天不通世故，未免要阿绣提点，比方怎样以“旁敲侧击”招数，乱人耳目，让对手挽回颜面。', '大熊小猫', '霸天', '安生', '<b>【隽秀】</b><br>蒹葭]苍苍，白露为霜。所谓伊人，在水一方。<br>脉脉眼中波，盈盈花盛处。<br>垆边人似月，皓腕凝霜雪。<br>淡眉如秋水，玉肌伴轻风！<br><br><b>【旁敲】</b><br>大粽子哥哥，此招甚好，不偏不倚！<br>奶奶，这套金乌刀法奥妙无穷，教给大粽子罢！<br>横推左掠，右刺反砍，下斫抱刀，看好啦！<br>此招谓之旁敲侧击，当气随刀走！<br><br><br><br><b>【死亡】</b><br>大哥，阿绣……不能再陪伴你左右了……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_jue_shipotian', '石破天是金庸小说《侠客行》中的男主角，原本为一个小乞丐，但为人却忠厚老实，性情温和，天赋极高，记性极好，精通炎炎功、罗汉伏魔神功、金乌刀法等上等武学。误入长乐帮之后，在贝海石的欺骗下，误打误撞参透侠客岛上惊天动地的武功秘诀《太玄经》图谱，成为一名绝世高手。', '大熊小猫', '棉花糖', '大熊', '<b>【太玄】</b><br>赵客缦胡缨，吴钩霜雪明。<br>银鞍照白马，飒沓[sà tà]如流星！<br>事了]拂衣去，深藏身与名。<br>谁能书阁下，白首太玄经。<br><br><b>【炎炎】</b><br>习此神功，如寒冬卧冰，盛夏吻火！<br>冰火同源本无间，阴阳调和万物生！<br><br><b>【玄酒】</b><br>二位哥哥，小弟不堪酒力，莫再劝饮！<br>玄冰碧火酒，冰火两重天！<br><br><br><b>【死亡】</b><br>生从命子游，死闻侠骨香……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_qichangfa', '戚长发是金庸《连城诀》中的角色，武林名宿铁骨墨萼梅念笙的三徒弟，绰号“铁索横江”，意思是武功了得，善于守御，敌人攻不进他门户;而事实上的意思是戚长发机敏多谋，厉害之极，只要是谁惹上了他，他一定挖空心思的报复，叫人好似一艘船在江心涡漩中乱转，上也上不得，下也下不得。为人阴险歹毒，城府极深，为了连城诀伙同师兄击杀师父，最后死于涂满剧毒的珠宝之上。', '大熊小猫', '霸天', 'MU', '<b>【横江】</b><br>铁锁横江，进退维谷！<br>叫你上也上不得，下也下不得！<br><br><b>【绝路】</b><br>诈亡蛰伏，寻访秘宝。<br>离此死地，必有生机。<br><br><b>【欺师】</b><br>交出连城剑诀，我便留你全尸！<br>哼，剑诀之秘，你说，还是不说？<br><br><br><b>【死亡】</b><br>这笔财宝…我绝不会和任何人…分享……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_shizhongyu', '石中玉是金庸小说《侠客行》中的角色，石清与闵柔之子、石破天胞兄。师从雪山派，相貌酷似石破天，性格人品却是云泥之别。石中玉十八九岁已经坏透，花花公子、贪生怕死、好色嫖妓、逼奸侍婢、甚至意图侵犯年纪尚幼的小师妹。还曾设计让石破天替他到侠客岛赴死。造就他的这个性格其父母有不可推卸的责任。', '大熊小猫', '棉花糖', '彻君', '<b>【狎乱】</b><br>美人若如斯，何不早入怀？哈哈哈哈……<br>阿绣妹妹，你我颠鸾倒凤，岂不美哉？<br><br><b>【诡谋】</b><br>瞒神弄鬼，抽身而退！<br>瞒天过海，偷梁换柱！<br><br><b>【瞒天】</b><br>替本公子赴死，是你与生俱来的使命！<br>不惧飞来祸，自有替罪羊，哼哼！<br><br><br><b>【死亡】</b><br>爹爹妈妈，救我，救救我……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_tangpei', '汤沛是金庸小说《飞狐外传》中的人物，绰号“甘霖惠七省”，三才剑掌门人。汤沛武功高强，内力修为颇深，虽然满口仁义道德，实则满肚子男盗女娼，其行为极为龌龊肮脏，正是此位“正人君子大英雄”逼死了袁紫衣的母亲袁银姑。在天下掌门人大会上用脚发暗器银针射伤多位掌门，后来他的恶劣行径遭到袁紫衣曝光，令众人切齿，最后死于袁紫衣之手。', '大熊小猫', '霸天', '末生', '<b>【施惠】</b><br>施小恩小惠，笼人脉人心！<br>甘霖惠七省，盛名满江湖！<br><br><b>【钓誉】</b><br>行惠施利，誉名远播！<br>施以薄恩，以策群心！<br><br><br><br><b>【死亡】</b><br>一朝计破，臭名昭彰……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_jue_yuanchonghuan', '袁崇焕是明朝蓟辽督师，曾誓言五年复辽，主张守为正着、战为奇着、款为旁着。崇祯二年冬，后金汗皇太极大举入塞，绕过袁崇焕在蓟州的防线﹐直逼北京城下，是为己巳之变。袁崇焕在北京广渠门﹑左安门击退后金军，随后被崇祯帝逮捕下狱。崇祯三年八月，因受到皇太极所设的反间计，崇祯帝以谋反大逆罪将袁崇焕凌迟处死。', '大熊小猫', '霸天', '前轮', '<b>【遣兵】</b><br>养兵千日，用兵一时！<br>威弑北狄，固守辽东！<br>擎天一柱，屡立奇功！<br>一生从戎无败绩，半世功名在梦中！<br><br><b>【碧血】</b><br>慷慨同仇日，间关百战时！<br>策杖只因图雪耻，横戈原不为封侯！<br><br><b>【忠魂】</b><br>荣华我已知庄梦，忠愤人将谓杞忧。<br>死后不愁无勇将，忠魂依旧守辽东。<br><br><br><b>【死亡】</b><br>片云孤月应肠断，桩树凋零又—秋……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_xinyan', '心砚是作家金庸小说《书剑恩仇录》、《飞狐外传》中的人物。心砚曾是书中主人公陈家洛的书童，约摸十五六岁，跟随陈家洛出生入死、谋划反清复明大业。后在被困于沙漠时正式加入红花会，为红花会十五当家。', '大熊小猫', '霸天', '安生', '<b>【书僮】</b><br>文房四宝在此，请少爷题诗，以寄哀思！<br>笔墨纸砚齐备，舵主当提笔修书，以策乾隆！<br><br><b>【暗哨】</b><br>清军有异动，请总舵主速作决策！<br>此哨为号，乾隆若有异心，舵主当速速撤退！<br><br><br><br><b>【死亡】</b><br>复明大业，业已杳然……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_fengtiannan', '凤天南是金庸小说《飞狐外传》中的人物，五虎门掌门人，臂力甚强，是广东佛山的恶霸，素来横行霸道，鱼肉百姓，为霸占钟家菜田陷害钟阿四一家偷吃自家的大鹅，迫使钟阿四剖儿腹以明冤。胡斐几欲除暴安良却屡遭袁紫衣阻拦，使凤天南父子逍遥法外。后死于汤沛之手。', '大熊小猫', '霸天', '佚名', '<b>【霸邻】</b><br>要在佛山容身，须当如期纳税！<br>这五百两，就当是你的保护费！<br><br><b>【豪夺】</b><br>钟家逆子偷食家鹅，当以田地抵偿！<br>雁过拔毛，兽走留皮，哈哈哈哈……<br><br><br><br><b>【死亡】</b><br>不该欺邻霸里，落得恶报缠身……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_dingbusandingbusi', '丁不三、丁不四是《侠客行》中的人物。六合人氏。丁不三早年因杀人太多，后来自己定下规矩，一日之内杀人不能超过三个，故江湖人称一日不过三。见石破天内力深厚，觉得石破天行事举止大不合常理，视之为白痴，非要杀了石破天不可。丁不四是丁不三的弟弟，在江湖上绰号叫一日不过四。丁不四无论在情场还是武功上都是凌霄城白自在的手下败将，曾经和史婆婆曾有一段感情纠葛。', '大熊小猫', '棉花糖', '末生', '<b>【杀道】</b><br>杀人亦有道，一日不过三！<br>该杀就得杀，一日不过四！<br><br><b>【诡谲】</b><br>我言天下多蠢辈，猪牛狗马遍地行。<br>犯我其行罪当死，天下无人不可杀！<br>丁家兄弟的心思，天下谁人能猜到？<br><br><b>【阵亡】</b><br>小子，这次算爷爷手下留情，下次……<br><br><br><br>');
    createIntroAndTaici('qtpz_wanzhenshan', '《连城诀》中的人物，是武林名宿梅念笙的三徒之一，排行老大，绰号五云手。他与两位师弟为了获取《连城诀》而合谋击杀师傅。后因与戚长发发生摩擦，唯恐戚长发会将连城诀的秘密告诉戚芳，便将戚长发击杀并砌在墙中。戚长发死里逃生活了下来，但万震山因此落下疑心病，惶惶不可终日。', '大熊小猫', '霸天', '冰霜墨菊', '<b>【封葬】</b><br>只有死人，才能守口如瓶！<br>你，就永远的陪着我吧，哈哈哈……<br>这，是我为你准备的坟墓！<br>明年的今天，便是你的忌日！<br><br><b>【弑师】</b><br>交出连城诀，免受这千刀万剐之痛！<br>老东西，你别敬酒不吃吃罚酒！<br><br><b>【阵亡】</b><br>我这是，自掘坟墓么……');
    createIntroAndTaici('qtpz_xie_hetieshou', '何铁手是金庸武侠小说《碧血剑》中的重要角色，《鹿鼎记》中也有出场。擅长使用各种毒药、饲养各种毒虫。何铁手样貌千娇百媚，艳若桃李，因练功割断一只手掌装上一枚铁钩而得名。原为五毒教教主，后拜袁承志为师投华山门下，改名为何惕守，有警惕别做坏事，严守规矩，正正派派之意。至《鹿鼎记》时曾出现赠送暗器含沙射影给韦小宝。何铁手情路坎坷而终身未婚。', '大熊小猫', '霸天', '鲨鲨', '<b>【五毒】</b><br>织心擅用冰蚕纺，天赐苗疆醉舞棠！<br>万蛊噬心，驭虫有术；千蝶吐瑞，妙手织天！<br>杯弓照影，碧蛇惊神！<br>梦枕千戚，魂返苗疆！<br>红尘一梦，化蝶迷踪！<br>玉宫心冷蟾啸月，闻音栖林动羌笛。<br>冰蚕絮牵毒倾城，不惑众生惑君生！<br>人间无门，惑起苗疆；黄泉有路，遗鼎大荒。<br>圣兽灵心归毒海，仙踪遗秘问奇缘。<br><br><b>【蜈钩】</b><br>蜈钩有毒，袁相公，可别空手来夺呀！<br>金钩穿魂、铁钩夺命！<br><br><br><br><b>【死亡】</b><br>纵有千丝百足，何及人心可怖……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_murenqing', '穆人清是金庸武侠小说《碧血剑》中的人物，华山派掌门，外号“神剑仙猿”，性格古怪，武功出神入化，二十余年未逢对手。剑法、拳术举世无双，在江湖中行侠仗义，却不留姓名。穆人清有三名弟子，分别是铜笔铁算盘黄真、神拳无敌归辛树以及在晚年收的袁崇焕之子袁承志。此外，穆人清与“铁剑门”掌门木桑道长是生死之交。', '大熊小猫', '霸天', '狗子', '<b>【荡剑】</b><br>鲸饮未吞海，剑气已横秋！<br>荡剑逐奸邪，飞来第一峰！<br><br><b>【仙猿】</b><br>流波激清响，仙猿临岸啼！<br>西岳天下险，小径寻山公！<br><br><b>【阵亡】</b><br>仙人今已故，老猿自同游……<br><br><br><br>');
    createIntroAndTaici('qtpz_yuanchengzhiwenqingqing', '袁承志是明末将领袁崇焕之子，拜华山派穆人清为师，后在金蛇郎君夏雪宜的金蛇秘笈中学得一身惊人的武功。下山后，他行侠仗义，结识红颜知己温青青，并在七省豪杰的支持下成为武林盟主，协助闯王起义并帮助闯军攻破明王朝首都北京。后李自成入京，袁承志眼见闯军腐化，义兄李岩惨死，因而与青青等人隐居海外。', '大熊小猫', '霸天', '谢声繁', '<b>【蛇行】</b><br>蜿蜒而行，迂回击寇！<br>灵蛇吐信，剑耀寒锋！<br><br><b>【燕妒】</b><br>你这招蜂引蝶的公子哥，还理我做甚？<br>莺莺燕燕身边绕，承志哥哥好福气呀！<br><br><b>【阵亡】</b><br>承志哥哥，我……错怪你了……<br><br><br><br>');
    createIntroAndTaici('qtpz_hehongyao', '何红药是金庸《碧血剑》中的痴情女子，五毒教主何铁手的姑姑。年轻时帮助心上人夏雪宜复仇盗取五毒教宝物金蛇剑和金蛇锥，却遭遇背叛和抛弃，并且受到教规惩罚，原本美艳不可方物的她容颜俱毁，自此神情大变。后找到夏雪宜遗骨，但中了他身前布下的机关而与之同归于尽。', '大熊小猫', '落影逝尘', '遂非', '<b>【自盗】</b><br>世间女子多情痴，千瘢万痕亦无悔！<br>毒侵脏腑芳容毁，他日雪恨念君归！<br><br><b>【怨毒】</b><br>只见新人笑，哪闻旧人哭！<br>霜结两鬓空念远，雪染青丝恨难填！<br><br><b>【阵亡】</b><br>念桥边红药，年年知为谁生……<br><br><br><br>');
    createIntroAndTaici('qtpz_hehongyao', '何红药是金庸《碧血剑》中的痴情女子，五毒教主何铁手的姑姑。年轻时帮助心上人夏雪宜复仇盗取五毒教宝物金蛇剑和金蛇锥，却遭遇背叛和抛弃，并且受到教规惩罚，原本美艳不可方物的她容颜俱毁，自此神情大变。后找到夏雪宜遗骨，但中了他身前布下的机关而与之同归于尽。', '大熊小猫', '落影逝尘', '遂非', '<b>【自盗】</b><br>世间女子多情痴，千瘢万痕亦无悔！<br>毒侵脏腑芳容毁，他日雪恨念君归！<br><br><b>【怨毒】</b><br>只见新人笑，哪闻旧人哭！<br>霜结两鬓空念远，雪染青丝恨难填！<br><br><b>【阵亡】</b><br>念桥边红药，年年知为谁生……<br><br><br><br>');
    createIntroAndTaici('qtpz_goujian', '勾践是春秋时期越国大王，与吴国交战时兵败被围于会稽山。勾践一面准备死战，一面派假意求和，献上美女西施使夫差沉迷酒色。勾践到吴国给夫差作奴仆，骗得夫差的信任，被释放回越国，勾践从此发誓要发奋图强，卧薪尝胆，最终以三千越甲灭掉吴国。', '大熊小猫', '落影逝尘', '狗子', '<b>【韬晦】</b><br>韬晦之计，藏锋守拙！<br> 卧薪尝胆，忍辱负重！<br>君子藏器，待时而动！<br> 知耻而后勇，知弱而图强！<br><br><b>【兴国】</b><br>天时地利兼备，伐吴之战必胜！<br>国之复兴，势不可挡！<br><br><b>【精甲】</b><br>天降神兵，必吞吴土！<br>精兵锐甲，所向披靡！<br>越甲三千，可破万军！<br><br><b>【阵亡】</b><br>复国之路修远兮……<br><br><br><br>');
    createIntroAndTaici('qtpz_zhaobanshan', '赵半山是《书剑恩仇录》的人物，红花会三当家，太极门弟子，其胖胖的身形配合太极拳法的柔劲，能以柔克刚，出奇制胜。赵半山以独门暗器飞燕银梭、飞蝗石、袖箭、铁莲子等纵横江湖，连珠不绝，人称之为“千臂如来”，和陆菲青是好友。其为人豪爽，又慈爱又威风，交友遍布天下。', '大熊小猫', '落影逝尘', '狗子', '<b>【飞梭】</b><br>飞燕银梭，巧器破敌！<br>飞梭万里，以敌制敌！<br><br><b>【柔道】</b><br>太极拳法，以弱胜强！<br>刚柔相济，运化无方！<br>形如搏兔之鹤，神似猎鼠之猫！<br>始而意动，继而劲动！<br><br><b>【阵亡】</b><br>反清复明，前赴后继……<br><br><br><br>');
    createIntroAndTaici('qtpz_hongli', '弘历在小说《书剑恩仇录》中被设定为反清组织红花会总舵主陈家洛的胞兄，陈家洛得知真相后改变战略，与其谈判，企图说服弘历跟红花会里应外合，瓦解满清势力，回复汉人江山。但强势的圣孝宪皇后以废除帝位为要协迫使弘历铲除红花会。斡旋于两大势力之间的他苦恼不已，最终狠下决心重创红花会。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【斡旋】</b><br>强权干政，逆贼举兵，朕该何处问计？<br>攘外安内，势均力敌！<br><br><b>【掣肘】</b><br>天子脚下，岂容反贼横行？<br>摄服乱党，可赏良田千亩！<br><br><b>【天尊】</b><br>御前侍卫何在？<br>白护卫护驾有功，择日再行重赏！<br><br><b>【阵亡】</b><br>自古忠义难两全……<br><br><br><br>');
    createIntroAndTaici('qtpz_lizicheng', '明朝末年社会动荡，苛捐杂税使得百姓民不聊生，已是摇摇欲坠之态李自成在高迎祥死后继任闯王，在众多良将的协助之下率领起义军犹如破之势，直取京都，并提出了均田免赋的口号，给生活在水深火热中的明朝百姓带来了一线希望，吃闯王穿闯王、闯王来了不纳粮的歌谣流传京都。', '大熊小猫', '落影逝尘', '白', '<b>【募兵】</b><br>招兵买马，组建义军！<br>大明苛捐杂税，可谓自取灭亡！<br><br><b>【举义】</b><br>哪里有压迫，哪里就有反抗！<br>改朝换代的时候到了！<br><br><b>【远征】</b><br>百万雄师，直取京都！<br>顺势而为，一统天下！<br><br><b>【均田】</b><br>均田免赋，国泰民安！<br>民以食为天！<br><br><b>【阵亡】</b><br>天要亡我！非战之罪……<br><br><br><br>');
    createIntroAndTaici('qtpz_xishi', '西施是《越女剑》中的角色，越王勾践对吴国战争失利后，采纳文种的美人计，寻得西施教以歌舞礼仪，使范蠡献于吴王夫差。夫差大悦，筑姑苏台，置其于椒花之房，沉溺酒色，荒于国政。传说西施曾于溪边浣纱，连鱼儿见到她的容颜都羞愧得沉到水底。', '大熊小猫', '落影逝尘', '卿九', '<b>【祸心】</b><br>大王连日征战，让妾身为您宽衣！<br>大王，来……喝嘛！<br><br><b>【沉鱼】</b><br>曾忆河边浣溪纱，鱼见惊之沉荷花。<br>为国轻付倾城笑，真心犹在忆中人！<br><br><b>【阵亡】</b><br>少伯，你终于…来接我了……<br><br><br><br>');
    createIntroAndTaici('qtpz_fanli', '范蠡是春秋末期著名军事家、经济学家，为匡扶越王勾践复国，说服剑术高手阿青前来训兵，又采纳文种的计策交心爱之人西施献与吴王夫差，以美色迷其心神，致其荒废国事。范蠡是中国早期商业理论家，被称为商圣。世人誉之：“忠以为国、智以保身、商以致富、成名天下。”', '寰宇星城', '落影逝尘', '小林', '<b>【哀兵】</b><br>赳赳武夫，誓破吴都！<br>苦心人，天不负；有志者，必吞吴！<br><br><b>【商圣】</b><br>知斗则修备，时用则知物！<br>贵出如粪土，贱取如珠玉！<br><br><b>【阵亡】</b><br>夷光，让你受委屈了……<br><br><br><br>');
    createIntroAndTaici('qtpz_weizhongxian', '魏忠贤是明朝末期宦官，明熹宗时期出任司礼秉笔太监，极受宠信，被称为“九千九百岁”。在官期间排除异己、独揽朝政，以致人们只知有忠贤而不知有皇上。朱由检继位后，打击惩治阉党，治魏忠贤十大罪，命逮捕法办，自缢而亡，其余党亦被肃清。', '大熊小猫', '落影逝尘', '白夜', '<b>【结党】</b><br>覆手罩金銮，东林鸟兽散！<br>咱家这几车薄礼，诸位大人，收，还是不收？<br>尔等皆股肱之臣，岂能不识时务？<br><br><b>【擅政】</b><br>区区小事，何需惊动圣驾？<br>军政要事，奴才定当竭忠尽智！<br><br><b>【阵亡】</b><br>紫袍玉带换鳏衣，悲饮四更无人提……<br><br><br><br>');
    createIntroAndTaici('qtpz_zhangsanlisi', '“赏善罚恶”二使张三及李四是侠客岛龙木岛主的弟子，每隔十年到中原邀请各大帮派掌门到侠客岛喝腊八粥，被江湖人士误以为是一件凶多吉少的事情。曾经让石破天饮下其“玄冰碧火酒”，若是寻常人早死肝肠寸断，因石破天内力深厚，不但没被毒死，反而内力精进因祸得福。', '大熊小猫', '霸天、藏海', '狗子', '<b>【赏惩】</b><br>善因结善果，恶行得恶报！<br>善恶之报，如影随形！<br>善恶若无报，乾坤必有私！<br>这赏善罚恶令，你接是不接？<br><br><b>【玄冰】</b><br>寒冰刺骨，魄散魂消！<br>风刀霜剑，怎及这玄冰丝毫！<br><br><b>【碧火】</b><br>凡火燎骨肉，碧火灼神魂！<br>毒酒销骨，烈焰焚心！<br><br><b>【阵亡】</b><br>恩怨是非，谁人辨……<br><br><br><br>');
    createIntroAndTaici('qtpz_shipotian', '石破天是《侠客行》的男主角，本为小乞丐，为人忠厚老实，天赋高、记性好，无意中得到玄铁令被谢烟客以错误的方式传授炎炎功，险些丧命。后来误打误撞被贝海石推举为长乐帮的帮主，并赴侠客岛参加龙木岛主的腊八粥宴，在岛上习得秘诀《太玄经》中的武功，从此成为难遇敌手的高手。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【赤炎】</b><br>饮下这玄冰碧火酒，甚是酣畅！<br>谢前辈，为何我仿佛烈火焚身？<br><br><b>【玄经】</b><br>这些小人变幻莫测，有趣有趣！<br>这蝌蚪文，其妙无穷！<br><br><b>【推盟】</b><br>前辈不必拘礼，折煞在下了！<br>我无名小卒，何德何能！<br><br><b>【阵亡】</b><br>知足常乐，随遇而安……<br><br><br><br>');
    createIntroAndTaici('qtpz_longmudaozhu', '龙岛主和木岛主是是侠客岛的两位岛主。江湖上每过十年，龙木两位岛主都会派赏善罚恶二使前往武林各大门派分发赏善罚恶令，邀请武林各大门派的掌门人前往侠客岛赴约品尝腊八粥，可去的人没有一个能够回来。以至于武林中人对侠客岛都十分忌惮，数十年来人心惶惶，生怕收到请帖。直到石破天来到神秘的侠客岛上，人们才揭开了侠客岛上的谜底，原来两位广邀武林豪杰前往，是为了一起领悟至高武学经书《太玄经》。', '大熊小猫', '霸天', '末生', '<b>【施粥】</b><br>奇药熬出粥一碗，断肠蚀骨又腐心！<br>善恶未敢称侠客，赏惩全在此粥中！<br><br><b>【切磋】</b><br>广邀天下才与智，以期堪破侠客行！<br>气如寒冰，血似激流！（气似烈焰，血如岩浆！）<br><br><br><b>【阵亡】</b><br>荒芜枯守四十载，白首方悟太玄经……<br><br><br><br>');
    createIntroAndTaici('qtpz_jyliyan', '李岩是李自成起义军的重要将领。原名李信，河南开封府杞县人，天启丁卯年举人，文武双全。其父李精白在魏忠贤逆案中被处罚。李岩生性慷慨豪爽，常常周济穷人，曾作了一首《劝赈歌》，望权贵救援水深火热中的黎民百姓。他在李自成起义中立下汗马功劳，忠心耿耿的他却被牛金星进谗惨被冤杀。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【劝赈】</b><br>朱门酒肉臭，路有冻死骨！<br>天下百姓水深火热，还望乡绅同僚慷慨解囊！<br><br><b>【鸿略】</b><br>依此良策，可保义军所向披靡！<br>醉里挑灯看剑，梦回吹角连营！<br><br><b>【阵亡】</b><br>大王为何，误信谗言……<br><br><br><br>');
    createIntroAndTaici('qtpz_aqing', '《越女剑》女主角。阿青是越国一名牧羊女，虽然弱质纤纤，却是金庸小说中武功和实战能力最强的人物之一。她从小与一只会使棒的白猿习武，悟得高超的剑法。范蠡在街上遇见她一人挫败八名吴国剑士，请她去训练越国战士，最后得到三千越甲可吞吴的成就。她爱上范蠡，却在容颜上输给了西施，黯然离去。', '大熊小猫', '朱阳光', '珂里', '<b>【厉兵】</b><br>厉兵秣马，横扫千军！<br>三千越甲可吞吴！<br><br><b>【束甲】</b><br>三千越甲，终成哀鸿一片！<br>千军万马又如何！<br><br><b>【阵亡】</b><br>她有倾世容颜，我何以得到范郎倾心……<br><br><br><br>');
    createIntroAndTaici('qtpz_zhuyoujian', '出场于《碧血剑》。朱由检是明朝的末代皇帝，虽然在位时勤于政务，但其刚愎自用，生性多疑，不能知人善任，屡屡革杀文臣武将，加上明末动荡的时代背景，亡国已是历史潮流。在位时曾六次发布罪己诏，深刻剖析自己的过失，于煤山自尽前亦写下自诏，要求闯军善待百姓。', '大熊小猫', '落影逝尘', '觅阳', '<b>【忧勤】</b><br>内忧外患，朕恨不能御驾亲征！<br>众卿家只知食君禄，却不曾担君忧！<br><br><b>【罪己】</b><br>大明将覆，怪朕错杀忠良！<br>崇祯无能，以致流寇四起，鞑子犯国！<br><br><b>【刚愎】</b><br>朕非亡国之君，臣皆亡国之臣！<br>百官误朕，个个该杀！<br><br><b>【阵亡】</b><br>为何朕，落得国破家亡……<br><br><br><br>');
    createIntroAndTaici('qtpz_wuzixu', '《越女剑》中出场。伍子胥本是春秋时期楚国人，因其家人受到谗臣陷害被楚平王杀害，悲愤之下投奔吴国，他在吴中之地相土尝水，象天法地，在太湖东岸的丘陵和平原之间建造了姑苏城。公元前五百零六年，他协同孙武带兵攻入楚都，伍子胥掘开楚平王陵墓，鞭尸三百，以报父兄之仇。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【筑城】</b><br>大兴土木，始建姑苏！<br>兴修城池，扬我国威！<br><br><b>【血状】</b><br>杀父诛兄之仇，永铭于心！<br>喋血之恨，岂能轻忘？<br><br><b>【阵亡】</b><br>吴王不听我谏言，必追悔莫及……<br><br><br><br>');
    createIntroAndTaici('qtpz_xuedaolaozhu', '《连城诀》中的第一反派。青海黑教血刀门第四代掌门人，武林第一邪派高手，门下都作和尚打扮却个个都是十恶不赦的淫僧。擅使用血刀经武功，刀法强悍。他强掳了水岱之女水笙，南四奇一路追杀他到藏边雪谷，与其进行了一场鏖战。其中三位先后战死，血刀老祖便将苟且便生的花铁干说降，令其弃械。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【悍刀】</b><br>击杀你，就像捏死一只蚂蚁，哈哈哈哈！<br>就用你们的鲜血，祭我的血刀！<br><br><b>【酣战】</b><br>今日一战，你们统统都会变成我的刀下亡魂！<br>在这雪谷之中，绝望地哀嚎吧！<br><br><b>【说降】</b><br>放下兵器，我便饶你不死！<br>跪下投降，可饶你狗命！<br><br><b>【阵亡】</b><br>竟死在这，无名小卒手里……<br><br><br><br>');
    createIntroAndTaici('qtpz_xie_xuedaolaozu', '血刀老祖是青海黑教“血刀门”第四代掌门人，使一柄血红缅刀，有着极其霸道之称号，化血神刀、血饮天下。刀法已至登峰造极之境，号称武林第一邪派高手。其绝学“血刀大法”怪异至极，每招都是在绝不可能的方位劈砍。内功极其诡异但也威力巨大，魔功大成之后表现为血影。', '大熊小猫', '霸天', '路边奇石', '<b>【邪尊】</b><br>天下至邪，无出其右！<br>天下多恶事，无我不敢为！<br><br><b>【血月】</b><br>血雨腥风天象惨，日月无光杀气升！<br>红月照地鬼门开，血洗人间魔星来！<br><br><b>【暗月】</b><br>月黑风高夜，杀人掠命时！<br><br><b>【弦月】</b><br>月华如利刃，杀尽正道人！<br><br><b>【残月】</b><br>碎镜映天天碎裂，残月照人人残缺！<br><br><b>【满月】</b><br>月满开杀戒，人头祭血刀！<br><br><b>【祭刀】</b><br>魔刀出鞘造杀劫，邪尊降世灭生灵！<br>向真正的血刀致意吧，这份恐惧，你们会刻在骨子里！<br><br><b>【阵亡】</b><br>我带给你的恐惧，会永远的伴随你，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('qtpz_yuyutong', '红花会十四当家，擅长吹笛，曾考上秀才而被称作金笛秀才。余鱼同英俊潇洒却偏偏痴恋人妻文四嫂而不可自拔，曾几度陷在这不伦之恋中痛不欲生。后来在官家子女李沅芷的死缠烂打下，逐渐解开心结，最终移情于李沅芷。曾为了四嫂骆冰深入龙潭虎穴解救文泰来，宁可自己身陷囹圄；更甘做人肉炸弹解救红花会众兄弟，自己却被炸毁容。', '大熊小猫', '落影逝尘', '失北', '<b>【慨赴】</b><br>知君命不偶，同病亦同忧！<br>士为知己者死！<br><br><b>【陷误】</b><br>鸳鸯有耦春蚕若，白马鞍边笑靥生。<br>痴心错付，悔人悔己！<br><br><b>【阵亡】</b><br>英雄气短，儿女情长……<br><br><br><br>');
    createIntroAndTaici('qtpz_miaorenfeng', '苗人凤是李自成手下苗防卫的后人，为人顶天立地、不苟言笑，苗家剑法炉火纯青，武功极高，号称打遍天下无敌手，人称金面佛。因受到田归农的挑拨与胡一刀比武决斗，在田归农的诡计下不慎击杀胡一刀，因而一生郁结难抒。最后终与胡斐化解了胡苗两家的恩怨。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【凤魄】</b><br>我苗人凤顶天立地，岂会与你这鼠辈为伍！<br>道不同，不相为谋！<br><br><b>【郁结】</b><br>年年焚香，也解不了我心中的悔恨！<br>若能与胡兄弟策马天涯……只可惜……<br><br><b>【阵亡】</b><br>胡兄弟，我下来向你赔罪了……<br><br><br><br>');
    createIntroAndTaici('qtpz_chenglingsu', '程灵素是药王谷无嗔大师的关门弟子，继承了毒手药王的遗作《药王神篇》，成功培育剧毒七心海棠，下毒功夫和解毒功夫都出神入化。她机智聪敏，料事如神。结识胡斐后，她暗恋胡斐，最后为救胡斐牺牲自己替他啜毒而死。临死前仍精心设计用七心海棠蜡烛击杀师门败类石万嗔等人。', '大熊小猫', '落影逝尘', '辣鸭', '<b>【植毒】</b><br>思念，是人世间最无药可解的毒！<br>灵药难治相思苦，海棠无心恋尘缘！<br><br><b>【芳魂】</b><br>你我都是可怜人，何不怜惜眼前人？<br>为了你，我可以献出我的生命！<br><br><b>【阵亡】</b><br>大哥，我死后，你还会记得我吗……<br><br><br><br>');
    createIntroAndTaici('qtpz_chengbenzhi', '程本直是青竹帮帮主程青竹之兄，布衣出身，因敬重袁崇焕，三次拜谒却不得，便投入袁督师部下，出力办事，终于得蒙督师见重，收为门生。后袁崇焕蒙蒙冤下狱，又遭凌迟毒刑。程本直不顾一切上书为袁公辩冤，只因言辞切直，被崇祯皇帝一同处死，死前要求葬于袁公墓旁，题铭：两条泼胆汉，一对痴心人。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【辩冤】</b><br>陛下冤杀袁公，微臣义不独活！<br>袁公之心，日月可鉴！<br><br><b>【同罪】</b><br>两条泼胆汉，一对痴心人！<br>臣甘受同诛之罪！<br><br><b>【阵亡】</b><br>人固有一死，或重于泰山，或轻于鸿毛……<br><br><br><br>');
    createIntroAndTaici('qtpz_huatiegan', '花铁干在南四奇“落花流水”中排行第二，本是屡行善举的侠士，在南四奇一路追杀血刀老祖到藏边雪谷的过程中，意志逐渐瓦解，内心的丑恶也逐渐暴露。为求自保他弃械投降，并为了在恶劣的雪谷中生存下去，以结义兄弟的尸体为食。回到中原后沽名钓誉，谎骗江湖人士自己诛杀了血刀门的恶贼并被推举为武林盟主。', '大熊小猫', '落影逝尘', '临自灵', '<b>【缴械】</b><br>好死不如赖活着！<br>尊严虽可贵，性命价更高！<br><br><b>【茹血】</b><br>这荒山雪岭，不食人肉何以生存？<br>茹毛饮血，只为绝地求生！<br><br><b>【沽名】</b><br>血刀门的淫僧，皆我所杀！<br>此乃侠义之本，各路朋友不必挂怀！<br><br><b>【盟举】</b><br>统领江湖，行侠仗义！<br>承蒙抬举，我便当仁不让了！<br><br><b>【阵亡】</b><br>谎言，竟被拆穿了……<br><br><br><br>');
    createIntroAndTaici('qtpz_xieyanke', '谢烟客隐居于摩天崖上，人称“摩天居士”。他曾经发布三枚玄铁令给有恩于自己的三个朋友，承诺他们可以此信物要求他做任何事情。前两枚均已使用，第三枚在巧合之下落到了小乞丐石破天的手中，为避免玄铁令落入坏人之手，他软磨硬泡逼石破天求他，无奈石破天性格高傲，令谢烟客煞为头疼。', '大熊小猫', '落影逝尘', '白', '<b>【令铁】</b><br>滴水之恩，涌泉相报！<br>凭此玄铁令，有求必应！<br><br><b>【夙诺】</b><br>君子一言，驷马难追！<br>老夫言出必行！<br><br><b>【解忧】</b><br>了无牵挂，浪迹天涯！<br>来去自如，无欲无争！<br><br><b>【阵亡】</b><br>无欲无求常自在……<br><br><br><br>');
    createIntroAndTaici('qtpz_ajiu', '阿九本是崇祯次女，封号长平公主，是青竹帮程青竹之徒，武艺高强。大明将亡之际，结识了帮助李自成起义的袁承志，恩怨情仇纵横交织，只恨自己不是平民儿女。大明将覆，国之将亡，崇祯逃亡之际，为使阿九免受义军凌辱，挥剑将她斩下一臂。后来削发为尼，法号九难，曾收陈圆圆之女阿珂、韦小宝为徒。', '大熊小猫', '落影逝尘', '水烟箩卜', '<b>【覆巢】</b><br>覆巢之下，安有完卵！<br>皮之不存，毛将焉附？<br>国难当前，谁能独善其身？<br><br><b>【国殇】</b><br>商女不知亡国恨，隔江犹唱后庭花！<br>国之将亡，必有妖孽！<br><br><b>【阵亡】</b><br>久在樊笼思成疾，可怜生在帝王家……<br><br><br><br>');
    createIntroAndTaici('qtpz_tianguinong', '田归农是李自成手下田姓护卫的后人，为关外天龙门北宗掌门。小有名气但没什么作为，为人阴险毒辣，为得到闯王宝藏的藏宝图，使用离间计令胡苗两家反目成仇并害死胡一刀。后又不折手段多次设计毒害苗人凤，对其严刑拷打。终被苗人凤废去一身武功后自尽。', '大熊小猫', '落影逝尘', '洛', '<b>【涂毒】</b><br>还望无嗔大师，赐我毒药一用！<br>我要他们二人，两败俱伤！<br><br><b>【刑讯】</b><br>交出藏宝图，可免受皮肉之苦！<br>看看是你的骨头硬，还是我的刀子硬！<br><br><b>【徇财】</b><br>这偌大的宝藏，都是我的囊中之物！<br>这富可敌国的财物，终于落到我的手里！<br><br><b>【阵亡】</b><br>人为财死，鸟为食亡……<br><br><br><br>');
    createIntroAndTaici('qtpz_yuanchengzhi', '《碧血剑》男主角。明末蓟辽督师袁崇焕的遗孤，因崇祯听信谗言错杀忠义先父而组建山宗，响应李自成起义。作为金蛇郎君夏雪宜传人，曾用《金蛇秘笈》中的功夫破解温家五老的五行阵。后为闯王立下大功，却不忍见越来越昏庸的闯王成为第二个崇祯，不愿与其同流合污，携众多部下远赴浡泥国海岛，赶走红毛賊后定居于此。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【破阵】</b><br>静待时机，后发制人！<br>灵蛇舞动，游刃有余！<br><br><b>【荡寇】</b><br>长驱入岛，如入化外之境！<br>逐出红毛贼，此处便胜却天上人间！<br><br><b>【将门】</b><br>蒙各路英豪承让，承志却之不恭了！<br>义结群雄，誓杀昏君！<br><br><b>【阵亡】</b><br>万里霜烟回绿鬓，十年兵甲误苍生……<br><br><br><br>');
    createIntroAndTaici('qtpz_kasili', '《书剑恩仇录》中陈家洛的意中人。喀丝丽是新疆回部首领木卓伦的次女，红花会总舵主陈家洛的恋人，为回部公主。她是金庸笔下的第一美女，全身白衣如雪，宛若仙子下凡，令人不敢亵渎。天真烂漫，善良仁爱，纯洁无暇，是回民心中神圣的女神。她最大愿望是世间没有战火，族人永享太平，为了族人可以牺牲自己的幸福。', '大熊小猫', '落影逝尘', '桃子玥', '<b>【祷告】</b><br>所求非善，何必祷神！<br>愿安拉真主保佑我族，永世和平！<br><br><b>【神谕】</b><br>万能的真主，愿你圣道得胜，打败入侵的敌人！<br>求真主保佑父兄击退外敌，回民永无战火！<br><br><b>【阵亡】</b><br>我愿用生命，换取回民安居乐业……<br><br><br><br>');
    createIntroAndTaici('qtpz_songxiance', '宋献策，明朝末年永城人。曾为卜者，精于奇门遁甲及图谶等术，李自成信若神灵。后为李自成谋士、军师，曾编造谶言“十八子主神器”，助李自成商定谋略，被封为开国大军师。曾用占卜之术算出大顺政权岌岌可危，大顺政权灭亡之后，此人不知所踪。', '大熊小猫', '落影逝尘', '狗子', '<b>【谣谶】</b><br>十八孩儿主神器！<br>吃闯王，穿闯王，闯王进城不纳粮！<br><br><b>【扶乩】</b><br>天象惨烈，日色无光，今日不可动刑！<br>国运危急，且待我算上一卦！<br><br><b>【阵亡】</b><br>天机，不可泄露……<br><br><br><br>');
    createIntroAndTaici('qtpz_hufei', '胡斐出身武林世家，是李自成四大护卫之一胡姓护卫的后代。因田归农的算计，刚一出世就失去双亲，在店小二平阿四的仗义抚养下长在成人，并将胡家刀法发扬光大，恪守父志看守闯王宝藏。一生虽然没有作出惊天动地的大事，但品德端良，为人豪爽，仗义疏财，曾接应红花会。', '大熊小猫', '落影逝尘', '狗子', '<b>【安民】</b><br>欺男霸女之徒，人人得而诛之！<br>除暴安良，行侠仗义！<br><br><b>【葬宝】</b><br>这闯王宝藏，害得多少人家破人亡！<br>就让这掀起武林纷争的祸端，长埋于此吧！<br><br><b>【守险】</b><br>这胡家刀谱，总算物归原主了！<br>我定会，发扬父亲遗志！<br><br><b>【阵亡】</b><br>胡苗两家的恩怨，终于化解了……<br><br><br><br>');
    createIntroAndTaici('qtpz_miaoruolan', '苗若兰是金庸小说《雪山飞狐》的女主角，金面佛苗人凤和南兰之女，是金庸小说里少见的大家闺秀。她容貌秀丽之极，声音娇柔无伦，出场时让武林豪客均感自惭形秽。她处事不惊、遇事不慌，天真善良，端庄大气。因父亲讲述胡、苗、范、田四家百年恩仇对小胡斐颇为关心，长大后更对胡斐一见倾心，抚琴饮酒与之对诗，并与胡斐定下白首之约。', '大熊小猫', '棉花糖', '安生', '<b>【量斗】</b><br>锦瑟无端五十弦，一弦一柱思华年！<br>宜言饮酒，与子偕老。琴瑟在御，莫不静好。<br>愿得一人心，白首不相离！<br><br><b>【飞僵】</b><br>欲取鸣琴弹，恨无知音赏！<br>山水弹琴尽，风花酌酒频。<br>诸位英雄姑且放下兵刃，听小女子抚琴片刻！<br><br><br><br><b>【死亡】</b><br>气若兰兮长不改，心若兰兮终不移……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_pingasi', '平阿四本是沧州一家酒楼的店小二，因被当地恶霸欺负，胡一刀夫妇仗义疏财相救。后胡一刀和苗人凤在田归农的挑唆下比武决斗，胡一刀身死，田归农追杀其遗嗣胡斐，平阿四感激胡一刀的大恩而拼死相救，被田归农削下一臂。独自将胡斐养大成人并督促其习武为父报仇，是平民中侠义之士 。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【断臂】</b><br>虽为草莽匹夫，但识忠义二字！<br>洒血染尽英雄事，铁骨七尺撑脊梁！<br><br><b>【育嗣】</b><br>恩公泉下有知，定以少爷为傲！<br>含辛茹苦十七载，胡家公子初长成！<br><br><b>【督武】</b><br>孩儿此般懈怠，怎报杀父大仇？<br>狗贼阴险毒辣，你需刻苦练习！<br><br><b>【阵亡】</b><br>少爷承继父志，我可以瞑目了……<br><br><br><br>');
    createIntroAndTaici('qtpz_wentailai', '文泰来是反清帮会红经会的四当家，绰号奔雷手，武功极为高强，在红花会中是数一数二的高手，拳法刚猛。因为和于万亭一同探听到乾隆的身世秘密而遭到追捕，身陷牢笼。红花会倾巢相救，三番四次功败垂成。在密室被乾隆亲自审问，作为阶下囚，气势更胜身为九五至尊的乾隆皇帝。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【雷奔】</b><br>铮铮铁骨，势若奔雷！<br>迅雷不及掩耳之势！<br><br><b>【贾祸】</b><br>我手握乾隆身世机密，可以此要挟！<br>事关重大，乾隆势必杀我灭口！<br><br><b>【义随】</b><br>反清复明，誓死相随！<br>红花老祖本姓朱，为救苍生下凡来！<br><br><b>【阵亡】</b><br>来世再随总舵主，共谋大业……<br><br><br><br>');
    createIntroAndTaici('qtpz_hongniangzi', '红娘子是明末农民起义军的女将，李岩之妻，出身于江湖艺人。李岩在河南杞县散粮赈灾济贫之时，红娘子率众起义，攻破县衙，与李岩成婚。虽为女流之辈，但红娘子是一位巾帼英雄，其与丈夫李岩共同投奔李自成，为李自成攻破京师立下不少的功劳。', '大熊小猫', '落影逝尘', '祭黎', '<b>【巾帼】</b><br>我自横刀立马，不输男儿郎！<br>百姓苦，江山亡，不爱红妆爱武装！<br><br><b>【请缨】</b><br>救百姓于水火，清朝廷之积弊！<br>昏君当道，民不聊生，吾辈之志，救国救民！<br><br><b>【阵亡】</b><br>马作的卢飞快，弓如霹雳弦惊……<br><br><br><br>');
    createIntroAndTaici('qtpz_shuisheng', '水笙是金庸小说《连城诀》及其衍生作品中的女主角，与其表哥汪啸风合称“铃剑双侠”， 白衫飘飘，俊雅无双，嫉恶如仇，因误会狄云是血刀恶僧，纵马踏断其右腿，后被血刀老祖掳走，在雪谷.漫长的几个月的相处中，与狄云冰释前嫌，并逐渐见识到花铁千的奸恶。结局与狄云一起隐居。', '大熊小猫', '霸天', '付水东流', '<b>【骈驾】</b><br>蘋汀游女能骑马，传道蛾眉画不如!<br>宝骏翩翩西北驰，共君齐驾羡人痴！<br><br><b>【扬鞭】</b><br>淫贼，看鞭！<br>血刀门的淫僧，还不给本姑娘让开！<br><br><b>【奋蹄】</b><br>衰草随鞭落，铃剑逐鹃声！<br>银铃霜雪蹄，白马逐烟去！<br><br><b>【阵亡】</b><br>狄大哥，此生与你，天涯海角……<br><br><br><br>');
    createIntroAndTaici('qtpz_xie_huatiegan', '花铁干是金庸创作的小说《连城诀》及其衍生作品中的男配角，电视剧《连城诀》由六小龄童饰演，江湖人称“中平无敌”。鹰爪铁枪门的门主，枪法已入大成之境，为当世一流高手，南四奇“落花流水”中排行第二，与“仁义陆大刀”陆天抒、“柔云剑”刘乘风、“冷月剑”水岱三人结拜为兄弟，在藏边雪谷对血刀老祖一战中，平时压抑在内心深处不敢见光的卑鄙一面彻底爆发。在原著中，花铁干最后死于天宁寺财宝中毒，而电视剧中，花铁干内心的丑恶，以及做过的卑劣行径，被狄云及水笙当众拆穿，并最终死', '吃饱睡睡醒吃', '霸天', '污名', '<b>【侠名】</b><br>落花流水强强联手，必将妖僧就地正法！<br>除恶务尽，一个淫僧也不能放过！<br><br><b>【怯死】</b><br>花某侠名在外，岂能困死于藏边雪谷！<br>古有壮士解其腕，今有花某弃手足！<br><br><b>【屈膝】</b><br>欲求生路，当无所不用其极！<br>蝼蚁尚且贪生，岂有人不惜命！<br><br><b>【背刺】</b><br>中平枪，枪中王，当中一点最难防！<br>兄弟，不就是拿来出卖的吗，哈哈哈……<br><br><b>【死亡】</b><br>冤有头债有主，二位兄弟……饶了我吧……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_diyun', '狄云是金庸小说中命运最悲惨的男主角，被万圭陷害锒铛入狱，被削断右手五指、穿琵琶骨。在狱中结识丁典，并在绝望自杀时得其相救，授其神照经和乌蚕衣。藏边雪谷误杀血刀老祖并获得其宝刀。经历重重磨难的他眼看着众人为抢夺财宝而葬身于江陵城南寺庙内，独自带着师妹女儿离去。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【横刀】</b><br>我愿横刀纵天涯，扫尽江湖不平事！<br>这一刻，命运由我自己主宰！<br><br><b>【设饵】</b><br>贪夫徇财，烈士徇名！<br>这是你们，最后的疯狂！<br><br><b>【馈遗】</b><br>这血刀经，我便收下了！<br>得丁大哥慷慨厚赠，狄云不胜感激！<br><br><b>【阵亡】</b><br>总算是，退出这血雨腥风的江湖……<br><br><br><br>');
    createIntroAndTaici('qtpz_yandaping', '言达平是金庸小说《连城诀》中的角色，梅念笙的二徒弟，绰号“陆地神龙”，与他两个师兄弟合谋击杀师父，之后又为争夺宝藏而自相残杀。言达平将三招精妙的剑招传授给狄云，企图借此引发万震山和戚长发的争斗，从而从中获利。最后在找到梁武帝宝藏时，一时不慎被戚长发一剑击杀。', '大熊小猫', '霸天', '虚怀若谷', '<b>【煽斗】</b><br>哼哼，坐山观虎斗！<br>尽管斗个你死我活，我自坐收渔利！<br><br><b>【攫取】</b><br>这连成诀，已是我的囊中之物，哈哈哈哈……<br>同门相残，只为绝世经纶！<br>欺师灭祖，以图连城之宝！<br><br><br><br><b>【死亡】</b><br>人算……不如天算……啊……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_jue_diyun', '狄云是金庸武侠小说《连城诀》中的主角，一个命运多舛的青年。原是雪山派的弟子，却因师父戚长发的利用和同门万圭的陷害，被冤枉入狱，遭受了无数的苦难和折磨。在狱中，他遇到了人生知己丁典，丁典传授给他神照经的武学秘籍，让他在黑暗中看到了一丝希望的曙光。师妹万芳误以为他背叛师门，转而爱上了万圭。然而狄云并没有因此放弃，他在善恶之间挣扎，最终选择了正义之路。在追杀血刀老祖的过程中，他意外地习得了血刀经的神功，这让他的实力大增，也让他的人生发生了翻天覆地的变化。经历了种种磨难后，狄云终于洗清了冤屈，与水笙一同隐居江湖，远离了尘世的纷扰。他的故事，是一段关于忠诚、爱情、正义和自我救赎的传奇，展现了一个英雄在逆境中成长，最终找到自己人生方向的历程。', '吃饱睡睡醒吃', '棉花糖', '末生', '<b>【一念】</b><br>善恶到头终有报，只争来早与来迟！<br>是非善恶难明辨，邪魔正道一念间！<br>[绝]白衣溅贼血，丹心照侠名。<br>[绝]炎凉遍览雄心在，沧桑多历侠骨存。<br>[邪]仗剑从仇讨，横刀杀气凝！<br>[邪]杀气震鞘刃染腥，血洗仇敌尽除名！<br><br><b>【入照】</b><br>吐故纳新，入神坐照！<br>蓄气通二脉，凝神照阴阳！<br><br><b>【血刃】</b><br>[绝]孑然一身，何须金银万两？<br>[绝]心已成灰，得此剑诀何用？<br>[邪]用侩[guì]子手的鲜血，染红这血刀！<br>[邪]天道不公，那我……就是天道！<br><br><br><b>【死亡】</b><br>江湖尽险恶，正心何以持……<br><br><br><br><br>');
    createIntroAndTaici('qtpz_meiniansheng', '梅念笙是江南武林名宿，人称铁骨墨萼，绝学为神照功和连城剑法。他淡泊名利、心怀苍生，门下却出了三个叛徒。为了得到牵涉宝藏秘密的连城剑诀，三个叛徒竟密谋弑师，梅念笙心慈手软却被叛徒暗算，最后被丁典所救，梅念笙看丁典品性纯良，便将连城诀和神照经一起交给他。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【剑诗】</b><br>孤鸿海上来，池潢不敢顾！<br>落日照大旗，马鸣风萧萧！<br><br><b>【寡战】</b><br>今日，我便清理门户！<br>师门不幸，出了你们三个叛徒！<br><br><b>【遗珍】</b><br>请丁公子务必保管这神照经！<br>丁公子肯仗义相救，我唯有将宝书相赠！<br><br><b>【阵亡】</b><br>得遇贤人，我死也瞑目了……<br><br><br><br>');
    createIntroAndTaici('qtpz_liyuanzhi', '清朝提督李可秀的千金，师从陆菲青，善使绵里针。乐于女抢男装，与余鱼同患难相处，动了真情，开始主动地追求余鱼同，奈何落花无意，余公子流水无情。余鱼同因痴恋兄嫂，为疗情伤，逃避到寺庙，落发为僧。李姑娘千里相随，敢爱敢为，在大漠与高手张召重相斗时，用计逼得红花会和余鱼同认成婚姻，痴情终于如愿以偿。', '大熊小猫', '落影逝尘', '古梁舟', '<b>【忧怜】</b><br>千山万水，苦随君行！<br>落花虽有意，流水却无情！<br><br><b>【铤险】</b><br>诛此狗贼，鱼同必定感恩于我。<br>如今我以身犯险，惟愿鱼同不负于我！<br><br><b>【阵亡】</b><br>长相思兮长相忆，短相思兮无穷极……<br><br><br><br>');
    createIntroAndTaici('qtpz_huoqingtong', '回部首领木卓伦之大女，文武兼备，善于调兵遣将，指挥大局，实乃巾帼不让须眉，同时不失女子温柔。即使爱情失意也没有消沉，而是把保卫民族的重任挑在肩上。曾为保回民平安，携贡品送入清军军营。后来统领回疆人民以寡敌众，在黑水河之役中，大败清兵。', '大熊小猫', '落影逝尘', '珂里', '<b>【纳贡】</b><br>纳牛羊千匹，保回疆民安！<br>化干戈为玉帛，免生灵涂炭！<br><br><b>【筹饷】</b><br>犒赏千军，杀尽满贼！<br>回民安居乐业，乃我生平夙愿！<br><br><b>【整饬】</b><br>《可兰经》乃我族圣物，岂容清狗掠夺！<br>整兵顿马，胜过雄兵百万！<br><br><b>【阵亡】</b><br>家洛，你要给喀丝丽幸福……<br><br><br><br>');
    createIntroAndTaici('qtpz_dindian', '丁典是荆门武林世家的一名子弟，意外之中救下被三个徒弟追杀的铁骨墨萼梅念笙，梅念笙见丁典为人质朴，便将绝世武功神照功和连城诀传授给他。后来被意中人凌霜华之父凌退思觊觎其宝书，设计毒害他，将他关在深牢里严刑逼供。丁典并未屈服，最后因凌霜华的死悲痛欲绝，中毒而死。', '大熊小猫', '落影逝尘', '青灯', '<b>【铮骨】</b><br>士可杀，不可辱！<br>七尺男儿，铁骨铮铮！<br><br><b>【神照】</b><br>人淡如菊，洗尽铅华！<br>习此神功，可起死回生！<br><br><b>【阵亡】</b><br>宁愿站着死，绝不跪着生……<br><br><br><br>');
    createIntroAndTaici('qtpz_huoayi', '新疆回部族人的少年领袖，是霍青桐和香香公主的兄长，忠正耿直。因回部圣物《可兰经》被清军抢走，霍阿伊与父亲木卓伦、霍青桐率领族人前往中原追寻圣物，得陈家洛相助，使得《可兰经》失而复得。最后因清军攻破回部，为了保护回部子民，与父亲木卓伦一同战死沙场。', '大熊小猫', '落影逝尘', '临自灵', '<b>【笞罚】</b><br>满贼干戈来犯，尔等蔫敢卸甲！<br>尔等遗失经书，当军法处置！<br><br><b>【鏖兵】</b><br>保卫疆土，背水一战！<br>宁沙场喋血，勿降作阶囚！<br><br><b>【阵亡】</b><br>黄沙百战穿金甲，不破楼兰终不还……<br><br><br><br>');
    createIntroAndTaici('qtpz_chenjialuo', '陈家洛身负于万亭厚望出任红花会总舵主。得知当今天子乾隆皇帝为自己的胞兄之后，致力于说服乾隆跟红花会里应外合赶走满清鞑子，光复汉人江山。曾挟持乾隆答应自己反清复汉的计划。因盲目信任乾隆，最终掉进乾隆的陷阱里，害得红花会前功尽弃，不得不携众兄弟远走新疆。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【拥主】</b><br>大哥乃黄帝子孙，岂可数典忘祖？<br>愿吾兄奋发鹰扬，光复汉人江山！<br><br><b>【盲信】</b><br>孤注一掷，且待乾隆筹划！<br>吾兄为汉人后裔，愿其迷途知返！<br><br><b>【义旗】</b><br>江南风光好，遍地红花开！<br>一敬桃园结义刘关张，二敬瓦岗寨上众儿郎！<br><br><b>【阵亡】</b><br>家洛愧对于老舵主厚望……<br><br><br><br>');
    createIntroAndTaici('qtpz_muzhuolun', '木卓伦是新疆回部族人的领袖，霍阿伊、霍青桐和香香公主之父，为人忠正耿直。因回部圣物《可兰经》被清军抢走，木卓伦领族人前往中原追寻圣物，得陈家洛相助，因此对陈家洛深怀感恩。后来陈家洛被兆惠大军围困于大漠，其也曾相救。最后因清军攻破回部，与儿子霍阿伊一同战死沙场。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【成仁】</b><br>不成功，便成仁！<br>鞑子兵精将猛，我等唯有血战！<br><br><b>【负隅】</b><br>只有战死的勇士，没有投降的懦夫！<br>今天，要与清兵决一死战！<br><br><b>【铩羽】</b><br>欺我族类，我必愤而反击！<br>誓与鞑子，同归于尽！<br><br><b>【阵亡】</b><br>保护回民的重任，就托付给你了……<br><br><br><br>');
    createIntroAndTaici('qtpz_wenqingqing', '雪宜与温仪所生的女儿，因为出身并不光彩所以不招温家五老待见。出生在匪盗世家，温青青的看家本领极其高超，出场便从安小慧和崔希敏手中抢走送给闯王的军饷。木桑道长曾教她上乘轻功神行百变，可于危难之中保住性命。', '大熊小猫', '落影逝尘', '仙女桥', '<b>【劫饷】</b><br>莫非荣老爷子也想来分一杯羹？<br>盗亦有道，这笔财物可是我先盯上的！<br><br><b>【阵亡】</b><br>既有金枝玉叶，又何须我寻常百姓……<br><br><br><br>');
    createIntroAndTaici('qtpz_xiaxueyi', '夏雪宜本是普通人家的孩子，只因温家五老之一温方禄贪图其姐姐的美貌，强奸未遂，故而残忍杀害他一家五口，从此心里播下仇恨的种子。他辗转习得云南五毒教《金蛇秘笈》里高超武功并在何红药的帮助下获得镇教之宝金蛇剑，行走于江湖时人称金蛇郎君。誓要杀温家堡五十口人、污温家女子十人方休。', '大熊小猫', '冷雨', '弈声传媒有声工作室', '<b>【蛇游】</b><br>我所承受的苦难，定要你们十倍奉还！<br>速速交出你们的狗命！<br><br><b>【阵亡】</b><br>阿仪，我重财宝而轻别离，愚极，蠢极……<br><br><br><br>');
    createIntroAndTaici('qtpz_yuanzhiyi', '袁紫衣是银姑被恶霸凤天南强暴生下的女儿，自幼出家，法名圆性。受师父嘱咐，出走江湖刺杀凤天南为母报仇，但因顾及人伦，需得先救他三次方可下手，于是与追杀凤天南的胡斐因误解而结下缘分。无奈袁紫衣已是佛门中人，两人真心相爱却不能相守，实在是可怜、可叹。', '大熊小猫', '落影逝尘', '水烟箩卜', '<b>【三赦】</b><br>此人杀不得，我有我的苦衷！<br>我答应过师父，要救这个禽兽三次！<br><br><b>【自赎】</b><br>贫尼法号圆性，望施主自重！<br>此乃佛门净地，施主，请回吧！<br><br><b>【阵亡】</b><br>如果有来生，愿为布衣，不做缁衣……<br><br><br><br>');
    createIntroAndTaici('qtpz_wuchendashi', '无嗔大师是药王谷的掌门，医术和使毒技术举世无双，人称毒手药王。著有《药王神篇》，记录了丰富的使毒知识。其同门师弟石万嗔为了获取此书，使用奸计害死了无嗔大师，他死前将此书交给关门弟子程灵素保管，并嘱咐她要谨记救人之道，同时替药王谷清理门户。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【解蛊】</b><br>尝尽百草，只为悬壶济世！<br>解毒还需下毒人！<br><br><b>【神章】</b><br>此书祸福相依，你需心存善念！<br>治病杀生，一念之间！<br><br><b>【阵亡】</b><br>灵素，务必继承为师衣钵……<br><br><br><br>');
    createIntroAndTaici('qtpz_zhangzhaozhong', '武当派的三弟子，陆菲青的师弟，绰号火手判官，善使一柄凝碧剑，武功绝顶，为人热衷功名，投身朝廷，为朝廷鹰犬，专门和红花会群雄为仇作对。曾经多次擒拿奔雷手文泰来，和红花会众兄弟进行周旋。在漠北被红花会李沅芷推入狼穴，陆菲青念在同门之情舍命相救反而被其所害。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【叛投】</b><br>良禽择木而栖，贤臣择主而事！<br>识时务者为俊杰！<br><br><b>【追擒】</b><br>尔等已是瓮中之蹩，插翅也难飞！<br>红花逆贼，还不束手就擒！<br><br><b>【阵亡】</b><br>心比天高，奈何，命比纸薄……<br><br><br><br>');
    createIntroAndTaici('qtpz_duoergun', '多尔衮是清太祖努尔哈赤之孙，清初杰出的政治家和军事家。皇太极死后，多尔衮和济尔哈朗以辅政王身份辅佐皇太极第九子福临即帝位，称摄政王；顺治元年在吴三桂的接应之下指挥清军入关，清朝正式入主中原，先后封叔父摄政王、皇叔父摄政王、皇父摄政王。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【破关】</b><br>挥师南下，就在今朝！<br>山海关已破，随我攻入北京城！<br><br><b>【辅政】</b><br>封官进爵，全由我说了算！<br>王公贵胄，无不听命于我！<br><br><b>【阵亡】</b><br>为臣者，切不可功高盖主……<br><br><br><br>');
    createIntroAndTaici('qtpz_lintuisi', '凌退思原为两湖龙沙帮帮主，龙沙帮被血刀老祖所灭后，几经辗转，成为荆州知府，为人残忍无情，为了得到梁武帝的宝藏，他利用金波旬花之毒将女儿的意中人丁典关入深牢大狱之中，日日对其施以酷刑以期他交出连城诀。最后索要无果，竟然不惜害死自己的亲生女儿凌霜华。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【黩刑】</b><br>不交出连城诀，别想踏出这深牢大狱！<br>匹夫无罪，怀璧其罪！<br><br><b>【淬毒】</b><br>中了我金波旬花之毒，你还不任我摆布！<br>你，终于栽到我手里了！<br><br><b>【阵亡】</b><br>这些宝藏，都是我的，都是我的……<br><br><br><br>');
    createIntroAndTaici('qtpz_niujinxing', '牛金星是河南宝丰县人，二十岁中秀才，天启七年中举人。性喜读书，通晓兵法。早年过着锦衣足食的生活。后随闯王李自成一起推翻大明王朝，曾为李自成制定战略、策略，历任大顺政权左辅和天佑阁大学士。 在《碧血剑》小说中，此人屡屡向李自成进谗诬害功臣李岩将军，还曾进劝闯王登基为帝。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【谗逆】</b><br>此人功高盖主，恐有谋逆之心！<br>制将军自恃有功，可把闯王放在眼里！<br><br><b>【劝进】</b><br>大王乃真命天子，当顺应天意！<br>时势造英雄，大王为何犹豫？<br><br><b>【阵亡】</b><br>难道，又要变天了吗……<br><br><br><br>');
    createIntroAndTaici('qtpz_wangchengen', '王承恩深得崇祯皇帝宠幸，官至司礼监秉笔太监。大明江山风雨飘扬，社会动荡，崇祯曾梦一神人写一“有”字于手心，向王承恩解梦。王承恩直言此梦乃凶兆，神人借意警告崇祯，有字上为大，下为明，均缺失一半。甲申之变闯军攻入京城，王承恩陪崇祯自缢于煤山。', '大熊小猫', '落影逝尘', '青灯折扇不语', '<b>【哭梦】</b><br>依奴才愚见，此梦乃大凶之兆！<br>神人显告我皇，大明江山将失过半！<br><br><b>【殉主】</b><br>奴才恭送大明崇祯皇帝上路！<br>黄泉路上冷，请圣上恩准以老奴为伴！<br><br><b>【阵亡】</b><br>陛下，老奴来陪您了……<br><br><br><br>');
    createIntroAndTaici('qtpz_luobing', '骆冰是红花会十位当家中唯一的女当家，是奔雷手文泰来的妻子，人称文四嫂，具有巾帼气质。其父是侠盗骆元通，善长使用一长一短的双刀，绰号“鸳鸯刀”，曾多次继父之志盗取富豪的财产分发给疾苦百姓。骆冰是个思想传统但个性平常的女子，为人和蔼可亲，使人如沐春风。', '大熊小猫', '落影逝尘', '江虞', '<b>【双刀】</b><br>狗官，领死吧！<br>长鸯短鸳多奇招，定要豺狼无处逃！<br><br><b>【侠盗】</b><br>巧取豪夺的狗官，何曾怜悯百姓疾苦！<br>取之于民，用之于民！<br><br><b>【阵亡】</b><br>四哥，我是你的骄傲吗……<br><br><br><br>');
    createIntroAndTaici('qtpz_huyidao', '胡一刀是当年李自成四大护卫之一的后代，秉承先志守护闯王藏于北主玉笔峰山洞里的宝藏，无奈田护卫的后代田归农一直想将宝藏据为已有，为了找出藏宝图，田归农挑拨胡一刀和苗护卫后人苗人凤的关系，令其在沧州进行了连续几天几夜的比武大决斗。双方难分胜负，田归农在双方的兵刃抹上剧毒，害死胡一刀。', '大熊小猫', '落影逝尘', '李二汪', '<b>【鏖战】</b><br>小弟和苗大哥如此投机，若不是世仇该有多好！<br>痛饮三杯，再决一死战！<br><br><b>【天佑】</b><br>守护宝藏的重任，交给你了！<br>切不能让宝藏，落入奸贼之手！<br><br><b>【阵亡】</b><br>我死后，望苗大哥抚养我儿成人……<br><br><br><br>');
    createIntroAndTaici('qtpz_liwenxiu', '李文秀是《白马啸西风》中的女主角。吕梁三杰为了抢夺一幅埋藏宝物的高昌迷宫图，带人与其父母交手，父母战死在大漠，李文秀逃至哈萨克居住区生活，成年后对少年时邂逅的哈萨克男子苏普产生了感情，但苏普并不喜欢她。李文秀把仇人带入迷宫，击杀了仇人。但击杀了仇人后，她又能去哪里呢，只能一个人牵着白马去往江南。', '大熊小猫', '假象', '良沨', '<b>【专情】</b><br>山有木兮木有枝，心悦君兮君不知！<br>鱼沉雁杳天涯路，最是别离相思苦！<br><br><b>【设诱】</b><br>设陷诱敌，以报血仇！<br>以饵为诱，打虎牢龙！<br><br><b>【阵亡】</b><br>迢迢归期，莫问来路……<br><br><br><br>');
    createIntroAndTaici('qtpz_supu', '苏普是金庸小说《白马啸西风》中的人物，哈萨克族男子，女主角李文秀的意中人。由于苏普的家人为汉人无辜杀害，因此，苏普的父亲苏鲁克仇恨所有的汉人，阻止苏普与李文秀来往;李文秀黯然离去。多年后苏普与阿曼一同碰见李文秀，这时的苏普只喜欢阿曼，李文秀只是他童年的好朋友。李文秀的心中却还是一直喜欢着苏普，直到后来她返回中原，心中仍然忘不了苏普。', '大熊小猫', '霸天', '佚名', '<b>【鲜衣】</b><br>衣不如新，人不如故！<br>少年英雄气，驰驹逞鲜衣！<br><br><b>【怒马】</b><br>草原大漠，任我驰骋！<br>我等驾此良驹，你已无处可逃！<br><br><b>【擎苍】</b><br>千里旷野雄鹰健，百兽奔走猎获丰！<br>苍鹰翱翔，直入云霄，所猎之物，无处可藏！<br>蒙真主庇佑，此次狩猎，必有所获！<br><br><br><b>【死亡】</b><br>驾、驾……(远去的马蹄声)<br><br><br><br><br>');
    //以武会友
    createIntroAndTaici('ywhy_shimaige', '史麦戈是《指环王》是的重要角色，出生于显赫的霍比特家庭。2463年，他和堂兄外出钓鱼，堂兄从河底捞起一只金戒指。史麦戈在还没有弄清戒指之前，魔怔般的占有欲就促使他杀害了堂兄。得偿所愿的史麦戈很快发现了戒指的神奇之处，用它达到了许多卑鄙目的，并令自己家破人亡，只能逃到迷雾山脉中一个黑暗洞穴中躲藏起来，长期生活在黑暗中不愿见到日月。几百年后，比尔博·巴金斯突然来到史麦戈的住处，并拿走魔戒。随后的几十年里，史麦戈一直在寻找魔戒，直到3017年，被索伦抓获。他供出了魔戒的下落，由此引发一场中土的正邪大战。在魔戒远征队旅程中，史麦戈多次想夺回魔戒，最后在与佛罗多·巴金斯的打斗中掉入末日火山，同魔戒一起在熔岩中燃烧殆尽。', '大熊小猫', '霸天', '花生', '<b>【魔起】</b><br>迪亚戈，给我……快把戒指给我！<br>今天是我的生日，我要它……做我的生日礼物！<br><br><b>【豢猎】</b><br>真是一条大鱼，迪亚戈，快抓住它！<br>今天……将满载而归！<br><br><b>【魔变】</b><br>我忘了面包的滋味，树木的声音，微风的轻柔……<br>噢，我的……心肝宝贝儿！<br><br><br><b>【死亡】</b><br>卑鄙的霍比特人……偷走了我的宝贝……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_gulu', '原名史麦戈，本是一名善良、爱好和平的霍比特人，一次和党兄外出钓鱼时，堂兄迪亚戈为了追捕一条大鱼，意外从河里捞出一枚金戒。金戒强大的魔力瞬间诱使史麦戈强烈想要占有它，企图以生日礼物为要求获得戒指，遭到堂兄拒绝后残忍击杀堂兄。获得魔戒后，被魔戒夸张的魔性折磨得不人不鬼，整日躲在迷雾山脉中一个黑暗洞穴中，开始生食野生动物渡日，在魔戒的影响下存活了几百年，变成了一个绿眼的怪物，把魔戒当成宝贝，嘴里经常发出咕噜的声音。他分裂出两个人格——胆小人格和邪恶人格，两个人格的相互对话经常折魔得他生不如死。在魔戒远征队旅程中，咕噜多次想夺回魔戒，最后在与佛罗多打斗中掉入末日火山，同魔戒一起在熔岩中燃烧殆尽。', '大熊小猫', '霸天', '白狗', '<b>【魔性】</b><br>咕噜……咕噜……<br>My Precious！<br>[胆小人格]他们咒骂我们，说我们是杀人凶手！<br><br><b>【贪餮】</b><br>[胆小人格]小偷巴金斯！我们恨他，我们永远都恨他！<br>[邪恶人格]坏人伤害我们！主人欺负我们！杀了他！杀了他！<br>[邪恶人格]丑陋的霍比特人，偷走了我们的宝贝儿！<br><br><b>【生啖】</b><br>[邪恶人格]可怜的小霍比特人，要被巨蛛希洛布生吞啦！<br>[邪恶人格]池塘的鱼儿好甘甜……<br><br><br><b>【死亡】</b><br>[双人格]我们好孤单，哭得好惨……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_beiteduote', '万圣节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;贝特和多特是《美国恐怖故事：畸形秀》中的一对连体双胞胎姐妹。生于19世纪末，由于身体结构奇特，从小被当作怪物展示。她们拥有独立的头脑，但共享一具身体。贝特温柔善良，而多特狡猾自私。两人经常因为性格差异和三观发生争执。在畸形秀中，贝特和多特被招募为表演者，她们的到来为畸形秀带来了新的生机。她们与畸形秀的其他成员建立了深厚的友谊，尤其是与吉米·达林之间发展出了一段复杂的感情。贝特和多特的故事充满了悲剧色彩，她们渴望过上正常的生活，但身体的特殊性让她们的梦想变得遥不可及。她们的命运也与畸形秀的兴衰紧密相连，最终在一场大火中结束了自己的生命。', '大熊小猫', '霸天', '喵吱', '<b>【连体】</b><br>我们的身体紧密相连，我们的灵魂自由无边！<br>在这四分五裂的世界，我们，是最完美的统一！<br>我们共呼吸、同命运；我们共荣辱、同敌忾[kài]！<br>我们，绝不会让任何人定义我们！<br><br><b>【孖生】</b><br>我们的生命与故事，由我们自己来书写！<br>我们是姐妹，我们亦是战士！<br>敢伤害我们其中一个，就是与我们两个为敌！<br><br><b>【离心】</b><br>我们共享生命、共享痛苦，也共享复仇的怒火！<br>我们不可分割，任何试图拆散我们的，都将付出代价！<br><br><br><b>【死亡】</b><br>死亡让我们分离，但我们的灵魂，将永远相依……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_niulangzhinv', '传说古代天帝的孙女织女擅长织布，每天给天空织彩霞。她讨厌这枯燥的生活，就偷偷下到凡间，私自嫁给河西的牛郎，过上男耕女织的生活。此事惹怒了天帝，把织女捉回天宫，责令他们分离，只允许他们每年的农历七月七在鹊桥上相会一次。他们坚贞的爱情感动了喜鹊，无数喜鹊飞来，用身体搭成一道跨越天河的喜鹊桥，让牛郎织女在天河上相会。', '大熊小猫', '霸天', '安生', '<b>【耕耰】</b><br>人世非比天仙路，沧海桑田为耕织。<br>观天难测晴雨，耕耘可知欠丰。<br><br><b>【梦莹】</b><br>相思梦悠悠，涕泣泪如雨。<br>纵使天各一方，你我梦魂相连！<br><br><b>【鹊桥】</b><br>天河涛涛，故人何处？<br>伤夫妇别离，恨天河难渡！<br>一道鹊桥横渺渺，千声玉佩过玲玲。<br>鹊桥凌云渡，天路非迢迢！<br><br><br><b>【死亡】</b><br>此去一别，来年今宵再相会……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_baijuyi', '白居易是唐朝诗人，所著诗歌《长歌行》从“汉皇重色思倾国”至“惊破霓裳羽衣曲”共三十二句为第一段，写唐玄宗和杨贵妃的爱情生活、爱情效果，以及由此导致的荒政乱国和安史之乱的爆发。从“九重城阙烟尘生”至“魂魄不曾来入梦”共四十二句为第二段，写马嵬驿兵变，杨贵妃被杀，以及此后唐玄宗对杨贵妃朝思暮想，深情不移。从“临邛道士鸿都客”至“此恨绵绵无绝期”共四十六句为第三段，写唐玄宗派人上天入地到处寻找杨贵妃和杨贵妃在蓬莱宫会见唐玄宗使者的情形。', '大熊小猫', '棉花糖', '紫衫喵', '<b>【酒令】</b><br>荔枝新熟鸡冠色，烧酒初开琥珀香。欲摘一枝倾一盏，西楼无客共谁尝。<br>况吾头半白，把镜非不见。何必花下杯，更待他人劝?<br>寒宵劝酒君须饮，君是孤眠七十身。<br>劝君一盏君莫辞，劝君两盏君莫疑，劝君三盏君始知！<br><br><b>【长恨】</b><br>回眸一笑百媚生，六宫粉黛无颜色！<br>云叠花颜金步摇，芙蓉帐暖度春宵！<br>春宵苦短日高起，从此君王不早朝！<br>在天愿作比翼鸟，在地愿为连理枝。<br><br><br><br><b>【死亡】</b><br>自从花颜去，秋水无芙蓉……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_gelun', '中元节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;格伦是美剧《行尸走肉》中的角色，是一名美籍韩裔。格伦本来是一个小小的披萨外卖员，在一次例行到亚特拉大收集补给的过程中遇到被丧尸包围的主角瑞克，通过无线电指导瑞克顺利突围。从此跟着瑞克团队开启末日大逃杀。格伦沉着冷静、灵敏无畏、足智多谋，在团队中，他充满了极强的同情心，保持着积极乐观和对青春一成不变的热情。而一次又一次死里逃生，也令他逐渐变得对死亡麻木不仁。后来被“救世军”的首领尼根残忍虐杀。', '大熊小猫', '僵尸王', '全职卤蛋', '<b>【外送】</b><br>叮……[门铃声]<br>爱心晚餐，风雨无阻！<br>先生，您的披萨！<br>祝您用餐愉快！<br>您的外卖，请签收！<br>需要我为您服务吗？<br>您的美餐，由我护送！<br><br><b>【末世】</b><br>群尸出笼，末日降临；山崩地裂，草木含悲！<br>人间正沧桑，满世活死人！<br><br><b>【救世】</b><br>不经人间炼狱，怎得涅磐重生！<br>丧尸不会灭亡人类，能灭绝人类的只有人类自己！<br><br><b>【逃杀】</b><br>不做屠夫，便成羔羊！<br>突破群尸重围，但求一线生机！<br><br><b>【死亡】</b><br>人心，是最可怕的东西……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_beiteduote', '万圣节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;贝特和多特是《美国恐怖故事》第四季里的角色，是长着两个头的连体人姐妹。 妹妹是一个温柔且可爱的女孩子，姐姐则很睿智沉静。姐姐喜欢吉米，妹妹喜欢丹迪。被丹迪告知切斯特正面目后与其决裂。后发现畸形人们意图谋杀艾莎后帮助艾莎逃离，最后和吉米生活在一起，并且怀孕了。<br><br>&nbsp;&nbsp;&nbsp;&nbsp;人物原型：原型是Hilton姐妹。她们都有着相似的命运，因家人嫌弃被卖给商人做畸形秀表演。辗转一生。因某种基因影响，这种不正常的分裂行为未被监测到，未能及时的停止。有的是下肢连体，有是平行连体，而有的是头颅连体。连体双胞胎，大多数存在部分器官共用的现象。从医学上进行手术分离，也需要就此进行评估。如果强行分离必定造成其中一人的死亡，这也是美恐中连体姐妹的痛~无法自由，也无法割舍。', '大熊小猫', '霸天', '待定', '<b>【连体】</b><br>暂无！<br>暂无！<br><br><b>【孖生】</b><br>！<br>暂无！<br>暂无！<br><br><b>【离心】</b><br>！<br>暂无！<br>暂无！<br><br><br><br><b>【阵亡】</b><br>暂无……<br><br><br><br>');
    createIntroAndTaici('ywhy_fahai', '法海是徐克电影《青蛇》中金山寺的住持大师，他以拯救天下苍生为己任，誓要斩除世间所有的妖魔，在追捕青白二蛇的过程当中，被青蛇扰乱了心性，他恼羞成怒，将许仙封印五音并囚禁在金山寺，最终导致白蛇水漫金山，无数生灵皆因之涂炭，在这一刻法海终于领悟到佛法的真谛。', '大熊小猫', '僵尸王', '全职卤蛋', '<b>【降妖】</b><br>妖就是妖，还敢口舌招摇！<br>大胆妖孽，我要你原形毕露！<br><br><b>【入魔】</b><br>仙凡有别，大道无情！<br>红尘厮混，终会堕入魔道！<br>蛇妖，你已触犯天条，还不速速伏法？<br>哪里逃，看我大罗金钵！<br>佛门重地，岂容妖孽横行！<br>世尊地藏，般若诸佛！<br>雕虫小技，竟敢班门弄斧！<br>大威天龙，大罗法咒，般若巴嘛空！<br><br><br><b>【缘法】</b><br>六道轮回，各有所序，何必苦苦执着？<br>水月镜花，迷惑众生，何谓妖、何谓佛？<br><br><br><b>【死亡】</b><br>难道，妖也有情……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_niao', '不久的将来，网络黑客尼奥对这个看似正常的现实世界产生了怀疑。他结识了黑客崔妮蒂，并见到了黑客组织的首领墨菲斯。墨菲斯告诉他，现实世界其实是由一个名叫“母体”的计算机人工智能系统控制，人们就像他们饲养的动物，没有自由和思想，而尼奥就是能够拯救人类的救世主。可是，救赎之路从来都不会一帆风顺，到底哪里才是真实的世界？如何才能打败那些超人一样的特勤？尼奥是不是人类的希望？这是黑客的帝国，程序和代码欢迎大家的到来。', '大熊小猫', '棉花糖', '攀', '<b>【骇客】</b><br>所谓选择，皆是虚幻！<br>世间万物，有始有终！<br><br><b>【矩阵】</b><br>人机之战尚未结束，未来任重道远！<br>真正的敌人，是与你并肩却暗藏匕首的人！<br><br><br><br><b>【阵亡】</b><br>阳光，终会普照……<br><br><br><br>');
    createIntroAndTaici('ywhy_nieyinniang', '聂隐娘为魏博大将聂锋之女，幼时被一女尼用法术偷去，教以剑术，能白日刺人，人莫能见。聂父死后，魏博主帅与陈许节度使刘昌裔不和，欲令聂隐娘暗杀之，聂却转而投刘。主帅另派精精儿与妙手空空儿前往暗杀，隐娘又以法术破之。后刘昌裔入觐，聂告别而去。刘死后，聂又至京师刘柩前恸哭。', '大熊小猫', '霸天', '昭月', '<b>【死士】</b><br>托身白刃里，杀人红尘中！<br>不知蝗蠹满天下，苦尽苍生皆王臣！<br><br><b>【投明】</b><br>先生高义，小女子愿投效以明志！<br>孤飞终已倦，请随缘客游。<br><br><b>【阵亡】</b><br>我本闲散客，归去如沙鸥……<br><br><br><br>');
    createIntroAndTaici('ywhy_wuqing', '无情是天下四大名捕之首，幼时全家惨遭灭门，是诸葛神侯的大徒弟。他心思缜密，智慧过人。因儿时横祸，双腿俱废，且脏腑受损，无法修习武功﹐但却凭着过人的天赋和毅力，悟出一套借劲借势的本领，以极其巧妙的手法收发暗器，更是练成以双手发力的绝世轻功。凭借轻功、暗器两项绝技，被江湖中人誉为：无腿行万里、千手不能防。他处事无情，内里留情。', '大熊小猫', '霸天', '酒酿陈玄', '<b>【机匣】</b><br>藏器于匣，鬼神难定！<br>飞花摘叶，信手拈来！<br>袖凛摧奸剑拂霜，缉凶除佞纳锋芒。<br>好一身横练功夫，可抵得住我这追魂钉？<br>寒梅影横斜，香落衔霜发<br>此地早已布下蒺藜，贼寇定无所遁形！<br>雀鸣晓天语，顾影玉凰来。<br><br><b>【踏雪】</b><br>蜃光消楼阁，星汉藏乌鹊！<br>孤辇乘风去，叶落雪无痕！<br><br><b>【阵亡】</b><br>情之一字，难得始终……<br><br><br><br>');
    createIntroAndTaici('ywhy_huoyuanjia', '电影中的霍元甲年少时争强好斗，不懂习武的真正意义，一心想要争津门第一，在比武中打死秦爷之后，被其干儿子仇杀灭门。从此远走他乡，隐居湘西。后来在好友帮助下开办精武体操会，为了国家尊严，同时与四位外国高手进行比武。', '大熊小猫', '霸天', '冰霜墨菊', '<b>【谜踪】</b><br>疾迅如风，来去无影！<br>迷而不返，是为无踪！<br><br><b>【睡狮】</b><br>岂其苗裔，不武如斯！<br>泱泱大国，让其沦胥？<br><br><b>【雄狮】</b><br>睡狮今已醒，祛敌何惶惶！<br>敌寇剑及履，雄狮咆百万！<br><br><b>【尚武】</b><br>崇文尚武，胆气自生！<br>武者，非是好勇斗狠，实为振而兴国！<br><br><b>【阵亡】</b><br>男儿不尚武，河山之将亡……');
    createIntroAndTaici('ywhy_baiyuchuan', '白玉川是电视剧《莲花争霸》中的悲情反派沉稳冷静、武功高强，争强好胜，渴望权欲。人物形象改编自东方不败，最后得到莲花宝典变成女儿身。一场腥风血雨围绕他展开。他是个钟情的人，对小蝶至死不渝;他又是个不孝之人，对养父仇恨之极。此人充满争议，以至后来出现了不少白迷。', '大熊小猫', '霸天', '随遇而安', '<b>【欲壑】</b><br>金钱、权势、力量……都是我的！<br>得不到她，那就毁了她！<br>贪如火，不遏则燎原！<br>欲如水，不制则滔天！<br><br><b>【化生】</b><br>莲华妙法，玄元化生！<br>蝮螫解腕，安辨雌雄！<br><br><b>【争霸】</b><br>醒掌千秋业，醉卧美人膝！<br>一朝权在手，杀尽负我人！<br>剑已出鞘，锋之所指！<br>红莲业火，血溅飞鹰！<br><br><b>【阵亡】</b><br>机关算尽，终是枉然……');
    createIntroAndTaici('ywhy_nalanyuanshu', '纳兰元述出自《黄飞鸿之男儿当自强》，广东提督，通英文、晓谋略，利用白莲教捣乱捉拿乱党孙文等共和宣传者。武艺高强，与黄飞鸿有两次交手，首次为棍法切磋，以四门棍法对战黄飞鸿的少林棍法，未见胜负，再次交手时先是比棍法，最后在巷子里以布棍与黄飞鸿激斗，被黄飞鸿以细竹竿割喉致死。', '大熊小猫', '霸天', '随遇而安', '<b>【师夷】</b><br>师夷长技，方可制夷！<br>欲制夷患，必筹夷情！<br><br><b>【洋务】</b><br>洋人船坚炮利，我辈岂能闭关锁国！<br>邪教惑民、外夷犯国，救国之路坎坷矣！<br><br><b>【阵亡】</b><br>空负绝学，独木难支……');
    createIntroAndTaici('ywhy_xiaoxiami', '小虾米是国产经典RPG单机游戏《金庸群侠传》中默认.存档人物的名字之一，没有人知道他从哪里来，只知道是为了寻十四天书来到江湖。初期武功平平，机缘巧合下得到很多武林秘笈，加上天资极高，打遍天下无敌手，当上了武林盟主，最后又打败了当世十大高手的围攻，之后就不知所踪了。是去归隐了，还是回到了属于自己的世界？', '大熊小猫', '吃朵棉花糖', '随遇而安', '<b>【游历】</b><br>人在江湖身是客，纵情天地化鱼鸥！<br>人在江湖身是客，纵情天地化鱼鸥！<br><br><b>【野球】</b><br>一朝功成，扶摇直上！<br>天下无难事，只怕野球拳！<br><br><b>【襄助】</b><br>得君相助，如虎添翼！<br>扶危拯溺，濡沫涸辙！<br><br><b>【阵亡】</b><br>归乡之路，迢迢无期……');
    createIntroAndTaici('ywhy_shaonianbaozheng', '《少年包青天》中的包拯是宋仁宗年间庐州学子，他思维缜密，擅长推理，屡破奇案，常常为人伸冤，少时便扬名天下。其母沈氏开设青天药庐悬壶济世，闲时便替官府验尸。在破解了一件件惊心险迫、跌宕起伏的曲折案件后，包拯侦破了大内皇宫的一桩千古奇案狸猫换太子，一时间矛头直指当朝权贵，包拯面不改色，直斥真凶。', '大熊小猫', '霸天', '随遇而安', '<b>【演绎】</b><br>蛛丝由来晓因果，慧眼如炬断古今！<br>环环相扣、丝丝相连！<br>抽丝剥茧，细查入微！<br>谜题，终于解开了！<br><br><b>【翻劫】</b><br>天子犯法，当与庶民同罪！<br>其情可悯，其罪当诛！<br>尔等权贵，皆是杀人凶手！<br><br><b>【阵亡】</b><br>只要真相大白，一切无愧于心……');
    createIntroAndTaici('ywhy_liulangyue', '柳朗月是武侠剧《幻影神针》的女主角，风情万种、心硬如铁，擅长隐身术。原本出身高贵，因遇人不淑，受奸人迫害，家破人亡，自己的花容月貌亦焚毁于大火之中，易容后隐居于狼嗥谷，终身依赖冰窖维持容颜，报这血海深仇，只能交付给一手调教出来的两个徒弟去替自己完成。', '大熊小猫', '霸天', '石头星星', '<b>【幻影】</b><br>幻化千变，影逝逐形！<br>孤影无所匿，茕茕照花容！<br><br><b>【冰焰】</b><br>寒冰绝谷，方保无虞！<br>毒焰炊夭，此身已绝！<br><br><b>【阵亡】</b><br>我恨这滔天血仇，不能亲手得报……');
    createIntroAndTaici('ywhy_chunsanshiniang', '春三十娘是电影《大话西游》的人物，由蓝洁瑛饰演，原型是蜘蛛精人称玉面桃花，盘丝大仙紫霞仙子的弟子，白晶晶的师姐，蜘蛛精与师妹争吃唐僧肉，误与猪八戒转世二当家发生关系，生下转世唐三藏。法术高强，道行高深，为了自己想要的东西，不惜付出一切代价。', '大熊小猫', '霸天', '恋恋', '<b>【摧花】</b><br>桃花过处，寸草不生！<br>金钱落地，人头不保！<br><br><b>【盘丝】</b><br>千般烦恼丝，欲挣不得出！<br>想跑？哼，这天罗地网，你跑的了吗？<br><br><b>【移魂】</b><br>天长情有尽，人间最风流！<br>移……魂……大……法！<br><br><b>【阵亡】</b><br>囿于俗世，又何尝不是一种美好……');
    createIntroAndTaici('ywhy_xiaolong', '小龙是喜剧功夫电影《笑林小子之新乌龙院》中的角色，少林弟子之一，同师兄弟一起与天魔斗智斗勇。小龙擅长醉奶拳，别看他还是个乳臭未干的小子，打起架来毫不含糊，仅凭三招便将两名天魔使打得落花流水。', '大熊小猫', '霸天', '待定', '<b>【醉步】</b><br>汉钟离醉步喝奶窝心顶！<br>蓝采和单提奶瓶拦腰破！<br><br><b>【奶拳】</b><br>好奶，好奶！<br>你们真没用诶（酒嗝），倒得比我还快！<br><br><b>【阵亡】</b><br>别拦我，我……还能喝……<br><br><br><br>');
    createIntroAndTaici('ywhy_libai', '柳朗月是武侠剧《幻影神针》的女主角，风情万种、心硬如铁，擅长隐身术。原本出身高贵，因遇人不淑，受奸人迫害，家破人亡，自己的花容月貌亦焚毁于大火之中，易容后隐居于狼嗥谷，终身依赖冰窖维持容颜，报这血海深仇，只能交付给一手调教出来的两个徒弟去替自己完成。', '大熊小猫', '霸天', '付水东流', '<b>【幻影】</b><br>幻化千变，影逝逐形！<br>孤影无所匿，茕茕照花容！<br><br><b>【冰焰】</b><br>寒冰绝谷，方保无虞！<br>毒焰焮天，此身已绝！<br><br><b>【阵亡】</b><br>我恨这滔天血仇，不能亲手得报……<br><br><br><br>');
    createIntroAndTaici('ywhy_libai', '世人只知李白诗万首，酒千觞，却不知他不独是位诗仙，亦是剑术名家。在影视作品中，童年因父亲被杀，遂寄养于叔父家中。自少好习剑术，本欲助明君治天下，但由于一身傲骨，不肯屈膝于人，屡次得罪权贵，终究与这世道格格不入。', '大熊小猫', '霸天、吃朵棉花糖', '冬赫', '<b>【千觞】</b><br>青天有客来几时，我自停杯一问之！<br>昔在长安醉花柳，五侯七贵同杯酒！<br><br><b>【邀月】</b><br>举杯邀明月，对影成三人！<br>人生得意须尽欢，莫使金樽空对月！<br><br><b>【剑仙】</b><br>十步杀一人，千里不留行！<br>苍榛蔽层丘，凤鸟鸣西海！<br>纵死侠骨香，不惭世上英！<br>精光射天地﹐雷腾不可冲！<br><br><b>【阵亡】</b><br>安能摧眉折腰事权贵……<br><br><br><br>');
    createIntroAndTaici('ywhy_chenzhen', '陈真是中国清末武术家霍元甲的弟子，本是一个名不见经传的精武门弟子，而影视作品版陈真被塑造成身手高超的民族英雄，且在霍元甲死后，从日本回国来为师父申冤正名。他完全是一个普通男人通过自我奋斗，走向成功之路的精神偶像。', '大熊小猫', '霸天', '冬赫', '<b>【精武】</b><br>枯木浮海，虽巨浪不可御！<br>精武之道﹐首在气节！<br><br><b>【汉魂】</b><br>寸土寸血﹐保我河山！<br>华夏儿郎﹐铸我汉魂！<br><br><b>【阵亡】</b><br>济济华冠﹐竟被列强所欺……<br><br><br><br>');
    createIntroAndTaici('ywhy_xiaochou', '愚人节专属2022<br>&nbsp;&nbsp;&nbsp;&nbsp;小丑是美国DC漫画旗下的反派，其身世成谜，是哥谭市最危险的罪犯，甚至不少反派都对他产生畏惧。智商极高却举止癫狂，犯罪行为常常无法预测，所到之处总伴随着混乱、无序以及令人不寒而栗的狂笑声。小丑喜欢通过制造痛苦和死亡向世人展示生命的无意义。小丑是蝙蝠侠的宿敌，他将与蝙蝠侠对抗作为乐趣。', '大熊小猫', '霸天', '狗子', '<b>【王牌】</b><br>生活如此乏味，不如玩场游戏吧！<br>伙计们，这场游戏的主题，是厮杀，哈哈哈……<br>Why so serious？<br>妈妈说，人要一直微笑。<br>喔，人总是嫉妒更幸运的人。<br>是我疯了，还是这世界疯了？<br>我的人生，充满负面情绪！<br><br><b>【恶剧】</b><br>疯狂就像地心引力，轻轻一推便跌入深渊！<br>带给你微笑是我的使命，你为什么不笑？<br><br><b>【阵亡】</b><br>每个人的心里，都住着一个小丑……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhangjunbao', '张君宝是《太极张三丰》里的主角，原本只是少林寺藏经阁里一个打杂厮役小仆，因为和董天宝偷学师伯武功犯戒被逐出少林。后董天宝为了飞黄腾达而变得不择手段，心灰意冷的张君宝在执友的开导下逐渐领悟道法的奥妙，终创造出以柔克刚的太极拳法，于大军阵前击杀已经灭绝人性的天宝。', '大熊小猫', '霸天', '待定', '<b>【修缘】</b><br>行通念达仙抚顶，半缘修道半缘君！<br>缘生缘灭土归土，缘灭缘生尘归尘。<br><br><b>【博览】</b><br>此经甚妙，容我细细观之！<br><br><b>【洗髓】</b><br>易经换骨，洗髓生筋！<br><br><b>【藏经】</b><br>千般玄妙理，尽蕴道心中！<br><br><b>【通脉】</b><br>劲以曲蓄而有余，脉以灵通而不绝！<br><br><b>【道法】</b><br>道法阴阳，衍化万物！<br>万物负阴而抱阳，冲气以为和。<br><br><b>【顿悟】</b><br>一朝顿悟法，十载寒暑功！<br>三乘五性，顿悟方知！<br><br><b>【太极】</b><br>一气三清成大道，执取龟蛇颠倒诀。<br>无相无形潜造化，有门有户在乾坤。<br><br><b>【阵亡】</b><br>天公劝饮醒醐酒，复命归根返本原……<br><br><br><br>');
    createIntroAndTaici('ywhy_direnjie', '狄仁杰是系列电视剧及电影的主角，被称为中国第一神探、护国良相。狄仁杰文武双全，有独到的办案风格：重效率而轻缛节，讲操守而又善变通，重调查推理，而不主观妄断。“断狱寸心间，千古费详猜。生死决于我，能不谨慎哉！”是他居官断狱、问理刑名自诫之诗。', '大熊小猫', '吃朵棉花糖', '水蓝', '<b>【奇案】</b><br>此案需顺藤摸瓜，切勿打草惊蛇！<br>此祸定是人为，安有神鬼作祟！<br>有人装神弄鬼、故弄玄虚矣！<br><br><b>【神断】</b><br>因岂执于是非；果能断于人常！<br>法网难逃，来人，将此獠拿下！<br><br><b>【销案】</b><br>众口铄金，积毁销骨，畏于人言安敢称臣？<br>社稷累卵，风雨飘摇，岂能因私废公！<br>此事牵连甚广，不可深究！<br><br><b>【阵亡】</b><br>真相，永不磨灭……<br><br><br><br>');
    createIntroAndTaici('ywhy_shifeixuan', '师妃暄是《大唐双龙传》中慈航静斋继承人超尘脱俗，江湖人称慈航仙子。其武功造诣接近最高层次的剑心通明。她是隋末乱世中的明灯，肩负着一个神圣使命--保护“和氏璧”。相传得“和氏璧”者兼得天下，，所以割据的群雄皆欲得之，而师妃暄就要觅得合适的人选，将玉璧相赠。', '木木枭', '霸天', '一叶米粥', '<b>【剑心】</b><br>寒山凌白羽，辟易绝埃尘！<br>自羡幽居乐，不为世中人。<br>花飞不解语，月落晓星沉。<br>玉泓秋水澈，云屏竹影深！<br>情起情消皆为相，我心无相证红尘！<br>缘深无所往，挥剑斩情关！<br>三尺青锋诛邪祟，慈航普度救苍生！<br>剑心澄澈，法通世明。<br><br><b>【赠璧】</b><br>昆仑毓秀世无双，百转精魄出玄黄！<br>望君持此玉璧，解救天下苍生！<br><br><b>【阵亡】</b><br>唯愿来世无烽火，朝云暮雨伴君侧……<br><br><br><br>');
    createIntroAndTaici('ywhy_niexiaoqian', '聂小倩是蒲松龄《聊斋志异》及其影视衍生作品中的人物形象，是树精黑山老妖姥姥所养的用来吸食人间男子精魄的的女鬼，其良性未泯，后来真心爱上书生宁采臣，为了保全其周全不惜与黑山老妖为敌，在与黑山老妖的决战中灰飞湮灭。聂小倩的形象反映了旧社会中敢于向封建教条反抗的勇敢形象。', '大熊小猫', '霸天、藏海', '蓦焱', '<b>【采阳】</b><br>芙蕖憔悴，暮云黯淡！<br>为伊荣落，愁过朝朝！<br><br><b>【幽灵】</b><br>几番流光缘未尽，无数相思难载愁！<br>幽冥不可诘，宁忍芳华误！<br><br><b>【还魂】</b><br>余生无他，空为虚度！<br>纵失百年苦修，也定要救他还阳！<br><br><b>【阵亡】</b><br>人鬼殊途，你我终是有缘无分……<br><br><br><br>');
    createIntroAndTaici('ywhy_yanchixia', '燕赤霞，电影《倩女幽魂》系列和《画中仙》中的主要人物。外貌好似钟馗，还颇有些酒神气质，法术也很高强。他性格奔放，略有些童心未泯，他视妖魔为敌，甚至偶尔还会与它们斗气。在《聊斋志异》的原著中，燕赤霞并非是一个癫狂的大汉，则是一个外貌清秀，年龄比宁采臣更小，热爱斩妖除魔的书生。', '棉花糖', '棉花糖', '小林', '<b>【缚魂】</b><br>人和妖一样，都有好坏之分！<br>可怕的不是皮囊，而是皮囊包裹的那颗心！<br>天若有情天亦老，可怜越老越多情！<br><br><b>【皓天】</b><br>金身不灭，元神出窍！<br>天地无极，乾坤借法！<br><br><b>【伏妖】</b><br>有我燕赤霞在，绝不让你涂炭生灵！<br>皆因世人无知，才被你趁虚而入！<br><br><br><b>【死亡】</b><br>地狱不空，誓不得道……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_dongtianbao', '董天宝是电影《太极张三丰》中的悲剧反派，他是张君宝的同门师弟，因偷功和君宝一同犯戒被逐出少林寺。他身份卑微却胸怀远志，为了攀附权贵不惜杀害自己心爱的女人和出卖手足兄弟。他性情残暴，滥杀无辜，终在大军阵前被君宝以太极拳法击杀。', '大熊小猫', '霸天', '冬赫', '<b>【偷功】</b><br>他日艺成，必建奇功！<br>神功傍身，宝剑在手！<br>此招，你可识得？<br>天下奇功，皆为我用！<br><br><b>【擢升】</b><br>我命由我，不由天！<br>拦我路者，格杀勿论！<br>虽为蝼蚁身，当怀鸿鹄志！<br>蚍蜉虽小，亦可撼树！<br>蝼蚁尚有功成日，欲与诸公试比高！<br>雄心万里长，只身荡寰宇！<br><br><b>【阵亡】</b><br>大丈夫追名逐利，何错之有……<br><br><br><br>');
    createIntroAndTaici('ywhy_songci', '宋慈是我国宋代杰出的法医学家，被称为“法医之父”、曾任广东、湖南等地提点刑狱官，办案着重实地检验。著有《洗冤集录》五卷，是我国第一部糸统的法医学专著，也是世界最早的法医学专著，广传国内外，对于医学的发展有重大贡献。根据其改编的多部断案类影视作品均为影迷们津津乐道、赞不绝口。', '大熊小猫', '吃朵棉花糖', '水蓝', '<b>【验骨】</b><br>活人会说谎，尸体却不会！<br>夫有死者，穷以验骨方得去伪存真！<br><br><b>【灭迹】</b><br>凡人之所为，必有迹可循！<br>天网恢恢，疏而不漏！<br>毁尸灭迹者，当以帮凶论罪！<br>索引痕迹，水落石出！<br><br><b>【洗冤】</b><br>大辟之狱，始于检验！<br>每念狱情之失，多起于发端之着、定验之误！<br><br><b>【阵亡】</b><br>天地扬威，镜雪沉冤……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhaopan', '赵盘是《寻秦记》中的角色，刚出场时为纨绔子弟、市井无赖，后经项少龙调教，变得懂事和善良，最终顶替嬴政而即位为秦国大王，经过一系列的宫廷斗争，大起大落，他开始变得心狠手辣，攻于心计，最终铲除了嫪毒和吕不韦等乱党势力开始亲政，最终君临天下统一六国。', '大熊小猫', '霸天', '水蓝', '<b>【覆陷】</b><br>此人口蜜腹剑，实乃心腹大患！<br>群雄逐鹿，谁主沉浮？<br>咫尺之路，远于天涯！<br>大丈夫，岂能偏安偏安一隅？<br><br><b>【扫合】</b><br>秦王扫六合，虎视何雄哉！<br>普天之下，莫非王土，率土之滨，莫非王臣！<br><br><b>【登殿】</b><br>尔等从龙之功，朕自有封赏！<br>挥剑决浮云，诸侯尽西来！<br><br><b>【归秦】</b><br>明断自天启，大略驾群才！<br>六国来抗有何惧，今天命当归我大秦！<br><br><b>【大统】</b><br>万邦往属尽归吾，千秋霸业谈笑间！<br>狼烟熄尽，一统江山！<br><br><b>【阵亡】</b><br>朕，终未寻得长生之法……<br><br><br><br>');
    createIntroAndTaici('ywhy_hongfunv', '红拂女出自唐人小说《虬髯客传》，与李靖和虬髯客并称为风尘三侠。本名张出尘，杨素府中家妓，因手持红拂而得名机智果敢、风姿飒爽，慧眼视出李靖与虬髯客的不凡，嫁与李靖为妻，与虬髯客义结金兰。在李靖造访杨素府后，当夜即投奔李靖，丝萝非独生，愿托良乔，与李靖共结夫妇。', '大熊小猫', '霸天', '付水东流', '<b>【识珠】</b><br>风尘何堪慧眼炬，明珠蒙尘岂不知！<br>卿本乱世豪杰身，落在承平蒙轻尘！<br><br><b>【夜奔】</b><br>雄才隐布衣，红拂伴君旁！<br>丝萝不独生，愿倚参天木！<br>患难誓相随，苍天可鉴之！<br><br><b>【阵亡】</b><br>李郎，奴家不能再随你天涯海角了……<br><br><br><br>');
    createIntroAndTaici('ywhy_wusong', '武松是《水浒传》中的人物。血溅鸳鸯楼后，为躲避官府抓捕，改作头陀打扮，江湖人称行者武松。曾在景阳冈上空手打死一只吊睛白额虎，因此武松打虎的事迹在后世广为流传。后归顺梁山百单八将之一，坐第十四把交椅，上应天伤星，后受朝廷招安随宋江征讨辽国等，在征方腊过程中被飞刀所伤，痛失左臂，被封为清忠祖师。州六和寺病逝。', '大熊小猫', '霸天、假象', '冬赫', '<b>【酣醉】</b><br>小二（打嗝声），上酒！<br>谁说三碗不过冈！<br><br><b>【搏虎】</b><br>区区大虫，有何可惧？<br>四海驰骋九州横，醉酒踏冈闻虎声！<br><br><b>【阵亡】</b><br>天下贪官，何异虎狼……<br><br><br><br>');
    createIntroAndTaici('ywhy_liyuanfang', '人民警察节专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;李元芳是《神探狄仁杰》中的虚构人物，祖籍河北，长于凉州。他性情刚烈，武功独步天下，善使幽兰剑、链子刀等兵器和各种暗器。他的胆识过人，却绝非莽夫，当狄仁杰不在时，他更能表现出超强的判断能力。李元芳义薄云天，对狄仁杰忠心耿耿，二人情同父子。', '大熊小猫', '霸天', '谢声繁', '<b>【链刀】</b><br>宝刀出鞘，刀刀夺命！<br>披枷带锁之人，徒行尸走肉耳！<br><br><b>【缉凶】</b><br>镣铐加身，还不伏法？<br>律法如山，杀人偿命！<br><br><b>【阵亡】</b><br>大人，属下先行告退……<br><br><br><br>');
    createIntroAndTaici('ywhy_hongmao', '儿童节专属·2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;虹猫是中国武侠动画《虹猫蓝兔七侠传》及其衍生作品中的主人公，七剑之首“长虹剑”传人，继承了父亲白猫的一身绝艺，武艺超群，坚强勇敢，足智多谋，英俊潇洒，帅气中又透出不可比拟的气魄，一袭白衫更衬出他的气质。承担着团结七剑传人，消灭魔教的重任。为了达到自己理想的彼岸而坚持不懈的努力，砥砺意志破除万难。', '咸鱼', '咸鱼', '荀冬卿', '<b>【侠道】</b><br>心中无我，无欲无求！<br>自古正邪不两立！<br><br><b>【旋风】</b><br>无所畏惧，方可收发自如！<br>定要群魔无处躲！<br><br><b>【长虹】</b><br>无怨无悔，方能人剑合一！<br>长剑破空，神临于世！<br>男儿有胆气，仗剑走天涯！<br><br><b>【阵亡】</b><br>蓝兔，是生是死，我们都在一起……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhizunbao', '七夕专属·2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;至尊宝是周星驰经典电影《大话西游》中的角色，是孙悟空的前世。转世为人的他沦陷在感情的漩涡中不能自拔，无意间获得月光宝盒，企图穿越时光挽救爱人白晶晶。在遇到给他三颗痣的紫霞仙子之后，成功脱胎转世成为孙悟空，肩负着护送唐僧西行的重任。戴上紧箍咒的他不能再沾人世间半分情份，否则越收越紧的紧箍咒只会让他愈加痛苦。', '大熊小猫', '落影逝尘', '千狐', '<b>【魔盒】</b><br>般若波罗密！<br>月光宝盒，时光穿梭！<br><br><b>【转世】</b><br>紧箍头上戴，紫霞心中留！<br> 一入佛门六根净，七色云彩别红尘！<br><br><b>【情劫】</b><br>红尘自有痴情者，莫笑痴情太痴狂！<br> 人有七情六欲，物有百转轮回！<br><br><b>【阵亡】</b><br>曾经有份真挚的爱情，我没有珍惜……<br><br><br><br>');
    createIntroAndTaici('ywhy_zixia', '七夕专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;紫霞仙子是周星驰电影《大话西游》中的角色，由朱茵饰演。紫霞与青霞本是如来佛祖座前日月神灯的灯芯，白天是紫霞，晚上是青霞，二人虽然同一肉身却仇恨颇深。紫霞有一誓言，只要谁能拔出她手中的紫青宝剑，就是她的意中人，因此举而受室仙界的追杀。在人间，紫霞、至尊宝、白晶晶、孙悟空上演了一场交错时空的凄美绝恋。朱茵饰演的紫霞仙子已深入人心，当年那段真挚爱情，成为仙界传奇。一部经典的无厘头喜剧，成就了紫霞仙子与至尊宝的浪漫爱情，也成为了一代人心中永远的经典。', '大熊小猫', '棉花糖', '木兰幽洛', '<b>【仙履】</b><br>不信你能拔得出我这紫青宝剑！<br>神仙也好，妖怪也罢，剑只有我的意中人能拔得出！<br>上天既然安排他拔出紫青宝剑，他一定是个不凡之人！<br>哇，跑都跑得那么帅，我真幸福！<br><br><b>【紫玲】</b><br>奇技淫巧，也想拦住本仙子！<br>紫金铃铛，催情迷魂！<br><br><b>【定情】</b><br>就像我的驴一样，给你盖个章，以后你就是我的人了！<br>他会在万众瞩目下出现，身披金甲圣衣，脚踏七色云彩！<br>我的意中人是个盖世英雄，有一天他会脚踏七彩祥云来娶我！<br>整个山谷都我的，包括你！<br><br><b>【绝恋】</b><br>我在你心里，留下了一样东西。<br>我们大家，立刻开始这段感情吧，至尊宝！<br>姻缘呢，上天安排的最大嘛！<br>不能跟喜欢的人在一起，就算让我做玉皇大帝也不会开心哪！<br><br><b>【死亡】</b><br>我猜中了开头，却猜不中这……结局……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_niefeng', '聂风是香港漫画《风云》及其改编电影中的主角之一，他天赋异禀，拥有超乎常人的武学潜力，是江湖中人人称颂的武林奇才。聂风性格正直、豪迈，深受武林同道的敬重和爱戴。电影中的形象英俊潇洒，武艺超群。身怀家传绝学“风神腿”，腿法迅捷无比，威力巨大。他与步惊云一同成长，两人情同手足，共同经历了无数的江湖风波和生死考验。聂风的人生充满了坎坷和挑战。他曾一度失去记忆，更在“绝世好剑”的影响下入魔，成为武林的一大祸害。但在步惊云的帮助下，聂风最终找回自我，摆脱了心魔的困扰。他与步惊云、第二梦等人一同抗击强敌，捍卫武林的和平与正义。', '大熊小猫', '霸天', '一路向北', '<b>【冰心】</b><br>一点寒光万丈芒，屠戮天下又何妨！<br>心若冰清，天塌不惊；万变尤定，神怡气静!<br>冰封万重山，寒冻九宵云！<br>冰心诀下，心如止水！<br><br><b>【风神】</b><br>无风云不动，云动心如风！<br>水淹大佛膝，火烧凌云窟！<br><br><b>【菩提】</b><br>生而绝世之人，总有绝世之命运！<br>千年修道，不如一朝入魔！<br>人间正道，荆棘满途。<br><br><br><b>【死亡】</b><br>浮世无缘，情难到老，倾城泣别，两皆失声……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_xiongba', '雄霸是香港漫画《风云》及其改编电影中的反派角色，天下会的帮主，武功盖世，野心勃勃，一心想成为天下至尊。他心狠手辣，为实现霸业，不惜铲除异己，广收门徒。曾得到泥菩萨的预言，得知自己的成功与否都与“风云”有关，于是收养聂风和步惊云为徒，传授他们绝世武功，希望借助他们的力量完成自己的雄图。然而雄霸的野心和残暴最终导致了他的失败。他与风、云之间的师徒情义也变得错综复杂，充满了背叛和复仇。雄霸的形象深刻地体现了权力的腐蚀和人性的扭曲。他虽然拥有至高无上的权力和武功，但他的残暴使他不得人心。雄霸的一生，是枭雄的传奇，也是悲剧的写照。', '大熊小猫', '霸天', '弹指间', '<b>【冰心】</b><br>金麟化龙，风云色变！<br>我雄霸向来逆天改命，魔又奈我何？哈哈哈……<br>天下英才，尽入彀[gòu]中！<br>风云际会，天命所归！<br><br><b>【风神】</b><br>龙脉在手，天下在望！<br>九宵龙吟，天下易主。<br>雄图霸业，一统江湖！<br><br><b>【菩提】</b><br>归元聚气，策定乾坤！<br>三——分——归——元——气！<br><br><br><b>【死亡】</b><br>成也风云，败也风云……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_xiaowei', '中元节专属·2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;小唯是根据蒲松龄《聊斋志异》改编的《画皮》系列电影中的九尾灵狐，来源于原著中披着人皮掏吃人心的恶鬼。为了维持妖气和生命，她不得不幻化成为绝世美女四处魅惑男人，剜心而食。小唯是该系列电影让人无法忘怀的女主角，她为爱而生，为爱而死，最终为情放弃一切。', '大熊小猫', '落影逝尘', '一叶米粥', '<b>【剜心】</b><br>我要你的心，你给吗？<br>用你的心，来换我的皮！<br>我是妖，不吃人心，我会老的！<br><br><b>【画皮】</b><br>画皮画骨，难画心！<br>你究竟爱我，哪副皮囊？<br>你爱我的心，还是我的皮？<br><br><b>【阵亡】</b><br>爱的感觉，就是疼……<br><br><br><br>');
    createIntroAndTaici('ywhy_taisen', '迈克·泰森曾获世界最年轻重量级拳击冠军，被认为是世界上最好的重量级拳击手之一。在其全盛时期，他以毁灭性的风格多次击败了著名的对手，一度是最具威胁性的拳击手之一。但其事业前途却因个人问题、缺乏训练、两次收押而中断。2020年5月，泰森宣布复出。', '大熊小猫', '落影逝尘', '狗子', '<b>【拳王】</b><br>中国武术，果然不堪一击！<br>在绝对力量面前，你如何反抗？<br><br><b>【踢馆】</b><br>这是力量和力量的对决！<br>高手过招，点到为止！<br><br><b>【阵亡】</b><br>中华武术，果然名不虚传……<br><br><br><br>');
    createIntroAndTaici('ywhy_nezha', '哪吒是神话小说《封神演义》中的角色，为陈塘关总兵李靖之子，其母怀胎三年零六个月才将其诞下。哪吒天生神力，曾大闹东海击杀龙王三太子导致陈塘洪涝不断。为了赎罪，哪吒割骨剔肉，后太乙真人用莲花为其重塑真身，获得三头六臂法力的哪吒位列仙班，携四大法器斩妖除魔。', '大熊小猫', '落影逝尘', '无忆CHENG', '<b>【闹海】</b><br>翻江倒海，直捣龙宫！<br>叱咤四海，威慑九幽！<br><br><b>【涅磐】</b><br>割肉还母，剔骨还父！<br>弟子叩谢太乙真人再生之恩！<br><br><b>【分身】</b><br>长缨在手，敢缚苍龙！<br>乾坤借法诛妖邪，风火叱咤除鬼魅！<br><br><b>【阵亡】</b><br>父母生养之恩，孩儿未敢忘记……<br><br><br><br>');
    createIntroAndTaici('ywhy_jichang', '姬昌是魔幻电影《封神第一部》中的角色，是体恤百姓、忧思天下的西岐诸侯。商王无道，致使连年大旱，五谷欠收，饿殍遍野。姬昌的二儿子姬发自小在朝歌做质子，他算出天机，到朝歌面见殷寿时被打入深牢，更令得长子伯邑考惨死，从此埋下了讨伐商王的种子。', '大熊小猫', '霸天', '末生', '<b>【悯农】</b><br>天下共苦、纷战不休，百姓流离失所！<br>殷王无道、天怒人怨，诸侯揭竿而起！<br>恸天下苍生，食不果腹、居无定所！<br><br><b>【占卦】</b><br>祈风调雨顺，佑西岐子民！<br>上窥天道，下俯苍生，唯独不能算自己。<br>扶乩观天象，龟甲测天机！<br><br><br><br><b>【死亡】</b><br>人心向背，王朝更替……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_sumu', '电影《八角笼中》中的主角苏木，其原型是来自四川省阿坝州苏木达尔基，是一名冲出大山走向世界擂台的格斗冠军。苏木自小是孤儿，与姐姐生活在大泷山，与伙伴们靠打劫为生，年纪轻轻就充满了迷茫，看不到人生的方向。遇到王宝强饰演的向腾辉后，命运发生改变，爱上了格斗。在经历了一系列曲折的事件后，苏木站上世界擂台并摘取冠军。', '大熊小猫', '霸天', '岛主', '<b>【迷惘】</b><br>打水漂的石头终会沉底，这就是我的命！<br>人生就像八角笼，四面八方都是网！<br><br><b>【破笼】</b><br>困兽犹斗，破笼而生！<br>羁鸟恋旧林，池鱼思故渊！<br>披荆斩棘，逆向而行！<br>有的鸟是关不住的，因为它们属于天空。<br><br><b>【反杀】</b><br>走出大泷山，冲向全世界！<br>总有一天，我要站上全世界最大的擂台！<br><br><b>【死亡】</b><br>虎子，我们，胜利了……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_xiangshaolong', '项少龙是黄易《寻秦记》中的男主角，是一位来自二十一世纪的特警精英。在一次尖端科技实验中意外穿越回到秦国，他感叹二十一世纪的中国发达美好，不想历史的洪流就此被改变，于是匡扶嬴政一扫六国，统一华夏，不惜眼看儿子项羽败北，一举奠定了华夏文明的版图基础。', '大熊小猫', '落影逝尘', '无忆CHENG', '<b>【穿越】</b><br>谁能逆转，这历史洪流？<br>历史泱泱岂能改，天命昭昭不可违！<br>历史变迁，朝代更迭，岂是一人所为？<br><br><b>【匡正】</b><br>泱泱中华，万古江河；如日之升，如月之恒！<br>乱臣贼子，休要坏我神州龙运！<br><br><b>【赋秦】</b><br>唯愿君臣千万世，六合同心归华夏！<br>六国归秦，一统中华！<br><br><b>【阵亡】</b><br>此生无悔入华夏，来世还做中国人……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhuiming', '追命原名崔略商，是温瑞安武侠《四大名捕》系列中的主角之一,排行第三，带艺拜师诸葛正我。出生即带内伤，因药物副作用使其上身不着力故另辟蹊径，练得精妙腿法，其双腿犹如可硬可软、可长可短的兵器。追命擅长追踪术，能快速准确的测知目标藏匿之处，令目标无处遁形。', '大熊小猫', '落影逝尘', '狗子', '<b>【摄命】</b><br>无敌旋风，夺魂索命！<br>草菅人命，法不容情！<br><br><b>【追踪】</b><br>尔等宵小之辈，哪里逃！<br>你已死路一条，还不束手伏法？<br><br><b>【阵亡】</b><br>得之我幸，失之我命……<br><br><br><br>');
    createIntroAndTaici('ywhy_mengxinghun', '孟星魂是古龙《流星蝴蝶剑》中的主角。性格孤僻，幼年被快活林主人高老大收养，之后被培养成一个绝顶杀手。他不喜欢杀人，但为报高老大的救命之恩，为其卖命已经成了他的生存方式。他每次杀人后都感到很恶心，却摆脱不了这个宿命。他的在执行最后一个任务时，改变一生，从此摆脱了杀手生涯，和心爱的女人孙蝶隐居。', '大熊小猫', '落影逝尘', '高丸丸', '<b>【绝杀】</b><br>长痛不如短痛，我会给你个痛快的！<br>你已四面无援，还是乖乖受死吧！<br><br><b>【封剑】</b><br>干完这一票，我便金盆洗手！<br>这刀口舔蜜的日子，我早已厌倦！<br><br><b>【阵亡】</b><br>这杀人如麻的日子，何时是个头……<br><br><br><br>');
    createIntroAndTaici('ywhy_lixunhuan', '李寻欢是古龙《多情剑客无情剑》及衍生作品中的人物。曾是朝廷殿试探花，故人称小李探花。后厌倦功名，弃官归隐。绝学是飞刀，例不虚发，在百晓生所著《兵器谱》上排名第三。回归后牵扯入金丝甲及♣️️盗案中，再遇故人。几翻转折，最终击杀《兵器谱》上排名第二的上官金虹。', '大熊小猫', '落影逝尘', '千狐', '<b>【飞刀】</b><br>出手一刀，例不虚发！<br>你，能快得过我的飞刀吗？<br><br><b>【归隐】</b><br>刀断愁肠结，逢君已陌路！<br>这天下，终究不是我想要的天下！<br><br><b>【阵亡】</b><br>美人迟暮，英雄末路，何等悲哀……<br><br><br><br>');
    createIntroAndTaici('ywhy_guxizhao', '顾惜朝是温瑞安小说《四大名捕逆水寒》中的人物，因出生寒微，一生壮志难酬以至心性扭曲，为了飞黄腾达投靠权贵，变得狠辣决绝，背叛连云寨，陷害追杀戚少商。他具备高超的军事才能，著有兵收《七略》，是一个充满悲情色彩又令人同情的反派角色。', '大熊小猫', '落影逝尘', '狗子', '<b>【困蹇】</b><br>大道如青天，我独不得出！<br>长空砺剑难酬志，空洒热血英雄胆！<br><br><b>【七略】</b><br>你有千般计，我有过墙梯！<br>你，如何逃出我的五指山？<br><br><b>【伐决】</b><br>尔等皆是七尺汉，为何落草为贼寇！<br>斩草除根，永绝后患！<br><br><b>【阵亡】</b><br>我，终究是输了么……<br><br><br><br>');
    createIntroAndTaici('ywhy_baozupo', '包租婆是周星驰电影《功夫》中的经典角色，她表面上是个刻薄寡恩的老板娘，总是对租客们指指点点，出言不逊，实则是一位大隐于市绝世高手。包租婆性情泼辣，总是带着嘲讽的表情站在一旁抽烟，嘴上不饶人实则充满正义感。曾以狮吼功功击败六指琴魔等人。', '大熊小猫', '落影逝尘', '', '<b>【狮吼】</b><br>跟老娘比嗓门儿，活腻了吗！<br>反了反了，都给我闭嘴！<br><br><b>【催租】</b><br>你们这帮歪瓜裂枣，还不赶紧交租？<br>连房租都交不起，活该一辈子干苦力！<br><br><b>【阵亡】</b><br>扫黑除恶，是我辈使命……<br><br><br><br>');
    createIntroAndTaici('ywhy_abao', '阿宝是《功夫熊猫》中的主角，是一名被鸭爸爸收养的孤儿，从小就有一个大侠之梦，可是他肥胖臃肿，行动迟缓，根本就不是习武的料子。机缘际会之下得到龟师傅的指点，他一步步领悟到了武侠的真谛并成长为一代大侠，击败了黑豹太郎、天煞等诸多反派。', '大熊小猫', '落影逝尘', '狗子', '<b>【无极】</b><br>嘿嘿，我这是乱拳打死老师傅！<br>我八窍已通七窍，尚有一窍不通！<br><br><b>【无量】</b><br>昨日已如流水去，未来遥遥不可知！<br>明日未可知，还是先吃饱吧！<br><br><b>【神龙】</b><br>想要入侵中原大地，先过我神龙大侠这关吧！<br>真的武士，决不退缩！<br><br><b>【阵亡】</b><br>保护中原大地，我做到了……<br><br><br><br>');
    createIntroAndTaici('ywhy_baisuzheng', '端午节专属2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;白素贞是中国古典神话爱情故事《白蛇传》中的主角，是一条修炼千年的蛇仙。因前世姻缘，她下凡和许仙结为夫妻，在庆祝端午佳节时一时贪杯饮下三杯雄黄酒现出原形将许仙吓得魂飞魄散。白素贞法力高强，其最值得称道的法术是九天玄元大法，曾以此法为死去的手下白福重塑肉身。', '大熊小猫', '落影逝尘', '一壶中', '<b>【酒殇】</b><br>酒入愁肠迷本性，雄黄害我现原形！<br>痴人醉饮雄黄酒，上穷碧落下黄泉！<br><br><b>【玄元】</b><br>此人阳寿未尽，还望阎君网开一面！<br>汇天地之灵气，取日月之精华！<br><br><b>【阵亡】</b><br>相公，今生缘分已尽……<br><br><br><br>');
    createIntroAndTaici('ywhy_ganshijiumei', '甘十九妹是萧逸武侠小说《甘十九妹》的女主角，原名甘明珠，是一位纵横天下的奇女子，有着盖世神功和旷世姿容，本性善良爱憎分明。武功绝世，三大绝杀剑招挥手间可决人生死，七步断肠红和含沙射影更让江湖人闻风丧胆。其与宿敌尹剑平惜惜相惜的爱情故事令人扼腕。', '大熊小猫', '咸鱼', '一叶米粥', '<b>【绝剑】</b><br>急剑如潞，先诛岳阳！<br>独身一剑洗江湖，凭栏观鞘承影出！<br><br><b>【断肠】</b><br>气毁丹田五脏红，棠梨落尽送君终！<br>沈园梦碎秋茶凉，恨织情蛊七步殇！<br><br><b>【阵亡】</b><br>若非宿命难逃，你会娶我吗……<br><br><br><br>');
    createIntroAndTaici('ywhy_baolaiying', '应无求，原名包来硬。原本胆小懦弱，为了保护如忆甘愿给劫匪下跪、饮尿求生。但如忆嫁给了锦衣卫离歌笑，后被严嵩害得惨死。自此包来硬黑化并投靠严嵩，卑躬屈膝。严嵩给包来硬改名应无求，让他做锦衣卫指挥使，并处处与离歌笑等人作对。可实际上，做这一切都是为了给如忆报仇，他要让如忆看到，他不是窝囊废。他也不是真的要杀离歌笑，而是想赢他，想让离歌笑承认，亲人爱人比正义更重要，应无求的选择才是正确的。在和和离歌笑决斗的时候，应无求心满意足死在离歌笑手里，只为了更早去见到如忆……', '大熊小猫', '棉花糖、霸天', '星空下木头', '<b>【情癫】</b><br>如忆……如忆！<br>相见争如不见，有情何似无情！<br>相见时难别亦难，东风无力百花残！<br>生当复来归，死当长相思！<br><br><b>【苟活】</b><br>大仇未报，岂敢撒手人寰！<br>暴罹[lí]此冤辱，苟活何所求！<br>如忆，报了这血海深仇…我再来见你！<br><br><b>【滔势】</b><br>锦衣御天下，伏魔定乾坤！<br>屈身数载，终报血仇！<br><br><b>【仇焰】</b><br>袖中出剑秋水流，血点斑斑新报仇！<br>他朝严嵩[sōng]悬首日，一缕轻烟慰亡魂！<br>一朝失势，人不如狗，哈哈哈！[嘲讽严嵩]<br><br><b>【死亡】</b><br>离歌笑，你输了…我比你更早…见到如忆……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_yingwuqiu', '应无求，原名包来硬。原本胆小懦弱，为了保护如忆甘愿给劫匪下跪、饮尿求生。但如忆嫁给了锦衣卫离歌笑，后被严嵩害得惨死。自此包来硬黑化并投靠严嵩，卑躬屈膝。严嵩给包来硬改名应无求，让他做锦衣卫指挥使，并处处与离歌笑等人作对。可实际上，做这一切都是为了给如忆报仇，他要让如忆看到，他不是窝囊废。他也不是真的要杀离歌笑，而是想赢他，想让离歌笑承认，亲人爱人比正义更重要，应无求的选择才是正确的。在和和离歌笑决斗的时候，应无求心满意足死在离歌笑手里，只为了更早去见到如忆……', '大熊小猫', '棉花糖、霸天', '星空下木头', '<b>【情癫】</b><br>如忆……如忆！<br>相见争如不见，有情何似无情！<br>相见时难别亦难，东风无力百花残！<br>生当复来归，死当长相思！<br><br><b>【苟活】</b><br>大仇未报，岂敢撒手人寰！<br>暴罹[lí]此冤辱，苟活何所求！<br>如忆，报了这血海深仇…我再来见你！<br><br><b>【滔势】</b><br>锦衣御天下，伏魔定乾坤！<br>屈身数载，终报血仇！<br><br><b>【仇焰】</b><br>袖中出剑秋水流，血点斑斑新报仇！<br>他朝严嵩[sōng]悬首日，一缕轻烟慰亡魂！<br>一朝失势，人不如狗，哈哈哈！[嘲讽严嵩]<br><br><b>【死亡】</b><br>离歌笑，你输了…我比你更早…见到如忆……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_honghaier', '儿童节专属2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;红孩儿是牛魔王和铁扇公主之子，住在号山枯松涧火云洞。婴儿大小，妖童外型，唇若涂朱，身着锦绣战裙，使丈八火尖枪。在火焰山修行三百年而炼成三昧真火，十分了得。为了得到可以让人长生不老的唐僧肉，假扮成受难的孩童自缚手脚吊在树上引唐僧师徒搭救，被孙悟空识破。', '大熊小猫', '落影逝尘', '荀冬卿', '<b>【圣婴】</b><br>日灼炎炎火云洞，平天圣婴显威风！<br>诸天神佛，还有哪个为我祭枪？<br>先灭菩萨金刚，再焚如来老儿！<br>吞吐风雷红云卷，燃平四海压火德！<br><br><b>【鬼胎】</b><br>金蝉冰肌玉骨，胜过瑶池蟠桃！<br>望几位师父慈悲，救我性命！<br><br><b>【阵亡】</b><br>弟子，愿意皈依我佛……<br><br><br><br>');
    createIntroAndTaici('ywhy_boya', '春节专属2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;源博雅是改编自梦枕貘系列小说《阴晴师》的电影《晴雅集》中的男主角，平安时代贵族，为皇室之后，是一名武士。博雅孤傲爽直，擅使弓箭，例无虚发。在与晴明共战祸蛇的过程中，挥洒热血唤醒四大守护神之一的朱雀神，更化身为晴明的式神与之并肩战斗。', '大熊小猫', '落影逝尘', '无忆', '<b>【飞矢】</b><br>百发百中，箭无虚发！<br>烈弦一开，魍魉难逃！<br><br><b>【结界】</b><br>以吾之血肉，唤雀神降临！<br>四神结界，必斩祸蛇！<br><br><b>【忠护】</b><br>忠诚，是最强的守护咒！<br>请代替我，继续战斗！<br><br><b>【阵亡】</b><br>雁过无痕风有情，生死两忘江湖里……<br><br><br><br>');
    createIntroAndTaici('ywhy_qingmin', '春节专属2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;安倍晴明是平安时代的阴阳师，被称为日本的姜子牙。在梦枕貘先生的小说里，他玩世不恭、身材修长、唇红齿白。影视衍生作品里，他首创收服众妖成为式神，形成生死与共的关系并肩作战，并能在生死关头打开守护结界，挽救自己和守护之人的生命。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【驱神】</b><br>以吾鲜血，缚令诸神！<br>此生无悔，侍奉为荣！<br><br><b>【缚妖】</b><br>五帝庇佑，咒符退魔！<br>青龙在左，白虎在右，朱雀在前，玄武垫后！<br><br><b>【阵亡】</b><br>名字，是最短的咒……<br><br><br><br>');
    createIntroAndTaici('ywhy_liangxiao', '梁萧是《昆仑》中的主角，自幼与父母分别，在天机宫中苦学算术，少时破解天机十算前九算而闻名天下，后目睹元军暴行，百姓惨状，心生厌战之情，远游西域，周游诸国。十年后，听闻挚爱死讯，心丧若死之际反而将算术与武学结合，悟得归藏之理，最终决战后与爱人花晓霜远赴东海灵鳌岛归隐，终老余生。', '木木枭', '霸天', '小林', '<b>【天机】</b><br>旁观未必穷神妙，自有十算算天机！<br>天机行日月，只手探参商！<br><br><b>【洞渊】</b><br>察今知古，拨草瞻风！<br>洞形查色，鉴虚度影！<br><br><b>【周游】</b><br>西方巍巍，大哉昆仑！<br>周游六虚，八劲合一！<br><br><b>【归藏】</b><br>蕴往圣绝学，有剑名归藏！<br>天之道，损有余而补不足！<br>万物虽繁杂，归藏始为终！<br>我已不再杀戮，何必苦苦相逼？<br><br><b>【阵亡】</b><br>愿人间……再无烽火……<br><br><br><br>');
    createIntroAndTaici('ywhy_lianxing', '怜星是古龙《绝代双骄》中移花宫的二宫主，邀月的妹妹。小时候与邀月抢摘桃子被其从树上推下导致手足畸形，因此落下阴影，终生活在邀月的掌控下不敢抵抗。怜星情路悲惨，一生未嫁。内心深处始终深爱着江枫，却碍于邀月的强势，从未敢表白心意。为救花无缺兄弟献上缓兵之计，终在双骄决战之时，决定忘却恩仇，违抗邀月的指令，被邀月所杀，如一颗寂灭孤星，伴月而起，悄然陨落。', '大熊小猫', '藏海', '龙龙龙哒', '<b>【移心】</b><br>落花有意逐流水，水移心落花自痴!<br>多情总被无情误，万千情愫化蝶去！<br>江边星星渔火乱，明月却是泊枫桥！<br><br><b>【瑕玉】</b><br>玉在山而草木润，渊生珠而崖不枯！<br>玉器七千陈湛露，翠蛾三百舞灵风！<br>玉容寂寞泪阑干，梨花一枝春带雨！<br><br><b>【阵亡】</b><br>姐姐，不能再错下去了……<br><br><br><br>');
    createIntroAndTaici('ywhy_yaoyue', '邀月是《绝代双骄》中移花宫大宫主，容貌绝世，摄人魂魄。邀月残酷无情，气质清冷，冠绝天下的掌法移花接玉令人闻风丧胆，因练成绝顶心法明玉功而得以永驻青春。因其心仪的男子江枫与其婢女私奔，大受刺激的邀月为抚平内心的挫败痛苦常用针自残玉臂，于是决心报复江枫的儿子小鱼儿和花无缺，在怜星的献计之下计划令其兄弟反目。', '大熊小猫', '落影逝尘、诗笺', '明河', '<b>【移宫】</b><br>冰摧傲梅迎霜立，寒骨姝影剑留香！<br>秋枫岂能恋花月，奈何明日俱归尘！<br>繁花易落情难移，此恨绵绵无绝期。<br><br><b>【明玉】</b><br>敢邀明月借千载，凌天许我受长生！<br>玉照千江明秋水，清心蚀骨亦蚀心！<br><br><b>【阵亡】</b><br>属于我的，你们谁也夺不走，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('ywhy_lengxue', '原名冷凌弃，在四大名捕中排行最末，江湖人称四爷。是诸葛正我的四徒弟，四人中年纪最小。性格坚毅，擅于绝处求生，能在一切常人难以生存的恶劣环境下生存，受伤后甚至更勇，人称他为“铁打的冷血”擅使无鞘的无名剑，剑法高超，杀伤力强，只攻不守，每次出招必以命相拼，不把对方击败绝不罢手，是四人中最能坚持且最让敌人胆寒的人。他杀敌冷血，情义热血。', '大熊小猫', '霸天', '冬赫', '<b>【挫锋】</b><br>我若放虎归山，他日必添新魂!<br>挫锋抑志，丧敌胆寒！<br><br><b>【狼噬】</b><br>孤狼弥勇，其志噬心！<br>成群之狼，纵虎何惧！<br><br><b>【阵亡】</b><br>良善何曾离心远，杀戮几时入人间……<br><br><br><br>');
    createIntroAndTaici('ywhy_luxiaofeng', '陆小凤是古龙《陆小凤传奇》系列主角，一个被称为有着“四条眉毛”的传奇人物。他的机智、武功、酒量、脸皮之厚都是鲜有人能及。他总有奇遇，也总能以高超的智慧和武功化险为夷。其绝学指法“灵犀一指”可断敌兵刃，轻功凤舞九天在书中也算首屈一指。', '大熊小猫', '落影逝尘', '小林', '<b>【灵犀】</b><br>灵犀一指，挫敌锋芒！<br>就这破铜烂铁，也想伤我？<br><br><b>【凤舞】</b><br>翩翩人中凤，遨游九重天！<br>火凤燎原，寸草不生！<br><br><b>【阵亡】</b><br>火凤的传说，将不绝于江湖……<br><br><br><br>');
    createIntroAndTaici('ywhy_huamanlou', '花满楼是古龙《陆小凤传奇》中的人物﹐江南花家第七子﹐是陆小凤的好友。自幼失明﹐但对人生依然充满感激﹐对人充满爱﹐从不怨天尤人。武功高强却从不滥杀无辜，热爱生活和大自然、俊秀文雅，其流云飞袖与闻声辨位乃江湖一绝。他是古龙小说中的另类﹐是武侠小说中的另一种境界。没有杀戮﹐没有血腥﹐有的只是宽容与博大对美的感恩，对生活的热爱。', '大熊小猫', '霸天', '阿林', '<b>【辨位】</b><br>流云飞袖，盈盈万千！<br>眼盲心不盲，心盲眼何用！<br>路尽隐香处，翩然雪海间。<br>落雪飘絮，闻声辨位。<br><br><b>【知命】</b><br>乐天知命，无喜无忧；妙性朗然，其乐难述！<br>白云苍狗皆过客，也无欢喜也无愁！<br>莫愁千里路，自有到来风！<br><br><b>【聆花】</b><br>看云卷云舒，听花开花落。<br>把酒黄昏后，有暗香盈袖。<br>花开花谢花满楼，云聚云散云悠悠！<br>鲜花满月水长流，花满心时亦满楼。<br><br><br><b>【死亡】</b><br>繁花落尽，物是人非……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_qiumoyan', '邱莫言是《新龙门客栈》中的一名江湖女侠，倾慕周淮安，营救行动的策划人。电影中以男装出场，英气逼人，使用子母剑，此剑隐喻了邱莫言好似君子中的君子。在侠士救孤的故事中，金镶玉为色，周淮安为报恩，只有邱莫言是为情，即使遭到“背叛”依然舍命救人，属于传统的武林侠客。', '大熊小猫', '落影逝尘', '明河', '<b>【奋营】</b><br>岂让豺狼祸苍生！<br>世道多险恶，唯有道义真！<br><br><b>【游侠】</b><br>浮萍漂泊本无根，天涯游子君莫问！<br>莫言世道多纷扰，看遍青山一重重！<br><br><b>【阵亡】</b><br>玉在匣中叹，金钗土里埋……<br><br><br><br>');
    createIntroAndTaici('ywhy_fangshiyu', '方世玉是李连杰主演的电影《方世玉》的主角，该片讲述了方世玉不知他父亲是红花会的成员，其父为保护反清组织红花会的花名册不慎落入官府手中。为了救他父亲，方世玉只身独闯刑场，奋勇救父的故事。方世玉少年英才，熟练少林拳法，其花刀更是耍得炉火纯青。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【劫刑】</b><br>家父危在旦夕，哪管刀山火海！<br>单枪匹马劫法场，生养之恩莫敢忘！<br><br><b>【花刀】</b><br>扬刀立马酬壮志，扫尽天下不平事！<br>今朝刀在手，江湖任我游！<br><br><b>【阵亡】</b><br>孩儿不孝，未救父于法场……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhouhuaian', '周淮安是禁军教头，杨宇轩部下，为报恩奋力营救杨宇轩子女。周淮安使一柄伞中剑，外表朴实无华，实则锋芒内敛。为了将忠烈遗孤送出关外，在龙门客栈与老板金镶玉和官家追兵多番周旋，既能以色稳住金镶玉。也能在关键时刻与东厂高手一决高下，显示出禁军教头的一腔豪情。', '大熊小猫', '落影逝尘', '小林', '<b>【险渡】</b><br>还望掌柜的，指条明路！<br>前路迢迢，道阻且长！<br><br><b>【救孤】</b><br>此乃忠烈遗孤，务必保其周全！<br>出了关外，就靠你自己了！<br><br><b>【阵亡】</b><br>别了，龙门客栈……<br><br><br><br>');
    createIntroAndTaici('ywhy_huawuque', '花无缺是古龙的小说《绝代双骄》男主之一，从出生时就被邀月怜星姐妹设局抱走抚养教导，欲促成他日后与孪生弟弟小鱼儿互相残杀，以此报复已经死去的江枫夫妇。花无缺出落成翩翩君子，温润如玉，丰神俊朗。习得移花宫的绝学“移花接玉功”，能借力使力，本质和武当的“四两拨千斤”相似，江湖传言“移花接玉，神鬼莫敌”。', '大熊小猫', '落影逝尘', '小林', '<b>【移花】</b><br>俯首看花花影动，东风意捉弄！<br>移花接玉，神鬼莫敌！<br><br><b>【接玉】</b><br>如月之恒，如日之升。<br>公子人如玉，陌上世无双。<br><br><b>【阵亡】</b><br>你我血浓于水，岂可自相残杀……<br><br><br><br>');
    createIntroAndTaici('ywhy_lixiaolong', '李小龙师承叶问，出生于美国加州旧金山，祖籍广东，世界武道变革先驱者、武术哲学家、MMA之父、功夫片的开创者和截拳道创始人，中国功夫首位全球推广者、好莱坞首位华人主角。1973年在香港逝世，年仅33岁，于九三年获得香港电影金像奖“终身成就奖”。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【截拳】</b><br>咿呀！<br>攻击是最好的防御！<br>拳如闪电腿如风！<br><br><b>【龙魂】</b><br>一扫病夫龙骨傲！<br>不敢称第一，绝不认第二！<br><br><b>【阵亡】</b><br>生为传奇，死为龙魂……<br><br><br><br>');
    createIntroAndTaici('ywhy_shanshangcheye', '山上彻也，1980年9月出生于日本奈良，前日本海上自卫队队员，2022年7月8日，41岁的山上彻也涉嫌枪杀日本前首相安倍晋三。山上彻也小时候家境不错，可惜父亲早死、家道中落。其后母亲更是中邪般地信仰某邪教团体，变卖家产向其捐款，落得倾家荡产，哥哥也因此自杀。山上彻变得生计窘迫，连一份正式的工作都没有。于是他对该宗教团体深恶痛绝，意欲施展疯狂的报复。本欲刺杀该宗教首脑，结果向安倍开了枪。', '大熊小猫', '霸天', '韩文杰', '<b>【擒王】</b><br>闻诛一夫纣矣，未闻弒君也！<br>始作俑者，其无后乎！<br><br><b>【霰弹】</b><br>万恶的邪教，下地狱吧！<br>邪教害民，人神共诛！<br>向千千万万的受害者，谢罪吧！<br><br><br><br><b>【死亡】</b><br>再见吧，这荒谬的世界……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_yuhuatian', '雨化田是徐克武侠电影《龙门飞甲》中的大反派，明宪宗最宠爱的万贵妃的亲信，其“武功独孤求败，造型东方不败”，举手投足延续徐氏武侠反派之妖娆风格。他是西厂厂公，权倾朝野，心思缜密，雍容华贵，有倾城之姿，同时心狠手辣。后遭人算计落入圈套，最后葬身于荒芜大漠中！', '大熊小猫', '落影逝尘', '稳得高处', '<b>【严缜】</b><br>军机暗语，你给我记牢了！<br>龙门飞甲，便知真假！<br><br><b>【倾权】</b><br>东厂不敢管的事，我来管！<br>此人性命，我西厂要定了！<br><br><b>【追缉】</b><br>长臂一挥，围捕钦犯千里外！<br>马鞭一指，追杀罪嫔大漠间！<br><br><b>【阵亡】</b><br>奈何雄心壮志，尽付大漠黄沙……<br><br><br><br>');
    createIntroAndTaici('ywhy_xiaoyuer', '小鱼儿是古龙《绝代双骄》的主角之一，花无缺的孪生弟弟。出生时因邀月怜星设局被江枫义兄燕南天带走，后辗转之下在恶人谷长大，在十大恶人的调教下学会了高超的骗术，渐渐成长为一个聪明绝顶、顽劣捣蛋、人人头疼的“小魔星”。小鱼儿依靠假死计谋，令邀月当众说出小鱼儿与花无缺为孪生兄弟的真相，兄弟二人最终相认。', '大熊小猫', '落影逝尘', '李二汪', '<b>【诓惑】</b><br>习得骗中骗，方做人上人！<br>男人的嘴，骗人的鬼！<br><br><b>【狡兔】</b><br>此时不跑，更待何时？<br>三十六计，溜之大吉！<br><br><b>【桀恶】</b><br>小爷我三天没吃人啦！<br>瞧你可怜，赏你一口！<br><br><b>【阵亡】</b><br>人之初，性本善……<br><br><br><br>');
    createIntroAndTaici('ywhy_chuliuxiang', '楚留香是古龙武侠小说《楚留香传奇》的男主角。他是一个名动天下，江湖中人人传诵的侠盗。他来去如风，翩若惊鸿，矫若游龙，偷完东西后空气中只留下淡淡的香气。他从不杀人，不杀敌手、不愿沾染血腥。楚留香冷静优雅，风流倜傥，轻功高绝，世上无人可及。', '大熊小猫', '落影逝尘', '李二汪', '<b>【余香】</b><br>盗帅爱销魂，月夜暗留香！<br>楚人江南留香久，海上渐有白云升。<br><br><b>【盗帅】</b><br>今夜子正，当踏月来寻！<br>闻君有美玉，不胜神往之！<br><br><b>【阵亡】</b><br>不求留芳于世，但求落幕无悔……<br><br><br><br>');
    createIntroAndTaici('ywhy_spzhanzhao', '展昭是古典武侠名著《三侠五义》中的人物，英雄气概，气宇轩昂。武艺高强，剑法绝伦，义薄云天，忠肝义胆。展昭与包拯相识于包拯进京赶考的途中，多次救包拯于危难之中，成为患难之交。因功绩累累，后经包拯举荐，被皇上御封为御前四品带刀护卫，封号御猫，在开封府供职。', '大熊小猫', '落影逝尘', '老王', '<b>【宵禁】</b><br>京畿重地，岂容鼠辈猖獗？<br>臣当摄服宵小，以保圣驾周全！<br>此处戒备森严，还望圣上宽忧！<br><br><b>【佑民】</b><br>侠骨柔情自留芳，不容鼠辈欺善良！<br>乱世扬巨阙，风骨昭青天！<br><br><b>【阵亡】</b><br>若非一番寒彻骨，何来♣️️扑鼻香……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhanzhao', '展昭是古典武侠名著《三侠五义》中的人物，英雄气概，气宇轩昂。武艺高强，剑法绝伦，义薄云天，忠肝义胆。展昭与包拯相识于包拯进京赶考的途中，多次救包拯于危难之中，成为患难之交。因功绩累累，后经包拯举荐，被皇上御封为御前四品带刀护卫，封号御猫，在开封府供职。', '大熊小猫', '落影逝尘', '蚩宇', '<b>【禁卫】</b><br>卑职救驾来迟，望皇上降罪！<br>圣驾南巡，尔等切勿懈怠！<br><br><b>【御猫】</b><br>谁题巨阙映苍茫，扫清浊世浩气扬！<br>骇浪翻飞身俊逸，疾风凌厉自留芳！<br><br><b>【阵亡】</b><br>男儿，志在四方……<br><br><br><br>');
    createIntroAndTaici('ywhy_shenglian', '电影《绣春刀》的男主角，大明锦衣卫总旗，明朝官僚体系下的一个小人物。沈炼喜欢画师北斋的作品，北斋因为在画作上写了几句批评魏忠贤的“反诗”，成了锦衣卫追杀的对象。沈炼在保护北斋的过程中，和北斋产生了情愫。后沈炼兄弟三人受命捉拿阉党，却因此次事件埋下隐患，为自己惹来杀身之祸。', '大熊小猫', '落影逝尘', 'ill', '<b>【围剿】</b><br>魏阉党羽，一个不留！<br>宁枉勿纵，定将阉奴斩草除根！<br>你问我何罪之有？身在乱世就是罪！<br>你私藏阉党，当与阉党同罪！<br><br><b>【裹挟】</b><br>身处乱世，岂能全身而退？<br>你我，不过是权利的牺牲品！<br><br><b>【阵亡】</b><br>挣不开，这命运的枷锁……<br><br><br><br>');
    createIntroAndTaici('ywhy_suqier', '苏乞儿原名苏灿，第五十二代丐帮帮主。本为当地一霸，生性不羁，与斧头帮结下冤仇。苏灿本过着富足的日子，遭到黑帮纠缠和洋人阴谋之后，与酒为伍，狂歌当哭，把酒意融入武学中，开创出别具一格的“醉拳”。终于在沦为乞丐的流落地长沙再度发奋。在朋友余枫、铁桥三等的帮助下，品德、武功不断提升，匡扶正义，成为一代宗师。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【流丐】</b><br>昼无好饭夜无眠，落得街头唱哩莲！<br>若非世道公义迟，谁又甘吃嗟来食？<br><br><b>【醉拳】</b><br>诗万首，酒千觞，几曾着眼看侯王！<br>形醉，意不醉，步醉，心不醉！<br><br><b>【扫浊】</b><br>一段青竹杖，扫清天下浊！<br>棒打双犬，扫清浊世！<br>手持绿杖行天下，人间再无犬吠声！<br>若天下不公，我便给它个公道！<br><br><b>【阵亡】</b><br>四海若升平，谁愿当街乞……<br><br><br><br>');
    createIntroAndTaici('ywhy_baiyutang', '白玉堂是古典名著《三侠五义》中的人物，因少年华美，气宇不凡，故人称“锦毛鼠”。他性情高傲、行侠仗义、为国为民。五鼠闹东京时年仅二十岁，主要成就有开封斗御猫、皇宫题诗杀命、盗三宝、困御猫、捉水怪、三探冲霄楼等。后供职开封府，升为三品副职，三探冲霄不知所踪。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【闹京】</b><br>猫与鼠的游戏，才刚刚开始！<br>纵是人间炼狱，白某照闯不误！<br>仰马仗剑云翻动，扬鞭提壶笑东风。<br><br><b>【睚眦】</b><br>人不轻狂，枉少年！<br>今日恩怨今日了！<br>仗剑携酒江湖行，多少恩怨醉梦中。<br><br><b>【阵亡】</b><br>人间自有青天在……<br><br><br><br>');
    createIntroAndTaici('ywhy_guohuai', '郭槐是古典武侠名著《七侠五义》中的人物，北宋宦官，皇后刘氏亲信。年少时与刘氏是青梅竹马的恋人，因刘氏被选秀入宫，自愿净身进宫追随刘氏左右。曾是包拯的救命恩人，与包拯结为三同好友。在“狸猫换太子”故事中，宦官郭槐为虎作伥，协助刘后（刘皇后）迫害太子（宋仁宗）生母李妃，最终被包拯铡死。传为今河北省藁城市赵庄村人。', '大熊小猫', '霸天', '派大唾沫星子', '<b>【换嫡】</b><br>娘娘当偷龙转凤，以固凤位！<br>李妃身怀六甲，恐夺昭阳，奴婢特献狸猫换太子之妙计！<br><br><b>【灭口】</b><br>要怪，只怪你看到不该看的东西！<br>就让这惊天秘密同你一起，永葬黄泉吧！<br><br><b>【枉法】</b><br>此乃刘太后亲赐免死金牌，你能奈我何？<br>你我同朝为官，何必苦苦相逼？<br><br><b>【供罪】</b><br>奴婢祸乱国祚，罪该万死！<br>太后有令，奴婢不敢有违凤诏，望包大人法外开恩！<br><br><b>【死亡】</b><br>老奴向先皇列祖，谢罪来了……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_huangfeihong', '黄飞鸿是佛山人，清末民国武术家、中医外科名医，也是《黄飞鸿》系列电影的男主角。清朝大臣元述为对付孙文等革命义士，煽动白莲教团攻打英国领事馆，黄飞鸿为保存国运命脉，与元述对抗并帮助孙文等人逃脱。其武功绝学为“无影脚”，出腿风格为声东击西，扰乱敌方后，对其攻击。', '大熊小猫', '落影逝尘', '沃声_风飞语', '<b>【图强】</b><br>朝廷积弱，列强欺凌，我辈当奋发图强！<br>救亡图存，国家兴革，匹夫有责！<br><br><b>【无影】</b><br>佛山无影脚，踢的就是你们这些洋狗！<br>今天，就让你们见识什么是真正的中国功夫！<br><br><b>【阵亡】</b><br>来世再做七尺汉，看我家国万世秋……<br><br><br><br>');
    createIntroAndTaici('ywhy_jinyong', '金庸是当代中国武侠小说四大宗师之一，著有十五部脍炙人口的武侠小说，塑造了不计其数鲜活的江湖侠客。金庸善于将其作品及其人物融入到鲜明的历史背景之中，让主角裹挟在历史的浪潮之下作出抉择。其作品始终弘扬侠之大者，为国为民的价值观。', '大熊小猫', '微尘', '蚩宇', '<b>【狂笔】</b><br>执笔写尽英雄事，仗剑倚马江湖中！<br>飞雪连天射白鹿，笑书神侠倚碧鸳！<br><br><b>【侠魂】</b><br>侠之大者，为国为民！<br>贫不改其气，达不改其志！<br><br><b>【阵亡】</b><br>挥亳泼墨百年梦，忽翻烂卷涕泗沾……<br><br><br><br>');
    createIntroAndTaici('ywhy_baozheng', '包拯是古典武侠名著《三侠五义》中的主角，不附权贵、铁面无私，且英明决断，敢于替底层百姓申冤，故有包青天之美名。京师有“关节不到，有阎罗包老”之语。后世将他奉为神明崇拜，认为他是奎星转世，由于民间传其黑面形象，亦被称为“铁面无私包青天”。', '大熊小猫', '寰宇星城', '小林', '<b>【洗冤】</b><br>我有尚方宝剑，可斩丹书铁券！<br>日诉阳间千不平，夜判阴曹掌幽冥！<br><br><b>【明察】</b><br>若要人不知，除非己莫为！<br>但见高堂明镜悬，举头三尺有青天！<br><br><b>【阵亡】</b><br>人间若无冤难平，何需铁面为青天……<br><br><br><br>');
    createIntroAndTaici('ywhy_zhangqiling', '清明节专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;张起灵是南派三叔作品《盗墓笔记》里的灵魂人物，盗墓铁三角的精神领袖。作为张家最后的张起灵，他身上流淌着麒麟血，能够在倒斗危险之际镇住蜂涌而出的尸蟞和大粽子。小哥沉着稳定，内敛低调，几乎无所不能，能给人强烈的安全感。结束守护青铜门的使命后与吴邪等居于福建雨村。', '大熊小猫', '落影逝尘', '稳得高处', '<b>【倒斗】</b><br>百足之虫，死而不僵！<br>雪山龙脉隐，铜门藏终极！<br><br><b>【尸变】</b><br>尸有十八变，其状各不同！<br>血尸凶残，大家千万别回头！<br><br><b>【血灵】</b><br>宝血开路，百虫退散！<br>麒麟洒血魑魅开，镇灵闯墓魍魉拜！<br><br><b>【阵亡】</b><br>十年生死语凝噎，一别长白思无邪……<br><br><br><br>');
    createIntroAndTaici('ywhy_mengdeer', '暑假专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;格雷戈尔·孟德尔，奥地利帝国生物学家。出生于奥地利帝国西里西亚（今属捷克）海因策道夫村，在布隆的修道院担任神父，是遗传学的奠基人，被誉为现代遗传学之父。他通过豌豆实验，发现了遗传学三大基本规律中的两个，分别为分离规律及自由组合规律。', '大熊小猫', '霸天、棉花糖', '攀', '<b>【减裂】</b><br>龙生九子各不同，虎生三子有一彪！<br>万物生长，欣欣向荣！<br>种瓜得瓜，种豆得豆！<br><br><b>【杂交】</b><br>天才，意味着一生辛勤的劳动！<br>优胜劣汰，适者生存！<br><br><br><br><b>【阵亡】</b><br>生命不止，代代相传……<br><br><br><br>');
    createIntroAndTaici('ywhy_wangkaixuan', '中元节专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;王凯旋，人称王胖子，是《鬼吹灯》或《盗墓笔记》中的男配角。性格比较二，嘴碎废话多，大大咧咧，百步穿杨身手不凡，认钱不认人，将门之后高干子弟，除了怕高别的都不在乎，不仅具备完善的斗争理论，更可贵的是敢于斗争，善于斗争，乐于斗争。《盗墓笔记》，据三叔说名叫王月半，与吴邪、张起灵组成盗墓铁三角，自称北派摸金校尉，混迹北京潘家园，嘴碎大大咧咧，关键时刻还算靠谱。', '大熊小猫', '霸天', 'MU', '<b>【量斗】</b><br>雄关漫道真如铁，而今迈步从头越！我王凯旋又回来了！<br>穴坐龟甲出鼠盗，棺内木根穿亡人！<br>天王盖地虎，宝塔镇河妖！<br>用屁股想想也知道，这写的是“盗墓者死”!<br><br><b>【飞僵】</b><br>急急如律令！噎死你个大粽子！<br>老胡，他这是中了什么毒？活人秒变大粽子了！<br><br><b>【探墓】</b><br>啥都用电动的还叫倒斗吗？这才是正宗摸金范儿！<br>咱这叫考古，啥盗墓、盗墓的！<br>什么盗墓贼？咱是对封建统治阶级的无情鞭挞！<br>可上九天揽月，可下五洋捉鳖！开在阴曹地府的花，我也一样给你采回来！<br><br><br><b>【死亡】</b><br>探了一辈子墓，没想到……今儿栽这儿了……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_hubayi', '明清节专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;胡八一是《鬼吹灯》的男主角，摸金校尉。他敢想敢说敢做，凭借半部十六字阴阳风水秘术掌握寻龙诀的摸金校尉，退役后与Shirley杨、王胖子三人走上探险盗墓之路。相传探墓之时需在墓穴东南角点上蜡烛，所谓人点蜡、鬼吹灯，若蜡烛熄灭则不适合摸金，需回避。', '大熊小猫', '寰宇星城', '', '<b>【摸金】</b><br>鸡鸣灯灭不摸金！<br>人点蜡，鬼吹灯！<br><br><b>【锁妖】</b><br>神兵降世，斩妖除魔！<br>地狱空荡荡，恶魔在人间！<br>鸡鸣灯灭，魍魉横行！<br><br><b>【寻龙】</b><br>寻龙分金看缠山，一重缠是一重关！<br>寻龙分金，一关一险！<br><br><b>【阵亡】</b><br>合则生，分则死……<br><br><br><br>');
    createIntroAndTaici('ywhy_jiushu', '清明节专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;九叔是林正英在僵尸系列电影中出演的人物形象，是一名茅山道长，九叔手持桃木剑、身穿黄道袍的形象给影迷留下深刻的印象。九叔神通广大，善于斩妖除魔驱鬼神，为维持阴阳两界的秩序作出了巨大的贡献，是影迷心中的人间守护者，这一形象将永存于世。', '大熊小猫', '寰宇星城', '小林', '<b>【魔道】</b><br>三清符起看阴阳，铜镜桃木镇魍魉！<br>神兵急急如律令，斩妖除魔驱邪灵！<br>天灵灵，地灵灵，太上老君来显灵！<br>半碗清水照乾坤，一张灵符命鬼神！<br><br><b>【炼尸】</b><br>七九夺阳，尸起西南！<br>尘归尘，土归土，请君速上轮回路！<br>尔身非本身，此身非玉身，烈火焚此身，由此而重生！<br>阴阳分两道，人鬼皆殊途！<br><br><b>【破咒】</b><br>你这蠢货，怎能烧毁灵符？<br>别怕，有师父在呢！<br><br><b>【阵亡】</b><br>朱砂糯米今犹在，昔日威风化尘埃……<br><br><br><br>');
    createIntroAndTaici('ywhy_yewen', '广东佛山人叶问是咏春拳掌门人。年少时家境优渥，从师咏春拳第三代传人陈华顺学习拳法，师傅“一条腰带一口气”的告诫，支持他走过日本侵华兵荒马乱的年代。其绝学咏春拳善用寸劲来攻击和防守。在战争年代，他弘扬中华武术，表现出了极强的民族气节。', '大熊小猫', '落影逝尘', '', '<b>【战祸】</b><br>兵连祸结多磨难，神州飘摇风雨泣！<br>兵荒马乱，沧海横流！<br><br><b>【咏春】</b><br>攻守兼备，后发制人！<br>寸劲收发，绵绵不绝！<br>咏到♣️️桩法妙，春生桃李艺林香！<br><br><b>【扬武】</b><br>神州尚有英雄在，愿拼热血卫中华！<br>我辈习武为何事？驱逐日寇复河山！<br><br><b>【阵亡】</b><br>尚武精神永传承……<br><br><br><br>');
    createIntroAndTaici('ywhy_liyuzhen', '中元节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;李玉甄是韩国电影《笔仙》中的女主角，她从汉城转学到父母的家乡，在新学校受到同班同学的欺负，于是她跟其他两个同样受到欺负的同学一起玩笔仙，他们招来笔仙对欺负他们的四个同学下诅咒，没有想到玉甄却被招来的笔仙鬼魂附身。奇怪的事情发生，四个霸凌者中的三人一个接着一个自焚而死，警方调查发现玉甄涉嫌重大，但是玉甄却不但拿不出不在场证明，她更完全丧失记忆。李玉甄的导师载恩决定带她去见自己一个会通灵的好友，想要解开这其中的惊天秘密……', '大熊小猫', '棉花糖', '林曦', '<b>【伏笔】</b><br>今生随前世，我请前世来，来了画个圈！<br>笔仙笔仙快快来，今生再续前世缘！<br>墨舞惊魂，咒语暗生！<br>落笔成谶[chèn]，伏笔已定！<br><br><b>【请仙】</b><br>魂兮归来，附我之身！<br>笔仙降临，助我复仇！<br>笔仙笔仙，倾听我愿。欺凌霸弱，永不超生！<br><br><b>【降笔】</b><br>笔落惊风雨，墨成泣鬼神！<br>仙灵附体，听我召唤！<br><br><br><b>【死亡】</b><br>怪力乱神，终难自救……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_bixian', '中元节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;笔仙是一种招灵游戏，通过笔来和一种姑且称之为笔仙的能量体交流。请“笔仙”游戏，是中国最古老的巫术之一“扶乩”的变种或简化版。“笔仙”游戏之所以能蛊惑人心，一切皆因那支能动的笔。从物理角度可以解释这种现象：玩“笔仙”不允许以肘或腕作支撑，需保持悬空，笔垂直于纸面任何一点。当悬腕、无支撑、光滑纸面、尖笔这一切矛盾条件具备，两个人都会互相用力，因此，身体作用下的笔做环行运动成为必然。请“笔仙”只是一种游戏，某些时候可能受到某种心理暗示的影响。', '大熊小猫', '棉花糖', '林曦', '<b>【扶鸾】</b><br>扶箕之术，趋吉避凶！<br>占卜问吉凶，仙灵测福祸！<br>不问成败，但求生死！<br>笔仙显灵，佑我平安！<br><br><b>【灵恶】</b><br>仙去魂归，尘缘了断。<br>笔仙笔仙如我愿，笔仙笔仙请归位。<br><br><br><br><b>【死亡】</b><br>仙途已尽，魂归太虚……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_wuxie', '清明节专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;吴邪是《盗墓笔记》中的主人公，是铁三角的精神领袖，长沙老九门中的吴家独子，生于盗墓世家。在《沙海》中设计筹划了整个沙海计划。吴邪是人间绝色，容貌华美。吴邪爱好摄影，擅长解密和逻辑推理，在古玩鉴定方面也有颇有造诣。', '大熊小猫', '落影逝尘', '洛', '<b>【留影】</b><br>无声摹百绘，脱墨述骨香！<br>十卷九藏，八七岁月，不忘六梦浮生！<br>五湖四海，三两知己，换你一世无邪！<br><br><b>【通译】</b><br>一字勘千机，万语寻旧译！<br>碑文记载，此墓凶险！<br><br><b>【鉴古】</b><br>这宝贝货真价实，绝非赝品！<br>鎏金碧珍挂珊瑚，怀璧不逊蔺相如！<br>莫使龙骨浊尘埃，销得凤翅金陵钗！<br><br><b>【阵亡】</b><br>岁月干净，如水淡……如酒清……<br><br><br><br>');
    createIntroAndTaici('ywhy_wukong', '七夕专属·2021<br><br>&nbsp;&nbsp;&nbsp;&nbsp;你是至尊宝的觉醒态。你的♠️️牌视为♥️️牌，你使用♥️️基本牌、普通锦囊牌指定唯一目标或其他角色使用这些牌指定你为唯一目标时，若你体力上限不大于3，你失去一点体力或减一点上限，此牌额外结算一次。', '大熊小猫', '落影逝尘', '狗子', '');
    createIntroAndTaici('ywhy_feijiang_female', '中元节专属·王凯旋专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;僵尸，古代中国民间传说之物，无证据证明其存在。僵尸集天地怨气，取天地死气，晦气而生。不老，不死，不灭，被天地人三界摒弃在众生六道之外，浪荡无依，流离失所。身体僵硬，在人世间以怨为力，以血为食。力大无穷,不死不灭。<br>&nbsp;&nbsp;&nbsp;&nbsp;僵尸在中国古代民间传说中为一种复活死尸，长有白毛，跳跃行走，力大，其记载多见于《子不语》、《阅微草堂笔记》等小说。另外魃修炼就变成犼之说乃近代相声家所言。', '大熊小猫', '霸天', '[无]', '<b>【盖棺】</b><br>[飞僵咆哮声]<br><br><b>【软禁】</b><br>[飞僵咆哮声]<br><br><b>【阵亡】</b><br>[飞僵咆哮声]');
    createIntroAndTaici('ywhy_feijiang_male', '中元节专属·王凯旋专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;僵尸，古代中国民间传说之物，无证据证明其存在。僵尸集天地怨气，取天地死气，晦气而生。不老，不死，不灭，被天地人三界摒弃在众生六道之外，浪荡无依，流离失所。身体僵硬，在人世间以怨为力，以血为食。力大无穷,不死不灭。<br>&nbsp;&nbsp;&nbsp;&nbsp;僵尸在中国古代民间传说中为一种复活死尸，长有白毛，跳跃行走，力大，其记载多见于《子不语》、《阅微草堂笔记》等小说。另外魃修炼就变成犼之说乃近代相声家所言。', '大熊小猫', '霸天', '[无]', '<b>【盖棺】</b><br>[飞僵咆哮声]<br><br><b>【软禁】</b><br>[飞僵咆哮声]<br><br><b>【阵亡】</b><br>[飞僵咆哮声]');
    createIntroAndTaici('ywhy_zongzi_female', '清明节专属·张起灵专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;粽子是一句在盗墓者中流传的暗语，指墓里保存的比较完好，没有腐烂但已经尸变的尸体，摸到大粽子就是碰上麻烦了，指僵尸、恶鬼之类不干净的东西。<br>&nbsp;&nbsp;&nbsp;&nbsp;来自于《鬼吹灯》作者虚构。《鬼吹灯》、《盗墓笔记》等小说中提到可以用黑驴蹄子克制。在《盗墓笔记》中提到可以用张起灵的血克制，不过这是个人因素。<br>&nbsp;&nbsp;&nbsp;&nbsp;而根据《鬼吹灯》的作者天下霸唱自述，粽子这个词语是他自己杜撰的。<br>&nbsp;&nbsp;&nbsp;&nbsp;关于名词和术语，有必解释一下，《鬼吹灯》中称盗墓为“倒斗”，和称陪葬品为“冥器”一样，这些特殊的行业名词是现实中确实存在的；而称古墓中的尸体为“粽子”，则完全是我个人原创虚构的，以前从没有这种说法。”上面这段话是摘自《鬼吹灯》后记，作者明确的说明了“粽子”一词是作者本人虚构的。粽子：指古墓中的尸体保存的比较完整，没有毁坏，不腐而僵。<br>&nbsp;&nbsp;&nbsp;&nbsp;1.大粽子：厉害的僵尸、恶鬼之类的东西。<br>&nbsp;&nbsp;&nbsp;&nbsp;2.老粽子：可发生尸变的不好对付的僵尸。<br>&nbsp;&nbsp;&nbsp;&nbsp;3.干粽子：是指墓里的尸体烂得只剩下一堆白骨了。<br>&nbsp;&nbsp;&nbsp;&nbsp;4.肉粽子：是指尸体身上值钱的东西多。<br>&nbsp;&nbsp;&nbsp;&nbsp;5.血粽子：血尸墓中的粽子，最厉害。<br>&nbsp;&nbsp;&nbsp;&nbsp;6.霉粽子：是指具有尸毒的尸体。<br>&nbsp;&nbsp;&nbsp;&nbsp;7.女粽子：女尸尸化后的粽子，比普通粽子更厉害。', '大熊小猫', '落影逝尘', '[无]', '<b>【粽子】</b><br>[粽子咆哮声]<br><br><b>【阵亡】</b><br>[粽子咆哮声]');
    createIntroAndTaici('ywhy_zongzi_male', '清明节专属·张起灵专属·2020<br><br>&nbsp;&nbsp;&nbsp;&nbsp;粽子是一句在盗墓者中流传的暗语，指墓里保存的比较完好，没有腐烂但已经尸变的尸体，摸到大粽子就是碰上麻烦了，指僵尸、恶鬼之类不干净的东西。<br>&nbsp;&nbsp;&nbsp;&nbsp;来自于《鬼吹灯》作者虚构。《鬼吹灯》、《盗墓笔记》等小说中提到可以用黑驴蹄子克制。在《盗墓笔记》中提到可以用张起灵的血克制，不过这是个人因素。<br>&nbsp;&nbsp;&nbsp;&nbsp;而根据《鬼吹灯》的作者天下霸唱自述，粽子这个词语是他自己杜撰的。<br>&nbsp;&nbsp;&nbsp;&nbsp;关于名词和术语，有必解释一下，《鬼吹灯》中称盗墓为“倒斗”，和称陪葬品为“冥器”一样，这些特殊的行业名词是现实中确实存在的；而称古墓中的尸体为“粽子”，则完全是我个人原创虚构的，以前从没有这种说法。”上面这段话是摘自《鬼吹灯》后记，作者明确的说明了“粽子”一词是作者本人虚构的。粽子：指古墓中的尸体保存的比较完整，没有毁坏，不腐而僵。<br>&nbsp;&nbsp;&nbsp;&nbsp;1.大粽子：厉害的僵尸、恶鬼之类的东西。<br>&nbsp;&nbsp;&nbsp;&nbsp;2.老粽子：可发生尸变的不好对付的僵尸。<br>&nbsp;&nbsp;&nbsp;&nbsp;3.干粽子：是指墓里的尸体烂得只剩下一堆白骨了。<br>&nbsp;&nbsp;&nbsp;&nbsp;4.肉粽子：是指尸体身上值钱的东西多。<br>&nbsp;&nbsp;&nbsp;&nbsp;5.血粽子：血尸墓中的粽子，最厉害。<br>&nbsp;&nbsp;&nbsp;&nbsp;6.霉粽子：是指具有尸毒的尸体。<br>&nbsp;&nbsp;&nbsp;&nbsp;7.女粽子：女尸尸化后的粽子，比普通粽子更厉害。', '大熊小猫', '落影逝尘', '[无]', '<b>【粽子】</b><br>[粽子咆哮声]<br><br><b>【阵亡】</b><br>[粽子咆哮声]');
    createIntroAndTaici('ywhy_moxiedadi', '清明节专属·埃及法老专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;蝎子王是出自电影《才木乃伊归来》中的角色，他为了复仇把灵魂出卖给了死神阿努比斯，阿努比比斯把他变成了魔蝎大帝。蝎子王的军队被击溃，虫揭子王独自—人逃难，被复仇蒙蔽了双眼，走投无髭洛时就把灵魂出卖给了死神阿努比斯。阿努比斯借驽给了他一支狼头军，完成复仇后就被阿努比斯收回,并受到了诅咒变成了半人斗蝎的怪物。', '大熊小猫', '藏海', '[无]', '<b>【毒螯】</b><br>[摩羯大帝呢喃]<br><br><b>【阴招】</b><br>[摩羯大帝呢喃]<br><br><b>【阵亡】</b><br>[摩羯大帝呢喃]');
    createIntroAndTaici('ywhy_shizumingdi', '清明节专属·埃及法老专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;始祖冥帝出自《木乃伊3》，计划2000多年前，残暴虐杀的始皇帝终遭女巫诅咒，和兵将一起被变成了兵马俑，封印在地下宫殿中。如今，隐居于英国牛津郡过着平静生活的冒险家里克和妻子伊芙琳，又一次得到了任务——把一件从中国上海博物馆偷走的珍贵文物物归原主。他们的儿子阿历克斯已长大，里克带着妻儿来到中国的里克，与伊芙琳的哥哥乔纳森重逢，而他们这时惊惧地发现当年被封印的帝王竟被唤醒，沉睡多年的他不仅神力过人，且誓言要让世人皆陷暴政！一场惊心动魄的大战随即开始。', '大熊小猫', '霸天', '[无]', '<b>【坑儒】</b><br>[冥帝狂笑]<br><br><b>【阴兵】</b><br>[阴兵嘶吼]<br><br><b>【阵亡】</b><br>[无]<br><br><br><br>');
    createIntroAndTaici('ywhy_yaojiyuanling', '清明节专属·埃及法老专属2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;埃及公主阿玛内特和死神赛特签订了契约想要成为一统埃及的女王，哪知道计划失败，最终，阿玛内特被制作成为了木乃伊，含恨而终。一晃眼千年过去，海豹突击队队员尼克（汤姆·克鲁斯 Tom Cruise 饰）在执行任务期间意外的闯入了一座位于地底的古墓中，唤醒了阿玛内特的灵魂，重返人间的阿玛内特决定将尼克的身体作为死神赛特的灵魂容器，在这个新世界里重新实现自己称王的野心。', '大熊小猫', '霸天', '[无]', '<b>【怨毒】</b><br>[怨灵尖叫]<br><br><b>【阴契】</b><br>[妖姬哀嚎]<br><br><b>【阵亡】</b><br>[无]<br><br><br><br>');
    createIntroAndTaici('ywhy_lianjiafalao', '清明节专属·埃及法老专属2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;法老是古埃及国王的尊称，也是一个神秘的名字，它是埃及语的希伯来文音译，其象形文字写作，意为大房屋。在古王国时代仅指王宫，并不涉及国王本身。新王国第十八王朝图特摩斯三世起，开始用于国王自身，并逐渐演变成对国王的一种尊称。第二十二王朝以后，成为国王的正式头衔。习惯上把古埃及的国王通称为法老。法老作为奴隶制专制君主，掌握全国的军政、司法、宗教大权，其意志就是法律，是古埃及的最高统治者。法老自称是太阳神阿蒙之子，是神在地上的代理人和化身，令臣民将其当作神一样来崇拜。连枷杖通常和赫卡杖一起使用，是亡故法老所持的权杖。', '大熊小猫', '霸天', '[无]', '<b>【法杖】</b><br>[法老之威]<br><br><b>【阴风】</b><br>[阴风阵阵]<br><br><b>【阵亡】</b><br>[无]<br><br><br><br>');
    createIntroAndTaici('ywhy_tieshou', '铁手原名铁游夏，温瑞安《四大名捕》系列主角之一，排行第二。早年已是当地名捕，带艺拜诸葛神侯为师，内功已达登峰造极之境，江湖中少有匹敌，一双铁手刀枪不入，百毒不侵，既能断金碎石，亦如春风拂面。游戏《逆水寒》中，大观元年，京西大水，铁手曾凭一人之力举万斤铜壁御洪，拯救灾民数百人，三日后官兵方至，彼时洪水已退，人们但见铜壁上掌印赫然，乃知其一双铁手实无虚传。', '大熊小猫', '棉花糖', '路边奇石', '<b>【摧坚】</b><br>刚可摧金断石，柔可清风拂面！<br>破而后立，一以贯之！<br><br><b>【扛鼎】</b><br>拔山扛鼎，此志干云！<br>举壁御洪，以佑苍生！<br><br><b>【阵亡】</b><br>壮士，当明知不可为而义所当为……<br><br><br><br>');
    createIntroAndTaici('ywhy_qingshe', '端午节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;青蛇是徐克导演经典电影《青蛇》中的主角，由张曼玉饰演。本是一个不谙世事的小蛇，跟随姐姐来到人间，学习做人的一切——包括人的七情六欲。青蛇以独特的视角见证了白蛇和许仙之间关于人性的一切：虚伪和背叛。由此她也悟出了做人比做蛇复杂得多。青蛇从最初的不知情为何物，到最后为姐姐流下第一滴眼泪，她看透了世人的丑恶、尝到了做人的苦涩。', '大熊小猫', '棉花糖', '良沨', '<b>【思凡】</b><br>姐姐，此物为何？竟有此般神奇！<br>四方诸事，不如一碗人间烟火。<br> 姐姐呀，做人怎么这么麻烦？<br>为什么做蛇的时候，你说做人好，现在却说做蛇好？<br>都说人间有情，但是情为何物？<br><br><b>【幻化】</b><br>似此故人非昨夜，为谁茕茕别云遥？<br>情仇爱恨皆所愿，缘何由此泪婆娑？<br><br><b>【硝酒】</b><br>芒硝化酒，辟瘟解毒！<br>姐姐，我……我没醉，我还要喝……<br><br><b>【阵亡】</b><br>情为何物，终是不晓……<br><br><br><br>');
    createIntroAndTaici('ywhy_baishe', '白蛇是修炼千年的蛇妖，因前世姻缘与许仙相爱，却受到法海的嫉妒将许仙囚禁于金山寺并封印其五音。白蛇多番索夫不得，怒而呼风换雨令整座金山寺变成一片汪洋，牵连无数苍生受害，因而被镇压于雷峰塔下。', '大熊小猫', '棉花糖', '安生', '<b>【仙恩】</b><br>十年修得同船渡，百年修得共枕眠！<br>有缘千里来相会，三笑徒然当一痴！<br><br><b>【水漫】</b><br>一怒涌江水，漫过金山巅！<br>柔肠愤起挥广袖，千里江南一片哀！<br><br><b>【化蛟】</b><br>自兹繁巨蟒，往往寿千年！<br>白蛇初下峨眉山，坐对青峰结翠鬟！<br><br><br><b>【死亡】</b><br>情之一字，熏神染骨，误尽苍生……<br><br><br><br><br>');
    createIntroAndTaici('ywhy_change', '中秋节专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;相传嫦娥飞到月宫以后向羿倾诉懊悔说：“明天乃月圆之候，你用面粉作丸，团团如圆月形状，放在屋子的西北方向，再连续呼唤我的名字。三更时分，我就可以回家来了。”翌日，羿照妻子的吩咐去做，届时嫦娥果由月中飞来，夫妻重圆。中秋节做月饼供嫦娥的风俗，也是由此形成。从此，中秋节拜月的风俗在民间传开了。', '大熊小猫', '霸天', '酱子', '<b>【瑶兔】</b><br>清净不觉月光冷，夜夜抱兔待露凝。<br>瑶兔若能挥玉杵，何须仙籍求长生？<br><br><b>【仙药】</b><br>欲化仙人赴瑶池，求得仙露与仙丹。<br>千年昆仑登仙道，如今孤影栖广寒。<br><br><b>【逐月】</b><br>长空月洒夜暮里，光华照君君未知。<br>阴晴圆缺月有全，离合悲欢人无常。<br>无言登楼江映月，月涌江潮是离愁。<br>月如流水隔幕帘，泪洒冰轮不得见。<br><br><b>【阵亡】</b><br>纵我未悔偷灵药，青天碧海亦孤心……<br><br><br><br>');
    createIntroAndTaici('ywhy_pangban', '庞斑是黄易著作武侠小说《覆雨翻云》的主角之一，绰号魔师。天性邪恶，犹如妖魔的化身，城府极深，喜怒哀乐不显示睛脸上，喜怒难测。兼带有玄秘的宗教色彩，跻身宗师级的地位，隐隐然凌驾黑白两道。修成魔门秘不可测、从没有人练成过的道心种魔大法，成为魔门古今第一人。', '木木枭', '霸天', '六月初十', '<b>【魔策】</b><br>天魔十策，为天下诸法之源！<br>云深不见月，魔心屠众生！<br>金刚不吐焰，天魔破幽禅！<br>魔嚣天下，策御乾坤！<br><br><b>【种魔】</b><br>道心种魔难自抑，红颜本就多是非！<br>三清天魔皆一愿，魔种暗蕴道心中。<br><br><b>【碎空】</b><br>溯钧天梦破，俯仰碎虚空！<br>天若阻我逍遥意，吾自葬天踏凌霄！<br><br><b>【情根】</b><br>情之为物，最是难言！<br>星汉皓无垠，怎及情一缕？<br><br><b>【阵亡】</b><br>世间再无魔师矣，哈哈哈……<br><br><br><br>');
    createIntroAndTaici('ywhy_yanshisan', '燕十三是古龙小说《三少爷的剑》中的角色。是一个为剑道疯魔的男人，练就家传武学夺命剑法，是当世第一流剑客，生平愿望是与剑中帝王谢晓峰一决高下。平生绝学夺命十三剑，后不但创出了第十四种变化，在找谢晓峰决战时又创出代表着毁灭和死亡的第十五剑。他原本可以凭借第十五剑击杀谢晓峰，却发现这一剑带来的只有毁灭和死亡，他不能让这样的剑法流传于世，成为武学的罪人，因此他选择自杀，让此剑法消失。', '大熊小猫', '霸天', '二空', '<b>【剑魔】</b><br>不与凡夫论天阔，此生唯与剑为友！<br>玄鞘金首慑凡骨，十三明珠证魔心！<br><br><b>【夺命】</b><br>夺命十三剑，又岂拘泥于十三式？<br>死在我的剑下，是你的荣幸。<br><br><b>【阵亡】</b><br>我……虽死……犹胜……<br><br><br><br>');
    createIntroAndTaici('ywhy_caoe', '端午节专属·2024<br><br>&nbsp;&nbsp;&nbsp;&nbsp;曹娥，会稽上虞人。东汉时期著名孝女。相传其父曹盱在五月五日端阳节迎伍神（伍子胥）的祭祀活动中溺于舜江中，数日不见尸体，当时孝女曹娥年仅十四岁，昼夜沿江嚎哭。过了十七天，在五月二十二日也投江，五日后曹娥的尸体抱父尸浮出水面。就此传为神话，继而相传至县府知事，令度尚为之立碑，让他的弟子邯郸淳作诔辞颂扬。因此所住之村镇即更名为曹娥镇，殉父之江为曹娥江，并建以寺庙慰其孝心。', '大熊小猫', '霸天', '林曦', '<b>【觅江】</b><br>风急浪高亦无阻，觅得父魂归故里！<br>江曳孤舟夜未央，小女泣血泪成霜！<br>寻亲不惜千般苦，报德何惧浪里寻！<br>觅江寻父魂，孝节恸苍穹！<br><br><b>【孝节】</b><br>孝感天地泣鬼神，名垂竹帛耀星芒！<br>蓼蓼者莪，匪莪伊蒿。哀哀父母，生我劬劳！<br>父兮生我，母兮鞠我。欲报之德，昊天罔极!<br><br><br><br><b>【死亡】</b><br>莫笑女儿弱，应知孝道难！<br><br><br><br><br>');
    createIntroAndTaici('ywhy_qiurong', '中元节专属·2022<br><br>&nbsp;&nbsp;&nbsp;&nbsp;秋容是蒲松龄的著名小说《聊斋志异》中的人物。秋容是个在大户人家为奴为婢的女子，与此大户人家的公子相恋，不得如愿。两人相约，服毒自杀，九泉相会。不料秋容只身命赴黄泉，公子却未如期赴约，因而成为了一个怨气未消的孤魂野鬼。', '大熊小猫', '霸天', '安生', '<b>【幻术】</b><br>世间虚幻之法，凡目怎得勘破？<br>盈盈水中月，袅袅镜中花。<br><br><b>【魂牵】</b><br>纵使天涯万里，秋容一线情牵！<br>思君忆君，魂萦梦牵！<br><br><b>【冥婚】</b><br>阴阳两相隔，情重不能分！<br>鸾杯醉宴好，晓戍复魂归！<br><br><b>【阵亡】</b><br>郎君若得情真切，秋容何悔赴黄泉！<br><br><br><br>');
    createIntroAndTaici('ywhy_aijifalao', '公元前，邪恶巫师埃默霍特普和法老的妻子阿克苏娜通奸，后来阿克苏娜自杀，埃默霍特普则受到终极诅咒变成永不死去的僵尸，只有当他腐烂的身体消失他才会得到解脱。当埃默霍特普随着石棺的合上而恐惧地尖叫时，诅咒已经随着埋下，他邪恶复仇的心在黑暗中越来越强大。他在黑暗中生不如死地熬过了3000千，被贪婪的美国寻宝人解除诅咒，埃默霍特普的复仇之灵开始疯狂席卷人类大地。', '大熊小猫', '霸天', '末生', '<b>【剑魔】</b><br>聚沙成塔，掩桎梏而通天！<br>心如鸿毛，登高台而羽化！<br><br><b>【夺命】</b><br>香以肉骨，帛以存身！<br>愚蠢的凡人们，向阿努比斯臣服吧，哈哈哈……<br><br><br><b>【阵亡】</b><br>千丈之塔，终堙于黄沙……<br><br><br><br>');
    createIntroAndTaici('ywhy_lupan', '中元节专属·2023<br><br>&nbsp;&nbsp;&nbsp;&nbsp;《陆判》是清代小说家蒲松龄创作的文言短篇小说集《聊斋志异》中的篇目。描写了主人公朱尔旦奇遇陆判官的幻异故事，其中陆判官为朱尔旦换心和为朱妻子换头的情节奇特诡谲、扣人心弦。朱尔旦死后来到家里生活的场面及路上教诲儿子赠送佩刀的情景，也寄托了作者对人间美好的希望之情。这本书是我国文学历史上的一朵璀璨文书，值得细细品味。', '吃饱睡睡醒吃', '棉花糖', '末生', '<b>【冥曹】</b><br>天道好轮回，苍天饶过谁！<br>人在做，天在看！<br>阴曹有案，请君对证公堂！<br>冥间清档，望君前往一叙！<br><br><b>【换首】</b><br>贪彼之美，则斧钺加颈项矣！<br>断鹤续凫，矫作者之妄也！<br><br><b>【易心】</b><br>心蕴大慧，何愁不入乡闱？<br>易心换首，金榜题名！<br>莫言君心塞茅闭窍，天下开窍几人乎？<br><br><b>【阵亡】</b><br>达者观之，生死一耳，何以乐生而悲死……<br><br><br><br>');
    createIntroAndTaici('xajh_quyuan', '屈原是中国文学史上第一位伟大的爱国诗人、中国最伟大的浪漫主义诗人之一，世界文化名人。他创立了“楚辞”这种文体，也开创了香草美人的传统。代表作品有《离骚》《九歌》等。虽忠事楚怀王，但却屡遭排挤，怀王死后又因顷襄王听信谗言而被流放，最终投汨罗江而死，后世人以端午节赛龙舟、吃粽子的形式来纪念他。', '大熊小猫', '霸天', '蓝', '<b>【九歌】</b><br>固人命兮有当，孰离合兮何为？<br>身既死兮神以灵，魂魄毅兮为鬼雄！<br><br><b>【骚辞】</b><br>亦余心之所善兮，虽九死其犹未悔！<br>宁溘死而流亡兮，不忍为此之常愁！<br><br><br><b>【阵亡】</b><br>安能以皓皓之白，而蒙世俗之尘埃乎……<br><br><br><br>');
    //角色攻略
    var createGonglue = function (zhu, hu, ci, jian, dw, gl, sk) {
        var path = 'extension/金庸群侠传/image/xingji/';
        var pre = '<img style=width:450px src=';
        var pre2 = '<img style=width:300px src=';
        var png = '.png><br>';
        var star = 'star' + png;
        var peh = pre + path;
        var pth = '：' + pre2 + path;
        return peh + 'sy' + png + '盟主' + pth + (zhu || 3) + star + '护法' + pth + (hu || 3) + star + '刺客' + pth + (ci || 3) + star + '奸细' + pth + (jian || 3) + star + peh + 'dw' + png + (dw || '未定义') + '<br><br>' + peh + 'gl' + png + (gl || '未定义') + '<br><br>' + peh + 'sk' + png + (sk || '未定义') + '<br><br><br><br>';
    };
    lib.characterGonglue = {
        ywhy_zhizunbao: createGonglue(4, 3, 4, 5, '至尊宝觉醒前主要是通过月光宝盒来控场，觉醒后通过♥️️（♠️️也视为♥️️）牌额外结算一次集攻防于一体，是一名偏娱乐性的角色。', '因为安装月光宝盒后会重复摸相同的牌，所以可以用来束缚敌方的核心，也可以配合即将大过牌的队友，比如李青萝、段延庆等 。想要快速获得朱砂痣觉醒，可以将月光宝盒安给场上的箭靶子或暴力输出角色。', '至尊宝的所有技能都和给人安装月光宝盒相关，他最害怕拆迁类、转移装备类角色，会让他无法获得朱砂痣而沦为白板，比如王承恩是他最大的克星，梦哭会让他永远无法给人安装月光宝盒。可以配合大过牌的队友或者玩装备流的队友。'),
        ywhy_xiaowei: createGonglue(3, 5, 4, 5, '小唯的剜心主打输出或强取别人的♥️️手牌，画皮则类似左慈一样能让她随机获得女性侠客牌，拥有了更多的可能性和更高的上限。因输出可观，更适合护法身份。', '发动剜心时，为了提高连续多次发动该技能的几率，应该首先选择没有手牌的敌人，百分之百打出伤害，选择手牌数量更少或者手牌为明牌没有♥️️的敌人。为了获得更多画皮侠客牌，你需要弃置更多♥️️手牌，降低了你的防御能力，需量力而行。<br> ', '小唯惧怕拆迁类敌人破坏她的手牌，使她♥️️手牌减少，画皮能力降低；因她回合内能打出多点伤害，害怕敌方萧峰发动偃兵将她翻面，同时能被赵敏的封赐配合或克制。'),
        ywhy_taisen: createGonglue(3, 5, 5, 2, '拳王泰森是一位强力输出武将，踢馆可以快速暴力击溃一名敌方核心。', '因踢馆的定点爆破能力，让他更适合护法或刺客身份，选中时机一举破敌，尽量在自己有闪的时候发动踢馆，确保自己造成的伤害更多从而在踢馆结束后，得到摸牌的福利。', '虽说是世界拳王，踢馆这个技能名也霸气侧漏，但是在实战中，踢馆需要挑软柿子，不可能去选择同样是暴力菜刀的敌方，比如李小龙、金轮法王等。'),
        ywhy_nezha: createGonglue(3, 4, 3, 5, '哪吒的能力是强力破坏所有角色的手牌结构和装备牌，再实施打击，觉醒后更是依靠各种法器暴力输出，适合护法身份。', '为了快速觉醒，队友可以在合适的时机对哪吒造成属性伤害。发动闹海时需慎重选择受到何种属性伤害，以及发动哪项闹海的子效果。', '装备流的敌人略克制哪吒，你可能在弃置他的装备时给他带来收益。最大的克星是无嗔大师，可以让他受到的属性伤害变成普通伤害，永远无法觉醒。'),
        ywhy_xiangshaolong: createGonglue(4, 4, 4, 3, '项少龙可以让游戏穿越回复到某一个历史状态，是一名娱乐性强于实用性的角色。因其能换两名角色的身份牌，所以他的身份适应性较为全面。 ', '鉴于穿越是将所有角色的状态回复到某个历史时刻，所以项少龙需要在团队综合状态偏好的时候记录穿越状态，比如在团队整体血量偏高、手牌和装备数量偏多，综合实力优于敌方的时候记录，以便将来敌方发生逆袭取得了游戏优势的时候，穿越回到记录的时刻，给团队一个重来的机会，改变游戏走向。匡正则需要根据你自己的考量，将一个虚弱的队友和一个强势的敌人交换身份牌。', '项少龙没有特殊的配合与克制。因穿越的瞬间角色会失去装备，所以能配合装备流队友。'),
        ywhy_zhuiming: createGonglue(3, 4, 5, 3, '追命是一名强势的菜刀选手，且因为追踪连续使用同名牌指定相同的目标能摸牌，适合攻击目标单一的身份，比如刺客。', '摄命这个技能需要追命在游戏中不间断地使用点数严格逆增的杀才能收获巨大的收益，所以你需要合理安排使用你的杀，尽量先使用点数更小的杀；另外你在使用普通锦囊牌时，也尽量连续指定相同的目标，以期触发追踪福利。包养系的队友要优先将杀交给追命。', '因摄命触发条件苛刻，再加上断杀的影响，导致摄命收益难以保障，如果遇到拆迁类敌方更是雪上加霜。'),
        ywhy_mengxinghun: createGonglue(3, 4, 3, 3, '孟星魂是一位特殊的菜刀型侠客，但是具有很大的局限性，对一个势力唯一存活的角色才有威慑性，但通常盟主和护法势力一致，所以他不适合做刺客，更适合做护法。', '为了发挥绝杀的最大收益，你可能会追着一个势力唯一的敌人打，不能很好地参与集火其他敌方核心。队友需要配合你集中去破坏势单力孤的敌人的手牌，帮助你精准打击敌方。', '菜刀最大的克星可能就是断杀神技了吧。'),
        ywhy_lixunhuan: createGonglue(4, 4, 3, 4, '火力满满的菜刀种子选手，多目标精准输出，是护法的不二人选。', '李寻欢输出不需要武器，但是想要获得飞刀标记却非常依赖装备。作为他的敌人，你最好不要随便去动他的装备，否则他反噬起来遭殃的是你整个团队。他是一个伪装备流，队友可以适当地对他拆拆装备。李寻欢的关键牌是酒、玄铁索链等，酒杀一刀那是毁天灭地的存在。', '小李探花，没有克星。和会移装备的角色能形成不错的配合。'),
        ywhy_guxizhao: createGonglue(3, 4, 5, 3, '一个听天由命的侠客，方差较大，自杀小分队成员之一。因为脸黑的话，困蹇分分钟会要了他的命，所以不合适当盟主，适合当孤注一掷的刺客，反正刺客命贱，死了一个他，还有千千万万个他。', '按照概率来算，顾惜朝可以通过困蹇大量过牌，快速集齐使用的锦囊牌种类，触发觉醒，他的人生就由自己掌握了。如果你是他包养系队友，请尽量将锦囊牌都交给他，以免他在自杀的道路上越走越远。', '我命由我不由天，谁能克我？我是你们全部人的克星。'),
        ywhy_baozupo: createGonglue(4, 4, 4, 4, '包租婆有着不错的掠夺卡牌的能力，还有一个不错的半强命技能，技能灵活，全身份适应。', '催租最多只能发动13次，所以你需要珍惜每次机会。对牌量较大的敌人发动时，尽量用点数大的牌来催租，以期能抢到更多的牌；但是如果目标只有一张牌，请用你最小的手牌来催租，不必在这种穷鬼身上浪费大点数！', '河东狮一吼，君子抖三抖，能克制包租婆的角色还没诞生，唯惧SP周芷若这丫头片子。'),
        ywhy_abao: createGonglue(5, 5, 5, 5, '神龙大侠是个超模侠客，全身份适应，没有他拿不下的身份。', '他是金庸包的新生代歌王，觉醒前后的阿宝都有可观的过牌能力，还能视为使用四种高质量卡牌，他可以自己一个人战斗，但前期如果你愿意包养他一下加速他的觉醒，那就是锦上添花了。', '作为一个吃货，可能最怕弹尽粮绝吧。'),
        ywhy_boya: createGonglue(4, 4, 4, 3, '博雅个人能力突出，能强命击杀敌人，也能为团队提拱庇护，适应除奸细外的所有身份。', '以军八来说，盟主护法团队只有三人，刺客团队为四人，所以从结界的理想状态（集齐四花色）来说，博雅当刺客可能更胜一筹。整个团队成员前期都需要克制使用手牌，尽量在弃牌阶段丢一张能让博雅集齐四种花色的牌，让你所在的团队达到最强防御状态！如果你已经缺失了一名队友，万不得已的情况下甚至可以给敌人一枚界（推荐触发几率低的红色牌），这样你们团队三人仍然有着魔防。因为忠护这个技能的存在，你也许是护法的天选之人，你死的时候还能调整一波界标记，为团队调整防御策略。', '博雅和他的团队都害怕被破坏手牌，导致无法及时获得结界标记，错失最佳防御时机。'),
        ywhy_baisuzheng: createGonglue(4, 5, 5, 3, '白素贞使用酒后可以强力清空敌人手牌或令敌人翻面，玄元更能强势救回濒死角色，适应除奸细以外的任意身份。', '白素贞上手比较简单，9点的手牌均视为酒，发动酒殇的几率较大；回合外存牌时，需要你特别注意自己牌的点数结构，最好能保存点数之和在9的整数倍中更大的牌，比如点数和为27的牌，这样在救濒死角色时，他能回复3点体力，摸9张牌，简直是满血复活！假如白素贞在回合外存了一张9点的手牌，她自己在濒死时，你是将此牌当酒自救，通过酒殇控制敌人，还是直接弃置这张牌来回复一点体力并摸3张牌呢？需要你根据当前形势再三斟酌。', '白素贞最喜欢包养系的队友比如张翠山、张松溪等，能提高她回合外发动玄元的几率，最怕拆牌类角色，让她无法发通过玄元救人。'),
        ywhy_ganshijiumei: createGonglue(4, 4, 5, 4, '甘十九妹是一位集控场与输出于一身的菜刀，适用于定点打击、精准破核，更适应刺客或护法。', '甘十九妹的七步断肠红，既可以用来控制一名敌人的牌，又可以用来转化含沙射影阻止一名敌人回血，可谓重大杀器。如果甘十九妹杀你且你没有杀，那么绝剑的选项1必选，你需要在第2选项和第3选项中间权衡选择，建议尽量选2，否则她获得七步断肠红后，可能让你在累计使用七张牌后裸奔，那你就陷入危境了。', '强势菜刀，惧怕断杀和的手短。'),
        ywhy_honghaier: createGonglue(3, 5, 4, 3, '红孩儿来势汹汹，杀气腾腾，输出爆表，但本身脆皮，适合当护法。', '红孩儿的鬼胎取自他自缚手脚吊在森山老林里博取唐僧同情，图谋不轨的情节。如果你想凭借此技能输出，你需要尽量选择可能没有黑色手牌的敌人，若他们没有黑牌替你解开横置，则你最多可造成3点输出。若你被红孩儿鬼胎选为目标，你需要考量你的难兄难弟手中有无♠️️，不想团队集体受难的话，你需尽可能地为红孩儿解开束缚。', '红孩儿能和一些玩火焰伤害的角色形成配合与克制，比如摘星子。'),
        ywhy_qingmin: createGonglue(4, 5, 5, 4, '晴明的部分牌可以指定多目标，可以选择三名角色成为式神，式神回血你可以蹭福利，适合护法和刺客。', '晴明驱神的收益来源于式神回血，所以开局选择式神很重要。建议首先主公，选择杨上的核心，因为他们受到集火的可能性更大，同时吃桃、被救起的几率更大，可将驱神的收益最大化。', '因驱神的收益核心在于式神回血，可以和一些医生系角色形成配合，比如胡青牛、平一指等。'),
        ywhy_jinyong: createGonglue(4, 4, 5, 3, '金庸的技能主要是辅助队友，给队友加BUFF，定位为辅助，队友越多则越强，最适合刺客身份。', '如果你是护法，出场时务必选择和盟主一样的朝代，以便发动侠魂时你和盟主都能享受免疫AOE的红利。在选择免疫开仓和歃血时，尽量选择核心。', '金庸比较克制铁木真、耶律洪基等想要入侵中原的角色。'),
        ywhy_zongzi_female: createGonglue(3, 3, 3, 3, '你只是一具行尸走肉的尸体而已，别多想了。', '攻略', '生克'),
        ywhy_zongzi_male: createGonglue(3, 3, 3, 3, '你只是一具行尸走肉的尸体而已，别多想了。', '攻略', '生克'),
        ywhy_zhangqiling: createGonglue(4, 4, 4, 4, '张起灵是一名娱乐性的角色，其拥有可观的过牌和隐形输出，身份性适应性较为全面。', '玩张起灵没有较大的技术门槛，通过倒斗可以使用无极而生过牌，也可以放出尸蹩咬人输出，而你还能通过贩卖麒麟血为他人提供庇佑。被尸蹩咬死的角色会成为大粽子，大粽子会无差别攻击活人，则你的麒麟血会成为炙手可热的商品。', '因粽子会无差别对活人使用比武，可以配合穆念慈、岳不群等能蹭比武红利的角色。'),
        ywhy_yewen: createGonglue(4, 4, 3, 5, '叶问会通过战祸发起大量的鞑虏入侵，体现了那个兵荒马乱、民不聊生的特殊时代背景。适合护法、奸细等身份。', '战祸是锁定发动，体现了那个弱肉强命的时代背景（装备多代表实力强）。而扬武则可以在他人发起鞑虏、比武时让团队集体进行抵抗状态，以战祸中得以生存。你需要注意的是，有人放万箭时，你可以对敌方发动扬武，把他们的手牌全变成杀，扰乱其防御。', '叶问可以配合或克制一系列转化AOE、比武的角色，比如铁木真、耶律洪基等。'),
        ywhy_baozheng: createGonglue(4, 4, 4, 3, '包拯是一位综合能力较为全面的侠客，可过牌、可改判、可控场，身份适应性非常全面。', '随着能打出无牌源伤害的角色越来越多，包拯明察的发挥空间也就越来越大，虽然别人可以不用牌造成伤害，可是明察秋的包公可以指定你的一张牌为作凶器，不但可以扣押掉你这张凶器牌，日后还能用它来当金刚护体或是用于改判，康敏、殷素素、蓝凤凰、摘星子等人瑟瑟发抖。同时他还能为无来源伤害指定伤害来源，联动发动明察，比如为生死符指定来源，既可以用于收人头，又能用于嫁祸盟主杀害护法。', '包公是一切无来源或无牌源伤害类角色的克星。若想人不知，除非己莫为！'),
        ywhy_wuxie: createGonglue(5, 5, 5, 5, '吴邪能过牌、能找宝物、能控判，全面小能手，全身份适应。', '吴邪本身没有特殊的过牌技，但是他遇强则强，谁回合内用牌多，他就能通过留影拍照留档，到自己的回合内冲洗照片，摸到这些记录的牌。所以在吴邪面前，那些刷牌党们，劝你们收敛，否则不过是为吴邪提供样本而已，他会如数奉还。', '克制或者配合刷牌流，你刷他也收，而且你还基本上点穴点不中他。'),
        ywhy_hubayi: createGonglue(4, 5, 4, 4, '胡八一集输出和过牌于一体，身份适应性较为全面。', '胡八一会随机地将两名角色永久横置，且以此法被横置的角色受到属性伤害加一，队友需要集中火力去攻击被锁住的“妖”，但因为是随机，也可能会坑到队友。不要试图去解开你的队友“妖”，那样只会浪费你的玄铁索链，唯一的办法就是给胡八一好处，让他摸牌，你才有机会解开。如果胡八一的阴烛为火杀和火弹，那他将会大量过牌，吹灭还是点亮这支蜡烛，就看双方的博弈和运气了。', '胡八一和能够打出属性伤害的角色有较好的配合，比如红孩儿、摘星子等。'),
        ywhy_jiushu: createGonglue(5, 5, 4, 4, '打僵尸小分队队长，能复活死亡角色成为僵尸，通过僵尸咬人，再人传人来造成输出，最适合盟主或护法看别人相互攻击了。', '僵尸出世了，别怕，有九叔呢，买张灵符保命吧。九叔可以通过卖灵符过牌，九叔团队没事彼此烧烧符挺好玩的，还能帮助九叔增加灵符销量。缺陷就是僵尸随机攻击人，有可能便宜敌方团队收人头了。', '九叔专门打僵尸，给人安全感，谁会这么无聊去克制九叔呢。倒是那些能打出火焰伤害的比如红孩儿小朋友，能烧毁灵符，帮助九叔销售灵符，九叔谢谢您嘞！'),
        ywhy_yaoyue: createGonglue(3, 4, 4, 3, '邀月的两个技能偏极端，在特殊情况下能收到意想不到的收益，但是不太适应盟主和奸细，适合护法和刺客。', '邀月使用牌时可以临时交换两名角色的武将牌，这个操作有非常多的可能性。你需要注意以下要点：杀卖血类、反馈类、阴阳怪气怼牌类（如SP赵云、大乔等）敌人时，将他的武将牌和一名没有卖血技能的角色交换，遏止他卖血；开AOE时，将一个没有卖血技能的队友和一个有卖血技能的敌人交换，遏止敌人卖血的同时队友还能卖血，收益相当可观。而明玉，大概是一个比较依赖关键锦囊牌的技能，游戏会记录你首次使用的普通锦囊牌的花色与牌名，你整局游戏该花色的牌均视为此牌，所以你首张普通锦囊牌比较适合使用无极而生、妙手空空、或AOE之类的关键牌。', '邀月喜欢包养系角色，能第一时间认出她是队友并将关键锦囊牌送给她，克制一切卖血等。'),
        ywhy_luxiaofeng: createGonglue(3, 5, 4, 3, '陆小凤的凤舞可以将使用牌的目标增多，同时不受暗器牌干扰还能获得暗器牌，较适合护法身份。', '在关键时候发动凤舞，可以实现多个破敌，还能把敌方的关键武器牌变成一把空余范围的破铜烂铁，比如能有效遏止敌人用圣火令连续输出。', '陆小风能够配合或克制转换暗器牌的角色，比如殷野王、赵半山等。'),
        ywhy_fangshiyu: createGonglue(3, 5, 4, 2, '方世玉的【劫刑】是一个强势保核技能，是护法的天选之人。', '作为方世玉，你需要时刻留意要保留点数更大的手牌，以期在关键时刻能用K点的牌来劫刑，可以让你方核心满血复活，还能一牌拆四牌，一举两得；但如果你手牌点数不够大还要硬痛感法场，只能是自身难保。', '方世玉能够配被改变拼点结果或蹭拼点红利的角色配合或克制，比如穆念慈、纪晓芙、杨康、胡青牛等。'),
        ywhy_qiumoyan: createGonglue(3, 4, 4, 3, '邱莫言的主打保核，是团队中一个重要的辅助性角色，适合护法等身份。', '别人对你使用牌，你可以变成比武，适合在你被杀却没有闪等情况下奋力突围，说不定还能起到反制效果，同时奋营让你有着非常可观的保核能力。', '邱莫言是岳不群的护法神选。'),
        ywhy_lixiaolong: createGonglue(4, 5, 5, 4, '李小龙是一位适合近身肉搏的强力菜刀，适合近位刺客和远位护法。', '李小龙能力较为全面，有输出、有过牌，但是局限性也较为明显，只适合近身格斗，对远位敌人无能为力。作为李小龙，你徒手输出能力要强于装备武器，若非万不得已，不要轻易安装攻击范围太大的武器牌，以免破坏你截拳的生效条件。如果你是李小龙的包养系队友，请尽量将点数最大的杀交给他。', '远位敌人可能就是李小龙最大的克星了，毕竟不装武器你够不着他，装了武器对他又不痛不痒。'),
        ywhy_suqier: createGonglue(3, 4, 5, 4, '苏乞儿是一位苟住爆发的瞬间输出型角色，节奏偏慢，比较依赖合适的时机，更适合刺客或者奸细。', '若你选择了苏乞儿，那你所需要最的最大的事情就是苟住性命，尽量多讨几口酒喝，看准时机，发动扫浊使用打狗棒，来达到瞬间爆破敌人的目的。如果你是苏乞儿的敌方，要不要使用酒，可要仔细掂量了，若被他讨了去，来日砸在你或队友身上，还是十分肉痛的。', '打醉拳的苏乞儿，当然喜欢和跟他一样醉生梦死的角色做朋友了，比如令狐冲任盈盈。'),
        ywhy_huawuque: createGonglue(3, 5, 4, 3, '花无缺的核心技能是在使用牌时暂时交换目标和另一个角色的牌，能有效输出；同时还能转化关键锦囊牌，最适合护法身份。', '当你需要快速击杀某个敌人时，但他手牌富足、还有防具，此时你只需要对他发动移花，将他和一名没有手牌或没有防具的角色互换手牌或防具，则你可以实现伪强命效果，移花这个技能在特殊情况下还能打出骚操作，击杀角色后不用换回手牌，则有可能将敌方一手好牌“赠送”给队友。接玉则有可能实现连续打出AOE等关键牌来实现全面清敌。', '移花能暂时交换两名角色的装备，所以可以和装备流角色如慕容复、SP周芷若等形成良好的配合；在开AOE或开仓、歃血时，如果团队里面有太极系队友如张三丰，再配合移花转化一张此牌，可以为团队带来8张牌的收益。'),
        ywhy_huangfeihong: createGonglue(4, 4, 4, 3, '黄飞鸿有一定的拆迁能力，还能通过图强来为团队回血或向敌方打出输出，适应除奸细外的所有身份。', '发动佛山无影脚时，虽然拆适敌人很爽，但你的杀有较大几率转移给下家，拆得越多，转移的几率越大，如果目标下家是你的脆皮队友，需要你谨慎思考了。发动图强时需要注意顺序，队友在前、敌人在后。', '因图强能让敌方失去体力，会被蹭“失去体力”事件红利的角色比如阿紫、文泰来克制或配合。'),
        ywhy_baiyutang: createGonglue(4, 4, 5, 3, '白玉堂的闹京可以精准破敌，比较适合速战速决、一举破核的战略方针，最适合目标明朗的刺客身份。', '闹京在能实现有效拆敌方牌的同时，还兼具控顶控判作用，综合能力较全面。闹京牌放在第几张、目标该猜第几张，则完全是双方的博弈了，毫无攻略可言，被闹京了就自求多福吧。睚眦这个技能则会让敌方永久带上标记，只要有弃牌事件则会额外弃一张牌，配合闹京更是增大了分分钟让敌方裸奔的可能性。', '睚眦非常克制那些通过弃牌来发动的技能，比如展昭的禁卫；同时亦能配合那些拆迁别人牌的队友，比如SP展昭的宵禁。'),
        ywhy_zhouhuaian: createGonglue(3, 4, 4, 3, '周淮安的救孤集输出和防御为一体，主要适用于护法或刺客身份。', '周淮安发动救孤时，能否将救孤牌顺利传递到他想要保护的人手中，则需要看路上每个人是要协助他还是为难他了。如果你是他的敌对方，不希望他为他的核心队友回血，则你可以宁可受到他一点伤害，也要中止这场千里救孤（事实上你还能获得他一张牌，算起来不太亏）。', '能传递关键牌和帮助团队回血，可以配合装备流、锦囊流、转化流等特定角色。'),
        ywhy_shenglian: createGonglue(3, 5, 4, 3, '沈炼能对多目标同时输出，还兼具有卖血过牌技能，最适合护法。', '沈炼攻击单一时，会无差别打击目标的上家和下家，连座效果杠杠的，则有可能连累队友，是护法的不二人选。成为AOE之类多目标牌的目标时，还能金蝉脱壳顺便过一下牌，个人能力较为突出，作为他的敌对方，你需要谨慎使用AOE等牌。', '沈炼和铁木真、耶律洪基等能转化AOE的角色具有不错的配合。'),
        ywhy_chuliuxiang: createGonglue(4, 4, 4, 4, '楚留香是一位过牌能力出色的角色，能够随时随地原地起暴，身份适应性较为全面。', '前期你需要尽可能多地给场上角色留“香”，尤其是那些容易围攻的靶子和暴力输出的菜刀，好让他们快速为你打工，成倍数地积累“香”，以期迅速将“香”兑现成为你的手牌。', '三血小身板略为脆皮，但是“香”的存在能为他提供一定防御。'),
        ywhy_yuhuatian: createGonglue(4, 4, 4, 4, '雨化田拥有非常出色的过牌能力，是一名养成系选手，到了后期尤为可怕，全身份适应。', '未造成过伤害的红色普通锦囊全部能被你获得，且你成为锦囊牌的目标会因累计次数而获取大量过牌，这意味着你能获取大量的无极而生、红色金刚护体、妙手空空和见招拆招等，你需要做的就是保住小命，对你来说时间就是金钱，你活得越久，收益将会越大，敌人干不掉你，就等着被你干掉吧。', '雨化田非常喜欢能转化锦囊牌的角色，能够提高你方卡牌的使用率。'),
        ywhy_xiaoyuer: createGonglue(4, 4, 4, 4, '小鱼儿的桀骜、诓惑是集攻防于一体的技能，还能有效克制卖血流，个人能力突出，生存能力较好，全身份适应。', '因黑色牌大部分为攻击牌，如杀、决斗，红色牌大部分为防御牌如桃、无极而生，所以桀骜既能扩大输出，又能福庇队友。诓惑不管成功失败，都是有利无弊，所以务必对敌方发动，因为猜错会失去体力，优先对卖血流的敌人发动，比如洪七公、郭破虏等。狡兔的存在注意你无法屯桃救队友，眼看着一手好牌如流水匆匆去，繁花尽落眼前，但是塞翁失马，蔫知非福，也许更好的牌等着你呢？', '小鱼儿非常克制卖血反馈流角色。'),
        ywhy_spzhanzhao: createGonglue(3, 3, 3, 3, 'SP展昭可以为团队加强武装力量，同时自己可以获得一部分菜刀技能，综合能力较为全面。', '适时地为团队上武装，但有可能破坏队友的手牌结构比如关键闪和桃等，发动宵禁需量力而行。', '发动宵禁需弃置目标的牌，所以可以被白玉堂的睚眦配合或者克制。'),
        ywhy_zhanzhao: createGonglue(3, 3, 3, 3, '展昭可以迅速起装备，御猫还能打打心理战实现多目标输出，集输出和娱乐性于一体，适应护法身份。', '如果你和队友被展昭发动御猫了，则此时非常考验你和队友的默契，选择谁出来承受这张杀，就看你团队中有没有贪生怕死之徒了。展昭发动御猫时千万不要选择带了防具的目标，否则所有御猫对象会无条件选择有防具的角色，导致你的杀没有任何输出（比如你用黑色色发动御猫时选择了装备了北斗阵的敌人）。成为御猫的目标后，首先牌多血厚的队友来承受这张杀，如果你们像老鼠一样四下溃散，互相推诿，那你们可能会被这张杀一网打尽的。', '发动禁卫需要弃牌，可以被白玉堂的睚眦配合或者克制。'),
        //其他篇章
        qtpz_hehongyao: createGonglue(2, 4, 5, 3, '何红药能为团队盗取装备，弃牌还能定向输出，适合做目标性更明确的刺客。因自盗有着极强的反噬性负面效果，极端不适应盟主身份。', '为了爱郎盗取教内宝物的何红药，能及时为团友分配装备牌，以解燃眉之急。若你贪心盗更多装备，则你面临惩罚的概率则更大。怨毒能有效输出，需要对你最希望他早日毁灭的敌人使用。', '何红药能配合装备流，比如慕容复、长白三禽等，能克制一众卖血流的敌人。'),
        qtpz_huyidao: createGonglue(3, 5, 4, 3, '胡一刀有过牌能力和拆牌能力，同时还能精破核，适合护法或刺客。', '作为胡一刀，发动鏖战时需要权衡让谁摸牌、让谁弃牌，要掂量自己手牌中杀的情况，是不能在鏖战中占到上风，不要搬起石头砸自己的脚。', '能在比武占绝对优势的角色如金轮法王会克制胡一刀；能蹭比武红利的角色如穆念慈能克制或配合他。'),
        qtpz_yuanzhiyi: createGonglue(3, 4, 5, 3, '袁紫衣是一位玩家较灵活的角色，三赦既能用于紧急情况下作为缓兵之计救队友，又能为团队加BUFF强化后期输出，较适应护法或刺客。', '当袁紫衣作为BUFF选手时，可能会拖慢团队前期的输出节奏，毕竟有惩的角色对有赦的角色第二次造成伤害时才持平，第三次造成伤害时才有加一点伤害的收益，适合在持久占中采取此策略。当袁紫衣用三赦紧急救队友时，后期需要强化对赦过的这个队友的保护力度，否则将会落得将队友献祭的下场而已。', '强命型的菜刀是袁紫衣的好搭档，能保证后期稳定输出从而让BUFF加成兑现。'),
        qtpz_huyidao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_yuanzhiyi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_xiaxueyi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wuchendashi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wenqingqing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_liyuanzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wentailai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_hongniangzi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_diyun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_meiniansheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_songxiance: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_pingasi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_hufei: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_xieyanke: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_yuanchengzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_tianguinong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_aqing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_kasili: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_huatiegan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_yuyutong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_ajiu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_chengbenzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_chenglingsu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_jyliyan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_miaorenfeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_haidafu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_zhuyoujian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wuzixu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_xuedaolaozhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_huoqingtong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_dindian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_huoayi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_muzhuolun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wangchengen: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_lizicheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_niujinxing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_zhangzhaozhong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_duoergun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_lintuisi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_luobing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_weichunhua: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_weixiaobaojianning: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_pangshoutoutuo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_mujianpin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_fangyi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_weixiaobao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_suquan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_weihutou: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_xuanye: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_chenjinnan: createGonglue(3, 4, 4, 3, '陈近南是一名控场类武将，同时还能掉血将队友使用的AOE牌再次给队友，组成小绝情阵，自己还有有小过牌。适合当护法或刺客。', '对敌人发动凝血时，对让其限入两难的抉择，无论掉不掉血都比较难受，下个回合将被封印一种类别的牌。如果你是陈近南的队友，你可以大胆地放鞑虏入侵等，他有可能助你一扫全场。', '陈近南的关键牌是杀和队友的AOE，和能够获得AOE的队友是最佳拍档。'),
        qtpz_jianninggongzhu: createGonglue(3, 4, 4, 4, '建宁公主的技能综合能力较全面，能过牌、能拆牌、能配合队友转化牌、还能转化延时锦囊牌，全身份适应 。 ', '建宁公主的欲孽可以在队友的配合下转化关键牌，同时辅助队友过牌；也可以用来拆敌方的牌；同时，还可以在队友有负面延时锦囊牌的情况下用来帮队友拆除隔空点穴等。违诏是一个收益较大的技能，因为金庸包里有正面延时锦囊牌如运功疗伤，作为建宁的敌方，建议放弃对她的团队使用延时锦囊牌，她可以全部转化为运功疗伤等，反而帮了她；也不要对你的队友用运功疗伤，她会转化为隔空点穴等，反而害了队友。', '建宁公主能配合或者克制所有能转化延时锦囊牌的角色，比如鸠摩智、桃谷六仙、吴应熊等。'),
        qtpz_fengjizhong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_aobai: createGonglue(4, 4, 4, 3, '鳌拜本质上一个多刀流的菜刀，兼具一定的过牌能力，集攻防于一体，强度中规中矩。', '每轮可以捡一张杀来输出，所以见招拆招和隔空点穴是他的关键牌，队友也需要注意尽量在弃牌时弃一张杀来配合他发动摄政。如果你是他的敌人，谨慎对他使用比武和鞑虏入侵，有可能偷鸡不成蚀把米。', '鳌拜较克制或配合过牌大的角色，过牌大的侠客弃牌时弃置杀的几率更高，鳌拜更容易发动摄政。'),
        qtpz_haidafu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_zengrou: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_hongantong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_maodongzhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_shuanger: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_sangjielama: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        qtpz_wusangui: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        ldj_wuyingxiong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        //笑傲江湖
        xajh_jiangnansiyou: createGonglue(3, 4, 5, 3, '江南四友是一名苟住爆发的瞬间打击破核的武将，但容易后继无力，适合目标明确的刺客身份。', '拥有四个限定技的江南四友，其每个技能之间或多或少也有千丝万缕的联动性。选择何时喝下越陈越香的珍酿酒至关重要，依局势而定，不能一概而论，如果是在持久局，你可以选择苟到中后期再饮酒，配合索链和属性杀，也许能打出一杀秒全场的骚操作。点睛和挥毫往往会联合起来同时发动，可以有机会瞬间破核甚至一路杀下去，如果你是江南四友的包养系队友，尽可能地将某个花色的杀送给他。对弈则是一个非常考验综合能力的技能，细说起来可以写到2000字，总之根据你想要该延时锦囊牌判定成功或失败，以及你的手牌花色结构再选择合适的对弈对象，小心别搬起石头砸了自己的脚。', '点睛可以配合暴力菜刀比如李小龙，带上半个咆哮的李小龙输出还是可观的，大部分情况下如果有人包养自己，点晴对自己发动是最适合的。'),
        xajh_sp_tianboguang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_liangfa: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_wumingtaijian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_fengqingyang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_ningzhongze: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_feibin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_tianmendaozhang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_linghuchongrenyinyin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_dongfangbubai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_ludayou: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_renwoxing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_yanglianting: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_yuelingsan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_yuebuqun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_linghuchong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_moda: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_zuolengchan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_laodenuo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_linpingzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_zhuqianqiu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_tianboguang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_renyingying: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_pingyizhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_spdongfangbubai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_yilin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_yucanghai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_dongfangbubaiyanglianting: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_lanfenghuang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_taoguliuxian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_liuzhengfengquyang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        xajh_shangguanyun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        //倚天屠龙记
        yttl_yulianzhou: createGonglue(4, 4, 4, 3, '俞莲舟综合能力较强，有可观的控敌人牌的能力，还有不凡的输出能力，同时还能为团队（包括自己）赠送技能太极，身份适应性比较全面。', '因绝户只能弃置手牌区、装备区和判定区里唯一的牌，作为俞莲舟的队友，你需要为他制造机会，尽可能地将敌人顺拆至某个区域只剩一张牌；俞莲舟的太极虽说是传道之用，但最适合给自己，在合适的时候发动柔拳来强化输出，同时还有可能打光手牌，给了自己获得太极的机会，获得太极后可以两个技能联动，集过牌与输出于一体。', '俞莲舟没有明显的克制的配合关系，个人能力突出。'),
        yttl_zhangsongxi: createGonglue(3, 4, 4, 3, '张松溪是一个包养系角色，自己还拥有可观的过牌技能，定位为辅助和爆发，适合护法或刺客。', '柔道类似于一个随机有可能发动的红牌版洛神，只要你失去最后的红色手牌即可发动。你需要做的就是尽一切可能使用或打出你所有红牌，作为他的敌方，若想在他的回合外集火他，可以交给他一张无关紧要的红色牌，全力攻击他，此时他也就是一个脆皮而已。', '包养系的角色是万金油，可以在团队中传递关键牌，比如将装备交给SP周芷若、将黑牌、黑杀交给张无忌让他更能酣畅地发动逆绝和九阳等。'),
        yttl_zhangsongxi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_xinran: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_huangshannv: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhoudian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_hanliner: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_moshenggu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhangsanfeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_changbaisanqin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yangxiao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_fanyao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhuyuanzhang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_due: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yinli: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_jinhuapopo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_changbaoshu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_changyuchun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yinliting: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_luhe: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_miejue: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_songqingshu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhangcuishan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhangwuji: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_daiqisi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_spzhouzhiruo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_hanqianye: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhouzhiruo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_chenyouliang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_spyangdingtian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yangbuhui: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yinsusu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yinyewang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_spxuanmingerlao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_xiexun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_weiyixiao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_xiaozhao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_jueyuandashi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_guoxiang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhaomin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yuanzhen: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yudaiyan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_jixiaofu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_huqingniu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_songyuanqiao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_doujiushenseng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_yintianzheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_wujincao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhuchangling: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_zhujiuzhenwuqingying: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        yttl_spsongyuanqiao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        //神雕
        sdxl_daerba: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_luzhanyuan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_spyangguo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_shendiao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_zhenzhibing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_fengmofeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_jue_duguqiubai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_chengying: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_guojinghuangrong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_hubilie: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_yangguoxiaolongnv: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_yangguo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_xiaolongniv: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_jinlunfawang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_mengge: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_gongsunzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_spguoxiang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_limochou: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_qiuqianchi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_zhaozhijin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_guofuX: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdxl_guopolu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        //射雕
        sdyx_wangchongyang: createGonglue(3, 4, 3, 5, '王重阳的论剑接近于限定技，充满随机性和不确定因素，更适合单打独斗的奸细身份。', '满足条件时，是否发动论剑，要看场上角色的生存状态，比完杀更具有不确定性，容易误伤队友，甚至还有可能便宜敌方执行高伤奖励和击杀奖励，故不建议奸细以外的身份选择。玄通则让你能迅速获得AOE、决斗等输出牌。', '敌方团队中的菜刀，尤其是高伤害菜刀（如李小龙、无名太监等）是他最大的克星；但也能配合高伤害队友获取高伤害奖励。'),
        sdyx_hanbaoju: createGonglue(3, 4, 4, 3, '韩宝驹前期通过随机给所有角色上坐骑、换坐骑，在该随机事件中寻求团队获得过牌的机会，但因为存在大量不可控因素，技能发挥发差大，更偏娱乐性，故其没有特别适应的身份，适合喜欢赌博、追求不确定刺激的玩家。', '开局上坐骑、以后每轮游戏结束换坐骑均为随机事件，所以会有非常大的给敌方上坐骑的风险，这就需要这位套马的汉子能迅速抓到玄铁索链，来将这些生性顽劣的野马服贴地套在团队的马厩内。脱缰的野马在随机奔跑的过程中，如果有幸进入了团队的厩内，则你就有机会为团队带来大量的过牌，过牌数量取决于马儿们的等级。', '如果你是韩宝驹的包养系队友，请第一时间将玄铁索链交给他，好让他用来为团队拴马，作为韩宝驹你也需要注意在开仓放粮中首选玄铁索链。韩宝驹和装备流角色配合起来会非常开心，比如张无忌、SP周芷若、慕容复等，同时这些角色也是他的克星。'),
        sdyx_quanjinfa: createGonglue(5, 4, 4, 5, '全金发有一个具有方差但较稳定的过牌技能，同时有一个非常肉的防御技，适合盟主和奸细的身份。', '从算法组合上来说，你展示的牌点数越大，求和组合中牌的张数可能越多，所以你在发动亨通时尽量展示点数最大的手牌。因为精算非常肉盾，如果你是全金发的敌方，若要快速击破他，尽量选择能强势破坏手牌的角色，比如朱聪、李自成、林平之等，唯有扒光他的手牌才能让他变成䏢皮。', '全金发的生存非常依赖点数大的手牌，所以非常惧怕朱聪、李自成等能破坏手牌结构的克星。'),
        sdyx_jue_guojing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_yuefei: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_zhucong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_spyinggu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_liping: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_shatongtianhoutonghai: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_jue_huangshang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_huazheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_sphuangyaoshi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_huangrong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_sp_huangrong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_meichaofeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_tuolei: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_hongqigong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_ouyangke: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_tiemuzhen: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_duantiande: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_kezhene: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_yinggu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_yangkang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_qiuqianren: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_zhoubotong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_fengheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_ouyangfeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_guojing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_zhebie: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_huangyaoshi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_spguojing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_munianci: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_wanyanhonglie: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_duanzhixin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_qiuchuji: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_jue_guojing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        sdyx_baoxiruo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        //天龙八部
        tlbb_jue_damo: createGonglue(5, 5, 5, 5, '达摩有一个高级的过牌技能，全身份适应。', '弃牌阶段，你需要注意选择弃置牌的花色。例如你手牌里面没闪或桃，则你可以弃置♦️️或♥️️手牌，则你将有较大概率或者闪或桃。作为他的敌方，尽可能不要拆他手牌，拆了也是白拆。', '达摩没有较明显的克制关系，但是配合花无缺这样的队友会让你的体验感成倍增加。'),
        tlbb_spwangyuyan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xuemuhua: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_spduanyu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_duanyu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_duanyanqing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_azhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xuzhuzi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_wangyuyan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_kangmin: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_suxinghe: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_yuelaosan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_zhongling: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_qiaofeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_ganbaobao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_spxuzhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_liqingluo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_tianshantonglao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xiaoyuanshan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xuanciyeerniang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_yeerniang: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_madayuan: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_huangmeiseng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xuzhuliqinglu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_baishijing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_azhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_baobutong: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_qinhongmian: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xuanci: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_liqinglu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_liqiushui: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_zhaixingzi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_daobaifeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_yunzhonghe: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_duanzhengchun: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_sptianshantonglao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_dingchunqiu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_muronglongcheng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_saodiseng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_xiaofeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_muwanqing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_murongfu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_ruanxingzhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_quanguanqing: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_murongbo: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_wuyazi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_spazi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_yelvhongji: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_jiumozhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_jue_tianshantonglao: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_youtanzhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_spjiumozhi: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_juexiaofeng: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
        tlbb_qiaofengazhu: createGonglue(3, 3, 3, 3, '定位', '攻略', '生克'),
    };
    if (!lib.jy_player_ziliao) lib.jy_player_ziliao = {};
    var ziliao = {
        tlbb_yelvnielugu: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_jieshan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_jieshan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '耶律涅鲁古',
            },
            taic: {
                tlbb_xiaoqiang: ['铁甲雄兵，力讨国贼！', '铁骑百万，即日起兵！'],
                tlbb_qipan: ['众军听令：誓取洪基首级，申伪讨逆！', '废黜伪帝，匡正皇室！'],
                tlbb_jieshan: ['解甲来降者，可从一等功！', '洪基速速来降，休做无谓挣扎！'],
                zhengwang: ['成王败寇，古今如是！'],
            },
            design: ['狗子', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_zuozimuxinshuangqing: {
            debug: {
                playerName: '左子穆辛双清',
            },
            taic: {
                tlbb_fenting: ['滚滚澜沧水，涛涛剑湖波！', '落木滴寒气，惊蛰鸣剑风！'],
                tlbb_doujian: ['试观今日之域中，竟是谁家之天下？', '宗门分高下，剑上决胜负！'],
                tlbb_yubi: ['月下玉璧裹剑影，一眸纯白似仙瞳。', '仙人化身，神来之剑！'],
                zhengwang: ['无量剑，愿听候灵鹫宫差遣！'],
            },
            design: ['冰霜墨菊', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_cuibaiquan: {
            debug: {
                playerName: '崔百泉',
            },
            taic: {
                tlbb_jizhu: ['算珠连射，定取尔等性命！', '行不更名坐不改姓，老子便是金算盘！'],
                tlbb_qianzhu: ['隐疾虽痛，怎及师门大仇！', '姑苏慕容氏，你我不共戴天！'],
                zhengwang: ['千算万算，人心难算……<br><br><br>'],
            },
            design: ['冰霜墨菊', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_shiqinglu: {
            debug: {
                playerName: '石清露',
            },
            taic: {
                tlbb_shihua: ['泪眼问花花不语，风吹红乱乱我心。', '不经一番心血溉，怎得花中第一流！'],
                tlbb_yihui: ['阆苑花发处，人间葬红时！', '南国有名种，春时寄相思！'],
                zhengwang: ['人非花是花睹人，花是人非人无花……<br><br><br>'],
            },
            design: ['蓦焱', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_zhiguangdashi: {
            debug: {
                playerName: '智光大师',
            },
            taic: {
                tlbb_pudu: ['渡海发慈心，誓愿救万民！', '佛前悔罪业，行善赎功德！', '不如天下之罪业，皆归老僧罢！', '雁门关下，残阳如血;往事依稀，不见旧人！'],
                tlbb_zaizhang: ['身染疾恙，亦不可移我之志！', '奇木异树，可治瘴毒！'],
                tlbb_tashu: ['乔帮主，你本姓是萧，你可知否？', '石刻虽能抹，罪业不可销！'],
                zhengwang: ['恩怨是非，俱作尘土……<br><br><br>'],
            },
            design: ['待定', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_xiaofeng: {
            debug: {
                playerName: '萧峰',
            },
            taic: {
                tlbb_yanbing: ['陛下此生，永不犯宋。若违此誓，有如此箭！', '单于断箭英雄去，月下犹闻燕赵歌。'],
                tlbb_xunzhi: ['风雨恨萧萧，胡汉难共朝！', '此鉴苍生应有愧，忍将碧血洒青天！'],
                zhengwang: ['恨怒喋血，终归黄土；花可解语，命殒青桥……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        tlbb_spwangyuyan: {
            debug: {
                playerName: 'sp王语嫣',
            },
            taic: {
                tlbb_dianbo: ['右指运力，攻其膻中穴！', '打狗棒法之妙，在于黏字诀和缠字诀。'],
                tlbb_xunjing: ['还施水阁还几度，玲珑福地聆千经！', '倾君复燕览玉洞，几闭尘世窥琅嬛。'],
                zhengwang: ['最是人间留不住，朱颜辞镜花辞树……<br><br><br>'],
            },
            design: ['阿也', '落影逝尘', '大熊小猫'],
        },
        tlbb_jue_damo: {
            debug: {
                playerName: '绝达摩',
            },
            taic: {
                jue_yijing: ['吐故纳新，兼收并蓄！', '花开花落非僧事，自有清风对碧流！'],
                tlbb_xisui: ['一穴开百穴，一脉通百脉！', '此脉一动，百脉俱通！', '人生如逆旅，我亦是行人！', '无根无极，万法自然！'],
                zhengwang: ['轮回过患，人生无常……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_dingchunqiu: {
            debug: {
                playerName: '邪丁春秋',
            },
            taic: {
                tlbb_shidu: ['神功控魂，剧毒腐心！', '世人皆惧断肠物，不见最毒在人心！'],
                tlbb_huagong: ['奇毒入筋脉，妙法化神功！', '化功大法法无边，奇毒异蛊蛊人心！'],
                tlbb_shending: ['星宿宝鼎纳百毒，老仙神功破万诀！', '万毒加身，见血封喉！'],
                zhengwang: ['施毒害人一世，终究毒上己身……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_wangjiantong: {
            debug: {
                playerName: '汪剑通',
            },
            taic: {
                tlbb_xueyi: ['寸心寸忧寸血泪，寸疆寸土寸河山！', '一呼百应筑边关，抛泪洒血铸英魂！'],
                tlbb_wusha: ['血战雁门征夫泪，多少憾事未可知！', '风合黄草掩白骨，霜摧红叶映残阳！'],
                tlbb_choumou: ['非我族类，其心必异！', '乔峰乃契丹遗血，一举一动需倍加监视！'],
                tlbb_yixin_new: ['乔峰若起异心，丐帮上下当倾力诛之！', '事关宋辽两国杀伐，汝当守口如瓶！'],
                zhengwang: ['胡汉恩仇英雄泪，雁门边声葬忠魂……<br><br><br>'],
            },
            design: ['薛晨鸭', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_wulaoda: {
            debug: {
                playerName: '乌老大',
            },
            taic: {
                tlbb_fudu_new: ['这生死符，犹如附骨之疽！', '断筋腐骨，生不如死！'],
                tlbb_chujie_new: ['诸位掌门，随我杀上灵鹫宫！', '三十六洞天罡聚，七十二岛地煞集！'],
                tlbb_lvdao_new: ['绿波乍现，夺魂索命！', '香露初凝，剧毒封喉！'],
                zhengwang: ['虚竹宫主宅心仁厚，小人愿誓死相从……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_jue_xuzhu: {
            debug: {
                playerName: '绝虚竹',
            },
            taic: {
                tlbb_xiaoyao: ['逍遥堪自乐，浩荡信无忧。', '追风赶月莫停留，平芜尽处是春山！'],
                tlbb_minghai: ['一点灵光彻太虚，万物相从归一理。', '色身当自轮回来，万相皆空入冥海。', '无穷般若心自在，语默动静体自然。', '大乘寂灭时，幻海现佛宗。'],
                zhengwang: ['众生皆苦，有缘皆孽……<br><br><br>'],
            },
            design: ['DZ', '霸天', '大熊小猫'],
        },
        tlbb_qiaofengazhu: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_guhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_kanghui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_guhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_kanghui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '乔峰阿朱',
            },
            taic: {
                tlbb_qiaozhuang: ['巧饰千般面，朱颜一人留！', '如梦幻真真亦假，姑苏水榭映莲香！'],
                tlbb_cizhu: ['痴情何谈悔与恨，青石桥头葬孤魂！', '塞上牛羊空许约，烛畔鬓云有旧盟！'],
                tlbb_guhong: ['形单影只寄天涯，江湖何处可归家？', '劳燕分飞各东西，夜凉梦醒裹旧衣！', '阿朱就是阿朱，千秋万载四海列国，就只有一个阿朱！'],
                tlbb_kanghui: ['亢龙有悔，悔不当初！', '千古之恨恨不休，万般悔意意难平！'],
                zhengwang: ['阿朱，我陪你去牧马放羊……<br><br><br>'],
            },
            design: ['大绿_Midori酱、小林', '诗笺、落影逝尘', '大熊小猫'],
        },
        tlbb_ruanxingzhu: {
            debug: {
                playerName: '阮星竹',
            },
            taic: {
                tlbb_dianqing: ['再续母女情，但凭这刺青！', '这个段字，是我当年亲手所刺！'],
                tlbb_chunhui: ['遥怜小儿女，未解忆长安！', '孤鸿号外野，翔鸟鸣北林！'],
                tlbb_yuanmeng: ['相见时稀隔别多，又春尽，奈悉何！', '段郎，你可知我多年对你魂牵梦萦？'],
                zhengwang: ['旧梦重温，虽死无憾……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        tlbb_xuanku: {
            debug: {
                playerName: '玄苦',
            },
            taic: {
                tlbb_ranmu: ['炽火燃木，不着一刀！', '锋燧燃枯树，刃风偃蒲草！'],
                tlbb_shouye: ['长江后浪推前浪，雏凤清于老凤声。', '万般业障皆随我，愿得赤子长无忧！'],
                tlbb_xiongying: ['往昔宿因所种，如今该当有此业报！', '我不入地狱，谁入地狱？'],
                zhengwang: ['阿弥陀佛……<br><br><br>'],
            },
            design: ['路边奇石', '霸天', '大熊小猫'],
        },
        tlbb_yelvhongji: {
            debug: {
                playerName: '耶律洪基',
            },
            taic: {
                tlbb_nanzheng: ['打下南朝，你我君臣名垂青史，岂不美哉？', '南朝君臣不协，人心不附，正是我大辽兴兵之良机！'],
                tlbb_mingjin: ['大军北归，南征之举就此作罢！', '鸣金收兵，班师南京！'],
                tlbb_congjian: ['传我将令，随我回朝，扫荡女真蛮族！', '兵凶战危，朕此一生，不越宋界！'],
                zhengwang: ['萧兄弟，今生臣负君，来世复君臣……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        tlbb_youjiyouju: {
            debug: {
                playerName: '游骥游驹',
            },
            taic: {},
            design: ['紫青叔', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_youtanzhi: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_chuantu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_chuantu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '游坦之',
            },
            taic: {
                tlbb_guiyi: ['愿为姑娘当牛做马！', '若能一亲芳泽，粉身碎骨也甘愿！'],
                tlbb_tuotai: ['涤荡六腑，超凡入圣！', '脱胎换骨，易筋洗髓！'],
                tlbb_xunzang: ['上穷碧落下黄泉,两处茫茫皆不见！', '与其孤独终老，不如泉下相随！'],
                tlbb_chuantu: ['时运不济，命途多舛！', '人生如此颠沛，活着有何意义？'],
                zhengwang: ['姑娘为何，从不对我正眼相看……<br><br><br>'],
            },
            design: ['沃声风飞语', '霸天', '大熊小猫'],
        },
        tlbb_juexiaofeng: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_kanglong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_fulong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_kanglong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_fulong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '绝萧峰',
            },
            taic: {
                tlbb_kunlong: ['天大地大，我又能何处容身？！', '身世成谜，胡汉难辨！'],
                tlbb_zhuixiong: ['一叶障目迷雾宽，血仇不报誓不还！', '天涯海角，也要手刃仇人！'],
                tlbb_kanglong: ['萧某非嗜杀之人，怎会赶尽杀绝？', '念在往日情义，今日便留你一命！'],
                tlbb_suyuan: ['萧峰今日，不再以契丹人为耻！', '真相大白，昔日恩怨一笔勾销！'],
                tlbb_fulong: ['陛下若不退兵，我便与你玉石俱焚！', '罪臣萧峰，叩谢圣恩！'],
                zhengwang: ['让这一切，埋葬在雁门关吧……<br><br><br>'],
            },
            design: ['沃声风飞语', '诗笺', '大熊小猫'],
        },
        tlbb_xuemuhua: {
            debug: {
                playerName: '薛慕华',
            },
            taic: {
                tlbb_shuming: ['你的性命，可不是白救的！', '阎王殿里救人，岂能劳而无功？'],
                tlbb_bihuo: ['星宿老贼为祸江湖，唯有避其锋芒！', '门户之乱,当退而自保！'],
                zhengwang: ['阎王，终究还是敌不过……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        tlbb_duanyanqing: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_chusi2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_chusi2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '段延庆',
            },
            taic: {
                tlbb_qiangcan: ['苟且偷生，只因国仇未报！', '窃国之辈，你我不死不休！'],
                tlbb_chusi2: ['我乃大理皇脉，自可为所欲为！', '我贵为太子，你们，却一无所有！'],
                tlbb_liuwang: ['这夺储之恨，永世难消！', '总有一天，我会夺回我失去的一切！'],
                tlbb_rangquan: ['大理江山，终于物归原主！', '乱臣贼子，感受到我复仇的火焰了吗？'],
                zhengwang: ['恨了一辈子，争了一辈子，真是荒唐的命运……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        tlbb_xuzhuzi: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_beiming: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_beiming: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    tlbb_dacheng: '注意:请检查是否遗漏了该技能', //台词待定
                },
                playerName: '虚竹',
            },
            taic: {
                tlbb_pojie: ['阿弥陀佛，罪过，罪过！', '世间安得双全法，不负如来不负卿？'],
                tlbb_huansu: ['小僧四戒皆破，愿领杖责之罚！', '劣徒屡破清规，已无颜立足少林！'],
                tlbb_beiming: ['无德无义之人，不如早日退出江湖！', '枉你神功盖世，却是滥杀无辜之徒！'],
                tlbb_dacheng: ['台词待定！', '台词待定'],
                zhengwang: ['原来，竟是春梦一场……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        tlbb_azhu: {
            debug: {
                playerName: '阿朱',
            },
            taic: {
                tlbb_yirong1: ['以假乱真，瞒天过海！', '容颜可易，坚心难移！'],
                tlbb_xiaoti: ['天上星，亮晶晶，永灿烂，长安宁！', '树欲静而风不止，子欲养而子先行！'],
                zhengwang: ['塞上牛羊成空约……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        tlbb_duanyu: {
            debug: {
                遗漏: {
                    tlbb_zhengyan: '注意:请检查是否遗漏了该技能',
                },
                playerName: '段誉',
            },
            taic: {
                tlbb_xiumai: ['无形之剑，扼敌咽喉！', '迅如闪电，雷厉风行！'],
                tlbb_qingguan: ['谁家子弟谁家院？无计悔多情！', '缘起缘灭缘终尽，花开花落花归尘！'],
                tlbb_lingbo: ['微步穀纹生，剑气碧烟横。', '江湖险恶，且习这轻功自保！'],
                tlbb_zhengyan: ['台词待定', '台词待定'],
                zhengwang: ['若有来世，莫问前缘……<br><br><br>'],
            },
            design: ['神齐大叔', '诗笺', '大熊小猫'],
        },
        tlbb_xiaoyaozi: {
            debug: {
                playerName: '绝逍遥子',
            },
            taic: {
                tlbb_haina: ['一朝闻道乘风起，抟云扶摇九万里！', '北冥鲲鱼纳碧海，南天鹏鸟负青天！', '数仞迎风下，遨游蓬蒿间。', '磅礴凌云梦，晓觉暮天长。'],
                tlbb_changchun: ['吾生须臾杳无迹，惟觅不老长春功！', '乘闲自是逍遥事，明月清风徐自来！', '世间安有长生事？花发叶落随自然。', '此生逍遥天休问，古来万事东流水！'],
                zhengwang: ['仙风神骨今何在？人间哪得真长生……<br><br><br>'],
            },
            design: ['君墨', '霸天', '大熊小猫'],
        },
        tlbb_spduanyu: {
            debug: {
                playerName: 'sp段誉',
            },
            taic: {
                tlbb_nayuan: ['百川聚海，放弥六合！', '穷发之北有冥海，谓之天池也。'],
                tlbb_zhuha: ['小生误食朱蛤，方能百毒不侵！', '此乃以毒攻毒之故！'],
                zhengwang: ['奈何世故人心，更胜毒蛇猛兽……<br><br><br>'],
            },
            design: ['神奇大叔', '落影逝尘', '大熊小猫'],
        },
        tlbb_kangmin: {
            debug: {
                playerName: '康敏',
            },
            taic: {
                tlbb_shifu: ['男人不思进取，活着有何用！', '汝密除之，妾当以身相许！'],
                tlbb_buyao: ['害死萧老英雄的元凶，便是大理镇南王段正淳！', '你若亲我，我便告知你带头大哥的下落。'],
                tlbb_siqian: ['天下男人皆一样，色字当头恩义忘！', '未亡人马门康氏，望长老主持公道！'],
                zhengwang: ['乔峰，我咒你不得好死……<br><br><br>'],
            },
            design: ['珂里', '朱阳光', '大熊小猫'],
        },
        tlbb_tangongtanpo: {
            debug: {
                playerName: '谭公谭婆',
            },
            taic: {},
            design: ['前轮、安生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_suxinghe: {
            debug: {
                playerName: '苏星河',
            },
            taic: {
                tlbb_yaotie: ['还请各路江湖朋友，前来以棋会友！', '多谢各位赏脸前来蔽派做客！'],
                tlbb_xpojie: ['棋逢对手，快哉快哉！', '先师布下这珍珑棋局，哪位高人可破解之？'],
                tlbb_yayin: ['装聋作哑，只为清理门户！', '唯有此举，可避江湖凶险！'],
                zhengwang: ['终究是逃不过江湖纷争……<br><br><br>'],
            },
            design: ['弈声传媒', '落影逝尘', '大熊小猫'],
        },
        tlbb_duanyanqing_new: {
            debug: {
                playerName: '邪段延庆',
            },
            taic: {
                tlbb_fuyu_new: ['腹语控神魂，奇功缚佛心！', '血债封七窍，仇海闭五音！'],
                tlbb_konghun_new: ['窃国之耻、断足之恨，你，准备好偿还了吗？', '定要你拱手奉上，朕的每一寸江山！'],
                tlbb_fengyue_new: ['落魄王孙，怎消受，杨枝玉露！', '天龙寺外，菩提树下。化子邋遢，观音长发！'],
                zhengwang: ['神器……终归我手，哈哈哈……<br><br><br>'],
            },
            design: ['DZ', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_zhongling: {
            debug: {
                playerName: '钟灵',
            },
            taic: {
                tlbb_xundiao: ['貂儿，给我教训这个泼皮无赖！', '一群莽夫欺负一个文弱书生，害不害臊！'],
                tlbb_qiyuan: ['你速去万劫谷，邀我爹妈前来搭救！', '段郎，我在这里等着你！'],
                tlbb_xinwu: ['奉上此鞋，他们自会明白！', '凭此信物，他们便知我深陷险境！'],
                zhengwang: ['我不是大丈夫，我偏要示弱……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        tlbb_yuelaosan: {
            debug: {
                playerName: '岳老三',
            },
            taic: {
                tlbb_qianjun: ['此剪摧锋挫锐，实乃神兵利器！', '死在你岳爷爷的鳄嘴剪下，算你造化！'],
                tlbb_yuguan: ['一只苍蝇也别想飞出去！', '今天将是你们共同的祭日！'],
                zhengwang: ['这小子看似无缚鸡之力，不料竟身怀绝技……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        tlbb_wangyuyan: {
            debug: {
                playerName: '王语嫣',
            },
            taic: {
                tlbb_dianhua: ['这城字十八破，改为十五破反而精要。', '繁章累述，不如化繁为简。'],
                tlbb_wendian: ['为君苦修万卷书，为君险行万里路！', '寻经问典，只为助表哥光复江山！'],
                zhengwang: ['满腔复燕梦，心中无儿女……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        tlbb_qiaofeng: {
            debug: {
                playerName: '乔峰',
            },
            taic: {
                tlbb_xianglong: ['飞龙在天！', '神龙摆尾！'],
                tlbb_kanghui: ['恩怨荣辱，俱化灰尘！', '亢龙长啸终成悔，英雄魂断雁门关！'],
                tlbb_zongpan: ['莫提旧誓与新约，怕问姓乔还姓萧！', '杏林深处，前尘渺渺，奈何伴萍漂！'],
                zhengwang: ['天大地大，竟无我容身之所……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_zhuangjuxian: {
            debug: {
                playerName: '邪庄聚贤',
            },
            taic: {
                tlbb_bingcan_new: ['草木残生颅铸铁，虫豸凝寒掌作冰！', '极阴之毒，摧经腐脉！'],
                tlbb_xiewang_new: ['邪魔已蚀骨，甘为护花狂！', '护花多危情，愿屈男儿膝！'],
                tlbb_kuiwei_new: ['摆布由人甘傀儡，浮沉一世作痴聋！', '阿紫姑娘喜欢大英雄，我要做大英雄！'],
                zhengwang: ['我的命，都是姑娘的……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_ganbaobao: {
            debug: {
                playerName: '甘宝宝',
            },
            taic: {
                tlbb_chouchang: ['晓镜但愁云鬓改，夜吟应觉月光寒！', '愁肠已断无由醉，酒未到，先成泪。'],
                tlbb_aijie: ['花自飘零水自流，一种相思，两处闲愁。', '物是人非事事休，欲语泪先流。'],
                tlbb_gulian: ['满目山河空念远，何不怜取眼前人？', '伊人已作他人妇，空余此心更付谁？'],
                zhengwang: ['此生，逃不过一个情字……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        tlbb_spxuzhu: {
            debug: {
                playerName: 'sp虚竹',
            },
            taic: {
                tlbb_luomei: ['花开堪折直须折，莫待无花空折枝！', '巧力婉转，一手折梅！'],
                tlbb_jiujie: ['胸中热血沸腾，管他戒律清规！', '人生苦短，当及时行乐！'],
                zhengwang: ['苦海无崖，回头是岸……<br><br><br>'],
            },
            design: ['林三', '诗笺', '大熊小猫'],
        },
        tlbb_xuanciyeerniang: {
            debug: {
                playerName: '玄慈叶二娘',
            },
            taic: {
                tlbb_youseng: ['缘起即灭，缘生已空！', '天与多情，不与长相守！'],
                tlbb_duhui: ['天道祸淫，不加悔罪之人！', '虔心忏悔，愿得佛祖宽恕！'],
                zhengwang: ['六根不净，何以诵佛……<br><br><br>'],
            },
            design: ['地鼠、青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_yeerniang: {
            debug: {
                playerName: '邪叶二娘',
            },
            taic: {},
            design: ['喵吱', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_liqingluo: {
            debug: {
                skill: {
                    界限突破情况: {
                        lbb_tongyou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        lbb_tongyou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    tlbb_tongyou: '注意:请检查是否遗漏了该技能', //已纠正
                },
                playerName: '李青萝',
            },
            taic: {
                tlbb_juanzhi: ['这小子定是图我琅环玉洞的武学秘籍！', '卷帙浩繁书中理，浮萍飘摇情中丝！'],
                tlbb_fanrui: ['如此负心汉，当杀了作花肥！', '这书生看似籍籍无名之辈，却甚懂花理。'],
                tlbb_tongyou: ['你不肯留下来，那就同归于尽！', '我得不到的男人，别的女人也别想得到！'],
                zhengwang: ['慕容复，你怎能罔顾亲情人伦……<br><br><br>'],
            },
            design: ['蛋黄酱爆炸', '落影逝尘', '大熊小猫'],
        },
        tlbb_tianshantonglao: {
            debug: {
                playerName: '天山童姥',
            },
            taic: {
                tlbb_zhemei: ['梅开二度，威震四海！', '天山折梅手，尽破天下武学！'],
                tlbb_bingfu: ['我要你求生不得，求死不能！', '尝尝这生不如死的滋味吧！'],
                zhengwang: ['你我皆非画中人，哈哈哈……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        tlbb_xiaoyuanshan: {
            debug: {
                playerName: '萧远山',
            },
            taic: {
                tlbb_huoyan: ['祸首也好，帮凶也罢，统统该死！', '血洗中原武林，方消这杀妻夺子之恨！'],
                tlbb_zheju: ['我潜伏少林，已遍览武学典籍！', '少林武学，终将为我大辽武士所用！'],
                zhengwang: ['皈依佛门中，人间恨已消……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        tlbb_madayuan: {
            debug: {
                playerName: '马大元',
            },
            taic: {
                tlbb_suohou: ['若非形势危急，马某绝不狠下毒手！', '乔兄弟若有异心，马某必践汪帮主遗志！'],
                tlbb_jianmi: ['此函事关重大，夫人切勿泄露！', '此信关系丐帮生死存亡，不到万不得已不得私启！'],
                zhengwang: ['乔兄弟，怪我未保管好此信，连累你了……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        tlbb_daobaifeng: {
            debug: {
                playerName: '刀白凤',
            },
            taic: {
                tlbb_chunyuan: ['寂寞空庭春欲晚，梨花满地不开门。', '忽见陌头杨柳色，悔教夫婿觅封侯。'],
                tlbb_jimie: ['多情总比无情苦，最是情痴不自知！', '波澜誓不起，妾心古井水！'],
                zhengwang: ['贪什么母仪天下，只盼情关易闯……<br><br><br>'],
            },
            design: ['佚名', '落影逝尘', '大熊小猫'],
        },
        tlbb_yeerniang: {
            debug: {
                playerName: '叶二娘',
            },
            taic: {
                tlbb_daoying: ['我既已尽失天伦，不妨你也尝尝此般痛苦！', '我遍尝人间之恶，那便无恶不作！'],
                tlbb_gouhe: ['我的夫君，他是一位盖世英雄！', '你若苦说不出，那才是真苦！'],
                zhengwang: ['愿天上，没有骨肉分离……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        tlbb_huangmeiseng: {
            debug: {
                playerName: '黄眉僧',
            },
            taic: {
                tlbb_duanzhi: ['有所得，必有所失！', '小小牺牲，不足挂齿！'],
                tlbb_xianji: ['贫僧是客，当受先行之利！', '如此，唯有猜枚以定先后！'],
                zhengwang: ['天外有天，人外有人……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_liqingluo: {
            debug: {
                playerName: '邪李青萝',
            },
            taic: {},
            design: ['安生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_xuzhuliqinglu: {
            debug: {
                playerName: '虚竹李清露',
            },
            taic: {
                tlbb_sekong: ['色即是空，空即是色！', '紫陌红尘拂面来，无人不道看花回。'],
                tlbb_juechen: ['佛日，长相厮守，有如修行！', '如今我佛缘已尽，你便是我余生所系！'],
                zhengwang: ['痴未了，情未了，恩未了，怨未了……<br><br><br>'],
            },
            design: ['林三卿九', '落影逝尘', '大熊小猫'],
        },
        tlbb_baishijing: {
            debug: {
                playerName: '白世镜',
            },
            taic: {
                tlbb_chansi: ['丐帮白某，领教阁下高招！', '缠丝擒拿手，一击即毙！'],
                tlbb_shijie: ['英雄难过美人关啊！', '白某，晚节不保矣！'],
                tlbb_gouxian: ['一不做，二不休，唯有一条道走到黑了！', '如今已成骑虎之势，乔帮主，得罪了！'],
                zhengwang: ['帮主不计前嫌，着实令白某羞愧难当……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_kangmin: {
            debug: {
                playerName: '邪康敏',
            },
            taic: {
                tlbb_duhui_xiekangming: ['我绝不会和别的女人，分享男人！', '我得不到的，你也休想得到！', '我要天下男子，都拜倒在我的石榴裙下！'],
                tlbb_guying: ['对镜顾影犹自怜，琉璃玉貌花月颜！', '月貌花容自沉沦，媚骨天成人销魂！'],
                tlbb_yuanyi: ['以色事人者，色衰而爱弛！', '美人迟暮将军老，最是红尘两不堪！'],
                tlbb_suijing: ['镜子！我要镜子！', '我的绝世容颜，我的绝世容颜！'],
                tlbb_jinggui: ['我是你灵魂深处的恶魔！', '不懂欣赏你的人，就杀了他吧！'],
                zhengwang: ['玉碎珠沉，香消玉殒……<br><br><br>'],
            },
            design: ['安生', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_azhi: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_hushi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_hushi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    tlbb_hushi: '注意:请检查是否遗漏了该技能', //已纠正
                },
                playerName: '阿紫',
            },
            taic: {
                tlbb_zhonggu: ['若愿为我赴汤蹈火，那便伸手入瓮！', '贪生怕死，怎么做我奴才？'],
                tlbb_zisui: ['就算星星月亮，姐夫也会替我摘下！', '我姐夫盖世神功，你敢动我分毫？'],
                tlbb_hushi: ['不要命的，就尽管放马过来！', '无名小卒，可听过我师父大名？'],
                zhengwang: ['我真的，什么都不如阿朱吗……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        tlbb_liqiushui: {
            debug: {
                playerName: '李秋水',
            },
            taic: {
                tlbb_souhun: ['靡音潜入耳，妙法涤神魂！', '色授魂欲予，春梦了无痕！'],
                tlbb_guixi: ['心静意平，自然而定！', '无知有灵，乃入真定！'],
                tlbb_wuxiang: ['藐姑射之山，绰约如处子！', '不着形相，无迹可寻！', '清静无为，神游太虚！', '精微渊深，万法无相！'],
                zhengwang: ['是她……竟然是她……<br><br><br>'],
            },
            design: ['待定', '落影逝尘', '大熊小猫'],
        },
        tlbb_xuanci: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_zhangxing: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_zhangxing: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '玄慈',
            },
            taic: {
                tlbb_fuji: ['截杀契丹武士，挽救大宋国运！', '断不能让契丹狗贼，为祸大宋江山！'],
                tlbb_mengbi: ['玄慈蒙义士包庇，方可苟于人世！', '众兄弟何苦为老衲隐瞒过错！'],
                tlbb_jiedi: ['雁门关一役造成业障，老衲永世不得超生！', '这累累血债，几世业报也无法偿还！'],
                tlbb_zhangxing: ['酿成今日之祸，老衲罪不可恕！', '大错已铸，老衲愿以死谢罪！'],
                zhengwang: ['愿佛祖，洗尽我一身罪孽……<br><br><br>'],
            },
            design: ['蚩宇', '冷雨', '大熊小猫'],
        },
        tlbb_baobutong: {
            debug: {
                playerName: '包不同',
            },
            taic: {
                tlbb_zhongjian: ['你卖友求荣，是为不义！', '堂堂慕容公子，岂可改姓段氏？'],
                tlbb_chengbian: ['非也，非也！', '此乃顺理成章，岂有强词夺理之说！'],
                tlbb_shiwei: ['姑苏慕容氏，早已辉煌不再！', '大厦之倾，非一世而为！'],
                zhengwang: ['慕容公子，愿你好自为之……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        tlbb_fengboe: {
            debug: {
                playerName: '风波恶',
            },
            taic: {},
            design: ['大宝', '霸天', '吃饱睡睡醒吃'],
        },
        tlbb_duanyuwangyuyan: {
            debug: {
                playerName: '段誉王语嫣',
            },
            taic: {},
            design: ['安生', '霸天', '大熊小猫'],
        },
        tlbb_meilanzhuju: {
            debug: {
                playerName: '梅兰竹菊',
            },
            taic: {
                tlbb_tongxin: ['[合]童姥座下四婢，参见新主人！', '[合]灵鹫宫四婢，特来伺候新尊主！', '[合]血脉相连，心意相通！'],
                tlbb_sijun: ['墨枝迎风傲，梅雪自芬芳！', '一夜飞雪寒梅起，散作乾坤万里春。', '新雨山林寂，空谷蕙兰幽。', '兰草不逊芙蓉色，何须涉江入荒泽？', '滴滴泪痕洒，萧萧斑竹鸣。', '生长松石听风雨，竹枝亦羡行人吟。', '寒秋肃杀色，菊开独悠然。', '方寸天地皆可隐，岂独东篱采菊花？', '[合]四花所寄托者，皆君子之魂也。'],
                zhengwang: ['[合]尊主，来世……再续主仆情……<br><br><br>'],
            },
            design: ['鲨鲨', '棉花糖', '吃饱睡睡醒吃'],
        },
        tlbb_liqinglu: {
            debug: {
                playerName: '李清露',
            },
            taic: {
                tlbb_suyuanlql: ['原来，你就是夜夜出现在我梦中的郎君！', '此生最是欢娱，应是凤城梦境！'],
                tlbb_chungui: ['柔情似水，佳期如梦！', '我爱上一个人，却不知道他的名字。'],
                zhengwang: ['生生世世若梦，岁岁年年如斯……<br><br><br>'],
            },
            design: ['卿九', '落影逝尘', '大熊小猫'],
        },
        tlbb_yunzhonghe: {
            debug: {
                遗漏: {
                    tlbb_zhuiyun: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '界云中鹤',
            },
            taic: {
                tlbb_feihe: ['逝如轻烟，鸿飞冥冥！', '杀其夫而占其妻，谋其财而居其谷，哈哈哈…'],
                zhengwang: ['轻功再高，也怕乱刀……<br><br><br>'],
            },
            design: ['清酒摇舟', '落影逝尘', '大熊小猫'],
        },
        tlbb_sptianshantonglao: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_liuyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_liuyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: 'sp天山童姥',
            },
            taic: {
                tlbb_tongyan: ['君已鹤发白胜雪，奈何今朝似髫年！', '神功累我如稚童，独坐相思缥缈峰！'],
                tlbb_zhongfu: ['杀人不用第二招！', '这，就是背叛我的下场！'],
                tlbb_duzun: ['八荒六合，惟我独尊！', '你的性命，已在我股掌之中！'],
                tlbb_liuyang: ['此掌至阳，可解寒毒。', '此乃解符要诀，你当铭记于心！'],
                zhengwang: ['天山鸟飞绝，故人两相忘……<br><br><br>'],
            },
            design: ['强珂', '落影逝尘', '大熊小猫'],
        },
        tlbb_murongfu: {
            debug: {
                playerName: '慕容复',
            },
            taic: {
                tlbb_yixing: ['以其人之道，还治其人之身！', '斗转星移，名震江湖！'],
                tlbb_chongzuo: ['复我大燕，矢志不移！', '举世纷纷笑慕容，谁知陈涉起耕佣！'],
                tlbb_qingfu: ['时不我与，生不逢时！', '难道我大燕，注定复国无望？'],
                tlbb_zifu: ['我乃姑苏慕容，不负盛名', '难若能光复大燕，忍辱负重又何妨！'],
                zhengwang: ['愧对列祖列宗……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        tlbb_dingchunqiu: {
            debug: {
                playerName: '丁春秋',
            },
            taic: {
                tlbb_misan: ['哼，苏星河，你的死期到了！', '再笑一声，便去向阎王老爷报道吧！'],
                tlbb_fugong: ['星宿老仙，法力无边！', '你已毒入骨髓，神仙难救！'],
                zhengwang: ['这生死符，才是人间至毒啊……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        tlbb_heliantieshu: {
            debug: {
                playerName: '赫连铁树',
            },
            taic: {
                tlbb_huansi: ['高昌、回鹘、凉州，皆我大夏之疆！', '河西一路，可北拒大辽，南抗吐蕃！'],
                tlbb_hudan: ['祁山无粮之地，汉人岂可久守？', '攻下玉门关，万里沃土，唾手可得！'],
                zhengwang: ['内失政理，外丧战机，吾空有良谋……<br><br><br>'],
            },
            design: ['二空', '霸天', '大熊小猫'],
        },
        tlbb_muronglongcheng: {
            debug: {
                playerName: '绝慕容龙城',
            },
            taic: {
                tlbb_huanshi: ['以彼之道，还施彼身！', '以眼还眼，以牙还牙！'],
                tlbb_huandou: ['斗转星移，逆天改命！', '闲云潭影日悠悠，物换星移几度秋！'],
                zhengwang: ['叹我姑苏慕容，敢上九天缚苍龙……<br><br><br>'],
            },
            design: ['涂涂', '落影逝尘', '大熊小猫'],
        },
        tlbb_saodiseng: {
            debug: {
                playerName: '绝扫地僧',
            },
            taic: {
                tlbb_shuofa: ['两位施主，何必为仇恨蒙蔽双眼？', '妄执于恩怨情仇，不如跳出红尘俗世！'],
                tlbb_bolan: ['天下武功，出少林！', '少林武学，博大精深！'],
                tlbb_qizhao: ['习武之人，当以佛学为基、以慈悲为念！', '心存歹念，必为戾气所伤！'],
                zhengwang: ['一念成佛，一念成魔……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        tlbb_qinhongmian: {
            debug: {
                playerName: '秦红棉',
            },
            taic: {
                tlbb_xiujian: ['情如修罗场，梦醒总断肠！', '与其情孽纠缠，不如早做了断！'],
                tlbb_qingheng: ['天长地久有时尽，此恨绵绵无绝期！', '情不知所起，一往而深。恨不知所终，一笑而泯！'],
                zhengwang: ['一见段郎，误终身……<br><br><br>'],
            },
            design: ['仙女桥', '霸天', '大熊小猫'],
        },
        tlbb_wuyazi: {
            debug: {
                playerName: '无崖子',
            },
            taic: {
                tlbb_zhenlong: ['愿得有缘人，举弈论寰宇！', '莫畏浮云遮望眼，守得云开见月明！'],
                tlbb_zaojie: ['吾生也有涯，而知也无涯！', '见微知著，守正待时！'],
                tlbb_qingshou: ['你既已入我逍遥派，还要这少林功夫做什么？', '重振逍遥派的重任，就交给你了'],
                zhengwang: ['乘风驾鹤，羽化登仙……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        tlbb_duanzhengchun: {
            debug: {
                playerName: '段正淳',
            },
            taic: {
                tlbb_lanqing: ['青裙玉面如相识，九月茶花满路开！', '星眸竹腰相伴，不知天地岁月也, 不知天地岁月也！', '你我重温旧梦，更比昔日情浓！', '小康风姿绰约，更胜年少英姿！', '修罗刀下死，做鬼也风流！', '皎凤朝凰忘芳菲，侯门难掩百花香！'],
                tlbb_niezhai: ['你们皆是段某至爱，何苦强分轩轾！', '手心手背都是肉，段某如何取舍！'],
                zhengwang: ['死后，我们也是同命鸳鸯……<br><br><br>'],
            },
            design: ['冰霜墨菊', '落影逝尘', '大熊小猫'],
        },
        tlbb_murongbo: {
            debug: {
                playerName: '慕容博',
            },
            taic: {
                tlbb_yaodie: ['好戏上演，静观其变！', '且看你们，自相残杀！'],
                tlbb_fuyan: ['我大燕复兴之日，近在咫尺！', '百年大计，东山再起！'],
                zhengwang: ['千年帝王师，一枕黄梁梦……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        tlbb_muwanqing: {
            debug: {
                playerName: '木婉清',
            },
            taic: {
                tlbb_muli: ['水木清华，婉兮清扬！', '古人有云，男女授受不亲！'],
                qtpz_jueshi: ['初窥帷篱者，当立白首约！', '师父有命，我若不嫁你，便要杀你！'],
                tlbb_shiyin: ['我代家兄前来和亲！', '西夏公主花容月貌，倒和家兄相衬！'],
                zhengwang: ['段郎，来世投胎，不做兄妹……<br><br><br>'],
            },
            design: ['古梁舟', '落影逝尘', '大熊小猫'],
        },
        tlbb_quanguanqing: {
            debug: {
                playerName: '全冠清',
            },
            taic: {
                tlbb_zhengbian: ['乔峰乃契丹孽种，留下只会为祸丐帮！', '若不逐出乔峰，丐帮基业恐将毁于一旦！'],
                tlbb_yongli: ['庄大侠智勇双全，当担此大任！', '今丐帮群龙无首，庄大侠切莫推辞！'],
                zhengwang: ['我这么做，全是为了丐帮好……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        tlbb_zhaixingzi: {
            debug: {
                playerName: '界摘星子',
            },
            taic: {
                tlbb_qianzui: ['你办事不力，当受帮规处置！', '不取回神木王鼎，就提头来见！'],
                tlbb_feilin: ['飞磷绽火，毁天灭地！', '这烈火焚身的滋味儿，不好受吧！'],
                zhengwang: ['竟然，引火烧身……<br><br><br>'],
            },
            design: ['洛', '诗笺', '大熊小猫'],
        },
        tlbb_jiumozhi: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_yandao: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_jiezhi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_nianhua: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_xisui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_yandao: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_jiezhi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_nianhua: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_xisui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '鸠摩智',
            },
            taic: {
                tlbb_wuchi: ['小僧痴顽，难断思友之情！', '愿一睹贵寺六脉神剑大威！'],
                tlbb_yandao: ['掌中藏火，绵延不熄！', '运息纵火，定要黑教灰飞烟灭！'],
                tlbb_jiezhi: ['我佛慈悲，姑且放你一马！', '自生自灭，且看造化！'],
                tlbb_nianhua: ['拈花一笑，得窥佛缘！', '佛祖拈花，迦叶一笑。'],
                tlbb_mozhang: ['世外闲人，岂为这俗事萦怀？', '方外之人，不恋俗尘。'],
                tlbb_xisui: ['易筋洗髓，超凡脱俗。', '莲池礼佛，如有重生。'],
                zhengwang: ['一生贪功恋势，不如云游四海……<br><br><br>'],
            },
            design: ['涂涂', '落影逝尘', '大熊小猫'],
        },
        tlbb_spjiumozhi: {
            debug: {
                playerName: 'sp鸠摩智',
            },
            taic: {
                tlbb_qixing: ['小僧这不情之请，还望大师成全！', '得窥宝籍奥秘，小僧死而无憾！'],
                tlbb_tanchen: ['能习得这上乘武学，折寿折福何足惧哉！', '天下武籍，尽归我手！'],
                tlbb_jieduan: ['苦非苦，乐非乐，皆一时执念！', '一念放下，万般自在。'],
                zhengwang: ['早登极乐，往生净土……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        tlbb_jue_tianshantonglao: {
            debug: {
                playerName: '绝天山童姥',
            },
            taic: {
                tlbb_huantong: ['天若有情天亦老，月如无恨月长圆！', '此情堪虞恨天长，不如人间共白头！'],
                tlbb_kongfu: ['除了效忠于我，你，别无选择！', '在痛苦的地狱里，轮回吧！'],
                tlbb_lingzun: ['我，才是你生命的主宰！', '顺我者昌，逆我者亡！'],
                zhengwang: ['长生不老，是对我最大的惩罚……<br><br><br>'],
            },
            design: ['遂非', '落影逝尘', '大熊小猫'],
        },
        tlbb_spazi: {
            debug: {
                playerName: 'sp阿紫',
            },
            taic: {
                tlbb_daoding: ['有了宝鼎，不必再受制于星宿老怪！', '宝鼎在我姐夫手里，有本事就去拿！'],
                tlbb_yingu: ['等我练成化功大法，谁还敢欺负我？', '行走江湖，绝技傍身！'],
                tlbb_quyi: ['我不要你的心，只要你的命！', '铁丑，还不把手伸进来？'],
                zhengwang: ['冷眼世间，最苦相思毒……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        sdyx_shangguanjiannan: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdyx_tiezhang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdyx_tiezhang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '上官剑南',
            },
            taic: {
                sdyx_wulve: ['洞庭残阳映天红，誓灭金贼一扫空！', '厉兵秣马从仇日， 勒马燕然第一峰！'],
                sdyx_liufang: ['破金要略何处觅？壁立千仞在中峰！', '得此兵书，救国救民！'],
                sdyx_tiezhang: ['习得神功，当救国于危难、解民于倒悬！', '抗金扶宋，功在千秋！'],
                zhengwang: ['千仞，破金大业，重于山……<br><br><br>'],
            },
            design: ['随遇而安', '霸天', '大熊小猫'],
        },
        sdyx_jueouyangfeng: {
            debug: {
                playerName: '绝欧阳锋',
            },
            taic: {
                sdyx_liudu: ['广施流毒得利好，遗损万世又何妨？', '谅尔自诩内力高绝，也难抵我万蛇之毒！', '行到毒云惨淡处，笑看天地同寿时！', '诡奇异怪流毒远，天下至毒我为尊！'],
                sdyx_nimai: ['逆中取顺，败中求胜！', '似前实后，因左而右！', '逆练真经，功冠武林！', '真气逆走，经脉逆行！'],
                zhengwang: ['好你个老叫化子，哈哈哈哈……<br><br><br>'],
            },
            design: ['随遇而安', '霸天', '大熊小猫'],
        },
        sdyx_juehuangyaoshi: {
            debug: {
                playerName: '绝黄药师',
            },
            taic: {
                sdyx_qizhen: ['五运更始，变应天期！', '天衍四九，人遁其一！'],
                sdyx_xiaojian: ['落英缤纷神剑雨，凤曲长鸣棹歌流！', '形销怆然箫声起，玉漏催银洒碧霄！'],
                zhengwang: ['如今但欲关门睡，一任♣️️作雪飞……<br><br><br>'],
            },
            design: ['冬赫', '霸天藏海', '大熊小猫'],
        },
        sdyx_wanyankang: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdyx_quanwang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdyx_quanwang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '完颜康',
            },
            taic: {
                sdyx_panguo: ['生是金国人，死为完颜鬼！', '家河破碎寄完颜，富贵荣华伴露迁！'],
                sdyx_tongdi: ['何计身后荣与辱，万里江山皆我物！', '一人之下，万人之上，哈哈哈……'],
                sdyx_quanwang: ['看浮生千般意趣，又何止金帛玉缕！', '不甘此生布衣路，挥戈纵马展宏图！'],
                zhengwang: ['一朝顿醒魂消散，反骨何堪对碧山……<br><br><br>'],
            },
            design: ['科学舟自横', '藏海', '大熊小猫'],
        },
        sdyx_hanbaoju: {
            debug: {
                playerName: '韩宝驹',
            },
            taic: {
                sdyx_xiangma: ['此马非凡马，一身龙骨傲！', '良驹遇伯乐，宝马配英雄！'],
                sdyx_xunhua: ['此马野性未改，且瞧我治它一治！', '骏马如风，脱缰则野！'],
                zhengwang: ['治国无法，如野马脱缰矣……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        sdyx_nanxiren: {
            debug: {
                playerName: '南希仁',
            },
            taic: {
                sdyx_tiejian: ['铁肩撑栋梁，甘洒满腔血！', '吾虽南山樵，重任亦可担！'],
                sdyx_xuezheng: ['血誓之约芒在骨，丹心一片证肝肠！', '以血为证，至死不绝！'],
                zhengwang: ['杀我之人，乃……<br><br><br>'],
            },
            design: ['阿也', '霸天藏海', '大熊小猫'],
        },
        sdyx_quanjinfa: {
            debug: {
                playerName: '全金发',
            },
            taic: {
                sdyx_hengtong: ['一分铜钿，一分货！', '财运亨通，吉星高照！'],
                sdyx_jingsuan: ['一手交钱，一手交货！', '折本儿买卖，不做不做！'],
                zhengwang: ['人算，不如天算啊……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdyx_shatongtianhoutonghai: {
            debug: {
                playerName: '沙通天侯通海',
            },
            taic: {
                sdyx_panlong: ['人走船留，雁过拔毛，哈哈哈哈哈！', '要想从此过，留下买路财！</b>', '蛟龙入海，浪卷潮回！', '双蛟掠命，尔等，已是釜底游鱼！'],
                sdyx_shuangjiao: ['兴风作浪，呼风唤雨！', '这片水域，都是我们的地盘！'],
                zhengwang: ['这究竟，是哪里来的暗流……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        sdyx_xie_meiruohua: {
            debug: {
                playerName: '邪梅若华',
            },
            taic: {
                sdyx_yaoyao: ['夭夭映丹霞，灼灼融春华！', '桃林浅深处，佳人淡浓妆！'],
                sdyx_qingdou: ['三月桃花开已盛，梁间燕子何时归？', '寂寞芳菲开无主，风吹一夜满桃花！', '花落随水意，春来我自知！', '落英缤纷寄潮水，暗香疏影浮月光！'],
                sdyx_xinghong: ['夜深忽梦桃花事，过往如沙泪阑干！', '一声枭啼残夜尽，梦惊空枕洒泪痕！'],
                sdyx_mozhua: ['我要用你们的项上头颅，以祭亡夫之灵！', '贼汉子，你在天之灵，看见我为你报仇了吗！'],
                zhengwang: ['零落成泥化尘土，桃花归处是桃花……<br><br><br>'],
            },
            design: ['安生', '霸天', '大熊小猫'],
        },
        sdyx_xie_meichaofeng: {
            debug: {
                playerName: '邪梅超风',
            },
            taic: {
                zhengwang: ['零落成泥化尘土，桃花归处是桃花……<br><br><br>'],
            },
            design: ['安生', '霸天', '大熊小猫'],
        },
        sdyx_chenxuanfeng: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdyx_daojin_heart: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_diamond: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_spade: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_club: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdyx_daojin_heart: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_diamond: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_spade: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdyx_daojin_club: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '陈玄风',
            },
            taic: {
                sdyx_daojin: ['得此奇书，他日称霸武林，岂不威风！', '黄老贼不肯交出经书，唯有出此下策！'],
                sdyx_daojin_heart: ['万物负阴而抱阳！', '合抱之木生于毫末，九层之台起于累土！'],
                sdyx_daojin_diamond: ['人法地，地法天，天法道，道法自然！', '天地之道，极则反，盈则损！'],
                sdyx_daojin_spade: ['阳中求真阴，九阴第三重！', '以阴练真阴，九阴第四重！'],
                sdyx_daojin_club: ['鬼狱阴风，以阴索魂！', '气至丹田贯十指，抓石破铁摧坚爪！'],
                sdyx_moke: ['贼婆娘，务必报此血海深仇！', '他日神功大成，勿忘为夫大仇！'],
                zhengwang: ['这乳臭未干的小子，究竟何方神圣……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        sdyx_jue_huangshang: {
            debug: {
                playerName: '绝黄裳',
            },
            taic: {
                jue_jiaoyi: ['读书破万卷，下笔如有神！', '读书百遍，其义自见！', '挑灯夜读十年苦，天下美谈鸡蛇兔！'],
                jue_tongwu: ['大道至简，悟在天成！', '大道在悟，不在修！', '大道由中悟，逍遥匪外寻！'],
                jue_jiuyin: ['日极则仄，月满则亏！', '道常无为，而无不为！', '道法自然，天人合一！', '天地不仁，以万物为刍狗！', '道生一，一生二，二生三，三生万物！'],
                zhengwang: ['冤家宜解不宜结……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        sdyx_liping: {
            debug: {
                playerName: '李萍',
            },
            taic: {
                sdyx_piaoping: ['漂忽如萍，人生如寄！', '漂泊异乡，故土难离！', '寄人篱下，非长久之策！'],
                sdyx_dayi: ['人生百年匆匆过，要留丹心昭日月！', '何惜百死报家国，青山处处埋忠骨！'],
                zhengwang: ['落叶，归根……<br><br><br>'],
            },
            design: ['谢声繁', '落影逝尘', '大熊小猫'],
        },
        sdyx_mayu: {
            debug: {
                playerName: '马钰',
            },
            taic: {
                sdyx_anshou_new: ['思定则情忘、体虚则气运！', '心死则神活、阳盛则阴消！', '切记今日之事，不可与外人道也！', '魂不内荡，神不外游，此为修炼内功之要诀！'],
                sdyx_yunyou_new: ['我欲乘风归去，游遍四海八荒！', '拂云游四海，弄影到三山！', '风萧萧兮木叶飞，声嗷嗷兮雁南归。'],
                zhengwang: ['嗟人世兮魂欲飞，伤人世兮心欲摧……<br><br><br>'],
            },
            design: ['白狗', '霸天', '大熊小猫'],
        },
        sdyx_baoxiruo: {
            debug: {
                playerName: '包惜弱',
            },
            taic: {
                sdyx_beimin: ['人非草木，孰能无情？', '众生平等，安有贵贱之分？'],
                sdyx_zhuisi: ['昔年梦碎忆临安，京华难驻思劳燕！', '侯门一入深似海，从此萧郎是路人！'],
                zhengwang: ['铁哥，我们生生世世，永不分离……<br><br><br>'],
            },
            design: ['一叶米粥', '看破一切', '大熊小猫'],
        },
        sdyx_zhucong: {
            debug: {
                playerName: '朱聪',
            },
            taic: {
                sdyx_toutian: ['妙手空空侠盗客，散尽天下不义财！', '妙手神偷走江湖，不盗财来不贪物！'],
                sdyx_huanri: ['偷梁换柱，万无一失！', '雕虫小技，让道长见笑了！'],
                zhengwang: ['常在河边走，哪有不湿鞋……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        sdyx_sp_huangrong: {
            debug: {
                playerName: 'sp黄蓉',
            },
            taic: {
                sdyx_baojia: ['善恶到头终有报！', '这一切都是你咎由自取！'],
                sdyx_wuxing: ['此阵怎可与桃花岛相提并论？', '神目如电，看穿仙界凡间！'],
                zhengwang: ['冤冤相报何时了……<br><br><br>'],
            },
            design: ['桃子玥', '落影逝尘', '大熊小猫'],
        },
        sdyx_spyinggu: {
            debug: {
                playerName: 'sp瑛姑',
            },
            taic: {
                sdyx_suanchou: ['我黑沼潭岂是你说来就来的？', '人间最是参不透，不是阵网是情网！'],
                sdyx_shushu: ['三人同行七十稀，五树♣️️廿一枝。', '七子团圆正半月，除百零五便得知。'],
                zhengwang: ['鸳鸯织就欲双飞，可怜未老头先白……<br><br><br>'],
            },
            design: ['FLORA', '落影逝尘', '大熊小猫'],
        },
        sdyx_jue_guojing: {
            debug: {
                playerName: '绝郭靖',
            },
            taic: {
                sdyx_zhenwei: ['重甲上阵，杀他个落花流水！', '头颅尚可抛，山河不能移！', '鞑子兴兵南下，襄阳断不可失！'],
                sdyx_xiagu: ['皑皑白骨映长空，殷殷热血入黄河！', '犹记当年靖康耻，壮士出征保家国！'],
                zhengwang: ['人生自古谁无死，留取丹心照汗青……<br><br><br>'],
            },
            design: ['冰霜墨菊', '落影逝尘', '大熊小猫'],
        },
        sdyx_zhamuhe: {
            debug: {
                playerName: '扎木合',
            },
            taic: {
                sdyx_wonan: ['三次结拜情，从此恩义绝！', '斡难冰声犹在耳，情随髀石已归尘！'],
                sdyx_lianfa: ['莽莽草原，却容不下你我两个英雄！', '铁木真有安答，可成吉思汗没有兄弟！'],
                zhengwang: ['我要看你东征西讨，亲手创下蒙古人的伟业……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        sdyx_yuefei: {
            debug: {
                playerName: '绝岳飞',
            },
            taic: {
                sdyx_falu: ['壮志饥餐胡虏肉，笑谈渴饮匈奴血！', '犯我华夏者，虽远必诛！'],
                sdyx_zhanji: ['撒豆成兵，誓破胡虏！', '何日请缨提锐旅，一鞭直渡清河洛！'],
                sdyx_zhonghun: ['忠魂常在，佑我中华！', '斩除顽恶还车贺，不问登坛万户侯。'],
                zhengwang: ['靖康耻，犹未雪；臣子恨，何时灭……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        sdyx_huazheng: {
            debug: {
                playerName: '华筝',
            },
            taic: {
                sdyx_xuhun: ['父汗，女儿非郭靖安答不嫁！', '孩儿对郭靖，早已芳心暗许！'],
                sdyx_changnian: ['你此去江南，不知何时能归？', '十万铁骑踏春归，不见鸿雁捎信回！'],
                sdyx_duanyi: ['你我海誓山盟，岂可薄情寡义？', '今生你负我，来世永不见！'],
                zhengwang: ['大漠白雕，终抵不过江南的燕儿……<br><br><br>'],
            },
            design: ['FLORA', '落影逝尘', '寰宇星城、大熊小猫'],
        },
        sdyx_guoxiaotian: {
            debug: {
                playerName: '郭啸天',
            },
            taic: {
                sdyx_zhongyi: ['苍龙啸月瓦岗寨，骏马乘风赤水泉！', '剑雨蒙霜轻似雪，行歌对酒涵如渊。'],
                sdyx_diexue: ['生当作人杰，死亦为鬼雄！', '袖里乾坤销残骨，叱咤风云义薄天！'],
                zhengwang: ['国亡身殒今何有，只留离骚在世间……<br><br><br>'],
            },
            design: ['前轮', '霸天', '大熊小猫'],
        },
        sdyx_huangrong: {
            debug: {
                playerName: '黄蓉',
            },
            taic: {
                sdyx_qingshi: ['七公，你就将这套武功授予靖哥哥嘛！', '我爹爹的落英神剑，自不如你降龙十八掌高明！'],
                sdyx_qiaoyan: ['大师救命之恩，如同再生父母。', '大师舍命相救，蓉儿无以为报！'],
                sdyx_qimen: ['略施算筹，乱敌阵脚！', '布五行八卦阵，方可金蝉脱壳！'],
                zhengwang: ['你们是大漠比翼的白雕，我只是江南柳枝下一只燕儿……<br><br><br>'],
            },
            design: ['仙女桥', 'SUKINCEN', '大熊小猫'],
        },
        sdyx_zhoubotong: {
            debug: {
                playerName: '界周伯通',
            },
            taic: {
                sdyx_mingwan: ['上当了上当了！真不好玩儿！', '老叫化子不肯陪我玩儿，你陪我玩儿吧！', '情情爱爱的真麻烦，教我养蜜蜂吧！'],
                sdyx_shouxun: ['若我师兄在世，你蔫能接住他十招？', '师兄让我好生保管此书！'],
                zhengwang: ['情情爱爱，折煞世人情狂……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        sdyx_fengheng: {
            debug: {
                playerName: '冯蘅',
            },
            taic: {
                sdyx_moshu: ['周大哥，请借经书与我一阅！', '天之道，损有馀而补不足，是故虚胜实，不足胜有馀。'],
                sdyx_cuixin: ['请原谅我已心力交瘁。', '时隔多年，经文所述已恍然如梦！'],
                zhengwang: ['药师，我实在是，无能为力……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        sdyx_ouyangfeng: {
            debug: {
                playerName: '欧阳锋',
            },
            taic: {
                sdyx_shezhang: ['尝尝万蛇噬心的滋味！', '灵蛇狂舞，逐鹿中原！'],
                sdyx_duxi: ['我白驼山的蛇毒，无药可解！', '老叫化子已身中剧毒，大难临头。'],
                sdyx_nijing: ['逆行筋脉，别有洞天！', '顺逆自如，问鼎华山！'],
                zhengwang: ['我是谁，我是谁！谁是欧阳锋……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        sdyx_guojing: {
            debug: {
                遗漏: {
                    sdyx_longyin: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '界郭靖',
            },
            taic: {
                sdyx_danxin: ['生系黎民苍生，死守襄阳古城！', '侠之大者刻心中，为国为民撼苍穹！'],
                sdyx_polu: ['藐视金军千秋图，漠然徂徕襄阳西！', '如今蒙古鞑子进犯，愿天下豪杰共御外敌!'],
                zhengwang: ['射雕英雄今安在？襄阳千古留侠名……'],
            },
            design: ['青灯折扇不语', '朱阳光', '大熊小猫'],
        },
        sdyx_zhebie: {
            debug: {
                playerName: '哲别',
            },
            taic: {
                sdyx_sheqi: ['草原男儿，能骑善射！', '靖儿乃武学奇才，大汗可重用之！'],
                sdyx_guifu: ['大汗雄才伟略，哲别诚心归附！', '愿随大汗开疆拓土！'],
                zhengwang: ['魂归大漠……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        sdyx_huangyaoshi: {
            debug: {
                playerName: '黄药师',
            },
            taic: {
                sdyx_beihuai: ['风吹落梅蘅芷去，徒留芙蓉对桃花。', '岁岁醉孤影，天地一放翁！'],
                sdyx_qushang: ['一目十行，且看两位贤侄造化。', '胜负既分，便将岛图相赠，贤侄可即日离岛。'],
                zhengwang: ['萧瑟平生只自知，玉箫忍按悼亡词……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        sdyx_spguojing: {
            debug: {
                playerName: 'sp郭靖',
            },
            taic: {
                sdyx_jianchi: ['弯弓如满月，箭去似流星！', '引弓长射，一箭双雕！'],
                sdyx_yuzhong: ['大汗养育之恩，自当肝胆相照！', '靖儿不懂大道理，唯有沙场相报！'],
                zhengwang: ['大宋乃我故疆，大汗何故……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        sdyx_qiuqianren: {
            debug: {
                skill: {
                    非界限突破情况: {
                        sdyx_tiezhang2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    sdyx_tiezhang: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界裘千仞',
            },
            taic: {
                sdyx_tiezhang: ['气自丹田，掌力不绝！', '区区软猬甲，怎敌我刚猛拳法！'], //普通版
                sdyx_tiezhang2: ['气自丹田，掌力不绝！', '区区软猬甲，怎敌我刚猛拳法！'], //突破版
                sdyx_huolian: ['段皇爷分心救子，我必能问鼎华山！', '大丈夫，当不择手段！'],
                zhengwang: ['竟然，失算了……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        sdyx_jue_hongqigong: {
            debug: {
                playerName: '绝洪七公',
            },
            taic: {
                sdyx_qianlong: ['藏巧于拙，潜龙勿用！', '亢龙有悔,盈不可久！', '顺势而发，势不可挡！', '逆势而动，后劲无穷！'],
                sdyx_shengai: ['贼虏亡我之心不死，我辈岂可坐以待毙！', '借天势，驱鞑虏！'],
                sdyx_tugou: ['负心多为读书人，仗义每多屠狗辈！', '愿执玉杖心不移，屠尽天下猪狗辈！'],
                zhengwang: ['愿……天下无狗……<br><br><br>'],
            },
            design: ['临时小驻', '霸天', '大熊小猫'],
        },
        sdyx_hongqigong: {
            debug: {
                playerName: '界洪七公',
            },
            taic: {
                sdyx_shouming: ['我大限将至，今将帮主之位传给你！', '此棒乃帮中信物，切莫落入奸人之手！'],
                sdyx_xiangyan: ['蓉儿莫忧，且让老叫花子供供五脏庙！', '山珍海味，莫如这鸳鸯五珍脍！'],
                zhengwang: ['一笑泯恩仇……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        sdyx_ouyangke: {
            debug: {
                playerName: '欧阳克',
            },
            taic: {
                sdyx_mushe: ['在小爷的蛇阵里，尽情地哭喊吧！', '喊破喉咙，也不会有人救你！'],
                sdyx_jixia: ['蓉妹妹绝色无双，做我的压寨夫人吧！', '交出《武穆遗书》，本公子便赐你解药！'],
                zhengwang: ['杨康，你这个……卑鄙小人……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        sdyx_xie_ouyangfeng: {
            debug: {
                playerName: '邪欧阳锋',
            },
            taic: {},
            design: ['虚怀若谷', '霸天', '大熊小猫'],
        },
        sdyx_yinggu: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdyx_xuechou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdyx_xuechou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '瑛姑',
            },
            taic: {
                sdyx_xingshang: ['人生世事太无常，霹雳晴空青叶殇！', '魄散珠胎没，芳销玉树沉！'],
                sdyx_tigu: ['我儿含冤而逝，为娘定为你讨个公道！', '这丧子之痛，我已无力承受！'],
                sdyx_xuechou: ['去阴曹地府向我儿赔罪吧！', '定要将你血祭吾儿！'],
                zhengwang: ['大仇得报，孩儿，你安息吧……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        sdyx_yangkang: {
            debug: {
                playerName: '杨康',
            },
            taic: {
                sdyx_weifu: ['我乃王爵世子，岂能与草莽为伍！', '命里藏金，花开富贵！'],
                sdyx_lisuo: ['一入江湖深似海，从此山河是故人！', '众叛亲离又何妨，我自陈王与魏王！'],
                zhengwang: ['念慈，我已痛改前非……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        sdyx_meichaofeng: {
            debug: {
                playerName: '界梅超风',
            },
            taic: {
                sdyx_lizhao: ['你已难逃魔爪！', '死在我九阴白骨爪下，是你的造化！'],
                sdyx_shien: ['一日为师，终身为父！', '叛徒不求原谅，只求为师父受死！'],
                sdyx_guidao: ['没能想到，此生还能回到桃花岛！', '岛上这一草一木，都充满了回忆。'],
                zhengwang: ['梦回桃花岛……<br><br><br>'],
            },
            design: ['仙女桥', 'SUKINCEN', '大熊小猫'],
        },
        sdyx_duantiande: {
            debug: {
                playerName: '段天德',
            },
            taic: {
                sdyx_ninglu: ['有钱能使鬼推磨！', '此乃杨贼人头，请六王爷验看！'],
                sdyx_huoyan: ['侄儿再不敢胡作非为！', '侄儿无处可逃，特来向伯父求救！'],
                zhengwang: ['伯父，侄儿知错了……<br><br><br>'],
            },
            design: ['弈声传媒', '落影逝尘', '大熊小猫'],
        },
        sdyx_kezhene: {
            debug: {
                playerName: '柯镇恶',
            },
            taic: {
                sdyx_xiadan: ['行走江湖，侠义为先！', '习武之人，当立锄强扶弱之志！'],
                sdyx_xiangmo: ['无耻之徒，拿命来！', '路见不平，拔刀相助！'],
                zhengwang: ['我柯镇恶，无愧于天地……<br><br><br>'],
            },
            design: ['涂涂', '落影逝尘', '大熊小猫'],
        },
        sdyx_munianci: {
            debug: {
                playerName: '界穆念慈',
            },
            taic: {
                sdyx_zhaoqing: ['小女漂泊无依，愿此举觅得佳婿！', '今设擂台比武招亲，哪位好汉敢挑战？'],
                sdyx_qianquan: ['浪子回头金不换！', '不管你是杨康还是完颜康，都是我不悔的选择。'],
                zhengwang: ['阿康，我来陪你了……<br><br><br>'],
            },
            design: ['冷冷血', '落影逝尘', '大熊小猫'],
        },
        sdyx_tuolei: {
            debug: {
                playerName: '拖雷',
            },
            taic: {
                sdyx_yingong: ['蒙古骑兵，所向无敌！', '东征西讨，随父征战！'],
                sdyx_gepao: ['你我不再是安答，而是战场上的敌人！', '从今以后，你我恩断义绝！'],
                zhengwang: ['郭靖安答，愿我们来世还做兄弟……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        sdyx_tiemuzhen: {
            debug: {
                playerName: '铁木真',
            },
            taic: {
                sdyx_rongma: ['一将功成万骨枯！', '戎马一生，逐鹿中原！'],
                sdyx_tuojiang: ['东歼金国，南定大宋！', '普天之下，莫非王土！'],
                sdyx_tianjiao: ['此乃神谕！', '策马南征，如有神助！'],
                zhengwang: ['我，真的不该杀戮吗……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        sdyx_wokuotai: {
            debug: {
                playerName: '窝阔台',
            },
            taic: {
                sdyx_canshi: ['臣服于蒙古帝国的铁蹄之下吧，哈哈哈……', '拿下此城，如扼南朝咽喉！'],
                sdyx_jingtun: ['蒙古帝国，四海无疆！', '马蹄所踏，皆为王土！', '要把青天覆盖的土地，都变作蒙古人的牧场！'],
                zhengwang: ['马背上的民族，绝不会被打败…………<br><br><br>'],
            },
            design: ['联络', '霸天', '大熊小猫'],
        },
        sdyx_wanyanhonglie: {
            debug: {
                playerName: '完颜洪烈',
            },
            taic: {
                sdyx_lixian: ['求贤若渴，礼贤下士！', '此人武艺非凡，可收于麾下！'],
                sdyx_zhulu: ['若得《武穆遗书》，定能助我攻克大宋！', '如此奇书，当归我所有！'],
                sdyx_baye: ['尔等智计百出，乃我大金之福！', '踏平南宋，荣华富贵享之不尽！'],
                zhengwang: ['胜者为王，败者为寇……<br><br><br>'],
            },
            design: ['弈声传媒', '落影逝尘、寰宇星城', '大熊小猫'],
        },
        sdyx_duanzhixin: {
            debug: {
                playerName: '界段智兴',
            },
            taic: {
                sdyx_yiyang: ['一中即离，一攻而退。', '欺身而上，攻敌要害！'],
                sdyx_chanxin: ['生亦何欢，死亦何苦？', '有情皆孽，无情太苦。'],
                sdyx_duhua: ['天地有情尽白发，人间无意了沧桑。', '人生如过客，放下即自在。'],
                zhengwang: ['我不入地狱，谁入地狱……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        sdyx_qiuchuji: {
            debug: {
                skill: {
                    非界限突破情况: {
                        sdyx_miyue_new: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    sdyx_miyue: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界丘处机',
            },
            taic: {
                sdyx_miyue: ['十八年后，各领爱徒，在此一较高下！', '如此，十八年后，醉仙楼再见！'], //普通版
                sdyx_miyue_new: ['十八年后，各领爱徒，在此一较高下！', '如此，十八年后，醉仙楼再见！'], //突破版
                sdyx_shijian: ['大汗当止杀爱民，成传世之仁君！', '仁政首要，敬天爱民。'],
                zhengwang: ['康儿数典忘祖，这场比赛，贫道是输了……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        sdyx_sphuangyaoshi: {
            debug: {
                playerName: 'sp黄药师',
            },
            taic: {
                sdyx_bichao: ['桃花影落飞神剑，碧海潮生按玉箫。', '桃花飞影潮生后 ，尽想东邻一笑痴。'],
                sdyx_luoying: ['桃花剑影独风流，玉笛青衫不系舟。', '微雨蝶飞忙，落花顾自伤。'],
                zhengwang: ['自古多情总自伤，花自飘零水自流……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        sdyx_wangchongyang: {
            debug: {
                playerName: '界王重阳',
            },
            taic: {
                sdyx_lunjian: ['客赏险峰有孤松，剑指华山无绝路！', '多少英雄多少梦，江湖来去各西东。刀锋交错不遑让，以武论道在孤峰！'],
                sdyx_xuantong: ['万法互通，方知万法皆空！', '天下武学，玄门正宗！', '呼吸吐纳心自在，气沉丹田手心开！'],
                zhengwang: ['无敌真寂寞，高处不胜寒……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdyx_spmeichaofeng: {
            debug: {
                playerName: 'sp梅超风',
            },
            taic: {
                sdyx_xiezhao: ['摧坚神爪，穿骨摄魂！', '多少能人异士，皆我爪下亡魂！'],
                sdyx_zhengu: ['天煞孤星泪，亡夫魂未销！', '好个双双对对，我偏棒打鸳鸯！'],
                zhengwang: ['夫仇未报，岂能……独活……<br><br><br>'],
            },
            design: ['遂非', '霸天', '大熊小猫'],
        },
        sdxl_juezhoubotong: {
            debug: {
                playerName: '绝周伯通',
            },
            taic: {
                sdxl_hubo: ['心无杂念，自成方圆!', '以一人之力，展二人之威！'],
                sdxl_kongming: ['大成若缺，其用不弊！', '大盈若冲，层出不穷！'],
                sdxl_zhuxi: ['华山论剑？好玩儿好玩儿好玩儿！', '情情爱爱惹人烦，还是养蜜蜂好玩！'],
                zhengwang: ['春波碧草，晓寒深处，相对浴红衣……<br><br><br>'],
            },
            design: ['狗子', '霸天、藏海', '大熊小猫'],
        },
        sdxl_gongsunlve: {
            debug: {
                playerName: '公孙绿萼',
            },
            taic: {
                sdxl_xiandan: ['女为悦已者容，亦可为已悦者死！', '飞蛾扑火，芳心无悔！'],
                sdxl_kunqing: ['弱水三千，只取一瓢！', '情网如织，我心如茧！'],
                zhengwang: ['杨大哥，今生缘悭，来世再见……<br><br><br>'],
            },
            design: ['奶诗', '霸天、藏海', '大熊小猫'],
        },
        sdxl_jue_wangchongyang: {
            debug: {
                playerName: '绝王重阳',
            },
            taic: {
                sdxl_candou: ['天宇无极，宙耀七星！', '明河映苍穹，北斗落长空！'],
                sdxl_xingluo: ['天以顺动而地以灵静，故星斗有行矣。', '七曜行而众星恒，近天则迟，远天则速。'],
                sdxl_ziwei: ['为政之德譬如北辰，居紫微而众星拱之。', '天有三辰，辰之一仪，谓之北极。'],
                sdxl_tiangang: ['极星通地轴，星象正天枢！', '身同流星杳然逝，吾道长存共北辰！'],
                tlbb_wcy_tianshu1: ['万象举动撼天枢，八极纵目览星辰。', '天枢之星，贪狼之宿。'],
                tlbb_wcy_tianxuan3: ['天海沁翠色，星璇入银河。', '天璇应地，巨门入星。'],
                tlbb_wcy_tianji5: ['月华凝碧玉，星尘聚天玑。', '天玑存禄，避凶趋吉。'],
                tlbb_wcy_tianquan7: ['我为莹烛纵黯淡，权平北斗自光芒。', '天权之衡，步北斗，踏天罡。'],
                tlbb_wcy_yuheng9: ['玉衡指孟冬，众星何历历。', '玉衡璀璨，以正廉贞。'],
                tlbb_wcy_kaiyang11: ['开阳升烽燧，残月落边城。', '星辅双合，共行开阳。'],
                tlbb_wcy_yaoguang13: ['摇光一转动北斗，失路荒芜指迷津。', '摇光破军，德全七政。'],
                zhengwang: ['人生不复见，动如参与商……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_daerba: {
            debug: {
                playerName: '达尔巴',
            },
            taic: {
                sdxl_qitun: ['拔地参天，力贯苍穹！', '攻城拔寨，所向无敌！</b>', '遇山开山，逢水劈水！'],
                sdxl_kuangchu: ['大力金刚杵！！', '夺命狂杵，取你性命！', '中原武林，尽是鼠辈！'],
                zhengwang: ['我的力气，也耗尽了……<br><br><br>'],
            },
            design: ['无忆CHENG', '霸天', '大熊小猫'],
        },
        sdxl_luzhanyuan: {
            debug: {
                playerName: '陆展元',
            },
            taic: {
                sdxl_wenqing: ['欢乐趣，离别苦，就中更有痴儿女！', '千山暮雪，只影向谁去！'],
                sdxl_huaijuan: ['你们藏好这方锦帕，可保一时平安！', '愿女魔头赌物思人，饶你们性命！'],
                zhengwang: ['问世间，情是何物……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        sdxl_xie_limochou: {
            debug: {
                playerName: '邪李莫愁',
            },
            taic: {},
            design: ['喵吱', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_shendiao: {
            debug: {
                playerName: '神雕',
            },
            taic: {
                sdxl_shouzhong: ['得雕兄慷慨相赠，小弟便不客气了！', '如此宝剑，小弟愧不敢收！'],
                qtpz_duwu: ['雕兄真是严师出高徒啊！', '（雕鸣）'],
                zhengwang: ['（无）'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdxl_xie_gongsunzhi: {
            debug: {
                playerName: '邪公孙止',
            },
            taic: {
                sdxl_fenqing: ['烈焰焚情，火海葬心！', '碧焰烧干千层泪，赤血染花两边心！'],
                sdxl_boqing: ['我纵得不到你的心，也要得到你的人！', '若不与我拜堂成亲，你的爱郎休想踏出这绝情谷！'],
                sdxl_wuqing: ['无情伤尽有情人，有情自伤无情物！', '自古多情空余恨，多情总被无情伤！'],
                sdxl_jieqing: ['情花伤情深，断情需绝情！', '欲治情毒草，断肠为良药！'],
                zhengwang: ['情之一物，最是伤人，哈哈哈哈哈……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_spyangguo: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdxl_xiaohun: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdxl_xiaohun: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: 'sp杨过',
            },
            taic: {
                sdxl_zhangqing: ['哀莫大于心死，而人死亦次之！', '世界上最遥远的距离，莫过于阴阳两隔！'],
                sdxl_liufang: ['彼岸花开开彼岸，奈何桥前可奈何！', '生死两茫茫，何处话凄凉？'],
                sdxl_xiaohun: ['断肠之殇，锥心之痛！！', '黯然销魂者，唯别而已矣！'],
                zhengwang: ['古墓，是我们最好的归宿……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdxl_zhenzhibing: {
            debug: {
                playerName: '甄志丙',
            },
            taic: {
                sdxl_qieyu: ['一亲姑娘芳泽，甄某死而无憾！', '姑娘美若天仙，怎教在下不心驰神往？'],
                sdxl_dajie: ['小节有损，大节不亏！', '鞑子挥师入中原，全真教必身先士卒！'],
                zhengwang: ['甄某之过，非一死而能赎罪……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdxl_fengmofeng: {
            debug: {
                playerName: '冯默风',
            },
            taic: {
                sdxl_qiaojiang: ['天工所至，精器为开！', '枭贼匪乱助胡虏，精兵利器定神州！', '铸神兵利刃，驱流寇奸宄！'],
                sdxl_qianying: ['病体残躯何所惜，匡助危城驱蛮夷！', '不入虎穴，焉得虎子！'],
                zhengwang: ['犹记当年桃花开……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        sdxl_jue_duguqiubai: {
            debug: {
                playerName: '绝独孤求败',
            },
            taic: {
                jue_wuzhao: ['无招胜有招。', '无剑胜有剑。', '遍寻天下，但求一败。', '败尽英雄，天下无双。', '不滞于物，草木皆兵。', '高处不胜寒！', '自古高手皆寂寞！'],
                jue_zangjian: ['隐居深谷，埋剑于此！', '群雄束手，长剑空利，不亦悲夫！'],
                zhengwang: ['我，是自己最大的敌人……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        sdxl_chengying: {
            debug: {
                playerName: '程英',
            },
            taic: {
                sdxl_shentong: ['小小碎石，亦可力破千钧！', '金铮之音，非袖而聚其势！'],
                sdxl_xiaoyin: ['桃花影落飞神剑，碧海潮生按玉箫。', '箫声一付，空谷幽兰。'],
                zhengwang: ['契若金兰，莫逆于心……<br><br><br>'],
            },
            design: ['大绿_Midori酱', '银汉贯苍穹', '大熊小猫'],
        },
        sdxl_luwushuang: {
            debug: {
                playerName: '陆无双',
            },
            taic: {},
            design: ['安生', '霸天', '大熊小猫'],
        },
        sdyx_hanxiaoying: {
            debug: {
                playerName: '韩小莹',
            },
            taic: {
                sdyx_yuenv: ['杳之若日，偏如腾兔！', '布形候气，与神俱往！'],
                sdyx_qiaojian: ['风灵轻渡雨，剑蕴巧心中！', '拭刃浣纱后，泛舟采莲花。'],
                zhengwang: ['阿生哥，小莹这就来陪你了……<br><br><br>'],
            },
            design: ['酱子', '霸天', '大熊小猫'],
        },
        sdyx_shagu: {
            debug: {
                playerName: '傻姑',
            },
            taic: {},
            design: ['安生', '霸天', '大熊小猫'],
        },
        sdyx_zhangasheng: {
            debug: {
                playerName: '张阿生',
            },
            taic: {
                sdyx_paoding: ['拆骨分筋，游刃有余！', '庖丁解牛，大快朵颐！'],
                sdyx_tiexue: ['虽为贩夫走卒，常怀忠义之心！', '情如铁坚，义比血浓！'],
                zhengwang: ['七妹，莫哭，莫哭……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        sdxl_guojinghuangrong: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdxl_yuanshou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_yuxue: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdxl_yuanshou: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_yuxue: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '绝郭靖黄蓉',
            },
            taic: {
                sdxl_gulei: ['神兵在手，斩敌击寇；奇书在旁，固守襄阳！', '且缮义勇三千甲，四方执锐固襄阳！'],
                sdxl_yingguan: ['得义士援助，襄阳可守！', '血海激涛护城河，刃映寒锋困森罗！'],
                sdxl_weicheng: ['兵临城下襄阳危，铁胆英豪铸堡垒！', '城池危在旦夕，我等当戮力同心！'],
                sdxl_yuanshou: ['望眼尸山砌忠骨，狼烟燃铸英雄魂！', '鞑虏噬骨如蚁附，援纳百川聚海流！'],
                sdxl_yuxue: ['捐躯赴国难，视死忽如归！', '男儿有志报沙场，马革裹尸守襄阳！'],
                zhengwang: ['铁血襄阳终难守，留取丹心照后人……<br><br><br>'],
            },
            design: ['炎凉、狗子', '寰宇星城', '寰宇星城'],
        },
        sdxl_xiaoxiangziyinkexi: {
            debug: {
                playerName: '潇湘子尹克西',
            },
            taic: {
                sdxl_qiejing: ['尹：既入少林宝地，岂能空手而归？', '潇：瞒天之计已成，速速脱壳抽身！'],
                sdxl_huji: ['尹：潇湘兄，休要独占宝书！', '潇：自古无奸不成商，莫要打这如意算盘！'],
                zhengwang: ['经……在猴中……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_maguangzuo: {
            debug: {
                playerName: '马光佐',
            },
            taic: {},
            design: ['大宝', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_nimoxing: {
            debug: {
                playerName: '尼摩星',
            },
            taic: {},
            design: ['大宝', '霸天', '吃饱睡睡醒吃'],
        },
        sdxl_yangguoxiaolongnv: {
            debug: {
                playerName: '杨过小龙女',
            },
            taic: {
                sdxl_bihe: ['古墓全真，相生相克！', '玄铁重势，可破万法！', '剑舞轻灵，以柔克刚。'],
                sdxl_xianlv: ['经年历尽千霜雪，不渝白首始如新！', '沧海桑田，不离不弃！'],
                zhengwang: ['神雕侠侣，绝迹江湖……<br><br><br>'],
            },
            design: ['黑兔、孑然', '落影逝尘', '大熊小猫'],
        },
        sdxl_hubilie: {
            debug: {
                playerName: '忽必烈',
            },
            taic: {
                sdxl_kaoshang: ['重赏之下，必有勇夫！', '立此汗马功劳，定享高官厚禄！'],
                sdxl_quanxiang: ['我等吊民伐罪，实乃仁义之师！', '郭叔父盖世英雄，何苦事奉昏君？'],
                zhengwang: ['千古霸业一场梦……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '寰宇星城'],
        },
        sdxl_guofuX: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdyx_baojia: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_baiju: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdyx_baojia: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_baiju: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '郭芙',
            },
            taic: {
                sdxl_jiaozi: ['杨过，我跟你不共戴天！', '本大小姐可不好惹！'],
                sdxl_danni: ['桃花岛大小姐在此，谁敢放肆？', '大武小武，给我教训这个臭小子！'],
                sdyx_baojia: ['宝甲在身，你蔫能伤到我半根毫毛！', '我是娘的掌上明珠，这软猬甲自然归我所有！'],
                sdxl_baiju: ['春入眉心一点愁，芳华共争国事忧！', '襄阳凭栏对狼烟，红衣怒马复少年！'],
                zhengwang: ['错尽悔不知，再见亦如斯……<br><br><br>'],
            },
            design: ['地鼠', '落影逝尘', '大熊小猫'],
        },
        sdxl_yangguo: {
            debug: {
                playerName: '界杨过',
            },
            taic: {
                sdxl_anhun: ['莫道黯然销魂，何处柳暗花明？', '一十六载，魂断天涯！'],
                sdxl_biefu: ['绝情断崖处，伊人今在否？', '相思无用，唯别而已，别期若有定，千般煎熬又何如？'],
                sdxl_shangli: ['多情自古伤离别！', '十年生死两茫茫，不思量，自难忘！'],
                zhengwang: ['未知今夕何夕……<br><br><br>'],
            },
            design: ['清酒摇舟', 'SUKINCEN', '大熊小猫'],
        },
        sdxl_xiaolongnv: {
            debug: {
                playerName: '小龙女',
            },
            taic: {
                sdxl_luowang: ['待你习就双掌罗雀，便是我古墓派入室弟子了。', '在这天罗地网中，了此残生吧！'],
                sdxl_hebi: ['此乃本门绝学，需二人合璧修炼。', '双剑合璧，技压全真。'],
                sdxl_muzong: ['野径斜入终南山，冷冷秋色古墓寒！', '十六载，相思染，携手归隐终南山。'],
                zhengwang: ['人间烟火，山河远阔，无一是你，无一不是你……<br><br><br>'],
            },
            design: ['草莓味少女', 'SUKINCEN', '大熊小猫'],
        },
        sdxl_jinlunfawang: {
            debug: {
                playerName: '金轮法王',
            },
            taic: {
                sdxl_longxiang: ['吃我一记龙象般若掌！', '掌如霹雳，无坚不摧！'],
                sdxl_mizong: ['待我习得龙象般若十三层，定能纵横中原武林！', '金刚密宗，擎天撼地！'],
                zhengwang: ['难道我龙象般若掌，竟不如这黯然销魂掌……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        sdxl_mengge: {
            debug: {
                遗漏: {
                    sdxl_fasong: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '蒙哥',
            },
            taic: {
                sdxl_xiezhi: ['你是选你女儿，还是选襄阳城的百姓？', '你若不肯降顺，我便当着两军将士的面，烧死你宝贝女儿！', '在你宝贝女儿和襄阳城之间，做个抉择吧！', '我要当着天下英雄的面，让你女儿葬身火海！'],
                zhengwang: ['马背上的民族，当战死沙场……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        sdxl_wudunruwuxiuwen: {
            debug: {
                playerName: '武敦儒武修文',
            },
            taic: {
                sdxl_xiqiang: ['忆往昔手足情深，叹今朝反目成仇！', '你我兄弟二人，何不一决胜负？'],
                sdxl_shubian: ['僵卧孤村不自哀，尚思为国戍轮台！', '山河欲坠今有恙，吾辈为国披戎装！'],
                zhengwang: ['国难当前，悔不该，骨肉操戈……<br><br><br>'],
            },
            design: ['儒风', '落影逝尘', '大熊小猫'],
        },
        sdxl_gongsunzhi: {
            debug: {
                playerName: '公孙止',
            },
            taic: {
                sdxl_qinggu: ['情花之毒，断肠之痛！', '肝肠寸断未忘情，却问情之为何物？'],
                sdxl_zhenwang: ['必要将尔等，一网打尽！', '如此阵网，插翅难逃！'],
                zhengwang: ['萼儿，爹对不起你……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        sdxl_zhaozhijin: {
            debug: {
                playerName: '赵志敬',
            },
            taic: {
                sdxl_lingxie: ['若非你行苟且之事，又怎会受制于我呢？', '甄师弟莫非忘了终南山那个风花雪月之夜？'],
                sdxl_tongbi: ['天下大势已定，何不接受蒙古册封？', '大汗乃天命所归，全真教愿听候差遣！'],
                sdxl_bishan: ['我，才是全真教掌门人的不二人选！', '全真教生杀大权，由我一人掌控！'],
                zhengwang: ['这就是多行不义必自毙吗……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        sdxl_spguoxiang: {
            debug: {
                skill: {
                    界限突破情况: {
                        sdxl_qinmu2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_qinmu3: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_qinmu4: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_guizong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        sdxl_qinmu2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_qinmu3: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_qinmu4: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        sdxl_guizong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: 'sp郭襄',
            },
            taic: {
                sdxl_renxia: ['江湖纷乱，自有我一剑承担！', '社稷危亡，承继侠者之光！'],
                sdxl_qinmu: ['人间自有情难老，不信娇女白发生！', '华山诀别江湖远，风陵不见神雕侠！'],
                sdxl_qinmu2: ['君生我未生，我生君已老！', '祝大哥哥和杨大嫂合百年之好！'],
                sdxl_qinmu3: ['一去江湖远，何时再少年？', '花有重开日，人无再少年！'],
                sdxl_qinmu4: ['错付痴心亦无悔，青灯古佛伴余生！', '人生如梦亦如幻，缘生缘灭还自在！'],
                sdxl_guizong: ['峨眉女眷，不为情痴！', '一心向道，不恋红尘！'],
                zhengwang: ['大哥哥，多想再见你一面……<br><br><br>'],
            },
            design: ['浅笑安然', '落影逝尘', '大熊小猫'],
        },
        sdxl_limochou: {
            debug: {
                playerName: '李莫愁',
            },
            taic: {
                sdxl_shixin: ['情花如蛊，万蛇噬心！', '问世间情为何物，直教人生死相许？'],
                sdxl_bingpo: ['你蔫能逃得出我的手掌心？', '不交出《玉女心经》，我要你万针穿心！'],
                sdxl_sanwu: ['你已无路可逃，还不交出经书？', '今日便是我掌管古墓派的大好时机！'],
                zhengwang: ['天南地北双飞客，老翅几回寒暑……<br><br><br>'],
            },
            design: ['仙女桥', '冷雨', '大熊小猫'],
        },
        sdxl_jue_yanggaizhi: {
            debug: {
                playerName: '绝杨改之',
            },
            taic: {
                sdxl_gaizhi: ['过而能改，善莫大焉！', '父孽子还，功过相赎！', '知过不讳，改过不惮！', '若非郭伯伯教诲如子，过儿焉有今日？'],
                sdxl_shangqing: ['此情未待成余恨，只是伤心到尽头。', '情思莫共情花绽，一寸别离一寸伤！', '碧落黄泉难寻见，幽梦恐别恨天长。', '断肠肠断泪难断，伤情情伤心亦伤！'],
                sdxl_xikuang: ['是是非非何时了，恩恩怨怨几时休！', '古来英豪皆寂寞，天下谁人复我敌！'],
                zhengwang: ['他日江湖若相逢，把酒千盏再言欢……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        sdxl_qiuqianchi: {
            debug: {
                playerName: '界裘千尺',
            },
            taic: {
                sdxl_guofu: ['亏得这棵枣树，老娘早成饿死鬼了！', '他要我死，我偏不死！'],
                sdxl_heji: ['有种的，就接我三枚枣核钉！', '天下利刃，皆敌不过我枣核钉！'],
                sdxl_zifu: ['哼，不怕公孙止这老贼不上钩！', '作茧自缚，也要和狗贼同归于尽！'],
                zhengwang: ['从今起，你中有我，我中有你，哈哈哈……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        sdxl_guopolu: {
            debug: {
                playerName: '郭破虏',
            },
            taic: {
                sdxl_zhulu: ['休让鞑虏，犯我河山！', '舍身取义，为民请命！'],
                sdxl_zhonggu: ['鞑子兵临城下，襄阳全民皆兵！', '遍地狼烟埋忠骨，碧血丹心佑襄阳！'],
                zhengwang: ['襄阳沦陷，我愿以死殉城……<br><br><br>'],
            },
            design: ['洛', '落影逝尘', '大熊小猫'],
        },
        sdxl_wusechanshi: {
            debug: {
                playerName: '无色禅师',
            },
            taic: {},
            design: ['大宝', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_ruyangwang: {
            debug: {
                playerName: '汝阳王',
            },
            taic: {
                yttl_pingluan: ['此患不除，如鲠在喉！', '明教兴兵作乱，末将愿请兵出战！'],
                yttl_qianbing: ['贼势已颓，千秋基业犹可存！', '飞随银鹘弓刀满，晓驾黑云日月翻！'],
                yttl_qianglu: ['擒得贼首，重重有赏！', '射人先射马，擒贼先擒王！'],
                zhengwang: ['我大元雄兵百万，怎至如此田地……<br><br><br>'],
            },
            design: ['随遇而安', '吃朵棉花糖、霸天', '大熊小猫'],
        },
        yttl_shuobude: {
            debug: {
                playerName: '说不得',
            },
            taic: {
                yttl_xingnang: ['我有一布袋，虚空无挂碍！', '背起行囊，游方去也！', '若言包得太虚空，虚空却在布袋外。', '行也布袋，坐也布袋，放下布袋，多少自在！'],
                yttl_poxi: ['宝袋一破，奇珍尽泄！', '千古一奇缘，袋破再无修！'],
                zhengwang: ['忽抛布袋归何处，地下天高一阁空……<br><br><br>'],
            },
            design: ['狗子', '吃朵棉花糖', '大熊小猫'],
        },
        yttl_chengkun: {
            debug: {
                playerName: '成昆',
            },
            taic: {},
            design: ['大宝', '霸天', '大熊小猫'],
        },
        yttl_dudajin: {
            debug: {
                playerName: '都大锦',
            },
            taic: {
                yttl_yabiao: ['镖行天下义当先，江湖人缘是饭缘！', '途经宝地，望诸位当家的行个方便！', '何方高人，还望现身赐教！', '多说无益，亮家伙吧！'],
                yttl_shizui: ['老都失信于人，前来负荆请罪！', '俞三侠遭此劫难，我等万死莫赎！'],
                zhengwang: ['贪心起，横祸至……<br><br><br>'],
            },
            design: ['狗子', '霸天', '大熊小猫'],
        },
        yttl_jue_zhangwuji: {
            debug: {
                playerName: '绝张无忌',
            },
            taic: {
                yttl_tianni_new: ['日有晦朔，月有盈亏，天地尚无完体。', '攻守可化，是非可逆，乾坤亦能颠倒。'],
                yttl_tianyu_new: ['参破死生之境，惟存医者仁心。', '我已尽力施救，康愈与否，尚待天意。'],
                yttl_tianyang_new: ['抱元含一，呼吸九阳。', '天生浩气，纯阳无极！'],
                zhengwang: ['明教善道，不解人世疾苦；医者仁心，难救大厦将倾……<br><br><br>'],
            },
            design: ['彻君', '霸天', '大熊小猫'],
        },
        yttl_zhangwujizhaomin: {
            debug: {
                playerName: '张无忌赵敏',
            },
            taic: {
                yttl_nuoyi: ['一法通万法，一力降百力！', '气转阴阳，混元一体！'],
                yttl_shiquan: ['纵有经天纬地之才，然无气吞山河之志！', '而今山河相奉，愿君还以盛世！'],
                yttl_guitian: ['管这天下，姓赵也好，姓朱也罢，便与我们无关！', '从今而起，我要你，天天为我画眉！'],
                zhengwang: ['这一世，为你画眉……<br><br><br>'],
            },
            design: ['冬赫、兔猪', '霸天', '大熊小猫'],
        },
        yttl_wangnangu: {
            debug: {
                playerName: '王难姑',
            },
            taic: {},
            design: ['鲜女不吃鱼', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_xie_zhaomin: {
            debug: {
                playerName: '邪赵敏',
            },
            taic: {
                yttl_hehe: ['家父汝阳王，敢动本姑娘，仔细自己的脑袋！', '爹爹战功赫赫，实乃元室之幸！', '挥鞭纵马，肃反剿贼！'],
                yttl_ruanjin: ['谁言女子非英物，六派皆为阶下囚！', '中原武林，不过尔尔！', '任诸位武艺高绝，都得倒在本郡主的软筋散下！'],
                yttl_jieqin: ['这第二件事，今日不能与周姑娘成亲！', '男子汉婆婆妈妈，会抱憾终生的！', '我偏要勉强！'],
                zhengwang: ['什么华夷之分、权势威名，我心中只你一个……<br><br><br>'],
            },
            design: ['许浞', '霸天', '大熊小猫'],
        },
        yttl_dingminjun: {
            debug: {
                playerName: '丁敏君',
            },
            taic: {
                yttl_feiyi: ['周芷若勾结魔教，包藏祸心，实乃峨眉之耻！', '你弑师夺位、蒙羞峨眉，当门规处置！'],
                yttl_zhengfeng: ['掌门之位，能者居之！', '我们，还是刀剑底下见真章吧！'],
                zhengwang: ['掌门师妹饶命，敏君不敢造次了……<br><br><br>'],
            },
            design: ['谢声繁', '藏海', '大熊小猫'],
        },
        yttl_juezhangsanfeng: {
            debug: {
                playerName: '绝张三丰',
            },
            taic: {
                yttl_liangyi: ['开天辟地化万物，凿破鸿蒙分太极！', '太极未分混沌，两仪已非其中！', '道存天地养万物，德化乾坤育众生！'],
                yttl_sixiang: ['一粒刀圭开四象，两般枪法杀三尸！', '太极功法，绵里藏针！'],
                zhengwang: ['物我相亲，天人合一……<br><br><br>'],
            },
            design: ['狗子', '霸天', '大熊小猫'],
        },
        yttl_yangdingtian: {
            debug: {
                playerName: '阳顶天',
            },
            taic: {
                yttl_kangyuan: ['天地存续留砥柱，江山有此障狂澜！', '蝼蚁尚有种，麒麟岂能逃！'],
                yttl_qianyi: ['拼将十万心头血，乾坤逆转未可知！', '刚柔颠倒，沛莫能御！'],
                yttl_mingzun: ['不居其位，不明其难；护国救民，纵死留香！', '敝履荣华，浮云生死，此身何惧！', '塞虏欲南饮，天兵伏北境！'],
                zhengwang: ['崇义卫国，终失所爱……<br><br><br>'],
            },
            design: ['随遇而安', '吃朵棉花糖、霸天', '大熊小猫'],
        },
        yttl_dujie: {
            debug: {
                playerName: '绝渡劫',
                hasPlayer: '请检查该角色是否已定义',
            },
            taic: {
                yttl_wujie: ['佛法无边，不渡无缘人；天雨辽阔，不润无根草！', '跳出三界外，不在五行中！'],
                yttl_exiang: ['金刚伏魔，天罗地网！', '因果轮回，善恶终报！'],
                zhengwang: ['佛度苦厄，何不渡我……<br><br><br>'],
            },
            design: ['狗子', '霸天', '超市薯片半价'],
        },
        yttl_yulianzhou: {
            debug: {
                playerName: '俞莲舟',
            },
            taic: {
                yttl_juehu: ['仙人摘桃，险中求胜！', '此招阴损，诸君慎用！'],
                yttl_rouquan: ['至刚而易折，至柔则无损！', '强极则损，弓满则折！', '至柔绕指刚则折，善而藏之吞明月！'],
                yttl_chuandao: ['传道授业，桃李满园！', '薪火相传，生生不息！', '桃李满天下，学子尽乾坤！'],
                zhengwang: ['星星之火，不能灭……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        yttl_zhangsongxi: {
            debug: {
                playerName: '张松溪',
            },
            taic: {
                yttl_shien: ['施恩莫望报，望报莫施恩！', '铁肩担道义，仁心施大爱！', '见死不救非英雄！', '扶弱助困，乃侠义之本！'],
                qtpz_roudao: ['水满则溢，物极必反！', '智圆行方，曲中求直！', '至柔者至刚，至弱者至强！', '反者道之动，弱者道之用！'],
                zhengwang: ['人间正道，永恒之光……<br><br><br>'],
            },
            design: ['冰霜墨菊', '落影逝尘', '大熊小猫'],
        },
        yttl_xinran: {
            debug: {
                playerName: '辛然',
            },
            taic: {
                yttl_cuihuo: ['烈火炼真金，疾风知劲草！', '炉火红红，百炼成钢！', '铁打的营盘，流水的兵！'],
                yttl_shanfeng: ['星星之火，可以燎原！', '东风正劲，利箭满弦！'],
                zhengwang: ['熊熊圣火，焚我残躯……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        yttl_huangshannv: {
            debug: {
                playerName: '黄衫女',
            },
            taic: {
                yttl_taiying: ['天下至柔，可破至坚！', '水之无形，因缘而化！', '弱之胜强，柔之胜刚，天下莫不知，莫能行！'],
                yttl_xianzong: ['终南山后，活死人墓，神雕侠侣，绝迹江湖！', '古墓仙踪今犹在，故人一去不复返！'],
                zhengwang: ['绿水常流，后会有期……<br><br><br>'],
            },
            design: ['谢声繁', '落影逝尘', '大熊小猫'],
        },
        yttl_zhoudian: {
            debug: {
                playerName: '周颠',
            },
            taic: {
                yttl_dianxian: ['你说话牛头不对马嘴，掌嘴掌嘴！', '你前言不搭后语，后语不接前言，委实可笑！'],
                yttl_nizhan: ['以彼之矛，破彼之盾，稳如天算！', '一寸长，一寸强，胜算就在一寸间！'],
                zhengwang: ['你！满口胡言乱语……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        yttl_hanliner: {
            debug: {
                playerName: '韩林儿',
            },
            taic: {
                yttl_guyong: ['谋事在人，成事在天！', '什么成王败寇，我韩氏一族，从不认命！'],
                yttl_juezhu: ['群雄逐鹿，胜者为王！', '事在人为，人定胜天！', '以退为进，以守为攻！'],
                zhengwang: ['大好江山，岂能拱手相让……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        yttl_moshenggu: {
            debug: {
                playerName: '莫声谷',
            },
            taic: {
                yttl_roujian: ['你有金刚钻，我有绕指柔！', '铁杵成针，滴水穿石！'],
                yttl_xunjie: ['身体发肤，受之父母，岂可轻易舍之！', '青书，苦海沉舟，及早回头！'],
                zhengwang: ['你弑叔犯上，必遭天谴……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        yttl_doujiushenseng: {
            debug: {
                playerName: '绝斗酒神僧',
            },
            taic: {
                yttl_jiyang: ['阴阳调和，刚柔并济！', '天地万物，分两极！'],
                yttl_jiusheng: ['酒逢知己，千杯少！', '醉酒提壶力千钧！', '酒不醉人，人自醉！'],
                zhengwang: ['世人皆醉，我独醒……<br><br><br>'],
            },
            design: ['白夜', '落影逝尘', '大熊小猫'],
        },
        yttl_wujincao: {
            debug: {
                playerName: '吴劲草',
            },
            taic: {
                yttl_duanzhu: ['男儿到死心如铁，看试手，补天裂！', '炉火照天地，红星乱紫烟！'],
                yttl_zhengqi: ['锐金旗下，听我号令！', '枪斧索命，刀箭穿心！'],
                zhengwang: ['打铁还需自身硬……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        yttl_yintianzheng: {
            debug: {
                playerName: '殷天正',
            },
            taic: {
                yttl_yingxi: ['日月光照，鹰王展翅！', '鹰爪之下，片甲不留！'],
                yttl_yiyuan: ['明教有难，老夫岂能置身事外？', '本教与明教同气连枝！', '当捐弃旧怨，群策群力！'],
                zhengwang: ['喜乐悲愁，皆归尘土……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_zhuer: {
            debug: {
                playerName: '邪蛛儿',
            },
            taic: {
                yttl_qianzhu: ['千蛛万毒注八脉，杀尽天下薄情人！', '千蛛万毒，不及情之一字！'],
                yttl_wandu: ['以身试毒毒攻心，将心换爱爱何求！', '情如含笑饮砒霜，断肠蚀骨皆所愿！'],
                yttl_gonghuan: ['我的心，早已许给那个短命鬼小张无忌！', '终有弱水替沧海，再无相思寄巫山！'],
                zhengwang: ['人生到处知何似，应似飞鸿踏雪泥……<br><br><br>'],
            },
            design: ['陈九', '霸天', '大熊小猫'],
        },
        yttl_zhuchangling: {
            debug: {
                playerName: '朱长龄',
            },
            taic: {
                yttl_mouxian: ['此计天衣无缝，定得屠龙宝刀！', '既是五侠之子，便是我座上贵宾！'],
                yttl_bixian: ['你，中了老夫的计了！', '你已穷途末路！'],
                yttl_fenzhuang: ['欲得屠龙刀，作戏作全套！', '区区旧宅，不足为惜！'],
                zhengwang: ['奇谋秘计，终是幻梦泡影……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '寰宇星城、大熊小猫'],
        },
        yttl_spsongyuanqiao: {
            debug: {
                playerName: 'sp宋远桥',
            },
            taic: {
                yttl_yuanmeng: ['讨伐魔教，武当义不容辞！', '前赴后继，只为斩除顽恶！'],
                yttl_taiji: ['阴阳交汇，变化无穷！', '行云流水，延绵不绝！'],
                zhengwang: ['为父一世英名，尽毁你手……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '7ACE'],
        },
        yttl_zhujiuzhenwuqingying: {
            debug: {
                playerName: '朱九真武青婴',
            },
            taic: {
                yttl_zongquan: ['“车骑”将军，给我上！', '捉住那小子，赏你肉骨头！'],
                yttl_cuhai: ['师兄，你怎么净帮真姐说话？', '表哥，我哪里比不上武妹妹？'],
                zhengwang: ['卫哥，你怎能如此偏心……<br><br><br>'],
            },
            design: ['桃子玥', '落影逝尘', '大熊小猫'],
        },
        yttl_songyuanqiao: {
            debug: {
                playerName: '宋远桥',
            },
            taic: {
                yttl_zhengyuan: ['远桥援救来迟，还望师太宽恕！', '武当与贵派辅车相依，唇亡齿寒。'],
                yttl_shameng: ['明教乃武林公敌，理当同仇敌忾！', '明教不除，联盟不灭！'],
                zhengwang: ['养子不教，父之过……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        yttl_zhangsanfeng: {
            debug: {
                playerName: '张三丰',
            },
            taic: {
                yttl_taiji: ['以静制动，以柔克刚！', '太极生两仪，八卦生万物！'],
                yttl_chunyang: ['此时无招胜有招！', '草木皆为刃，四两拨千斤！'],
                yttl_taoli: ['学武先做人，忠厚为根本！', '中华太极门，正气满乾坤！'],
                zhengwang: ['花开有落时，人生容易老……<br><br><br>'],
            },
            design: ['狗子', 'SUKINCEN', '大熊小猫'],
        },
        yttl_yangxiao: {
            debug: {
                playerName: '界杨逍',
            },
            taic: {
                yttl_xingshi: ['你们谁，第一个出来受死啊？', '想上光明顶，先过我这关！'],
                yttl_jieao: ['什么六大派七大派，不过是乌合之众！', '所谓名门正派，都是三教九流之徒！'],
                zhengwang: ['我就算死，也要死得有尊严……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        yttl_fanyao: {
            debug: {
                playerName: '范遥',
            },
            taic: {
                yttl_qianwo: ['苦心十年潜敌营，一片赤心向光明！', '忍豫让之辱，护明教基业！', '玉面毁尽栖龙虎，世间再无逍遥仙！'],
                yttl_guijiao: ['光明右使范遥，参见张教主！', '光明二使齐聚，紫白金青归位！'],
                zhengwang: ['圣火，要熄灭了吗……<br><br><br>'],
            },
            design: ['沃声风飞语', '霸天', '大熊小猫'],
        },
        yttl_yinli: {
            debug: {
                playerName: '殷离',
            },
            taic: {
                yttl_maodu: ['宿仇难消，朱颜渐憔！', '此毒，攻心！'],
                yttl_chuxin: ['眷眷往昔时，忆此断人肠！', '吾心所系，唯昔日曾阿牛也！'],
                zhengwang: ['人生若只如初见……<br><br><br>'],
            },
            design: ['阿九', '落影逝尘', '大熊小猫'],
        },
        yttl_zhuyuanzhang: {
            debug: {
                遗漏: {
                    yttl_yinyuan: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '朱元璋',
            },
            taic: {
                yttl_qingce: ['眼中钉，肉中刺，不除不快！', '为君者，切不可亲小人而远贤臣！'],
                yttl_yaolu: ['今日助我大业，他日加官进爵！', '得此良将，霸业可图！'],
                zhengwang: ['得到天下，却失去了兄弟情谊……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        yttl_changbaisanqin: {
            debug: {
                playerName: '长白三禽',
            },
            taic: {
                yttl_fendao: ['烈火焚之，定能窥探宝刀奥秘！', '既得屠龙宝刀，何以难解刀中玄机？'],
                yttl_kuiyu: ['武林至尊，屠龙宝刀！', '宝刀在手，纵横武林指日可待！'],
                zhengwang: ['追逐一生，终酿成横祸……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        yttl_due: {
            debug: {
                playerName: '渡厄',
                hasPlayer: '请检查该角色是否已定义',
            },
            taic: {
                yttl_jingang: ['诸法空相，不生不灭！', '无众生相，无寿者相！'],
                yttl_fumo: ['众生皆苦，唯有自渡！', '是法平等，无有高下！'],
                yttl_kuchan: ['静心听佛语，佛渡有缘人！', '垂老抱佛脚，愿渡苦海人！'],
                zhengwang: ['无妄一心是一佛国；有妄一心是一地狱……<br><br><br>'],
            },
            design: ['狗子', 'SUKINCEN', '大熊小猫'],
        },
        yttl_shaolinsandu: {
            debug: {
                playerName: '渡厄渡劫渡难',
            },
            taic: {
                yttl_jingang: ['诸法空相，不生不灭！', '无众生相，无寿者相！'],
                yttl_fumo_new: ['众生皆苦，唯有自渡！', '是法平等，无有高下！'],
                yttl_wujie_new: ['佛法无边，不渡无缘人；天雨辽阔，不润无根草！', '跳出三界外，不在五行中！'],
                zhengwang: ['无妄一心是一佛国；有妄一心是一地狱……<br><br><br>'],
            },
            design: ['狗子', '霸天', '大熊小猫'],
        },
        yttl_jinhuapopo: {
            debug: {
                playerName: '金花婆婆',
            },
            taic: {
                yttl_jinhua: ['落此伤寒，终身不愈。', '老身抱恙在身，不便现身相见！'],
                yttl_jiedao: ['灭绝老尼仗剑伤我，还望谢老前辈赐刀一用！', '借此宝刀，定要灭绝跪地求饶！'],
                zhengwang: ['生死到头都成空……<br><br><br>'],
            },
            design: ['遂非', '落影逝尘', '大熊小猫'],
        },
        yttl_lengqian: {
            debug: {
                playerName: '冷谦',
            },
            taic: {},
            design: ['虚静', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_changyuchun: {
            debug: {
                playerName: '常遇春',
            },
            taic: {
                yttl_xianfeng: ['我老常，愿为教主鞍前马后！', '急流勇进，身先士卒！'],
                yttl_xiaoyong: ['匹夫之勇，亦可破敌！', '定要打得元军，落花流水！'],
                zhengwang: ['大丈夫，当马革裹尸而还……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        yttl_xuda: {
            debug: {
                playerName: '徐达',
            },
            taic: {
                yttl_zhenglu: ['当北征元室，驱逐鞑虏！', '长车踏破贺兰山，王师直捣黄龙府！'],
                yttl_hulve: ['去其屏藩羽翼，而后进兵，不战可胜！', '我军既克大都，余地，自可席卷而下。', '鹊巢鸠占百余载，归来无恙复河山！'],
                yttl_chengzhi: ['属下蒙教主授此宝书，愿为苍生剖肝沥胆！', '承遗志效法武穆，逐胡虏克复中原！'],
                zhengwang: ['得见九州归一，虽死无憾矣……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        yttl_changbaoshu: {
            debug: {
                playerName: '常胜宝树王',
            },
            taic: {
                yttl_lingjian: ['我等奉教主之命，前来捉拿教内叛徒！', '明教圣女，还不速速伏法！'],
                yttl_qizhao: ['番域奇功，变幻莫测！', '中原武学，不过花拳绣腿！'],
                zhengwang: ['张教主宅心仁厚，实在令人敬佩……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        yttl_yinliting: {
            debug: {
                skill: {
                    界限突破情况: {
                        yttl_taiji: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        yttl_taiji: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '殷梨亭',
            },
            taic: {
                yttl_channuo: ['若非我软弱无能，芙妹怎会见异思迁？', '男儿有泪不轻弹，只是未到伤心处！'],
                yttl_tongshou: ['哀莫大于心死！', '曾经沧海难为水，除却巫山不是云！'],
                yttl_taiji: ['不忘初心，方得始终！', '上善若水，刚柔相济！'],
                zhengwang: ['我本将心向明月，奈何明月照沟渠……<br><br><br>'],
            },
            design: ['神齐大叔', 'SUKINCEN', '大熊小猫'],
        },
        yttl_luhe: {
            debug: {
                playerName: '玄冥二老',
            },
            taic: {
                yttl_xuanming2: ['你已身中寒毒，命不久矣！', '玄冥神掌，至阴至寒！'],
                yttl_hanyin2: ['不该沉迷酒色，误了郡主大事！', '昨与美人对尊酒，朱颜如花腰似柳！'],
                zhengwang: ['晚节不保，晚节不保啊……<br><br><br>'],
            },
            design: ['弈声传媒有声工作室', '落影逝尘', '大熊小猫'],
        },
        yttl_miejue: {
            debug: {
                playerName: '灭绝师太',
            },
            taic: {
                yttl_zhangjian: ['驱逐鞑虏，还我汉人河山！', '领袖群伦，光耀峨眉！'],
                yttl_huiqiao: ['倚天不出，谁与争锋？', '芷若，倚天剑的秘密，你定当铭记！'],
                yttl_jie: ['你一刀杀了杨逍，我便立你为掌门！', '魔教余孽，祸国殃民！'],
                zhengwang: ['芷若，勿忘为师遗训……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        yttl_songqingshu: {
            debug: {
                playerName: '宋青书',
            },
            taic: {
                yttl_jixian: ['张无忌，你为何要横刀夺爱？', '我和周师妹，才是天造地设的一对！'],
                yttl_nishi: ['我待世人如亲故，世人欺我如刍狗！', '若得刹那芳华，飞蛾扑火又有何惧？'],
                zhengwang: ['我早已厌倦这不公的世界……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        yttl_zhangwuji: {
            debug: {
                skill: {
                    界限突破情况: {},
                    非界限突破情况: {
                        yttl_nijue: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    yttl_nijue_two: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界张无忌',
            },
            taic: {
                yttl_nijue_two: ['力拔千钧，斗转星移！', '转换阴阳二气，一击制敌！'],
                yttl_nijue: ['力拔千钧，斗转星移！', '转换阴阳二气，一击制敌！'],
                yttl_jiuyang: ['他强由他强，清风拂山冈。', '他横任他横，明月照大江。'],
                yttl_chuqiao: ['无忌愿与明教共进退！', '挽狂澜于既倒，扶大厦之将倾！'],
                zhengwang: ['江山可弃，红颜难负……<br><br><br>'],
            },
            design: ['林写', '落影逝尘', '大熊小猫'],
        },
        yttl_zhangcuishan: {
            debug: {
                playerName: '张翠山',
            },
            taic: {
                yttl_yinjiu: ['素素是我发妻，就让我代她受过！', '素素犯下弥天大错，翠山唯有自刎谢罪！'],
                yttl_taiji: ['百炼钢，成绕指柔！', '冰冻三尺，非一日之寒！'],
                zhengwang: ['不管你做过什么，我从不后悔娶了你……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        yttl_daiqisi: {
            debug: {
                playerName: '黛绮丝',
            },
            taic: {
                yttl_miling: ['你要给我好好打探乾坤大挪移心法的下落！', '明教一有风吹草动，立时向我禀报！'],
                yttl_yixin: ['此乃我囊中之物！', '金花银叶，重出江湖！'],
                zhengwang: ['谁不愿做平凡儿女……<br><br><br>'],
            },
            design: ['徐安', '落影逝尘', '大熊小猫'],
        },
        yttl_hanqianye: {
            debug: {
                playerName: '韩千叶',
            },
            taic: {
                yttl_gudan: ['我孤身前来，就没打算活着回去！', '今日我登门挑战，不成功，便成仁！'],
                yttl_qiyuan: ['身中寒毒，心中情毒！', '觅得红粉佳人，父仇不报也罢！'],
                yttl_yinshi: ['我愿为你却抛家仇，隐姓埋名！', '从此这世间，只有银叶先生！'],
                zhengwang: ['今夜，好冷……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_daiqisi: {
            debug: {
                playerName: '邪黛绮丝',
            },
            taic: {},
            design: ['安生', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_spzhouzhiruo: {
            debug: {
                playerName: 'sp周芷若',
            },
            taic: {
                yttl_duanren: ['此剑，暗藏玄机！', '情随剑断，欲从心起！'],
                yttl_juejue: ['自古男儿皆薄幸！', '是你先不仁，休怪我无义！'],
                zhengwang: ['忘不了的，汉水河畔……<br><br><br>'],
            },
            design: ['地鼠', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_zhouzhiruo: {
            debug: {
                playerName: '邪周芷若',
            },
            taic: {
                yttl_daoguang: ['慧剑斩情丝，烈刃断红尘！', '倚天屠龙，上斩贼虏，下诛魔教！'],
                yttl_yiming: ['黄天在上，他日徒儿有辱师命，天诛地灭！', '苍天为鉴，我周芷若与姓张的，恩断义绝！'],
                yttl_guangzong: ['剑锋耀金顶，薪火照神州！', '恩师有知，含笑九泉！'],
                yttl_jianying: ['不见青丝红颜老，只留正气满乾坤！', '本是青灯不归客，只因浊酒留风尘！'],
                zhengwang: ['刀光冷，剑影寒，偏白了，青丝三千……<br><br><br>'],
            },
            design: ['酱子', '霸天', '大熊小猫'],
        },
        yttl_yinsusu: {
            debug: {
                playerName: '殷素素',
            },
            taic: {
                yttl_tuobiao: ['此镖牵连甚广，若有闪失，休怪我手下无情！', '尔等须确保此镖万无一失，否则难逃其罪！'],
                yttl_congshan_new: ['从善如流，从恶如崩！', '素素自知罪孽深重，愿洗心革面！'],
                zhengwang: ['不该再踏足中原……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_yintianzheng: {
            debug: {
                playerName: '邪殷天正',
            },
            taic: {},
            design: ['大宝', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_yangbuhui: {
            debug: {
                playerName: '杨不悔',
            },
            taic: {
                yttl_jiandie: ['大丈夫，怎能执念过往？', '过去终成过去，眼前还需珍惜！'],
                yttl_biyi: ['花开终成果，不负有心人。', '只羡鸳鸯，不羡仙！'],
                zhengwang: ['六哥，我们总算，在一起了……<br><br><br>'],
            },
            design: ['Yinke.吟可', '落影逝尘', '大熊小猫'],
        },
        yttl_spyangdingtian: {
            debug: {
                playerName: 'sp阳顶天',
            },
            taic: {
                yttl_yixing: ['移形换影，逆转乾坤！', '牵引挪移，摧枯拉朽！'],
                yttl_qiangmei: ['郎情妾意，天作之合！', '大丈夫，何患无妻？'],
                zhengwang: ['师妹，你怎能背叛我……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        yttl_chenyouliang: {
            debug: {
                playerName: '陈友谅',
            },
            taic: {
                yttl_cefan: ['立下此功，武当掌门非你莫属！', '宋兄弟乃人中龙凤，怎甘追驸骥尾？'],
                yttl_dongyi: ['此事，莫非有诈！', '容我多番思虑。'],
                zhengwang: ['多疑反被误……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        yttl_aerasan: {
            debug: {
                playerName: '阿二阿三',
            },
            taic: {},
            design: ['佚名', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_yin_fanyao: {
            debug: {
                playerName: '隐范遥',
            },
            taic: {},
            design: ['污名', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_yinyewang: {
            debug: {
                playerName: '殷野王',
            },
            taic: {
                yttl_feiding: ['明枪易躲，暗箭难防！', '俞三侠武功卓绝，只可智取，不可硬来！'],
                yttl_yangwei: ['今日，是我天鹰教扬刀立威的大好时机！', '得此宝刀镇教，必定扬名立万！'],
                zhengwang: ['江湖险恶，不该如此张扬……<br><br><br>'],
            },
            design: ['莫无殇', '落影逝尘', '大熊小猫'],
        },
        yttl_spxuanmingerlao: {
            debug: {
                playerName: 'sp玄冥二老',
            },
            taic: {
                yttl_xuanyin: ['你，还是早些料理身后事吧！', '普天之下，无人可解我这至寒之毒！'],
                yttl_mingjiang: ['愿为郡主，肝脑涂地！', '功名利禄，皆我所图！'],
                zhengwang: ['只求蝇头利，何计身外名……<br><br><br>'],
            },
            design: ['弈声传媒有声工作室', '落影逝尘', '大熊小猫'],
        },
        yttl_kongjian: {
            debug: {
                playerName: '空见',
            },
            taic: {
                yttl_tiequ: ['本无我相无人相，岂有金刚不坏身！', '金刚铁骨，刀枪不入！'],
                yttl_shie: ['欲消宿仇除冤孽，需藏慈心化杀劫！', '这十三记七伤拳，谢施主便加诸老衲之身罢！'],
                yttl_dujiekj: ['折诸般烦恼，降众世嗔心！', '众生需渡无量劫，离开深狱一执念！'],
                yttl_jingang: ['慈心悲悯，普度众生！', '舍此空皮囊，渡彼怨憎会！'],
                zhengwang: ['还望谢施主放下屠刀，立地成佛……<br><br><br>'],
            },
            design: ['末生', '霸天、藏海', '大熊小猫'],
        },
        yttl_xiexun: {
            debug: {
                playerName: '谢逊',
            },
            taic: {
                yttl_shihou: ['啊……', '纵声长啸，无坚不摧！'],
                yttl_wudao: ['武林至尊，屠龙宝刀；号令天下，莫敢不从！', '我离群索居二十载，终未悟出屠龙刀的秘密！'],
                zhengwang: ['无忌孩儿，就让义父皈依佛门，洗尽一身罪孽……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_xiexun: {
            debug: {
                playerName: '邪谢逊',
            },
            taic: {},
            design: ['前轮', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_zhouzhiruo: {
            debug: {
                skill: {
                    界限突破情况: {
                        yttl_fayi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        yttl_fayi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '周芷若',
            },
            taic: {
                yttl_yaren: ['忍一时之辱，铭先师遗志！', '今芷若所受之辱，他日必当悉数奉还！'],
                yttl_zhangquan: ['峨眉弟子听令：剿灭魔教，秉承先志！', '恩师亲传扳指在此，谁敢不从？'],
                yttl_fayi: ['你躲得过初一，躲不过十五！', '峨眉乃名门正派，断不与魔教勾结！'],
                zhengwang: ['芷若泥足深陷，误入歧途，愧对恩师器重……<br><br><br>'],
            },
            design: ['Stella薇', 'SUKINCEN', '大熊小猫'],
        },
        yttl_xiaozhao: {
            debug: {
                playerName: '界小昭',
            },
            taic: {
                yttl_lianxiang: ['公子千金之躯，怎能为我抵挡凶险！', '能得公子垂怜，小昭三生有幸！'],
                yttl_yibi: ['公子待我情深义重，我愿一生侍奉左右！', '公子，我来为你译读这圣火令神功！'],
                zhengwang: ['公子，请多保重……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        yttl_weiyixiao: {
            debug: {
                playerName: '韦一笑',
            },
            taic: {
                yttl_binzhang: ['玄阴绵绵，冰魄冻天！', '寒入五脏悔今时，霜侵六腑堪凌迟！'],
                yttl_xuefu: ['三阴错乱难展翼，且息獠牙藏锋芒！', '三阴俱损，痛不欲生！'],
                yttl_zhuiyun: ['（无）'],
                zhengwang: ['承蒙大恩，不必再茹毛饮血……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        yttl_xie_weiyixiao: {
            debug: {
                playerName: '邪韦一笑',
            },
            taic: {
                yttl_meiying: ['神出如影，鬼魅随行！', '如鬼附身，如魅驱魂！', '没猜到我的存在吧？哈哈哈……', '我会成为你，而你…将就此消失！', '你的大意，就用你的鲜血来偿还吧！', '好好记住，这张终结你生命的脸！'],
                yttl_hanmai: ['血脉凝冰难自抑，阴寒摧命不欲生!', '寒伤入血脉，阴毒不可驱！', '这加倍的恐惧，将融入你们的血液！', '今晚的月光照亮的，会是你们的尸体！'],
                yttl_zhuiyun: ['（无）'],
                zhengwang: ['呃……不要高兴的太早，我在光明顶上等着你们!<br><br><br>'],
            },
            design: ['全职卤蛋', '霸天', '吃饱睡睡醒吃'],
        },
        yttl_guoxiang: {
            debug: {
                skill: {
                    界限突破情况: {
                        yttl_lizong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        yttl_lizong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '郭襄',
            },
            taic: {
                yttl_bianxun: ['华山一别无觅处，余生共谁度？', '遍寻天涯，不见侠影！'],
                yttl_changyi: ['一见杨过，误终身！', '少室山头琴未冷，风陵渡口似闻声！'],
                yttl_daoyin: ['万事汇宗皆作土，飘然绝尘去！', '峨眉慧剑削发，遁身空门绝尘！'],
                yttl_lizong: ['襄阳之殇，永志不忘！', '承父之志，驱逐鞑虏！'],
                zhengwang: ['红颜弹指老，不见神雕侠……<br><br><br>'],
            },
            design: ['浅笑安然', '落影逝尘', '大熊小猫'],
        },
        yttl_jueyuandashi: {
            debug: {
                skill: {
                    界限突破情况: {
                        yttl_lieyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_boyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_zhenyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        yttl_lieyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_boyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_zhenyang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '觉远大师',
            },
            taic: {
                yttl_changjing: ['纸上得来终觉浅，绝知此事要躬行！', '书中自有黄金屋！'],
                yttl_hudu: ['扫地恐伤蝼蚁命，爱惜飞蛾纱罩灯！', '君宝，郭女侠，你们自求多福吧！'],
                yttl_kuangyi: ['九阳神功，不可失传！', '领悟高低，全凭造化！'],
                yttl_lieyang: ['工弥久而技弥精！', '劲断意不断！'],
                yttl_boyang: ['阴阳互补，互生互济！', '由己则滞，从人则活！'],
                yttl_zhenyang: ['彼不动，己不动，彼微动，己已动。', '曲中求直，蓄而后发。'],
                zhengwang: ['仿佛听到，佛祖的召唤……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        yttl_yudaiyan: {
            debug: {
                playerName: '俞岱岩',
            },
            taic: {
                yttl_zhukou: ['欺压平民百姓，算什么英雄好汉！', '尔等欺男霸女之徒，还不速速领死？'],
                yttl_zhuizei: ['大丈夫，怎可取不义之财！', '物归原主，完璧归赵！'],
                zhengwang: ['我俞三侠，怎会落得如斯田地……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        yttl_zhaomin: {
            debug: {
                playerName: '赵敏',
            },
            taic: {
                yttl_youzhu: ['这陶然山庄，便是他葬身之所！', '枉自聪明平南王，聪明反被聪明误！'],
                yttl_cifeng: ['你等围剿明教有功，大大有赏！', '立下此功，他日定可平步青云！'],
                zhengwang: ['说好的，一世为我画眉呢……<br><br><br>'],
            },
            design: ['兔猪', '落影逝尘', '大熊小猫'],
        },
        yttl_yuanzhen: {
            debug: {
                playerName: '圆真',
            },
            taic: {
                yttl_celuan: ['剿灭魔教，当立奇功！', '明教乃武林公敌，人人得而诛之！'],
                yttl_zhawang: ['唯有此计，方可绝处逢生！', '如今死里逃生，且待东山再起！'],
                zhengwang: ['策乱一生，终是竹篮打水一场空……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        yttl_jixiaofu: {
            debug: {
                skill: {
                    界限突破情况: {},
                    非界限突破情况: {
                        yttl_sishou2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_buyu2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    yttl_sishou: '注意:请检查是否遗漏了该技能',
                    yttl_buyu: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界纪晓芙',
            },
            taic: {
                yttl_sishou: ['愿我如星君如月，夜夜流光相皎洁！', '此情，以天为媒，以地为证！'],
                yttl_buyu: ['衣带渐宽终不悔，为伊消得人憔悴！', '纵是万劫不覆，我亦无怨无悔！'],
                yttl_sishou2: ['愿我如星君如月，夜夜流光相皎洁！', '此情，以天为媒，以地为证！'],
                yttl_buyu2: ['衣带渐宽终不悔，为伊消得人憔悴！', '纵是万劫不覆，我亦无怨无悔！'],
                zhengwang: ['师父大恩，再世再报……<br><br><br>'],
            },
            design: ['辣鸭', '落影逝尘', '大熊小猫'],
        },
        yttl_huqingniu: {
            debug: {
                playerName: '胡青牛',
            },
            taic: {
                tlbb_huitian: ['若非明教人，生死不过问！', '你阳寿未尽，命不该绝！'],
                yttl_bianjiu: ['此灸可助你内力精进！', '半身不遂谷外关，肩鶻曲池三里还！'],
                zhengwang: ['恨不能，解脱世人……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        xajh_qufeiyan: {
            debug: {
                playerName: '曲非烟',
            },
            taic: {
                xajh_shuoyan: ['男追女，隔重山；女追男，隔层纱！', '嘻嘻…令狐哥哥，你哪懂女儿家的心思！'],
                xajh_yanmie: ['恩怨情仇皆如尘，郁结憾恨一念泯！', '倚楼听风雨，淡看江湖路！'],
                zhengwang: ['此生路未远，江湖不再来……<br><br><br>'],
            },
            design: ['一叶米粥', '藏海、美妙的世界', '大熊小猫'],
        },
        xajh_dingxianshitai: {
            debug: {
                playerName: '定闲师太',
            },
            taic: {
                xajh_liedan: ['我辈虽女流，烈胆胜须眉！', '左掌门并派之议，敝派决不屈从！'],
                xajh_mengshou: ['任老魔称霸武林，五岳剑派当同仇敌忾！', '五岳同盟除奸邪，不教魔道改日月！'],
                xajh_shouwei: ['生死关头，少侠切莫推辞！', '上天有好生之德，公子必有福报！'],
                zhengwang: ['恒山派，就交给少侠了……<br><br><br>'],
            },
            design: ['谢声繁', '藏海、霸天', '大熊小猫'],
        },
        xajh_jiangnansiyou: {
            debug: {
                playerName: '江南四友',
            },
            taic: {
                xajh_zhenniang: ['金樽盛美酒，郁郁胡不乐？ ', '兰陵美酒郁金香，玉碗盛来琥珀光！'],
                xajh_duiyi: ['我爱敲棋君善饮，人称豪客与闲仙！', '人生如棋，落子无悔，哈哈哈……<br><br><br>'],
                xajh_dianjing: ['世间无限丹青手，一片伤心画不成！', '挥毫落纸墨痕新，几点♣️️最可人！'],
                xajh_huihao: ['池墨泼飞云，紫毫挥广宇！', '行云流水间，落笔如云烟！'],
                zhengwang: ['譬如朝露，去日苦多……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        xajh_sp_tianboguang: {
            debug: {
                遗漏: {
                    yttl_zhuiyun: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: 'sp田伯光',
            },
            taic: {
                xajh_kuaidao: ['天下武功，唯快不破！ ', '兄台，看刀！', '破空如龙吟，刀锋似虎啸！'],
                xajh_luanhong: ['品酒辨丈夫，闻香识女人！', '宝马配好鞍，红粉赠佳人！', '良玉比君子，名花拟[nǐ]美人！'],
                zhengwang: ['得遇红颜与知己，此生何其有幸……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        xajh_liangfa: {
            debug: {
                skill: {
                    界限突破情况: {},
                    非界限突破情况: {
                        xajh_yingjie2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    xajh_yingjie: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界梁发',
            },
            taic: {
                xajh_yingjie: ['举觞白眼望青天，皎如玉树临风前！', '今宵且尽一杯酒，与君同销万古愁！'],
                xajh_yingjie2: ['举觞白眼望青天，皎如玉树临风前！', '今宵且尽一杯酒，与君同销万古愁！'],
                xajh_sijie: ['何方贼头，报上名来！', '鬼鬼祟祟藏头露尾，算什么正人君子？'],
                zhengwang: ['义心如石，死节不移……<br><br><br>'],
            },
            design: ['儒风', '落影逝尘', '大熊小猫'],
        },
        xajh_wumingtaijian: {
            debug: {
                playerName: '绝无名太监',
            },
            taic: {
                xajh_huanhai: ['宦海沉浮，不如流浪于江湖！', '这深宫内院，步步杀机，人人自危！', '萧墙祸起，是时候离开这波谲[jué]云诡之地了！'],
                xajh_xiedian: ['欲练神功，引刀自宫！', ' 采阴补阳，天人化生！', '气血双修，事半功倍！', '奇书一出，天下必乱！'],
                zhengwang: ['这血雨腥风的序幕，才刚刚开启……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        xajh_fengqingyang: {
            debug: {
                playerName: '风清扬',
            },
            taic: {
                xajh_shoujian: ['以剑御气，以剑修心！', '剑术若入化臻之境，草木竹石皆可为剑！'],
                xajh_jianzong: ['天下唯我剑气长，一剑纵横三万里！', '剑锋所指，心之所至！'],
                zhengwang: ['什么剑气之争，皆是过眼云烟……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        xajh_ningzhongze: {
            debug: {
                playerName: '宁中则',
            },
            taic: {
                xajh_qizong: ['筑根强基，以气练剑！', '宁氏一剑，无双无对！'],
                xajh_lanxin: ['做人当如君子兰，择居幽谷而不争！', '上善若水，为而不争！', '一杯清酒聚知音，半生相知有几人！'],
                zhengwang: ['错付一生，所托非人……<br><br><br>'],
            },
            design: ['谢声繁', '落影逝尘', '大熊小猫'],
        },
        xajh_feibin: {
            debug: {
                playerName: '费彬',
            },
            taic: {
                xajh_taozui: ['人就是江湖，你如何退出？', '恩未尽怨未了，刘掌门岂能一退了之！', '什么金盆洗手，不过是你开脱罪名的借口！'],
                xajh_shajue: ['衡山派勾结魔教，遗祸武林，论罪当诛！', '尔等包藏祸心，实乃武林公敌！', '正邪不两立，我等替天行道矣！'],
                zhengwang: ['你，竟敢暗算我……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        xajh_xie_zuolengchan: {
            debug: {
                playerName: '邪左冷禅',
            },
            taic: {},
            design: ['前轮', '霸天', '僵尸王'],
        },
        xajh_linzhennan: {
            debug: {
                playerName: '林震南',
            },
            taic: {
                xajh_qibiao: ['我林家世代行镖，素来信义当先！', '福威镖局走镖，请诸位好汉行个方便！'],
                xajh_huaibi: ['匹夫无罪，怀璧其罪！', '慢藏诲盜，明于耳目！'],
                zhengwang: ['祖宅之物，不可擅动……<br><br><br>'],
            },
            design: ['冰霜墨菊', '霸天', '大熊小猫'],
        },
        xajh_xie_renwoxing: {
            debug: {
                playerName: '邪任我行',
            },
            taic: {
                xajh_shaqi: ['服从或是死亡？做出你们的抉择吧！', '煞气蔽天地，凶神临世间！'],
                xajh_xixing_xierenwoxing: ['你们的真气，不过是我的下酒菜，哈哈哈哈哈……', '吸星大法，纵日月星辰，亦可取之！'],
                xajh_mowei: ['日月神教，文成武德！', '圣主威名，无人不尊！'],
                zhengwang: ['日月光照，泽被苍生，哈哈哈（咽气）……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        xajh_linghuchongrenyinyin: {
            debug: {
                playerName: '令狐冲任盈盈',
            },
            taic: {
                xajh_jiufu: ['一曲长歌一杯酒，半世漂泊半生缘！', '醉饮千觞不知愁，红颜相伴了无忧！', '烈酒过喉畅鲸饮，横剑醉梦不自知！', '举案莫问君几醉，小杯清陈又一樽。'],
                xajh_qinxin: ['琴音藏雅意，弦歌寄真心！', '琴鸣酒乐两相得，一杯不啻千钧金！'],
                zhengwang: ['琴心剑魄今何在，梦断浮生一曲终……<br><br><br>'],
            },
            design: ['狗子、大绿_Midori酱', '落影逝尘', '大熊小猫'],
        },
        xajh_tianmendaozhang: {
            debug: {
                playerName: '天门道长',
            },
            taic: {
                xajh_xueyong: ['并派一事，我泰山派恕难从命！', '左掌门野心昭昭，不怕江湖中人耻笑？'],
                xajh_gangjue: ['宁为玉碎，不能瓦全！', '血染岱宗，玉石俱焚！'],
                zhengwang: ['筋络寸断，誓死一博……<br><br><br>'],
            },
            design: ['沃声风飞语', '寰宇星城', '大熊小猫'],
        },
        xajh_lanfenghuang: {
            debug: {
                playerName: '蓝凤凰',
            },
            taic: {
                xajh_liangu: ['奉劝阁下，早点儿准备棺材吧！', '你已全身是毒，药石无医！'],
                xajh_zhuanxue: ['亏得我转血之术，你已重获新生。', '五毒尽除，脱胎换骨！'],
                zhengwang: ['救得了别人，救不了自己……<br><br><br>'],
            },
            design: ['遂非', '落影逝尘', '大熊小猫'],
        },
        xajh_lvzhuwong: {
            debug: {
                playerName: '绿竹翁',
            },
            taic: {
                xajh_jianpu: ['此谱非凡物，不可湮于俗人之手。', '天下能奏此曲者，不过寥寥数人尔。'],
                xajh_yuye: ['为君持酒劝斜阳，且向花间留晚照。', '金樽玉液映澄黄﹐醇醪未品醉人香。'],
                xajh_zhuyun: ['绿竹通幽清凉境，青松忘返自在心。', '回首萧瑟无晴雨，一巷青竹任平生。'],
                zhengwang: ['俗世凡尘多纷扰，竹篱茅舍自甘心……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        xajh_liuzhengfengquyang: {
            debug: {
                skill: {
                    界限突破情况: {
                        xajh_juepu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        xajh_juepu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '刘正风曲洋',
            },
            taic: {
                xajh_diezou: ['沧海一声笑，红尘俗世知多少！', '不问恩怨不问情，琴箫合鸣觅知音！'],
                xajh_juechang: ['我送故人三万里，以血践盟歌咏志！', '广陵散，成绝响，一曲江湖还笑傲！'],
                xajh_juepu: ['此去江湖与君绝，何日再闻笑傲曲？', '初闻不知曲中意，再听已是曲中人！'],
                zhengwang: ['人生得一知音，足矣……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        xajh_yuelingsan: {
            debug: {
                playerName: '界岳灵珊',
            },
            taic: {
                xajh_jianwu: ['青梅如豆，柳叶似眉！', '冲灵剑舞，情意绵长！'],
                xajh_huizhi: ['幡幡瓠叶，采之亨之，君子有酒，酌言尝之！', '诗酒趁年华，年华如豆蔻。'],
                xajh_fanghun: ['海枯石烂，此情不渝！', '与君同饮三杯酒，来世再做结发人！'],
                zhengwang: ['大师兄，替我照顾平之……<br><br><br>'],
            },
            design: ['槐生', '落影逝尘', '大熊小猫'],
        },
        xajh_yuebuqun: {
            debug: {
                playerName: '岳不群',
            },
            taic: {
                xajh_jianxie: ['君子当藏器于身，待时而动。', '放长线，钓大鱼！', '忍一时荣辱，成千古霸业！'],
                xajh_qiaowei: ['人在江湖，身不由己！', '岳某当尽绵力，替你主持公道！'],
                xajh_yuli: ['鹬蚌相争，渔人得利！', '螳螂捕蝉，黄雀在后！', '作壁上观，不如浑水摸鱼！'],
                zhengwang: ['苦心经营王霸计，竹篮打水一场空……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        xajh_xieyuebuqun: {
            debug: {
                playerName: '邪岳不群',
            },
            taic: {
                xajh_weishan: ['华山门下，当笃行君子之仁。', '知者不惑，仁者不忧。<br>义人纵渴，不饮盗泉之水！<br>信义行于君子，而诡诈施于小人。<br>武林相逢，我辈当以礼为先。<br>明礼而知进退，自省而全得失。'],
                xajh_koumi: ['你我师徒恩义已断，毋宁多言！', '正邪不两立，休怪岳某手下无情！'],
                xajh_fujian: ['既得辟邪剑谱，威震五岳，近在咫尺！ ', '比剑夺帅，兼收并蓄，盟主之位尽在囊中！'],
                zhengwang: ['面具，终究被揭穿了……<br><br><br>'],
            },
            design: ['林木', '霸天', '吃饱睡睡醒吃'],
        },
        xajh_dongfangbubai: {
            debug: {
                playerName: '界东方不败',
            },
            taic: {
                xajh_weizhong: ['都说我负天下人，可天下人何曾善待我？', '为了你，我可以背叛全世界！'],
                xajh_daoxi: ['任我行已是行将就木，你们还不弃暗投明？', '凤鸣于野，栖梧之志！'],
                zhengwang: ['失去你，得到全世界，又如何……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        xajh_yanglianting: {
            debug: {
                playerName: '杨莲亭',
            },
            taic: {
                xajh_shichong: ['还望教主，替属下作主！', '孰是孰非，自有教主定夺！'],
                xajh_shanquan: ['得权利者，得天下！', '生杀予夺，大权在握！'],
                zhengwang: ['不该恃宠生骄，迷失在权利的漩涡中……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        xajh_tongbaixiong: {
            debug: {
                playerName: '童百熊',
            },
            taic: {},
            design: ['大宝', '霸天', '大熊小猫'],
        },
        xajh_xiangwentian: {
            debug: {
                playerName: '向问天',
            },
            taic: {
                xajh_gujun: ['你们这些小罗罗，还不够爷塞牙缝呢！', '天王老子就是我，你们，一起上！'],
                xajh_lianmei: ['你我联手，定叫那些兔崽子落荒而逃！', '能与令狐少侠携手酣战，实乃人生一大快事！'],
                xajh_yingjiu: ['李代桃僵，只为营救故主！', '偷天换日，以愈手足之伤！'],
                zhengwang: ['酩酊一场，不负结义之情，取酒来！<br><br><br><br><br>'],
            },
            design: ['YY', '霸天', '吃饱睡睡醒吃'],
        },
        xajh_xie_dongfangbubai: {
            debug: {
                playerName: '邪东方不败',
            },
            taic: {},
            design: ['雪橙', '霸天', '大熊小猫'],
        },
        xajh_ludayou: {
            debug: {
                playerName: '界陆大友',
            },
            taic: {
                xajh_digong: ['我自幼无依，视大师兄为手足至亲！', '大师兄，你要照顾我一辈子哦！'],
                xajh_nianjue: ['你且运功疗伤，日后再向师父请罪！', '人命关天，你快按我念的要诀运气调息！'],
                zhengwang: ['我大师兄行侠仗义，一定不会放过你……<br><br><br>'],
            },
            design: ['神齐大叔', '朱阳光', '大熊小猫'],
        },
        xajh_yuehou: {
            debug: {
                playerName: '乐厚',
            },
            taic: {
                xajh_yinyang: ['阴阳二气皆天生，善驭阴阳则功成！ ', '掌分阴阳，绵绵不绝！'],
                xajh_shuangzhang: ['少侠好剑法，且再试试我这大阴阳手！', '阴阳双掌，后发先至！'],
                zhengwang: ['双掌既损，我的功夫……全废了……<br><br><br>'],
            },
            design: ['攀', '棉花糖', '大熊小猫'],
        },
        xajh_renwoxing: {
            debug: {
                skill: {
                    界限突破情况: {},
                    非界限突破情况: {
                        xajh_chushan2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    xajh_chushan: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界任我行',
            },
            taic: {
                xajh_biguan: ['教中事务，全由东方兄弟打理。', '老夫修炼期间，尔等尽忠护法！'],
                xajh_xixing: ['哼！蝼蚁之命，怎与天地齐寿？', '你只是老夫的垫脚石！'],
                xajh_chushan2: ['神功大成之日，便是我一统江湖之时！', '东方狗贼，今天必要取你狗命！'],
                xajh_chushan: ['神功大成之日，便是我一统江湖之时！', '东方狗贼，今天必要取你狗命！'],
                xajh_quanbing: ['千秋万载，一统江湖！', '踏平五岳，威震四海！'],
                zhengwang: ['难道老夫竟也是肉体凡胎……<br><br><br>'],
            },
            design: ['冷淘', '朱阳光', '大熊小猫'],
        },
        xajh_linghuchong: {
            debug: {
                playerName: '令狐冲',
            },
            taic: {
                xajh_jianhao: ['快意天涯三尺剑，风流落拓一声箫！', '长剑无招，从来胜败天知晓！'],
                xajh_zuixia: ['今朝有酒今朝醉，明日愁来明日愁。', '五岳归来三杯醉，江湖人去万事空。'],
                xajh_wangyou: ['漂泊半世一壶酒，知己天涯三两人。', '皇图霸业谈笑中，不胜人间一场醉。'],
                zhengwang: ['抽刀断水水更流，举杯浇愁愁更愁……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        xajh_moda: {
            debug: {
                playerName: '界莫大',
            },
            taic: {
                xajh_qinjian: ['琴中藏剑，剑发琴音！', '此去江湖无归期，空余琴音瑟瑟鸣！'],
                xajh_zhongsu: ['一首潇湘雨，唱断英雄魂！', '江湖悠悠一壶酒，曲高和寡诉衷肠！'],
                zhengwang: ['谁解琴中意，谁怜歌中人……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        xajh_tianboguang: {
            debug: {
                playerName: '田伯光',
            },
            taic: {
                xajh_xunfang: ['窈窕淑女，君子好逑！', '春宵一刻值千金！'],
                xajh_aotu: ['决断阴阳割分晓，缁衣为师斩寇雠！', '师父在上，请受徒儿一拜！'],
                zhengwang: ['良师益友惧得，人生何憾……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        xajh_renyingying: {
            debug: {
                playerName: '任盈盈',
            },
            taic: {
                xajh_qugang: ['弦挑流水洗客愁，此声最断肠。', '千金易得，知音难觅。'],
                xajh_heming: ['高山流水，琴瑟和鸣！', '朝露润花花愈香，琴音解愁愁更长。'],
                zhengwang: ['尘世如潮人如水，只叹江湖几人回……<br><br><br>'],
            },
            design: ['水烟箩卜', '落影逝尘', '大熊小猫'],
        },
        xajh_zhuqianqiu: {
            debug: {
                playerName: '祖千秋',
            },
            taic: {
                xajh_lunbei: ['葡萄美酒夜光杯，欲饮琵琶马上催！', '红袖织绫夸柿蒂，青旗沽酒趁梨花！'],
                xajh_yaojiu: ['此酒，只与有缘人饮！', '服下此药，可起死回生！'],
                zhengwang: ['记得，以酒祭我……<br><br><br>'],
            },
            design: ['临自灵', '落影逝尘', '大熊小猫'],
        },
        xajh_linpingzhi: {
            debug: {
                skill: {
                    界限突破情况: {
                        xajh_xuechi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        xajh_xuechi: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '林平之',
            },
            taic: {
                xajh_renru: ['君子报仇，十年不晚！', '且待我练就神功，再报这灭门之仇！'],
                xajh_qushi: ['尘世已不足恋，唯有父仇难消！', '只要大仇得报，他日无怨无悔！'],
                xajh_xuechi: ['千杯难消心头恨！', '不将你挫骨扬灰，何以祭先父之灵！'],
                zhengwang: ['再也没有什么可以失去的了……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        xajh_laodenuo: {
            debug: {
                playerName: '劳德诺',
            },
            taic: {
                xajh_qianxing: ['趁敌内乱，浑水摸鱼！', '不动声色，祸起萧墙！'],
                xajh_anxi: ['踏破铁鞋无觅处，得来全不费工夫！', '勿怪二师兄心狠手辣，怪只怪你身在江湖！'],
                zhengwang: ['六猴儿，二师兄向你陪罪了……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        xajh_spdongfangbubai: {
            debug: {
                skill: {
                    界限突破情况: {
                        xajh_feizheng: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_nvgong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_zongquan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        xajh_feizheng: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_nvgong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_zongquan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    xajh_feizhen: '注意:请检查是否遗漏了该技能',
                },
                playerName: 'sp东方不败',
            },
            taic: {
                xajh_feizhen: ['秧针刺水剑锋齐，点点血色白绫飘！', '金针不见血，却染残阳斜！'],
                xajh_shanbian: ['天人化生，阴阳逆变！', '阴阳迭用事何穷，此乃乾坤妙用！'],
                xajh_nvgong: ['慵针懒线，几曾做女红。', '薄施粉黛，淡扫娥眉。'],
                xajh_zongquan: ['何人不服我莲弟？', '天下风云出我辈，一入江湖岁月催！'],
                zhengwang: ['愿来世，赐我女儿身……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        xajh_pingyizhi: {
            debug: {
                playerName: '平一指',
            },
            taic: {
                xajh_tiandao: ['生死皆有定数，怎能不顾天理！', '万物枯荣，生死轮回，自有天定！'],
                xajh_qihuang: ['如此奇症，非药石可医，非神仙能救！', '老夫平生从未见过如此玄奇之症！'],
                zhengwang: ['佞臣误国，庸医害人哪……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        xajh_zuolengchan: {
            debug: {
                playerName: '界左冷禅',
            },
            taic: {
                xajh_linhan: ['吸星大法，不足为惧！', '在寒冰地狱瑟瑟发抖吧！'],
                xajh_weijian: ['此人碍我大业，欲除之而后快。', '此次设伏，只可成功，不许失败！'],
                xajh_bingpai: ['五岳剑派，同气连枝！', '五岳合并，众望所归！'],
                zhengwang: ['竟为他人作嫁衣……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影', '大熊小猫'],
        },
        xajh_yilin: {
            debug: {
                playerName: '仪琳',
            },
            taic: {
                xajh_jiecheng: ['若救得令狐师兄，我愿承受三世业障！', '佛祖恕罪，一切业报，弟子一人承担！'],
                xajh_fanxin: ['欲断三千烦恼丝，长点青灯伴古佛！', '取次花丛懒回顾，半缘修道半缘君。'],
                xajh_qiyuan: ['慈航普度，愿君安好！', '求菩萨保佑令狐大哥化险为夷！'],
                zhengwang: ['一心向佛，无怨无悔……<br><br><br>'],
            },
            design: ['草莓味少女', '落影逝尘', '大熊小猫'],
        },
        xajh_yucanghai: {
            debug: {
                skill: {
                    界限突破情况: {
                        xajh_cuixin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_suoxiu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        xajh_cuixin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        xajh_suoxiu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '余沧海',
            },
            taic: {
                xajh_bianlian: ['见人说人话，见鬼说鬼话！', '当面是人，背面是鬼，哈哈哈……'],
                xajh_cuixin: ['摧心剖肝，杀人无形！', '神功夺魂五脏碎，烈掌索命六脏摧！'],
                xajh_suoxiu: ['绊敌于方寸，一举歼灭之！', '你们，就结伴赴黄泉吧！'],
                xajh_miemen: ['用剑谱来交换你们林家的人命吧！', '交出《辟邪剑谱》，可留你一条狗命！'],
                zhengwang: ['竟死在这黄毛小子手上……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        xajh_dongfangbubaiyanglianting: {
            debug: {
                playerName: '东方不败杨莲亭',
            },
            taic: {
                xajh_zongqing: ['对酒当歌，人生几何！', '莲弟，能和你在一起，世界末日又有何惧！'],
                xajh_suoyu: ['欲望尽头，是寂寞。', '就算死亡，也不能把我们分开！'],
                zhengwang: ['我要你们，统统都给莲弟陪葬……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        xajh_taoguliuxian: {
            debug: {
                playerName: '桃谷六仙',
            },
            taic: {
                xajh_shejian: ['能和我们讲道理的人，还没出世呢！', '六个臭皮匠，赛过诸葛亮！'],
                xajh_zibian: ['六弟，休要胡说八道！', '是福不是祸，是祸躲不过！'],
                xajh_guici: ['我们兄弟只有六人，怎么能说是丑八怪？', '有理走天下，无理寸步难！'],
                xajh_shenlv: ['定要将你，大卸八块！', '兄弟齐心，其利断金！'],
                zhengwang: ['病从口入，祸从口出啊……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        xajh_xie_taoguliuxian: {
            debug: {
                playerName: '邪桃谷六仙',
            },
            taic: {},
            design: ['白狗', '霸天', '吃饱睡睡醒吃'],
        },
        xajh_shangguanyun: {
            debug: {
                playerName: '上官云',
            },
            taic: {
                xajh_shunshi: ['另投明主，不事奸小！', '愿随教主共诛逆贼！', '见风转舵，实乃时势所逼！'],
                xajh_fengying: ['教主神威，冠绝江湖！', '教主神功盖世，威慑五岳四海！'],
                zhengwang: ['追随教主，此生无悔……<br><br><br>'],
            },
            design: ['无忆CHENG', '微尘', '银汉贯苍穹'],
        },
        ldj_weishihougong: {
            debug: {
                skill: {
                    界限突破情况: {
                        ldj_yuanzhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_huizhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_linglong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_xiuwai: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_yazhu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_jinghong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ldj_yuanzhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_huizhong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_linglong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_xiuwai: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_yazhu: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ldj_jinghong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '韦氏后宫',
            },
            taic: {
                ldj_fengyuan: ['欸，爵爷我的人气就是这么高！', '相逢就是缘，交个朋友再走嘛！'],
                ldj_fugang: ['夫之有命，岂敢相违！', '同声如鼓瑟，举案共齐眉！'],
                ldj_fanpai: ['亲亲好老婆们，今晚谁来陪我呀！', '一人一晚，不如大被同眠，来来来！'],
                ldj_yuanzhong: ['好冤家，别怜惜奴家，用力点嘛！', '奴家的纤纤玉腿，爵爷喜不喜欢嘛？'],
                ldj_huizhong: ['一寸相思万千忆，情深几许望君知！', '双鬟何窈窕，慧蕴巧心中！'],
                ldj_linglong: ['照灼连朱槛，玲珑映粉墙！', '好哥哥，可不许欺负人家！'],
                ldj_xiuwai: ['情难忍，举头望，烟锁柳眉！', '侠侣梦，终得弃，共隐江湖！'],
                ldj_yazhu: ['我天天陪你掷骰子，输了可要打手心哦！', '软语燕依人，共君坠红尘！'],
                ldj_jinghong: ['情从金玉散，逐影飞鸿来！', '愿回知郎时，两心复如一！'],
                zhengwang: ['好老婆们，香一个……<br><br><br>'],
            },
            design: ['未眠等', '霸天、藏海', '大熊小猫'],
        },
        ldj_sufeiya: {
            debug: {
                playerName: '苏菲亚',
            },
            taic: {
                ldj_diyue: ['你我各取所需，何谈亏欠？', '缔盟约誓，永不背弃！', '划山而治，两国修好！'],
                ldj_zhengluan: ['沙俄的勇士们，随我进军莫斯科！', '彼得尚幼，由我摄政，有谁不服？', '准备好接受女王的恩典吧！'],
                zhengwang: ['难忘那夜，露水情缘……<br><br><br>'],
            },
            design: ['未眠', '霸天', '大熊小猫'],
        },
        ldj_ake: {
            debug: {
                playerName: '阿珂',
            },
            taic: {
                ldj_juese: ['易求无价宝，难得有情郎！', '晓看天色暮看云，行也思君，坐也思君！'],
                ldj_zhuxin: ['红颜未老恩先断，最是无情帝王家！', '昨夜承欢今余悲，可恨王孙早不归！'],
                zhengwang: ['我心匪石不可转，但求麟儿调琴瑟……<br><br><br>'],
            },
            design: ['阿也', '藏海', '大熊小猫'],
        },
        ldj_weichunhua: {
            debug: {
                playerName: '韦春花',
            },
            taic: {
                ldj_goulan: ['什么王公贵胄、王侯将相，都得拜倒在我的石榴裙下！', '莺歌燕舞华灯下，六朝蝴蝶竞芳华！'],
                ldj_wasi: ['哎哟，大人，您多久没光临丽春院啦！', '这年头笑贫不笑娼，有钱才是大爷！'],
                zhengwang: ['我果真是，人老珠黄了么……<br><br><br>'],
            },
            design: ['遂非', '落影逝尘', '大熊小猫'],
        },
        ldj_wuyingxiong: {
            debug: {
                playerName: '吴应熊',
            },
            taic: {
                ldj_yazhi: ['我，只不过是权利斗争的陪葬品！', '皇权倾轧，你我都是棋子！'],
                ldj_lianyin: ['我乃御封太保，尔等胆敢无礼！', '紫禁城内，安有我半点自由！'],
                zhengwang: ['来世愿做寻常人，决计不入帝王家……<br><br><br>'],
            },
            design: ['冰霜墨菊', '咸鱼、落影逝尘', '大熊小猫'],
        },
        ldj_wuzhirong: {
            debug: {
                playerName: '吴之荣',
            },
            taic: {
                ldj_wenyu: ['犯忌之词，怎能留之！', '此书大逆不道，岂可流毒天下？', '清风不识字，何故乱翻书？反诗，反诗！'],
                ldj_yuanzui: ['此人讴歌前史，定怀谋逆之心！', '此诗借古讽今，实有反清复明之图！'],
                ldj_xingan: ['颠覆皇权，即刻满门抄斩！', '欺君罔上，罪当诛连九族！'],
                zhengwang: ['韦大人，饶命，饶命……啊……<br><br><br>'],
            },
            design: ['全职卤蛋', '棉花糖', '吃饱睡睡醒吃'],
        },
        ldj_jue_weixiaobao: {
            debug: {
                playerName: '绝韦小宝',
            },
            taic: {
                ldj_huachai: ['上场不分大小，只收金银元宝！', '英雄好汉，越输越笑；王八羔子，赢了就跑！', '这十几万两银票，就劳烦兄弟们帮我花差花差！', '人生难得几回搏，此时不博何时博！'],
                ldj_huijiao: ['我不去大杀三方，你也别想铲我的桩！', '二一添作五，不输不赢，不杀不赔！', '来来来，下注下注下注！'],
                ldj_tongchi: ['咱们井水不犯河水，岂不两全其美？', '庙堂逢源，贵人相助；江湖交友，义薄云天！', '四海之内皆兄弟，不可伤了和气！'],
                zhengwang: ['朝廷草莽，里外难做，老子……不干了！<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        ldj_weixiaobaojianning: {
            debug: {
                playerName: '界韦小宝建宁',
            },
            taic: {
                ldj_haodu: ['人生就是一场赌，不是赢来便是输！', '老子我大杀三方，金银财宝一箩筐！'],
                ldj_yuannie: ['韦爵爷，让奴家伺候你快活嘛！', '死奴才，还不给本公主爬过来！', '想走？先问问本公主的鞭子答不答应！'],
                zhengwang: ['生是风流人，死做快活鬼……<br><br><br>'],
            },
            design: ['蚩宇、猴子', '落影逝尘', '大熊小猫'],
        },
        ldj_zhengkeshuang: {
            debug: {
                playerName: '郑克塽',
            },
            taic: {
                ldj_wanku: ['陈永华党羽背主自立，给我拿下了！', '我乃延平郡王之子，自有便宜行事之权！', '承父祖之荫，受一等之爵。', '名门之后，自有天恩！'],
                ldj_xiangqing: ['归顺大清，蒙恩受禄！', '台湾郑氏，愿率众归服王化！'],
                zhengwang: ['无颜对郑氏先祖，有愧于台湾百姓……<br><br><br>'],
            },
            design: ['紫衫喵', '霸天', '大熊小猫'],
        },
        ldj_pangshoutoutuo: {
            debug: {
                playerName: '胖瘦头陀',
            },
            taic: {
                ldj_dubian: ['剧毒封喉如疽附，噬皮噬骨又噬心！', '此丹威力无穷，我等岂有不忠之心？'],
                ldj_fuming: ['教主神威，望宽恕小的无能！', '此乃《四十二章经》，请教主过目！'],
                zhengwang: ['求教主慈悲，赐我们解药……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        ldj_mujianpin: {
            debug: {
                playerName: '沐剑屏',
            },
            taic: {
                ldj_weisheng: ['好哥哥，求你救我逃出生天！', '眼下之计，唯有与哥哥共进退！', '人家才不是茯苓花雕猪呢！'],
                ldj_yizhu: ['小女身世坎坷，且听细细道来！', '君王死社稷，儿女殉江山！'],
                zhengwang: ['好哥哥，我先睡了……<br><br><br>'],
            },
            design: ['一叶米粥', '落影逝尘', '大熊小猫'],
        },
        ldj_dongefei: {
            debug: {
                playerName: '董鄂妃',
            },
            taic: {
                ldj_zhuanchong: ['臣妾并无所出，错蒙陛下谬爱！', '万千宠爱，一枝独秀！', '独占春色，圣宠隆恩！', '后宫佳丽三千人，三千宠爱在一身！'],
                ldj_feiming: ['红颜胜人多薄命，莫怨春风当自嗟！', '自古红颜天犹妒，香消玉殒谁人怜？', '木秀于林，风必摧之！'],
                zhengwang: ['我做鬼……也不会放过你……<br><br><br>'],
            },
            design: ['鲨鲨', '棉花糖', '大熊小猫'],
        },
        ldj_fulin: {
            debug: {
                playerName: '福临',
            },
            taic: {},
            design: ['小林', '霸天', '大熊小猫'],
        },
        ldj_fangyi: {
            debug: {
                playerName: '方怡',
            },
            taic: {
                ldj_weizui: ['不诛吴贼，国仇难平！', '此番铤而走险，必报国仇家恨！'],
                ldj_zhongji: ['轻身为国，死亦无怨！', '以吾血肉之躯，复我大明河山！'],
                zhengwang: ['愿得来世，山河无恙……<br><br><br>'],
            },
            design: ['谢声繁', '落影逝尘', '大熊小猫'],
        },
        qtpz_weixiaobao: {
            debug: {
                playerName: '韦小宝',
            },
            taic: {
                qtpz_yabao: ['买定离手，听天由命！', '小赌怡情，大赌伤身。'],
                qtpz_qiaoshe: ['大家好兄弟，讲义气！', '三寸巧舌行天下，左右逢源登高堂。'],
                zhengwang: ['海老乌龟阴狠毒辣，这次死定了……<br><br><br>'],
            },
            design: ['神齐大叔', '落影逝尘', '大熊小猫'],
        },
        qtpz_suquan: {
            debug: {
                playerName: '苏荃',
            },
            taic: {
                qtpz_zhenggang: ['君为臣纲，夫为妻纲，有谁不服！', '长幼有序，妻妾有别！'],
                qtpz_yiqing: ['昔年扬州误白龙，横陈燕翔锁情终！', '可笑九尺鬓眉苍，何妄梨树压海棠！'],
                zhengwang: ['嫁鸡随鸡，夫唱妇随……<br><br><br>'],
            },
            design: ['大绿_Midori酱', '落影逝尘', '大熊小猫'],
        },
        qtpz_aobai: {
            debug: {
                playerName: '界鳌拜',
            },
            taic: {
                qtpz_shezheng: ['一国之君，怎能妇人之仁！', '为祸朝纲者，当处以极刑！'],
                qtpz_yingshi: ['权利的欲望，谁不迷恋？', '翻手为云，覆手为雨！'],
                zhengwang: ['悔不该目中无人……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_haidafu: {
            debug: {
                playerName: '海大富',
            },
            taic: {
                qtpz_shidu: ['病体沉疴，饮鸩止渴！', '彼之砒霜，吾之蜜糖！'],
                qtpz_fenji: ['你我皆非善类，何不撕下面具？', '你终于露出狐狸尾巴了！'],
                ldj_huashi: ['就让你带着这秘密，永远消失吧！', '怪只怪你，知道太多！'],
                zhengwang: ['老奴不才，未能手刃先帝仇人……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        qtpz_zengrou: {
            debug: {
                playerName: '曾柔',
            },
            taic: {
                qtpz_zhitou: ['两粒骰子，一片痴心！', '愿君多采撷，此物最相思！'],
                qtpz_wangfu: ['小宝，我的终身幸福，就托付给你了！', '我知道，他一定会回来娶我的！'],
                zhengwang: ['望穿秋水，小宝，你在哪里……<br><br><br>'],
            },
            design: ['卿九', '落影逝尘', '大熊小猫'],
        },
        qtpz_hongantong: {
            debug: {
                playerName: '洪安通',
            },
            taic: {
                qtpz_baotai: ['别想跟我耍花样！', '不想死，就乖乖听老夫的吩咐！'],
                qtpz_aozun: ['仙福永享，寿与天齐！', '这宝座，只属于老夫一人！'],
                zhengwang: ['你们为什么，都要反我……<br><br><br>'],
            },
            design: ['林三', '落影逝尘', '大熊小猫'],
        },
        qtpz_maodongzhu: {
            debug: {
                playerName: '毛东珠',
            },
            taic: {
                qtpz_luanwei: ['区区太监，也敢妄议朝政！', '不交出《四十二章经》，本宫要你人头落地！'],
                qtpz_huagu: ['喝了这杯，好赴黄泉！', '你已命在须臾，倾刻粉身碎骨！'],
                zhengwang: ['潜伏数载，终究劫数难逃……<br><br><br>'],
            },
            design: ['徐安', '落影逝尘', '大熊小猫'],
        },
        qtpz_shuanger: {
            debug: {
                playerName: '双儿',
            },
            taic: {
                qtpz_kangli: ['我们生要一起生，死要一起死！', '能一辈子侍奉小宝，是双儿最大的福分！'],
                qtpz_xiangfu: ['小宝，别怕，我来救你了！', '双儿此生，只真心对待小宝一人！'],
                zhengwang: ['小宝，我们来世还要在一起……<br><br><br>'],
            },
            design: ['地鼠', '落影逝尘', '大熊小猫'],
        },
        qtpz_sangjielama: {
            debug: {
                playerName: '桑结喇嘛',
            },
            taic: {
                qtpz_dayin: ['象躯撼地千潮退，龙吟啸天慑群雄！', '胎藏天授，大日如来！'],
                sdxl_mizong: ['览密宗六法，嗔金刚之怒！', '金刚怒目，轮转光明！'],
                zhengwang: ['狗皇帝！你……背信弃义……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_wusangui: {
            debug: {
                playerName: '吴三桂',
            },
            taic: {
                qtpz_xianguan: ['李贼欺我太甚，唯有向睿亲王求救！', '意气冲冠为红颜，从此不计身后名！'],
                qtpz_fanluan: ['唯今之计，只有占地为王！', '男人大丈夫，怎可久居人臣？'],
                zhengwang: ['时不予我，时不予我啊……<br><br><br>'],
            },
            design: ['黑兔', '落影逝尘', '大熊小猫'],
        },
        qtpz_weihutou: {
            debug: {
                playerName: '韦虎头',
            },
            taic: {
                qtpz_mengtong: ['稚儿无知，莫怪，莫怪！', '童言无忌，童言无忌！'],
                qtpz_fuyin: ['平步青云，全仗父辈光芒！', '皇天后土，赐我日月星辰！'],
                zhengwang: ['王侯将相，宁有种乎？'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        ldj_nanhuairentangruowang: {
            debug: {
                playerName: '南怀仁汤若望',
            },
            taic: {},
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        qtpz_xuanye: {
            debug: {
                playerName: '玄烨',
            },
            taic: {
                qtpz_zhenfan: ['蝼蚁之患，不可放任！', '三藩作乱，窃国之辈也！'],
                qtpz_fujiang: ['尔等尽可戴罪立功。', '宝岛台湾，终归我大清版图。'],
                qtpz_shengshi: ['朱栏画栋最高楼，海色天容万象收！', '战马初闲甲士欢，挥戈早已破楼兰！'],
                zhengwang: ['我真的还想再活五百年……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        qtpz_chenjinnan: {
            debug: {
                playerName: '陈近南',
            },
            taic: {
                qtpz_ningxue: ['你已时日不多，可有临终遗言？', '看你还怎么为害武林！'],
                qtpz_zhongsu: ['小宝，我陈家世代效忠，切不可向郑家寻仇！', '反清大业当前，怎可拘泥个人恩怨？'],
                zhengwang: ['勿忘复明大计……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_jianninggongzhu: {
            debug: {
                playerName: '建宁公主',
            },
            taic: {
                qtpz_yunie: ['桂贝勒，你打得人家好舒服唷！', '打是亲，骂是爱，男人越坏我越爱！'],
                qtpz_weizhao: ['好哥哥，你带人家私奔好不好嘛？', '吴狗熊已是阉奴，本公主岂能下嫁？'],
                zhengwang: ['爵爷鞭下死，做鬼也快活……<br><br><br>'],
            },
            design: ['泥泥', '落影逝尘', '大熊小猫'],
        },
        qtpz_fengjizhong: {
            debug: {
                playerName: '风际中',
            },
            taic: {
                qtpz_diebao: ['小人有要情禀报，望将军引见！', '天地会狡兔三窟，皇上须多加防范！'],
                qtpz_jibian: ['不如归顺清廷，尽享荣华富贵！', '国泰民安，谁当皇帝，又有何区别？'],
                zhengwang: ['聪明反被聪明误啊……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_murenqing: {
            debug: {
                playerName: '穆人清',
            },
            taic: {
                qtpz_dangjian: ['鲸饮未吞海，剑气已横秋！', '荡剑逐奸邪，飞来第一峰！'],
                qtpz_xianyuan: ['流波激清响，仙猿临岸啼！', '西岳天下险，小径寻山公！'],
                zhengwang: ['仙人今已故，老猿自同游……<br><br><br>'],
            },
            design: ['狗子', '霸天', '大熊小猫'],
        },
        qtpz_xie_hetieshou: {
            debug: {
                playerName: '邪何铁手',
            },
            taic: {
                qtpz_wudu: ['织心擅用冰蚕纺，天赐苗疆醉舞棠！', '万蛊噬心，驭虫有术；千蝶吐瑞，妙手织天！', '杯弓照影，碧蛇惊神！', '梦枕千戚，魂返苗疆！', '红尘一梦，化蝶迷踪！', '玉宫心冷蟾啸月，闻音栖林动羌笛。', '冰蚕絮牵毒倾城，不惑众生惑君生！', '人间无门，惑起苗疆；黄泉有路，遗鼎大荒。', '圣兽灵心归毒海，仙踪遗秘问奇缘。'],
                qtpz_wugou: ['蜈钩有毒，袁相公，可别空手来夺呀！', '金钩穿魂、铁钩夺命！'],
                zhengwang: ['纵有千丝百足，何及人心可怖……<br><br><br>'],
            },
            design: ['鲨鲨', '霸天', '大熊小猫'],
        },
        qtpz_jue_yuanchonghuan: {
            debug: {
                playerName: '绝袁崇焕',
            },
            taic: {
                qtpz_qianbing: ['养兵千日，用兵一时！', '威弑北狄，固守辽东！', '擎天一柱，屡立奇功！', '一生从戎无败绩，半世功名在梦中！'],
                qtpz_bixue: ['慷慨同仇日，间关百战时！', '策杖只因图雪耻，横戈原不为封侯！'],
                qtpz_zhonghun: ['荣华我已知庄梦，忠愤人将谓杞忧。', '死后不愁无勇将，忠魂依旧守辽东。'],
                zhengwang: ['片云孤月应肠断，桩树凋零又—秋……<br><br><br>'],
            },
            design: ['前轮', '霸天', '大熊小猫'],
        },
        qtpz_yuanchengzhiwenqingqing: {
            debug: {
                playerName: '袁承志温青青',
            },
            taic: {
                qtpz_shexing: ['蜿蜒而行，迂回击寇！', '灵蛇吐信，剑耀寒锋！'],
                qtpz_yandu: ['你这招蜂引蝶的公子哥，还理我做甚？', '莺莺燕燕身边绕，承志哥哥好福气呀！'],
                zhengwang: ['承志哥哥，我……错怪你了……<br><br><br>'],
            },
            design: ['冬赫、谢声繁', '霸天', '大熊小猫'],
        },
        qtpz_hehongyao: {
            debug: {
                playerName: '何红药',
            },
            taic: {
                qtpz_zidao: ['世间女子多情痴，千瘢万痕亦无悔！', '毒侵脏腑芳容毁，他日雪恨念君归！'],
                qtpz_yuandu: ['只见新人笑，哪闻旧人哭！', '霜结两鬓空念远，雪染青丝恨难填！'],
                zhengwang: ['念桥边红药，年年知为谁生……<br><br><br>'],
            },
            design: ['遂非', '落影逝尘', '大熊小猫'],
        },
        qtpz_goujian: {
            debug: {
                skill: {
                    界限突破情况: {
                        qtpz_jingjia: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        qtpz_jingjia: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '勾践',
            },
            taic: {
                qtpz_taohui: ['韬晦之计，藏锋守拙！', ' 卧薪尝胆，忍辱负重！', '君子藏器，待时而动！', ' 知耻而后勇，知弱而图强！'],
                qtpz_xingguo: ['天时地利兼备，伐吴之战必胜！', '国之复兴，势不可挡！'],
                qtpz_jingjia: ['天降神兵，必吞吴土！', '精兵锐甲，所向披靡！', '越甲三千，可破万军！'],
                zhengwang: ['复国之路修远兮……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        qtpz_zhaobanshan: {
            debug: {
                playerName: '赵半山',
            },
            taic: {
                qtpz_feisuo: ['飞燕银梭，巧器破敌！', '飞梭万里，以敌制敌！'],
                qtpz_roudao: ['太极拳法，以弱胜强！', '刚柔相济，运化无方！', '形如搏兔之鹤，神似猎鼠之猫！', '始而意动，继而劲动！'],
                zhengwang: ['反清复明，前赴后继……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        qtpz_hongli: {
            debug: {
                playerName: '弘历',
            },
            taic: {
                qtpz_woxuan: ['强权干政，逆贼举兵，朕该何处问计？', '攘外安内，势均力敌！'],
                qtpz_chezhou: ['天子脚下，岂容反贼横行？', '摄服乱党，可赏良田千亩！'],
                qtpz_tianzun: ['御前侍卫何在？', '白护卫护驾有功，择日再行重赏！'],
                zhengwang: ['自古忠义难两全……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_lizicheng: {
            debug: {
                skill: {
                    界限突破情况: {
                        qtpz_yuanzheng: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        qtpz_yuanzheng: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '李自成',
            },
            taic: {
                qtpz_mubing: ['招兵买马，组建义军！', '大明苛捐杂税，可谓自取灭亡！'],
                qtpz_juyi: ['哪里有压迫，哪里就有反抗！', '改朝换代的时候到了！'],
                qtpz_yuanzheng: ['百万雄师，直取京都！', '顺势而为，一统天下！'],
                qtpz_juntian: ['均田免赋，国泰民安！', '民以食为天！'],
                zhengwang: ['天要亡我！非战之罪……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        qtpz_xishi: {
            debug: {
                playerName: '西施',
            },
            taic: {
                qtpz_huoxin: ['大王连日征战，让妾身为您宽衣！', '大王，来……喝嘛！'],
                qtpz_chenyu: ['曾忆河边浣溪纱，鱼见惊之沉荷花。', '为国轻付倾城笑，真心犹在忆中人！'],
                zhengwang: ['少伯，你终于…来接我了……<br><br><br>'],
            },
            design: ['卿九', '落影逝尘', '大熊小猫'],
        },
        qtpz_fanli: {
            debug: {
                playerName: '范蠡',
            },
            taic: {
                qtpz_aibing: ['赳赳武夫，誓破吴都！', '苦心人，天不负；有志者，必吞吴！'],
                qtpz_shangsheng: ['知斗则修备，时用则知物！', '贵出如粪土，贱取如珠玉！'],
                zhengwang: ['夷光，让你受委屈了……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '寰宇星城'],
        },
        qtpz_weizhongxian: {
            debug: {
                playerName: '魏忠贤',
            },
            taic: {
                qtpz_jiedang: ['覆手罩金銮，东林鸟兽散！', '咱家这几车薄礼，诸位大人，收，还是不收？', '尔等皆股肱之臣，岂能不识时务？'],
                qtpz_shanchao: ['区区小事，何需惊动圣驾？', '军政要事，奴才定当竭忠尽智！'],
                zhengwang: ['紫袍玉带换鳏衣，悲饮四更无人提……<br><br><br>'],
            },
            design: ['白夜', '落影逝尘', '大熊小猫'],
        },
        qtpz_zhangsanlisi: {
            debug: {
                playerName: '张三李四',
            },
            taic: {
                qtpz_shangcheng: ['善因结善果，恶行得恶报！', '善恶之报，如影随形！', '善恶若无报，乾坤必有私！', '这赏善罚恶令，你接是不接？'],
                qtpz_xuanbing: ['寒冰刺骨，魄散魂消！', '风刀霜剑，怎及这玄冰丝毫！'],
                qtpz_bihuo: ['凡火燎骨肉，碧火灼神魂！', '毒酒销骨，烈焰焚心！'],
                zhengwang: ['恩怨是非，谁人辨……<br><br><br>'],
            },
            design: ['狗子', '霸天、藏海', '大熊小猫'],
        },
        qtpz_longmudaozhu: {
            debug: {
                playerName: '龙木岛主',
            },
            taic: {
                qtpz_shizhou: ['奇药熬出粥一碗，断肠蚀骨又腐心！', '善恶未敢称侠客，赏惩全在此粥中！'],
                qtpz_qiecuo: ['广邀天下才与智，以期堪破侠客行！', '气如寒冰，血似激流！（气似烈焰，血如岩浆！）'],
                zhengwang: ['荒芜枯守四十载，白首方悟太玄经……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        qtpz_shipotian: {
            debug: {
                playerName: '石破天',
            },
            taic: {
                qtpz_chiyan: ['饮下这玄冰碧火酒，甚是酣畅！', '谢前辈，为何我仿佛烈火焚身？'],
                qtpz_qijing: ['这些小人变幻莫测，有趣有趣！', '这蝌蚪文，其妙无穷！'],
                qtpz_tuimeng: ['前辈不必拘礼，折煞在下了！', '我无名小卒，何德何能！'],
                zhengwang: ['知足常乐，随遇而安……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_jue_shipotian: {
            debug: {
                playerName: '绝石破天',
            },
            taic: {},
            design: ['大熊', '棉花糖', '大熊小猫'],
        },
        qtpz_axiu: {
            debug: {
                playerName: '阿绣',
            },
            taic: {},
            design: ['安生', '霸天', '大熊小猫'],
        },
        qtpz_jyliyan: {
            debug: {
                playerName: '李岩',
            },
            taic: {
                qtpz_quanzhen: ['朱门酒肉臭，路有冻死骨！', '天下百姓水深火热，还望乡绅同僚慷慨解囊！'],
                qtpz_honglve: ['依此良策，可保义军所向披靡！', '醉里挑灯看剑，梦回吹角连营！'],
                zhengwang: ['大王为何，误信谗言……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        qtpz_aqing: {
            debug: {
                playerName: '阿青',
            },
            taic: {
                qtpz_libing: ['厉兵秣马，横扫千军！', '三千越甲可吞吴！'],
                qtpz_shujia: ['三千越甲，终成哀鸿一片！', '千军万马又如何！'],
                zhengwang: ['她有倾世容颜，我何以得到范郎倾心……<br><br><br>'],
            },
            design: ['珂里', '朱阳光', '大熊小猫'],
        },
        qtpz_zhuyoujian: {
            debug: {
                playerName: '朱由检',
            },
            taic: {
                qtpz_youqin: ['内忧外患，朕恨不能御驾亲征！', '众卿家只知食君禄，却不曾担君忧！'],
                qtpz_zuiji: ['大明将覆，怪朕错杀忠良！', '崇祯无能，以致流寇四起，鞑子犯国！'],
                qtpz_gangbi: ['朕非亡国之君，臣皆亡国之臣！', '百官误朕，个个该杀！'],
                zhengwang: ['为何朕，落得国破家亡……<br><br><br>'],
            },
            design: ['觅阳', '落影逝尘', '大熊小猫'],
        },
        qtpz_wuzixu: {
            debug: {
                playerName: '界伍子胥',
            },
            taic: {
                qtpz_zhucheng: ['大兴土木，始建姑苏！', '兴修城池，扬我国威！'],
                qtpz_xuezhuang: ['杀父诛兄之仇，永铭于心！', '喋血之恨，岂能轻忘？'],
                zhengwang: ['吴王不听我谏言，必追悔莫及……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_xuedaolaozhu: {
            debug: {
                playerName: '血刀老祖',
            },
            taic: {
                qtpz_handao: ['击杀你，就像捏死一只蚂蚁，哈哈哈哈！', '就用你们的鲜血，祭我的血刀！'],
                qtpz_hanzhan: ['今日一战，你们统统都会变成我的刀下亡魂！', '在这雪谷之中，绝望地哀嚎吧！'],
                qtpz_shuixiang: ['放下兵器，我便饶你不死！', '跪下投降，可饶你狗命！'],
                zhengwang: ['竟死在这，无名小卒手里……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_xie_xuedaolaozu: {
            debug: {
                playerName: '邪血刀老祖',
            },
            taic: {
                qtpz_xiezun: ['天下至邪，无出其右！', '天下多恶事，无我不敢为！'],
                qtpz_xueyue: ['血雨腥风天象惨，日月无光杀气升！', '红月照地鬼门开，血洗人间魔星来！'],
                qtpz_anyue: ['月黑风高夜，杀人掠命时！'],
                qtpz_chanyue: ['月华如利刃，杀尽正道人！'],
                qtpz_xuanyue: ['碎镜映天天碎裂，残月照人人残缺！'],
                qtpz_manyue: ['月满开杀戒，人头祭血刀！'],
                qtpz_jidao: ['魔刀出鞘造杀劫，邪尊降世灭生灵！', '向真正的血刀致意吧，这份恐惧，你们会刻在骨子里！'],
                zhengwang: ['我带给你的恐惧，会永远的伴随你，哈哈哈……<br><br><br>'],
            },
            design: ['路边奇石', '霸天', '吃饱睡睡醒吃'],
        },
        qtpz_yuyutong: {
            debug: {
                playerName: '余鱼同',
            },
            taic: {
                qtpz_gaifu: ['知君命不偶，同病亦同忧！', '士为知己者死！'],
                qtpz_wuxian: ['鸳鸯有耦春蚕若，白马鞍边笑靥生。', '痴心错付，悔人悔己！'],
                zhengwang: ['英雄气短，儿女情长……<br><br><br>'],
            },
            design: ['矢北', '落影逝尘', '大熊小猫'],
        },
        qtpz_miaorenfeng: {
            debug: {
                playerName: '苗人凤',
            },
            taic: {
                qtpz_fengpo: ['我苗人凤顶天立地，岂会与你这鼠辈为伍！', '道不同，不相为谋！'],
                qtpz_yujie: ['年年焚香，也解不了我心中的悔恨！', '若能与胡兄弟策马天涯……只可惜……<br><br><br>'],
                zhengwang: ['胡兄弟，我下来向你赔罪了……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        qtpz_chenglingsu: {
            debug: {
                playerName: '程灵素',
            },
            taic: {
                qtpz_zhidu: ['思念，是人世间最无药可解的毒！', '灵药难治相思苦，海棠无心恋尘缘！'],
                qtpz_xianghun: ['你我都是可怜人，何不怜惜眼前人？', '为了你，我可以献出我的生命！'],
                zhengwang: ['大哥，我死后，你还会记得我吗……<br><br><br>'],
            },
            design: ['辣鸭', '落影逝尘', '大熊小猫'],
        },
        qtpz_chengbenzhi: {
            debug: {
                playerName: '程本直',
            },
            taic: {
                qtpz_yuanbian: ['陛下冤杀袁公，微臣义不独活！', '袁公之心，日月可鉴！'],
                qtpz_tongzui: ['两条泼胆汉，一对痴心人！', '臣甘受同诛之罪！'],
                zhengwang: ['人固有一死，或重于泰山，或轻于鸿毛……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        qtpz_huatiegan: {
            debug: {
                skill: {
                    界限突破情况: {
                        qtpz_mengju: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        qtpz_mengju: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '花铁干',
            },
            taic: {
                qtpz_jiaoxie: ['好死不如赖活着！', '尊严虽可贵，性命价更高！'],
                qtpz_ruxue: ['这荒山雪岭，不食人肉何以生存？', '茹毛饮血，只为绝地求生！'],
                qtpz_guming: ['血刀门的淫僧，皆我所杀！', '此乃侠义之本，各路朋友不必挂怀！'],
                qtpz_mengju: ['统领江湖，行侠仗义！', '承蒙抬举，我便当仁不让了！'],
                zhengwang: ['谎言，竟被拆穿了……<br><br><br>'],
            },
            design: ['临自灵', '落影逝尘', '大熊小猫'],
        },
        qtpz_xieyanke: {
            debug: {
                skill: {
                    界限突破情况: {
                        qtpz_tieling: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        qtpz_tieling: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    qtpz_lingtie: '注意:请检查是否遗漏了该技能',
                },
                playerName: '谢烟客',
            },
            taic: {
                qtpz_tieling: ['滴水之恩，涌泉相报！', '凭此玄铁令，有求必应！'],
                qtpz_lingtie: ['滴水之恩，涌泉相报！', '凭此玄铁令，有求必应！'],
                qtpz_sunuo: ['君子一言，驷马难追！', '老夫言出必行！'],
                qtpz_jieyou: ['了无牵挂，浪迹天涯！', '来去自如，无欲无争！'],
                zhengwang: ['无欲无求常自在……<br><br><br>'],
            },
            design: ['白', '落影逝尘', '大熊小猫'],
        },
        qtpz_ajiu: {
            debug: {
                playerName: '阿九',
            },
            taic: {
                qtpz_fuchao: ['覆巢之下，安有完卵！', '皮之不存，毛将焉附？', '国难当前，谁能独善其身？'],
                qtpz_guoshang: ['商女不知亡国恨，隔江犹唱后庭花！', '国之将亡，必有妖孽！'],
                zhengwang: ['久在樊笼思成疾，可怜生在帝王家……<br><br><br>'],
            },
            design: ['水烟箩卜', '落影逝尘', '大熊小猫'],
        },
        qtpz_tianguinong: {
            debug: {
                playerName: '田归农',
            },
            taic: {
                qtpz_tudu: ['还望无嗔大师，赐我毒药一用！', '我要他们二人，两败俱伤！'],
                qtpz_xingxun: ['交出藏宝图，可免受皮肉之苦！', '看看是你的骨头硬，还是我的刀子硬！'],
                qtpz_xuncai: ['这偌大的宝藏，都是我的囊中之物！', '这富可敌国的财物，终于落到我的手里！'],
                zhengwang: ['人为财死，鸟为食亡……<br><br><br>'],
            },
            design: ['洛', '落影逝尘', '大熊小猫'],
        },
        qtpz_yuanchengzhi: {
            debug: {
                playerName: '袁承志',
            },
            taic: {
                qtpz_pozhen: ['静待时机，后发制人！', '灵蛇舞动，游刃有余！'],
                qtpz_dangkou: ['长驱入岛，如入化外之境！', '逐出红毛贼，此处便胜却天上人间！'],
                qtpz_jiangmen: ['蒙各路英豪承让，承志却之不恭了！', '义结群雄，誓杀昏君！'],
                zhengwang: ['万里霜烟回绿鬓，十年兵甲误苍生……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        tlbb_xie_murongfu: {
            debug: {
                playerName: '邪慕容复',
            },
            taic: {
                tlbb_bidao: ['贤才广纳，良将入麾！', '收揽人心，以为己助！'],
                tlbb_zhinian: ['图谋大业﹐光宗复国！', '身登大宝﹐开国中兴！'],
                tlbb_xinmo: ['碍我大业者，当死无赦！', '但求兴复，无不可为！'],
                tlbb_qingfu: ['奔波碌碌，兴复之望渺茫！', '人谋有尽，岂能逆转大势！'],
                zhengwang: ['联乃大燕皇帝，哈哈哈……<br><br><br>'],
            },
            design: ['彻君', '霸天', '大熊小猫'],
        },
        qtpz_xinyan: {
            debug: {
                playerName: '心砚',
            },
            taic: {
                qtpz_shutong: ['文房四宝在此，请少爷题诗，以寄哀思！', '笔墨纸砚齐备，舵主当提笔修书，以策乾隆！'],
                qtpz_anshao: ['清军有异动，请总舵主速作决策！', '此哨为号，乾隆若有异心，舵主当速速撤退！'],
                zhengwang: ['复明大业，业已杳然……<br><br><br>'],
            },
            design: ['安生', '霸天', '大熊小猫'],
        },
        qtpz_kasili: {
            debug: {
                playerName: '喀丝丽',
            },
            taic: {
                qtpz_daogao: ['所求非善，何必祷神！', '愿安拉真主保佑我族，永世和平！'],
                qtpz_shenyu: ['万能的真主，愿你圣道得胜，打败入侵的敌人！', '求真主保佑父兄击退外敌，回民永无战火！'],
                zhengwang: ['我愿用生命，换取回民安居乐业……<br><br><br>'],
            },
            design: ['桃子玥', '落影逝尘', '大熊小猫'],
        },
        qtpz_songxiance: {
            debug: {
                playerName: '宋献策',
            },
            taic: {
                qtpz_yaochen: ['十八孩儿主神器！', '吃闯王，穿闯王，闯王进城不纳粮！'],
                qtpz_fuji: ['天象惨烈，日色无光，今日不可动刑！', '国运危急，且待我算上一卦！'],
                zhengwang: ['天机，不可泄露……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        qtpz_wanzhenshan: {
            debug: {
                playerName: '万震山',
            },
            taic: {
                qtpz_fengzang: ['只有死人，才能守口如瓶！', '你，就永远的陪着我吧，哈哈哈……', '这，是我为你准备的坟墓！', '明年的今天，便是你的忌日！'],
                qtpz_shishi: ['交出连城诀，免受这千刀万剐之痛！', '老东西，你别敬酒不吃吃罚酒！'],
                zhengwang: ['我这是，自掘坟墓么……<br><br><br>'],
            },
            design: ['冰霜墨菊', '霸天', '大熊小猫'],
        },
        qtpz_qichangfa: {
            debug: {
                playerName: '戚长发',
            },
            taic: {
                qtpz_hengjiang: ['铁锁横江，进退维谷！', '叫你上也上不得，下也下不得！'],
                qtpz_juelu: ['诈亡蛰伏，寻访秘宝。', '离此死地，必有生机。'],
                qtpz_qishi: ['交出连城剑诀，我便留你全尸！', '哼，剑诀之秘，你说，还是不说？'],
                zhengwang: ['这笔财宝……我绝不会和任何人……分享……<br><br><br>'],
            },
            design: ['MU', '霸天', '大熊小猫'],
        },
        qtpz_fengtiannan: {
            debug: {
                playerName: '凤天南',
            },
            taic: {
                qtpz_balin: ['要在佛山容身，须当如期纳税！', '这五百两，就当是你的保护费！'],
                qtpz_haoduo: ['钟家逆子偷食家鹅，当以田地抵偿！', '雁过拔毛，兽走留皮，哈哈哈哈……'],
                zhengwang: ['不该欺邻霸里，落得恶报缠身……<br><br><br>'],
            },
            design: ['佚名', '霸天', '大熊小猫'],
        },
        qtpz_tangpei: {
            debug: {
                playerName: '汤沛',
            },
            taic: {
                qtpz_shihui: ['施小恩小惠，笼人脉人心！', '甘霖惠七省，盛名满江湖！'],
                qtpz_diaoyu: ['行惠施利，誉名远播！', '施以薄恩，以策群心！'],
                zhengwang: ['一朝计破，臭名昭彰……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        qtpz_miaoruolan: {
            debug: {
                playerName: '苗若兰',
            },
            taic: {
                qtpz_jinse: ['锦瑟无端五十弦，一弦一柱思华年！', '宜言饮酒，与子偕老。琴瑟在御，莫不静好。', '愿得一人心，白首不相离！'],
                qtpz_yaxian: ['欲取鸣琴弹，恨无知音赏！', '山水弹琴尽，风花酌酒频。', '诸位英雄姑且放下兵刃，听小女子抚琴片刻！'],
                zhengwang: ['气若兰兮长不改，心若兰兮终不移……<br><br><br><br><br><br>'],
            },
            design: ['安生', '棉花糖', '大熊小猫'],
        },
        qtpz_hufei: {
            debug: {
                playerName: '胡斐',
            },
            taic: {
                qtpz_anming: ['欺男霸女之徒，人人得而诛之！', '除暴安良，行侠仗义！'],
                qtpz_zangbao: ['这闯王宝藏，害得多少人家破人亡！', '就让这掀起武林纷争的祸端，长埋于此吧！'],
                qtpz_shouxian: ['这胡家刀谱，总算物归原主了！', '我定会，发扬父亲遗志！'],
                zhengwang: ['胡苗两家的恩怨，终于化解了……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        qtpz_liwenxiu: {
            debug: {
                playerName: '李文秀',
            },
            taic: {
                qtpz_zhuanqing: ['山有木兮木有枝，心悦君兮君不知！', '鱼沉雁杳天涯路，最是别离相思苦！'],
                qtpz_lwxsheyou: ['设陷诱敌，以报血仇！', '以饵为诱，打虎牢龙！'],
                zhengwang: ['迢迢归期，莫问来路……<br><br><br>'],
            },
            design: ['良沨', '假象', '大熊小猫'],
        },
        qtpz_pingasi: {
            debug: {
                playerName: '平阿四',
            },
            taic: {
                qtpz_duanbi: ['虽为草莽匹夫，但识忠义二字！', '洒血染尽英雄事，铁骨七尺撑脊梁！'],
                qtpz_yusi: ['恩公泉下有知，定以少爷为傲！', '含辛茹苦十七载，胡家公子初长成！'],
                qtpz_duwu: ['孩儿此般懈怠，怎报杀父大仇？', '狗贼阴险毒辣，你需刻苦练习！'],
                zhengwang: ['少爷承继父志，我可以瞑目了……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_wentailai: {
            debug: {
                skill: {
                    界限突破情况: {
                        qtpz_benlei: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {},
                },
                遗漏: {
                    qtpz_benlei2: '注意:请检查是否遗漏了该技能',
                },
                playerName: '界文泰来',
            },
            taic: {
                qtpz_benlei2: ['铮铮铁骨，势若奔雷！', '迅雷不及掩耳之势！'],
                qtpz_benlei: ['铮铮铁骨，势若奔雷！', '迅雷不及掩耳之势！'],
                qtpz_guhuo: ['我手握乾隆身世机密，可以此要挟！', '事关重大，乾隆势必杀我灭口！'],
                qtpz_yisui: ['反清复明，誓死相随！', '红花老祖本姓朱，为救苍生下凡来！'],
                zhengwang: ['来世再随总舵主，共谋大业……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_hongniangzi: {
            debug: {
                playerName: '红娘子',
            },
            taic: {
                qtpz_jingguo: ['我自横刀立马，不输男儿郎！', '百姓苦，江山亡，不爱红妆爱武装！'],
                qtpz_qingying: ['救百姓于水火，清朝廷之积弊！', '昏君当道，民不聊生，吾辈之志，救国救民！'],
                zhengwang: ['马作的卢飞快，弓如霹雳弦惊……<br><br><br>'],
            },
            design: ['祭黎', '落影逝尘', '大熊小猫'],
        },
        qtpz_shuisheng: {
            debug: {
                playerName: '水笙',
            },
            taic: {
                qtpz_pianjia: ['蘋汀游女能骑马，传道蛾眉画不如!', '宝骏翩翩西北驰，共君齐驾羡人痴！'],
                qtpz_yangbian: ['淫贼，看鞭！', '血刀门的淫僧，还不给本姑娘让开！'],
                qtpz_fenti: ['衰草随鞭落，铃剑逐鹃声！', '银铃霜雪蹄，白马逐烟去！'],
                zhengwang: ['狄大哥，此生与你，天涯海角……<br><br><br>'],
            },
            design: ['付水东流', '霸天', '大熊小猫'],
        },
        qtpz_jue_diyun: {
            debug: {
                playerName: '绝狄云',
            },
            taic: {},
            design: ['末生', '棉花糖', '吃饱睡睡醒吃'],
        },
        qtpz_xie_huatiegan: {
            debug: {
                playerName: '邪花铁干',
            },
            taic: {},
            design: ['污名', '霸天', '吃饱睡睡醒吃'],
        },
        qtpz_diyun: {
            debug: {
                playerName: '界狄云',
            },
            taic: {
                qtpz_hengdao: ['我愿横刀纵天涯，扫尽江湖不平事！', '这一刻，命运由我自己主宰！'],
                qtpz_sheer: ['贪夫徇财，烈士徇名！', '这是你们，最后的疯狂！'],
                qtpz_kuiyi: ['这血刀经，我便收下了！', '得丁大哥慷慨厚赠，狄云不胜感激！'],
                zhengwang: ['总算是，退出这血雨腥风的江湖……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_yandaping: {
            debug: {
                playerName: '言达平',
            },
            taic: {},
            design: ['虚怀若谷', '霸天', '大熊小猫'],
        },
        qtpz_meiniansheng: {
            debug: {
                playerName: '梅念笙',
            },
            taic: {
                qtpz_jianshi: ['孤鸿海上来，池潢不敢顾！', '落日照大旗，马鸣风萧萧！'],
                qtpz_guazhan: ['今日，我便清理门户！', '师门不幸，出了你们三个叛徒！'],
                qtpz_yizhen: ['请丁公子务必保管这神照经！', '丁公子肯仗义相救，我唯有将宝书相赠！'],
                zhengwang: ['得遇贤人，我死也瞑目了……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        qtpz_liyuanzhi: {
            debug: {
                playerName: '李沅芷',
            },
            taic: {
                qtpz_youlian: ['千山万水，苦随君行！', '落花虽有意，流水却无情！'],
                qtpz_tingxian: ['诛此狗贼，鱼同必定感恩于我。', '如今我以身犯险，惟愿鱼同不负于我！'],
                zhengwang: ['长相思兮长相忆，短相思兮无穷极……<br><br><br>'],
            },
            design: ['古梁舟', '落影逝尘', '大熊小猫'],
        },
        qtpz_huoqingtong: {
            debug: {
                playerName: '霍青桐',
            },
            taic: {
                qtpz_nagong: ['纳牛羊千匹，保回疆民安！', '化干戈为玉帛，免生灵涂炭！'],
                qtpz_chouxiang: ['犒赏千军，杀尽满贼！', '回民安居乐业，乃我生平夙愿！'],
                qtpz_zhengchi: ['《可兰经》乃我族圣物，岂容清狗掠夺！', '整兵顿马，胜过雄兵百万！'],
                zhengwang: ['家洛，你要给喀丝丽幸福……<br><br><br>'],
            },
            design: ['珂里', '落影逝尘', '大熊小猫'],
        },
        qtpz_dindian: {
            debug: {
                playerName: '丁典',
            },
            taic: {
                qtpz_zhengu: ['士可杀，不可辱！', '七尺男儿，铁骨铮铮！'],
                qtpz_shenzhao: ['人淡如菊，洗尽铅华！', '习此神功，可起死回生！'],
                zhengwang: ['宁愿站着死，绝不跪着生……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_huoayi: {
            debug: {
                playerName: '霍阿伊',
            },
            taic: {
                qtpz_chifa: ['满贼干戈来犯，尔等蔫敢卸甲！', '尔等遗失经书，当军法处置！'],
                qtpz_aobing: ['保卫疆土，背水一战！', '宁沙场喋血，勿降作阶囚！'],
                zhengwang: ['黄沙百战穿金甲，不破楼兰终不还……<br><br><br>'],
            },
            design: ['临自灵', '落影逝尘', '大熊小猫'],
        },
        qtpz_chenjialuo: {
            debug: {
                playerName: '陈家洛',
            },
            taic: {
                qtpz_yongzhu: ['大哥乃黄帝子孙，岂可数典忘祖？', '愿吾兄奋发鹰扬，光复汉人江山！'],
                qtpz_mangxin: ['孤注一掷，且待乾隆筹划！', '吾兄为汉人后裔，愿其迷途知返！'],
                qtpz_yiqi: ['江南风光好，遍地红花开！', '一敬桃园结义刘关张，二敬瓦岗寨上众儿郎！'],
                zhengwang: ['家洛愧对于老舵主厚望……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        qtpz_muzhuolun: {
            debug: {
                playerName: '木卓伦',
            },
            taic: {
                qtpz_chengren: ['不成功，便成仁！', '鞑子兵精将猛，我等唯有血战！'],
                qtpz_fuyu: ['只有战死的勇士，没有投降的懦夫！', '今天，要与清兵决一死战！'],
                qtpz_shayu: ['欺我族类，我必愤而反击！', '誓与鞑子，同归于尽！'],
                zhengwang: ['保护回民的重任，就托付给你了……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_wenqingqing: {
            debug: {
                遗漏: {
                    qtpz_shenying: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '温青青',
            },
            taic: {
                qtpz_jiexiang: ['莫非荣老爷子也想来分一杯羹？', '盗亦有道，这笔财物可是我先盯上的！'],
                zhengwang: ['既有金枝玉叶，又何须我寻常百姓……<br><br><br>'],
            },
            design: ['仙女桥', '落影逝尘', '大熊小猫'],
        },
        qtpz_xiaxueyi: {
            debug: {
                playerName: '夏雪宜',
            },
            taic: {
                qtpz_sheyou: ['我所承受的苦难，定要你们十倍奉还！', '速速交出你们的狗命！'],
                zhengwang: ['阿仪，我重财宝而轻别离，愚极，蠢极……<br><br><br>'],
            },
            design: ['弈声传媒有声公司', '落影逝尘', '大熊小猫'],
        },
        qtpz_yuanzhiyi: {
            debug: {
                playerName: '袁紫衣',
            },
            taic: {
                qtpz_sanshe: ['此人杀不得，我有我的苦衷！', '我答应过师父，要救这个禽兽三次！'],
                qtpz_zishu: ['贫尼法号圆性，望施主自重！', '此乃佛门净地，施主，请回吧！'],
                zhengwang: ['如果有来生，愿为布衣，不做缁衣……<br><br><br>'],
            },
            design: ['水烟箩卜', '落影逝尘', '大熊小猫'],
        },
        qtpz_wuchendashi: {
            debug: {
                playerName: '无嗔大师',
            },
            taic: {
                qtpz_jiegu: ['尝尽百草，只为悬壶济世！', '解毒还需下毒人！'],
                qtpz_shenzhang: ['此书祸福相依，你需心存善念！', '治病杀生，一念之间！'],
                zhengwang: ['灵素，务必继承为师衣钵……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_zhangzhaozhong: {
            debug: {
                playerName: '界张召重',
            },
            taic: {
                qtpz_pantou: ['良禽择木而栖，贤臣择主而事！', '识时务者为俊杰！'],
                qtpz_zhuiqin: ['尔等已是瓮中之蹩，插翅也难飞！', '红花逆贼，还不束手就擒！'],
                zhengwang: ['心比天高，奈何，命比纸薄……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        qtpz_duoergun: {
            debug: {
                playerName: '多尔衮',
            },
            taic: {
                qtpz_poguan: ['挥师南下，就在今朝！', '山海关已破，随我攻入北京城！'],
                qtpz_fuzheng: ['封官进爵，全由我说了算！', '王公贵胄，无不听命于我！'],
                zhengwang: ['为臣者，切不可功高盖主……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_lintuisi: {
            debug: {
                playerName: '凌退思',
            },
            taic: {
                qtpz_duxin: ['不交出连城诀，别想踏出这深牢大狱！', '匹夫无罪，怀璧其罪！'],
                qtpz_cuidu: ['中了我金波旬花之毒，你还不任我摆布！', '你，终于栽到我手里了！'],
                zhengwang: ['这些宝藏，都是我的，都是我的……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        qtpz_niujinxing: {
            debug: {
                playerName: '牛金星',
            },
            taic: {
                qtpz_channi: ['此人功高盖主，恐有谋逆之心！', '制将军自恃有功，可把闯王放在眼里！'],
                qtpz_quanjing: ['大王乃真命天子，当顺应天意！', '时势造英雄，大王为何犹豫？'],
                zhengwang: ['难道，又要变天了吗……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        qtpz_wangchengen: {
            debug: {
                skill: {
                    界限突破情况: {},
                    非界限突破情况: {
                        qtpz_kumeng2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    qtpz_kumeng: '注意:请检查是否遗漏了该技能',
                },
                playerName: '王承恩',
            },
            taic: {
                qtpz_kumeng: ['依奴才愚见，此梦乃大凶之兆！', '神人显告我皇，大明江山将失过半！'],
                qtpz_kumeng2: ['依奴才愚见，此梦乃大凶之兆！', '神人显告我皇，大明江山将失过半！'],
                qtpz_xunzhu: ['奴才恭送大明崇祯皇帝上路！', '黄泉路上冷，请圣上恩准以老奴为伴！'],
                zhengwang: ['陛下，老奴来陪您了……<br><br><br>'],
            },
            design: ['青灯折扇不语', '落影逝尘', '大熊小猫'],
        },
        qtpz_luobing: {
            debug: {
                playerName: '骆冰',
            },
            taic: {
                qtpz_shuangdao: ['狗官，领死吧！', '长鸯短鸳多奇招，定要豺狼无处逃！'],
                qtpz_xiadao: ['巧取豪夺的狗官，何曾怜悯百姓疾苦！', '取之于民，用之于民！'],
                zhengwang: ['四哥，我是你的骄傲吗……<br><br><br>'],
            },
            design: ['江虞', '落影逝尘', '大熊小猫'],
        },
        qtpz_huyidao: {
            debug: {
                playerName: '胡一刀',
            },
            taic: {
                qtpz_aozhan: ['小弟和苗大哥如此投机，若不是世仇该有多好！', '痛饮三杯，再决一死战！'],
                qtpz_tianyou: ['守护宝藏的重任，交给你了！', '切不能让宝藏，落入奸贼之手！'],
                zhengwang: ['我死后，望苗大哥抚养我儿成人……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        ywhy_baiyuchuan: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_zhengba: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_zhengba: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '影白玉川',
            },
            taic: {
                ywhy_yuhe: ['金钱、权势、力量……都是我的！', '得不到她，那就毁了她！', '贪如火，不遏则燎原！', '欲如水，不制则滔天！'],
                ywhy_huasheng: ['莲华妙法，玄元化生！', '蝮螫解腕，安辨雌雄！'],
                ywhy_zhengba: ['醒掌千秋业，醉卧美人膝！', '一朝权在手，杀尽负我人！', '剑已出鞘，锋之所指！', '红莲业火，血溅飞鹰！'],
                zhengwang: ['机关算尽，终是枉然……<br><br><br>'],
            },
            design: ['随遇而安', '霸天', '大熊小猫'],
        },
        ywhy_nalanyuanshu: {
            debug: {
                playerName: '纳兰元述',
            },
            taic: {
                ywhy_shiyi: ['师夷长技，方可制夷！', '欲制夷患，必筹夷情！'],
                ywhy_yangwunlys: ['洋人船坚炮利，我辈岂能闭关锁国！', '邪教惑民、外夷犯国，救国之路坎坷矣！'],
                zhengwang: ['空负绝学，独木难支……<br><br><br>'],
            },
            design: ['随遇而安', '霸天', '大熊小猫'],
        },
        ywhy_xiaochou: {
            debug: {
                playerName: '小丑',
            },
            taic: {
                ywhy_wangpai: ['生活如此乏味，不如玩场游戏吧！', '伙计们，这场游戏的主题是厮杀，哈哈哈…', 'Why so serious？', '妈妈说，人要一直微笑。', '喔，人总是嫉妒更幸运的人。', '是我疯了，还是这世界疯了？', '我的人生，充满负面情绪！'],
                ywhy_eju: ['疯狂就像地心引力，轻轻一推便跌入深渊！', '带给你微笑是我的使命，你为什么不笑？'],
                zhengwang: ['每个人的心里，都住着一个小丑……<br><br><br>'],
            },
            design: ['狗子', '霸天', '大熊小猫'],
        },
        ywhy_niao: {
            debug: {
                playerName: '尼奥',
            },
            taic: {
                ywhy_haike: ['所谓选择，皆是虚幻！', '世间万物，有始有终！'],
                ywhy_juzhen: ['人机之战尚未结束，未来任重道远！', '真正的敌人，是与你并肩却暗藏匕首的人！'],
                zhengwang: ['阳光，终会普照……<br><br><br>'],
            },
            design: ['攀', '棉花糖', '大熊小猫'],
        },
        ywhy_zhangjunbao: {
            debug: {
                skill: {
                    界限突破情况: {
                        tlbb_bolan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_xisui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_changjing: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        jy_shaolin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_taiji: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        tlbb_bolan: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        tlbb_xisui: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_changjing: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        jy_shaolin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        yttl_taiji: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '张君宝',
            },
            taic: {
                ywhy_xiuyuan: ['行通念达仙抚顶，半缘修道半缘君。', '缘生缘灭土归土，缘灭缘生尘归尘。'],
                tlbb_bolan: ['此经甚妙，容我细细观之。'],
                tlbb_xisui: ['易经换骨，洗髓生筋！'],
                yttl_changjing: ['千般玄妙理，尽蕴道心中。'],
                jy_shaolin: ['劲以曲蓄而有余，脉以灵通而不绝。'],
                ywhy_daofa: ['道法阴阳，衍化万物。', '万物负阴而抱阳，冲气以为和。'],
                ywhy_dunwu: ['一朝顿悟法，十载寒暑功！', '三乘五性，顿悟方知。'],
                yttl_taiji: ['一气三清成大道，执取龟蛇颠倒诀。', '无相无形潜造化，有门有户在乾坤。'],
                zhengwang: ['天公劝饮醒醐酒，复命归根返本原……<br><br><br>'],
            },
            design: ['冰霜墨菊', '霸天', '大熊小猫'],
        },
        ywhy_direnjie: {
            debug: {
                playerName: '狄仁杰',
            },
            taic: {
                ywhy_qian: ['此案需顺藤摸瓜，切勿打草惊蛇！', '此祸定是人为，安有神鬼作祟！', '有人装神弄鬼、故弄玄虚矣！'],
                ywhy_shenduan: ['因岂执于是非；果能断于人常！', '法网难逃，来人，将此獠拿下！'],
                ywhy_xiaoan: ['众口铄金，积毁销骨，畏于人言安敢称臣？', '社稷累卵，风雨飘摇，岂能因私废公！', '此事牵连甚广，不可深究！'],
                zhengwang: ['真相，永不磨灭……<br><br><br>'],
            },
            design: ['水蓝', '霸天', '大熊小猫'],
        },
        ywhy_niulangzhinv: {
            debug: {
                playerName: '牛郎织女',
            },
            taic: {
                ywhy_gengyou: ['人世非比天仙路，沧海桑田为耕织。', '观天难测晴雨，耕耘可知欠丰。'],
                ywhy_mengying: ['相思梦悠悠，涕泣泪如雨。', '纵使天各一方，你我梦魂相连！'],
                ywhy_queqiao: ['天河涛涛，故人何处？', '伤夫妇别离，恨天河难渡！', '一道鹊桥横渺渺，千声玉佩过玲玲。', '鹊桥凌云渡，天路非迢迢！'],
                zhengwang: ['此去一别，来年今宵再相会……<br><br><br>'],
            },
            design: ['安生', '霸天', '大熊小猫'],
        },
        ywhy_shaonianbaozheng: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_fanjie: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_fanjie: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '少年包拯',
            },
            taic: {
                ywhy_yanyi: ['蛛丝由来晓因果，慧眼如炬断古今！', '环环相扣、丝丝相连！', '抽丝剥茧，细查入微！', '谜题，终于解开了！'],
                ywhy_fanjie: ['天子犯法，当与庶民同罪！', '其情可悯，其罪当诛！', '尔等权贵，皆是杀人凶手！'],
                zhengwang: ['只要真相大白，一切无愧于心……<br><br><br>'],
            },
            design: ['随遇而安', '霸天', '大熊小猫'],
        },
        ywhy_chunsanshiniang: {
            debug: {
                playerName: '春三十娘',
            },
            taic: {
                ywhy_cuihua: ['桃花过处，寸草不生！', '金钱落地，人头不保！'],
                ywhy_pansi: ['千般烦恼丝，欲挣不得出！', '想跑？哼，这天罗地网，你跑的了吗？'],
                ywhy_yihun: ['天长情有尽，人间最风流！！', '移……魂……大……法！'],
                zhengwang: ['囿于俗世，又何尝不是一种美好……<br><br><br>'],
            },
            design: ['恋恋', '霸天', '大熊小猫'],
        },
        ywhy_xiaoxiami: {
            debug: {
                playerName: '游小虾米',
            },
            taic: {
                ywhy_youli: ['人在江湖身是客，纵情天地化鱼鸥！', '便尝人间事百味，自居一隅辟炎凉！'],
                ywhy_yeqiu: ['一朝功成，扶摇直上！', '天下无难事，只怕野球拳！'],
                ywhy_xiangzhu: ['得君相助，如虎添翼！', '扶危拯溺，濡沫涸辙！'],
                zhengwang: ['归乡之路，迢迢无期……<br><br><br>'],
            },
            design: ['随遇而安', '吃朵棉花糖', '大熊小猫'],
        },
        ywhy_shifeixuan: {
            debug: {
                playerName: '师妃暄',
            },
            taic: {
                ywhy_jianxin: ['寒山凌白羽，辟易绝埃尘！', '自羡幽居乐，不为世中人。', '花飞不解语，月落晓星沉。', '玉泓秋水澈，云屏竹影深！', '情起情消皆为相，我心无相证红尘！', '缘深无所往，挥剑斩情关！', '三尺青锋诛邪祟，慈航普度救苍生！', '剑心澄澈，法通世明。'],
                ywhy_zengbi: ['昆仑毓秀世无双，百转精魄出玄黄！', '望君持此玉璧，解救天下苍生！'],
                zhengwang: ['唯愿来世无烽火，朝云暮雨伴君侧……<br><br><br>'],
            },
            design: ['一叶米粥', '霸天', '木木枭'],
        },
        ywhy_liulangyue: {
            debug: {
                playerName: '影柳朗月',
            },
            taic: {
                ywhy_huanying: ['幻化千变，影逝逐形！', '孤影无所匿，茕茕照花容！'],
                ywhy_bingyan: ['寒冰绝谷，方保无虞！', '毒焰焮天，此身已绝！'],
                zhengwang: ['我恨这滔天血仇，不能亲手得报……<br><br><br>'],
            },
            design: ['石头星星', '霸天', '大熊小猫'],
        },
        ywhy_niexiaoqian: {
            debug: {
                playerName: '聂小倩',
            },
            taic: {
                ywhy_caiyang: ['芙蕖憔悴，暮云黯淡！', '为伊荣落，愁过朝朝！'],
                ywhy_youling: ['几番流光缘未尽，无数相思难载愁！', '幽冥不可诘，宁忍芳华误！'],
                ywhy_huanhun: ['余生无他，空为虚度！', '纵失百年苦修，也定要救他还阳！'],
                zhengwang: ['人鬼殊途，你我终是有缘无分……<br><br><br>'],
            },
            design: ['蓦焱', '霸天、藏海', '大熊小猫'],
        },
        ywhy_yanchixia: {
            debug: {
                playerName: '燕赤霞',
            },
            taic: {},
            design: ['小林', '棉花糖', '棉花糖'],
        },
        ywhy_hongfunv: {
            debug: {
                playerName: '红拂女',
            },
            taic: {
                ywhy_shizhu: ['风尘何堪慧眼炬，明珠蒙尘岂不知！', '卿本乱世豪杰身，落在承平蒙轻尘！'],
                ywhy_yeben: ['雄才隐布衣，红拂伴君旁！', '丝萝不独生，愿倚参天木！', '患难誓相随，苍天可鉴之！'],
                zhengwang: ['李郎，奴家不能再随你天涯海角了……<br><br><br>'],
            },
            design: ['付水东流', '霸天', '大熊小猫'],
        },
        ywhy_wusong: {
            debug: {
                playerName: '武松',
            },
            taic: {
                ywhy_hanzui: ['小二（打嗝声），上酒！', '谁说三碗不过冈！'],
                ywhy_bohu: ['区区大虫，有何可惧？', '四海驰骋九州横，醉酒踏冈闻虎声！'],
                zhengwang: ['天下贪官，何异虎狼……<br><br><br>'],
            },
            design: ['冬赫', '假象、霸天', '大熊小猫'],
        },
        ywhy_liyuanfang: {
            debug: {
                playerName: '李元芳',
            },
            taic: {
                ywhy_liandao: ['宝刀出鞘，刀刀夺命！', '披枷带锁之人，徒行尸走肉耳！'],
                ywhy_jixiong: ['镣铐加身，还不伏法？', '律法如山，杀人偿命！'],
                zhengwang: ['大人，属下先行告退……<br><br><br>'],
            },
            design: ['小林', '霸天', '大熊小猫'],
        },
        ywhy_hongmao: {
            debug: {
                playerName: '虹猫',
            },
            taic: {
                ywhy_xiadao: ['心中无我，无欲无求！', '自古正邪不两立！'],
                ywhy_xuanfeng: ['无所畏惧，方可收发自如！', '定要群魔无处躲！'],
                ywhy_changhong: ['无怨无悔，方能人剑合一！', '长剑破空，神临于世！', '男儿有胆气，仗剑走天涯！'],
                zhengwang: ['蓝兔，是生是死，我们都在一起……<br><br><br>'],
            },
            design: ['荀冬卿', '咸鱼', '咸鱼'],
        },
        ywhy_zhizunbao: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_qingjie: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_qingjie: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '至尊宝',
            },
            taic: {
                ywhy_mohe: ['般若波罗密！', '月光宝盒，时光穿梭！'],
                ywhy_zhuanshi: ['紧箍头上戴，紫霞心中留！', ' 一入佛门六根净，七色云彩别红尘！'],
                ywhy_qingjie: ['红尘自有痴情者，莫笑痴情太痴狂！', ' 人有七情六欲，物有百转轮回！'],
                zhengwang: ['曾经有份真挚的爱情，我没有珍惜……<br><br><br>'],
            },
            design: ['千狐', '落影逝尘', '大熊小猫'],
        },
        ywhy_xiaowei: {
            debug: {
                playerName: '小唯',
            },
            taic: {
                ywhy_wanxin: ['我要你的心，你给吗？', '用你的心，来换我的皮！', '我是妖，不吃人心，我会老的！'],
                ywhy_huapi: ['画皮画骨，难画心！', '你究竟爱我，哪副皮囊？', '你爱我的心，还是我的皮？'],
                zhengwang: ['爱的感觉，就是疼……<br><br><br>'],
            },
            design: ['一叶米粥', '落影逝尘', '大熊小猫'],
        },
        ywhy_niefeng: {
            debug: {
                playerName: '影聂风',
            },
            taic: {},
            design: ['一路向北', '霸天', '大熊小猫'],
        },
        ywhy_xiongba: {
            debug: {
                playerName: '影雄霸',
            },
            taic: {},
            design: ['弹指间', '霸天', '大熊小猫'],
        },
        ywhy_zixia: {
            debug: {
                playerName: '影紫霞',
            },
            taic: {},
            design: ['木兰幽洛', '棉花糖', '大熊小猫'],
        },
        ywhy_taisen: {
            debug: {
                playerName: '泰森',
            },
            taic: {
                ywhy_quanwang: ['中国武术，果然不堪一击！', '在绝对力量面前，你如何反抗？'],
                ywhy_tiguan: ['这是力量和力量的对决！', '高手过招，点到为止！'],
                zhengwang: ['中华武术，果然名不虚传……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        ywhy_nezha: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_fenshen: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_fenshen: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '哪吒',
            },
            taic: {
                ywhy_naohai: ['翻江倒海，直捣龙宫！', '叱咤四海，威慑九幽！'],
                ywhy_niepan: ['割肉还母，剔骨还父！', '弟子叩谢太乙真人再生之恩！'],
                ywhy_fenshen: ['长缨在手，敢缚苍龙！', '乾坤借法诛妖邪，风火叱咤除鬼魅！'],
                zhengwang: ['父母生养之恩，孩儿未敢忘记……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        ywhy_xiangshaolong: {
            debug: {
                playerName: '项少龙',
            },
            taic: {
                ywhy_chuanyue: ['谁能逆转，这历史洪流？', '历史泱泱岂能改，天命昭昭不可违！', '历史变迁，朝代更迭，岂是一人所为？'],
                ywhy_kuangzheng: ['泱泱中华，万古江河；如日之升，如月之恒！', '乱臣贼子，休要坏我神州龙运！'],
                ywhy_fuqin: ['唯愿君臣千万世，六合同心归华夏！', '六国归秦，一统中华！'],
                zhengwang: ['此生无悔入华夏，来世还做中国人……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        ywhy_sumu: {
            debug: {
                playerName: '苏木',
            },
            taic: {
                ywhy_miwang: ['打水漂的石头终会沉底，这就是我的命！', '人生就像八角笼，四面八方都是网！'],
                ywhy_polong: ['困兽犹斗，破笼而生！', '羁鸟恋旧林，池鱼思故渊！', '披荆斩棘，逆向而行！', '有的鸟是关不住的，因为它们属于天空。'],
                ywhy_fansha: ['走出大泷山，冲向全世界！', '总有一天，我要站上全世界最大的擂台！'],
                zhengwang: ['虎子，我们，胜利了……<br><br><br>'],
            },
            design: ['岛主', '霸天', '大熊小猫'],
        },
        ywhy_jichang: {
            debug: {
                playerName: '姬昌',
            },
            taic: {
                ywhy_minnong: ['天下共苦、纷战不休，百姓流离失所！', '殷王无道、天怒人怨，诸侯揭竿而起！', '恸天下苍生，食不果腹、居无定所！'],
                ywhy_zhangua: ['祈风调雨顺，佑西岐子民！', '上窥天道，下俯苍生，唯独不能算自己。', '扶乩观天象，龟甲测天机！'],
                zhengwang: ['人心向背，王朝更替……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        ywhy_zhuiming: {
            debug: {
                playerName: '追命',
            },
            taic: {
                ywhy_sheming: ['无敌旋风，夺魂索命！', '草菅人命，法不容情！'],
                ywhy_zhuizong: ['尔等宵小之辈，哪里逃！', '你已死路一条，还不束手伏法？'],
                zhengwang: ['得之我幸，失之我命……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        ywhy_mengxinghun: {
            debug: {
                playerName: '孟星魂',
            },
            taic: {
                ywhy_juesha: ['长痛不如短痛，我会给你个痛快的！', '你已四面无援，还是乖乖受死吧！'],
                ywhy_fengjian: ['干完这一票，我便金盆洗手！', '这刀口舔蜜的日子，我早已厌倦！'],
                zhengwang: ['这杀人如麻的日子，何时是个头……<br><br><br>'],
            },
            design: ['高丸丸', '落影逝尘', '大熊小猫'],
        },
        ywhy_lixunhuan: {
            debug: {
                playerName: '界李寻欢',
            },
            taic: {
                ywhy_feidao: ['出手一刀，例不虚发！', '你，能快得过我的飞刀吗？'],
                ywhy_guiyin: ['刀断愁肠结，逢君已陌路！', '这天下，终究不是我想要的天下！'],
                zhengwang: ['美人迟暮，英雄末路，何等悲哀……<br><br><br>'],
            },
            design: ['千狐', '落影逝尘', '大熊小猫'],
        },
        ywhy_guxizhao: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_fajue: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_fajue: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '顾惜朝',
            },
            taic: {
                ywhy_kunjian: ['大道如青天，我独不得出！', '长空砺剑难酬志，空洒热血英雄胆！'],
                ywhy_qilve: ['你有千般计，我有过墙梯！', '你，如何逃出我的五指山？'],
                ywhy_fajue: ['尔等皆是七尺汉，为何落草为贼寇！', '斩草除根，永绝后患！'],
                zhengwang: ['我，终究是输了么……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        ywhy_baozupo: {
            debug: {
                playerName: '包租婆',
            },
            taic: {
                yttl_shihou: ['跟老娘比嗓门儿，活腻了吗！', '反了反了，都给我闭嘴！'],
                ywhy_cuizu: ['你们这帮歪瓜裂枣，还不赶紧交租？', '连房租都交不起，活该一辈子干苦力！'],
                zhengwang: ['扫黑除恶，是我辈使命……<br><br><br>'],
            },
            design: ['电影原声', '落影逝尘', '大熊小猫'],
        },
        ywhy_abao: {
            debug: {
                playerName: '阿宝',
            },
            taic: {
                ywhy_wuji: ['嘿嘿，我这是乱拳打死老师傅！', '我八窍已通七窍，尚有一窍不通！'],
                ywhy_wuliang: ['昨日已如流水去，未来遥遥不可知！', '明日未可知，还是先吃饱吧！'],
                ywhy_shenlong: ['想要入侵中原大地，先过我神龙大侠这关吧！', '真的武士，决不退缩！'],
                zhengwang: ['保护中原大地，我做到了……<br><br><br>'],
            },
            design: ['狗子', '落影逝尘', '大熊小猫'],
        },
        ywhy_fahai: {
            debug: {
                playerName: '法海',
            },
            taic: {
                ywhy_xiangyao: ['妖就是妖，还敢口舌招摇！', '大胆妖孽，我要你原形毕露！'],
                ywhy_rumo: ['仙凡有别，大道无情！', '红尘厮混，终会堕入魔道！', '蛇妖，你已触犯天条，还不速速伏法？', '哪里逃，看我大罗金钵！', '佛门重地，岂容妖孽横行！', '世尊地藏，般若诸佛！', '雕虫小技，竟敢班门弄斧！', '大威天龙，大罗法咒，般若巴嘛空！'],
                ywhy_yuanfa: ['六道轮回，各有所序，何必苦苦执着？', '水月镜花，迷惑众生，何谓妖、何谓佛？'],
                zhengwang: ['难道，妖也有情……<br><br><br>'],
            },
            design: ['全职卤蛋', '僵尸王', '大熊小猫'],
        },
        ywhy_gelun: {
            debug: {
                playerName: '格伦',
            },
            taic: {
                ywhy_waisong: ['叮……（门铃声）', '爱心晚餐，风雨无阻！', '先生，您的披萨！', '祝您用餐愉快！', '您的外卖，请签收！', '需要我为您服务吗？', '您的美餐，由我护送！'],
                ywhy_moshi: ['群尸出笼，末日降临；山崩地裂，草木含悲！', '人间正沧桑，满世活死人！'],
                ywhy_jiushi: ['不经人间炼狱，怎得涅磐重生！', '丧尸不会灭亡人类，能灭绝人类的只有人类自己！'],
                ywhy_taosha: ['不做屠夫，便成羔羊！', '突破群尸重围，但求一线生机！'],
                zhengwang: ['人心，是最可怕的东西……<br><br><br>'],
            },
            design: ['全职卤蛋', '僵尸王', '大熊小猫'],
        },
        ywhy_gulu: {
            debug: {
                playerName: '咕噜',
            },
            taic: {},
            design: ['白狗', '霸天', '大熊小猫'],
        },
        ywhy_shimaige: {
            debug: {
                playerName: '史麦戈',
            },
            taic: {},
            design: ['花生', '霸天', '大熊小猫'],
        },
        ywhy_beiteduote: {
            debug: {
                playerName: '贝特多特',
            },
            taic: {},
            design: ['喵吱', '霸天', '大熊小猫'],
        },
        ywhy_baisuzheng: {
            debug: {
                playerName: '白素贞',
            },
            taic: {
                ywhy_jiushang: ['酒入愁肠迷本性，雄黄害我现原形！', '痴人醉饮雄黄酒，上穷碧落下黄泉！'],
                ywhy_xuanyuan: ['此人阳寿未尽，还望阎君网开一面！', '汇天地之灵气，取日月之精华！'],
                zhengwang: ['相公，今生缘分已尽……<br><br><br>'],
            },
            design: ['一壶中', '落影逝尘', '大熊小猫'],
        },
        ywhy_ganshijiumei: {
            debug: {
                playerName: '甘十九妹',
            },
            taic: {
                ywhy_juejian: ['急剑如潞，先诛岳阳！', '独身一剑洗江湖，凭栏观鞘承影出！'],
                ywhy_duanchang: ['气毁丹田五脏红，棠梨落尽送君终！', '沈园梦碎秋茶凉，恨织情蛊七步殇！'],
                zhengwang: ['若非宿命难逃，你会娶我吗……<br><br><br>'],
            },
            design: ['一叶米粥', '咸鱼', '大熊小猫'],
        },
        ywhy_honghaier: {
            debug: {
                playerName: '红孩儿',
            },
            taic: {
                ywhy_shengying: ['日灼炎炎火云洞，平天圣婴显威风！', '诸天神佛，还有哪个为我祭枪？', '先灭菩萨金刚，再焚如来老儿！', '吞吐风雷红云卷，燃平四海压火德！'],
                ywhy_guitai: ['金蝉冰肌玉骨，胜过瑶池蟠桃！', '望几位师父慈悲，救我性命！'],
                zhengwang: ['弟子，愿意皈依我佛……<br><br><br>'],
            },
            design: ['荀冬卿', '落影逝尘', '大熊小猫'],
        },
        ywhy_baolaiying: {
            debug: {
                playerName: '包来硬',
            },
            taic: {},
            design: ['星空下木头', '棉花糖、霸天', '大熊小猫'],
        },
        ywhy_yingwuqiu: {
            debug: {
                playerName: '应无求',
            },
            taic: {},
            design: ['星空下木头', '棉花糖、霸天', '大熊小猫'],
        },
        ywhy_boya: {
            debug: {
                playerName: '影博雅',
            },
            taic: {
                ywhy_feishi: ['百发百中，箭无虚发！', '烈弦一开，魍魉难逃！'],
                ywhy_jiejie: ['以吾之血肉，唤雀神降临！', '四神结界，必斩祸蛇！'],
                ywhy_zhonghu: ['忠诚，是最强的守护咒！', '请代替我，继续战斗！'],
                zhengwang: ['雁过无痕风有情，生死两忘江湖里……<br><br><br>'],
            },
            design: ['无忆CHENG', '落影逝尘', '大熊小猫'],
        },
        ywhy_qingmin: {
            debug: {
                遗漏: {
                    ywhy_dunshu: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '影晴明',
            },
            taic: {
                ywhy_fuyao: ['以吾鲜血，缚令诸神！', '此生无悔，侍奉为荣！'],
                ywhy_qushen: ['五帝庇佑，咒符退魔！', '青龙在左，白虎在右，朱雀在前，玄武垫后！'],
                zhengwang: ['名字，是最短的咒……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        ywhy_liangxiao: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_guizang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_guizang: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '梁萧',
            },
            taic: {
                ywhy_tianji: ['旁观未必穷神妙，自有十算算天机！', '天机行日月，只手探参商！'],
                ywhy_dongyuan: ['察今知古，拨草瞻风！', '洞形查色，鉴虚度影！'],
                ywhy_zhouyou: ['西方巍巍，大哉昆仑！', '周游六虚，八劲合一！'],
                ywhy_guizang: ['蕴往圣绝学，有剑名归藏！', '天之道，损有余而补不足！', '万物虽繁杂，归藏始为终！', '我已不再杀戮，何必苦苦相逼？'],
                zhengwang: ['愿人间……再无烽火……<br><br><br>'],
            },
            design: ['小林', '霸天', '木木枭'],
        },
        ywhy_lianxing: {
            debug: {
                playerName: '怜星',
            },
            taic: {
                ywhy_yixin: ['落花有意逐流水，水移心落花自痴!', '多情总被无情误，万千情愫化蝶去！', '江边星星渔火乱，明月却是泊枫桥！'],
                ywhy_xiayu: ['玉在山而草木润，渊生珠而崖不枯！', '玉器七千陈湛露，翠蛾三百舞灵风！', '玉容寂寞泪阑干，梨花一枝春带雨！'],
                zhengwang: ['姐姐，不能再错下去了……<br><br><br>'],
            },
            design: ['龙龙龙哒', '藏海', '大熊小猫'],
        },
        ywhy_yaoyue: {
            debug: {
                playerName: '邀月',
            },
            taic: {
                ywhy_yigong: ['冰摧傲梅迎霜立，寒骨姝影剑留香！', '秋枫岂能恋花月，奈何明日俱归尘！', '繁花易落情难移，此恨绵绵无绝期。'],
                ywhy_mingyu: ['敢邀明月借千载，凌天许我受长生！', '玉照千江明秋水，清心蚀骨亦蚀心！'],
                zhengwang: ['属于我的，你们谁也夺不走，哈哈哈……<br><br><br>'],
            },
            design: ['明河', '落影逝尘', '大熊小猫'],
        },
        ywhy_lengxue: {
            debug: {
                playerName: '冷血',
            },
            taic: {
                ywhy_cuofeng: ['我若放虎归山，他日必添新魂!', '挫锋抑志，丧敌胆寒！'],
                ywhy_langshi: ['孤狼弥勇，其志噬心！', '成群之狼，纵虎何惧！'],
                zhengwang: ['良善何曾离心远，杀戮几时入人间……<br><br><br>'],
            },
            design: ['冬赫', '霸天', '大熊小猫'],
        },
        ywhy_luxiaofeng: {
            debug: {
                playerName: '陆小凤',
            },
            taic: {
                ywhy_linxi: ['灵犀一指，挫敌锋芒！', '就这破铜烂铁，也想伤我？'],
                ywhy_fengwu: ['翩翩人中凤，遨游九重天！', '火凤燎原，寸草不生！'],
                zhengwang: ['火凤的传说，将不绝于江湖……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        ywhy_qiumoyan: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_youxia: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_youxia2: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                playerName: '界邱莫言',
            },
            taic: {
                ywhy_fenying: ['岂让豺狼祸苍生！', '世道多险恶，唯有道义真！'],
                ywhy_youxia2: ['浮萍漂泊本无根，天涯游子君莫问！', '莫言世道多纷扰，看遍青山一重重！'],
                ywhy_youxia: ['浮萍漂泊本无根，天涯游子君莫问！', '莫言世道多纷扰，看遍青山一重重！'],
                zhengwang: ['玉在匣中叹，金钗土里埋……<br><br><br>'],
            },
            design: ['明河', '落影逝尘', '大熊小猫'],
        },
        ywhy_fangshiyu: {
            debug: {
                playerName: '方世玉',
            },
            taic: {
                ywhy_jiexin: ['家父危在旦夕，哪管刀山火海！', '单枪匹马劫法场，生养之恩莫敢忘！'],
                ywhy_huadao: ['扬刀立马酬壮志，扫尽天下不平事！', '今朝刀在手，江湖任我游！'],
                zhengwang: ['孩儿不孝，未救父于法场……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        ywhy_zhouhuaian: {
            debug: {
                playerName: '周淮安',
            },
            taic: {
                ywhy_duxian: ['还望掌柜的，指条明路！', '前路迢迢，道阻且长！'],
                ywhy_jiugu: ['此乃忠烈遗孤，务必保其周全！', '出了关外，就靠你自己了！'],
                zhengwang: ['别了，龙门客栈……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        ywhy_huawuque: {
            debug: {
                playerName: '花无缺',
            },
            taic: {
                ywhy_yihua: ['俯首看花花影动，东风意捉弄！', '移花接玉，神鬼莫敌！'],
                ywhy_jieyu: ['如月之恒，如日之升。', '公子人如玉，陌上世无双。'],
                zhengwang: ['你我血浓于水，岂可自相残杀……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        ywhy_lixiaolong: {
            debug: {
                playerName: '李小龙',
            },
            taic: {
                ywhy_jiequan: ['咿呀！', '攻击是最好的防御！', '拳如闪电腿如风！'],
                ywhy_longhun: ['一扫病夫龙骨傲！', '不敢称第一，绝不认第二！'],
                zhengwang: ['生为传奇，死为龙魂……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        ywhy_yuhuatian: {
            debug: {
                playerName: '雨化田',
            },
            taic: {
                ywhy_yanzhen: ['军机暗语，你给我记牢了！', '龙门飞甲，便知真假！'],
                ywhy_qingquan: ['东厂不敢管的事，我来管！', '此人性命，我西厂要定了！'],
                ywhy_zhuiji: ['长臂一挥，围捕钦犯千里外！', '马鞭一指，追杀罪嫔大漠间！'],
                zhengwang: ['奈何雄心壮志，尽付大漠黄沙……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        ywhy_xiaoyuer: {
            debug: {
                playerName: '小鱼儿',
            },
            taic: {
                ywhy_kuanghuo: ['习得骗中骗，方做人上人！', '男人的嘴，骗人的鬼！'],
                ywhy_jiaotu: ['此时不跑，更待何时？', '三十六计，溜之大吉！'],
                ywhy_jiee: ['小爷我三天没吃人啦！', '瞧你可怜，赏你一口！'],
                zhengwang: ['人之初，性本善……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        ywhy_chuliuxiang: {
            debug: {
                遗漏: {
                    ywhy_zhuiyun: '注意:请检查是否遗漏了该技能', //MOD技能无台词
                },
                playerName: '楚留香',
            },
            taic: {
                ywhy_yuxiang: ['盗帅爱销魂，月夜暗留香！', '楚人江南留香久，海上渐有白云升。'],
                ywhy_daoshuai: ['今夜子正，当踏月来寻！', '闻君有美玉，不胜神往之！'],
                zhengwang: ['不求留芳于世，但求落幕无悔……<br><br><br>'],
            },
            design: ['李二汪', '落影逝尘', '大熊小猫'],
        },
        ywhy_spzhanzhao: {
            debug: {
                playerName: 'sp展昭',
            },
            taic: {
                ywhy_xiaojin: ['京畿重地，岂容鼠辈猖獗？', '臣当摄服宵小，以保圣驾周全！', '此处戒备森严，还望圣上宽忧！'],
                ywhy_youming: ['侠骨柔情自留芳，不容鼠辈欺善良！', '乱世扬巨阙，风骨昭青天！'],
                zhengwang: ['若非一番寒彻骨，何来♣️️扑鼻香……<br><br><br>'],
            },
            design: ['小林', '落影逝尘', '大熊小猫'],
        },
        ywhy_zhanzhao: {
            debug: {
                playerName: '展昭',
            },
            taic: {
                ywhy_jinwei: ['卑职救驾来迟，望皇上降罪！', '圣驾南巡，尔等切勿懈怠！'],
                ywhy_yumao: ['谁题巨阙映苍茫，扫清浊世浩气扬！', '骇浪翻飞身俊逸，疾风凌厉自留芳！'],
                zhengwang: ['男儿，志在四方……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        ywhy_shenglian: {
            debug: {
                playerName: '沈炼',
            },
            taic: {
                ywhy_weijiao: ['魏阉党羽，一个不留！', '宁枉勿纵，定将阉奴斩草除根！', '你问我何罪之有？身在乱世就是罪！', '你私藏阉党，当与阉党同罪！'],
                ywhy_guoxie: ['身处乱世，岂能全身而退？', '你我，不过是权利的牺牲品！'],
                zhengwang: ['挣不开，这命运的枷锁……<br><br><br>'],
            },
            design: ['ILL', '落影逝尘', '大熊小猫'],
        },
        ywhy_suqier: {
            debug: {
                playerName: '苏乞儿',
            },
            taic: {
                ywhy_liugai: ['昼无好饭夜无眠，落得街头唱哩莲！', '若非世道公义迟，谁又甘吃嗟来食？'],
                ywhy_zuiquan: ['诗万首，酒千觞，几曾着眼看侯王！', '形醉，意不醉，步醉，心不醉！'],
                ywhy_saozhuo: ['一段青竹杖，扫清天下浊！', '棒打双犬，扫清浊世！', '手持绿杖行天下，人间再无犬吠声！', '若天下不公，我便给它个公道！'],
                zhengwang: ['四海若升平，谁愿当街乞……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        ywhy_baiyutang: {
            debug: {
                playerName: '白玉堂',
            },
            taic: {
                ywhy_naojing: ['猫与鼠的游戏，才刚刚开始！', '纵是人间炼狱，白某照闯不误！', '仰马仗剑云翻动，扬鞭提壶笑东风。'],
                ywhy_yazi: ['人不轻狂，枉少年！', '今日恩怨今日了！', '仗剑携酒江湖行，多少恩怨醉梦中。'],
                zhengwang: ['人间自有青天在……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        ywhy_guohuai: {
            debug: {
                playerName: '郭槐',
            },
            taic: {
                ywhy_huandi: ['娘娘当偷龙转凤，以固凤位！', '李妃身怀六甲，恐夺昭阳，奴婢特献狸猫换太子之妙计！'],
                ywhy_miekou: ['要怪，只怪你看到不该看的东西！', '就让这惊天秘密同你一起，永葬黄泉吧！'],
                ywhy_wangfa: ['此乃刘太后亲赐免死金牌，你能奈我何？', '你我同朝为官，何必苦苦相逼？'],
                ywhy_gongzhui: ['奴婢祸乱国祚，罪该万死！', '太后有令，奴婢不敢有违凤诏，望包大人法外开恩！'],
                zhengwang: ['老奴向先皇列祖，谢罪来了……<br><br><br>'],
            },
            design: ['派大唾沫星子', '霸天', '大熊小猫'],
        },
        ywhy_huangfeihong: {
            debug: {
                playerName: '黄飞鸿',
            },
            taic: {
                ywhy_tuqiang: ['朝廷积弱，列强欺凌，我辈当奋发图强！', '救亡图存，国家兴革，匹夫有责！'],
                ywhy_wuying: ['佛山无影脚，踢的就是你们这些洋狗！', '今天，就让你们见识什么是真正的中国功夫！'],
                zhengwang: ['来世再做七尺汉，看我家国万世秋……<br><br><br>'],
            },
            design: ['沃声风飞语', '落影逝尘', '大熊小猫'],
        },
        ywhy_qiurong: {
            debug: {
                playerName: '秋容',
            },
            taic: {
                ywhy_huanshu: ['世间虚幻之法，凡目怎得勘破？', '盈盈水中月，袅袅镜中花。'],
                ywhy_hunqian: ['纵使天涯万里，秋容一线情牵！', '思君忆君，魂萦梦牵！'],
                ywhy_minghun: ['一阴阳两相隔，情重不能分！', '鸾杯醉宴好，晓戍复魂归！'],
                zhengwang: ['郎君若得情真切，秋容何悔赴黄泉！<br><br><br>'],
            },
            design: ['安生', '霸天', '大熊小猫'],
        },
        ywhy_caoe: {
            debug: {
                playerName: '曹娥',
            },
            taic: {},
            design: ['林曦', '霸天', '大熊小猫'],
        },
        ywhy_yanshisan: {
            debug: {
                playerName: '燕十三',
            },
            taic: {
                ywhy_jianmo: ['不与凡夫论天阔，此生唯与剑为友！', '玄鞘金首慑凡骨，十三明珠证魔心！'],
                ywhy_duoming: ['夺命十三剑，又岂拘泥于十三式？', '死在我的剑下，是你的荣幸。'],
                zhengwang: ['我……虽死……犹胜……<br><br><br>'],
            },
            design: ['二空', '霸天', '大熊小猫'],
        },
        ywhy_jinyong: {
            debug: {
                playerName: '金庸',
            },
            taic: {
                ywhy_kuangbi: ['执笔写尽英雄事，仗剑倚马江湖中！', '飞雪连天射白鹿，笑书神侠倚碧鸳！'],
                ywhy_xiahun: ['侠之大者，为国为民！', '贫不改其气，达不改其志！'],
                zhengwang: ['挥亳泼墨百年梦，忽翻烂卷涕泗沾……<br><br><br>'],
            },
            design: ['蚩宇', '微尘', '大熊小猫'],
        },
        ywhy_baozheng: {
            debug: {
                playerName: '包拯',
            },
            taic: {
                ywhy_zhaoxue: ['我有尚方宝剑，可斩丹书铁券！', '日诉阳间千不平，夜判阴曹掌幽冥！'],
                ywhy_mingcha: ['若要人不知，除非己莫为！', '但见高堂明镜悬，举头三尺有青天！'],
                zhengwang: ['人间若无冤难平，何需铁面为青天……<br><br><br>'],
            },
            design: ['小林', '寰宇星城', '大熊小猫'],
        },
        ywhy_tieshou: {
            debug: {
                playerName: '铁手',
            },
            taic: {
                ywhy_cuijian: ['刚可摧金断石，柔可清风拂面！', '破而后立，一以贯之！'],
                ywhy_gangding: ['拔山扛鼎，此志干云！', '举壁御洪，以佑苍生！'],
                zhengwang: ['壮士，当明知不可为而义所当为……<br><br><br>'],
            },
            design: ['路边奇石', '棉花糖', '大熊小猫'],
        },
        ywhy_baishe: {
            debug: {
                playerName: '白蛇',
            },
            taic: {
                ywhy_xianen: ['十年修得同船渡，百年修得共枕眠！', '有缘千里来相会，三笑徒然当一痴！'],
                ywhy_shuiman: ['一怒涌江水，漫过金山巅！', '柔肠愤起挥广袖，千里江南一片哀！'],
                ywhy_huajiao: ['自兹繁巨蟒，往往寿千年！', '白蛇初下峨眉山，坐对青峰结翠鬟！'],
                zhengwang: ['情之一字，熏神染骨，误尽苍生……<br><br><br>'],
            },
            design: ['安生', '棉花糖', '大熊小猫'],
        },
        ywhy_qingshe: {
            debug: {
                playerName: '青蛇',
            },
            taic: {
                ywhy_sifan: ['姐姐，此物为何？竟有此般神奇！', '四方诸事，不如一碗人间烟火。', '姐姐呀，做人怎么这么麻烦？', '为什么做蛇的时候，你说做人好，现在却说做蛇好？', '都说人间有情，但是情为何物？'],
                ywhy_huanhua: ['似此故人非昨夜，为谁茕茕别云遥？', '情仇爱恨皆所愿，缘何由此泪婆娑？'],
                ywhy_xiaojiu: ['芒硝化酒，辟瘟解毒！', '姐姐，我……我没醉，我还要喝……'],
                zhengwang: ['情为何物，终是不晓……<br><br><br>'],
            },
            design: ['良沨', '棉花糖', '大熊小猫'],
        },
        ywhy_change: {
            debug: {
                playerName: '嫦娥',
            },
            taic: {
                ywhy_yaotu: ['清净不觉月光冷，夜夜抱兔待露凝。', '瑶兔若能挥玉杵，何须仙籍求长生？'],
                ywhy_xianyao: ['欲化仙人赴瑶池，求得仙露与仙丹。', '千年昆仑登仙道，如今孤影栖广寒。'],
                ywhy_zhuyue: ['长空月洒夜暮里，光华照君君未知。', '阴晴圆缺月有全，离合悲欢人无常。', '无言登楼江映月，月涌江潮是离愁。', '月如流水隔幕帘，泪洒冰轮不得见。'],
                zhengwang: ['纵我未悔偷灵药，青天碧海亦孤心……<br><br><br>'],
            },
            design: ['酱子', '霸天', '大熊小猫'],
        },
        ywhy_pangban: {
            debug: {
                playerName: '庞斑',
            },
            taic: {
                ywhy_moce: ['天魔十策，为天下诸法之源！', '云深不见月，魔心屠众生！', '金刚不吐焰，天魔破幽禅！', '魔嚣天下，策御乾坤！'],
                ywhy_zhongmo: ['道心种魔难自抑，红颜本就多是非！', '三清天魔皆一愿，魔种暗蕴道心中。'],
                ywhy_suikong: ['溯钧天梦破，俯仰碎虚空！', '天若阻我逍遥意，吾自葬天踏凌霄！'],
                ywhy_qinggen: ['情之为物，最是难言！', '星汉皓无垠，怎及情一缕？'],
                zhengwang: ['世间再无魔师矣，哈哈哈……<br><br><br>'],
            },
            design: ['六月初十', '霸天', '木木枭'],
        },
        ywhy_aijifalao: {
            debug: {
                playerName: '埃及法老',
            },
            taic: {
                ywhy_juta: ['聚沙成塔，掩桎梏而通天！', '心如鸿毛，登高台而羽化！'],
                ywhy_yinshi: ['香以肉骨，帛以存身！', '愚蠢的凡人们，向阿努比斯臣服吧，哈哈哈……'],
                zhengwang: ['千丈之塔，终堙于黄沙……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        ywhy_shanshangcheye: {
            debug: {
                playerName: '山上徹也',
            },
            taic: {
                ywhy_qinwangsscy: ['闻诛一夫纣矣，未闻弒君也！', '始作俑者，其无后乎！'],
                ywhy_xiandan: ['万恶的邪教，下地狱吧！', '邪教害民，人神共诛！', '向千千万万的受害者，谢罪吧！'],
                zhengwang: ['再见吧，这荒谬的世界……<br><br><br>'],
            },
            design: ['韩文杰', '霸天', '大熊小猫'],
        },
        ywhy_zhangqiling: {
            debug: {
                playerName: '张起灵',
            },
            taic: {
                ywhy_daodou: ['百足之虫，死而不僵！', '雪山龙脉隐，铜门藏终极！'],
                ywhy_shibian: ['尸有十八变，其状各不同！', '血尸凶残，大家千万别回头！'],
                ywhy_xielin: ['宝血开路，百虫退散！', '麒麟洒血魑魅开，镇灵闯墓魍魉拜！'],
                zhengwang: ['十年生死语凝噎，一别长白思无邪……<br><br><br>'],
            },
            design: ['稳得高处', '落影逝尘', '大熊小猫'],
        },
        ywhy_zongzi_female: {
            debug: {
                playerName: '粽子·女',
            },
            taic: {
                'ywhy_zongzi_skill	': ['[粽子咆哮声]'],
                zhengwang: ['[粽子咆哮声]<br><br><br>'],
            },
            design: ['[无]', '落影逝尘', '大熊小猫'],
        },
        ywhy_zongzi_male: {
            debug: {
                playerName: '粽子·男',
            },
            taic: {
                'ywhy_zongzi_skill	': ['[粽子咆哮声]'],
                zhengwang: ['[粽子咆哮声]<br><br><br>'],
            },
            design: ['[无]', '落影逝尘', '大熊小猫'],
        },
        ywhy_lianjiafalao: {
            debug: {
                playerName: '连枷法老',
            },
            taic: {
                ywhy_fazhang: ['[法老之威]'],
                ywhy_yinfeng: ['[阴风阵阵]'],
                zhengwang: ['[无]<br><br><br>'],
            },
            design: ['无', '霸天', '大熊小猫'],
        },
        ywhy_moxiedadi: {
            debug: {
                playerName: '魔蝎大帝',
            },
            taic: {
                ywhy_duao: ['[魔蝎大帝呢喃]'],
                ywhy_yinzhao: ['[魔蝎大帝呢喃]'],
                zhengwang: ['[魔蝎大帝呢喃]<br><br><br>'],
            },
            design: ['无', '藏海', '大熊小猫'],
        },
        ywhy_shizumingdi: {
            debug: {
                playerName: '始祖冥帝',
            },
            taic: {
                ywhy_kengru: ['[冥帝狂笑]'],
                ywhy_yinbing: ['[阴兵嘶吼]'],
                zhengwang: ['[无]<br><br><br>'],
            },
            design: ['无', '霸天', '大熊小猫'],
        },
        ywhy_yaojiyuanling: {
            debug: {
                playerName: '妖姬怨灵',
            },
            taic: {
                ywhy_yuandu: ['[怨灵尖叫]'],
                ywhy_yinqi: ['[妖姬哀嚎]'],
                zhengwang: ['[无]<br><br><br>'],
            },
            design: ['无', '霸天', '大熊小猫'],
        },
        ywhy_feijiang_female: {
            debug: {
                playerName: '飞僵·女',
            },
            taic: {
                ywhy_gaiguan: ['[飞僵咆哮声]'],
                ywhy_chuguan: ['[飞僵咆哮声]'],
                zhengwang: ['[飞僵咆哮声]<br><br><br>'],
            },
            design: ['[无]', '霸天', '大熊小猫'],
        },
        ywhy_feijiang_male: {
            debug: {
                playerName: '飞僵·男',
            },
            taic: {
                ywhy_gaiguan: ['[飞僵咆哮声]'],
                ywhy_chuguan: ['[飞僵咆哮声]'],
                zhengwang: ['[飞僵咆哮声]<br><br><br>'],
            },
            design: ['[无]', '霸天', '大熊小猫'],
        },
        ywhy_wangkaixuan: {
            debug: {
                playerName: '王凯旋',
            },
            taic: {
                ywhy_liangdou: ['雄关漫道真如铁，而今迈步从头越！我王凯旋又回来了！', '穴坐龟甲出鼠盗，棺内木根穿亡人！', '天王盖地虎，宝塔镇河妖！', '用屁股想想也知道，这写的是“盗墓者死”!'],
                ywhy_feijiang: ['急急如律令！噎死你个大粽子！', '老胡，他这是中了什么毒？活人秒变大粽子了！'],
                ywhy_tanmu: ['啥都用电动的还叫倒斗吗？这才是正宗摸金范儿！', '咱这叫考古，啥盗墓、盗墓的！', '什么盗墓贼？咱是对封建统治阶级的无情鞭挞！', '可上九天揽月，可下五洋捉鳖！开在阴曹地府的花，我也一样给你采回来！'],
                zhengwang: ['探了一辈子墓，没想到……今儿栽这儿了……<br><br><br>'],
            },
            design: ['MU', '霸天', '大熊小猫'],
        },
        ywhy_hubayi: {
            debug: {
                playerName: '胡八一',
            },
            taic: {
                ywhy_mojin: ['鸡鸣灯灭不摸金！', '人点蜡，鬼吹灯！'],
                ywhy_suoyao: ['神兵降世，斩妖除魔！', '地狱空荡荡，恶魔在人间！', '鸡鸣灯灭，魍魉横行！'],
                ywhy_xunlong: ['寻龙分金看缠山，一重缠是一重关！', '寻龙分金，一关一险！'],
                zhengwang: ['合则生，分则死……<br><br><br>'],
            },
            design: ['蚩宇', '寰宇星城', '大熊小猫'],
        },
        ywhy_jiushu: {
            debug: {
                playerName: '九叔',
            },
            taic: {
                ywhy_modao: ['三清符起看阴阳，铜镜桃木镇魍魉！', '神兵急急如律令，斩妖除魔驱邪灵！', '天灵灵，地灵灵，太上老君来显灵！', '半碗清水照乾坤，一张灵符命鬼神！'],
                ywhy_lianshi: ['七九夺阳，尸起西南！', '尘归尘，土归土，请君速上轮回路！', '尔身非本身，此身非玉身，烈火焚此身，由此而重生！', '阴阳分两道，人鬼皆殊途！'],
                ywhy_pozhou: ['你这蠢货，怎能烧毁灵符？', '别怕，有师父在呢！'],
                zhengwang: ['朱砂糯米今犹在，昔日威风化尘埃……<br><br><br>'],
            },
            design: ['小林', '寰宇星城', '大熊小猫'],
        },
        ywhy_yewen: {
            debug: {
                playerName: '叶问',
            },
            taic: {
                ywhy_zhanhuo: ['兵连祸结多磨难，神州飘摇风雨泣！', '兵荒马乱，沧海横流！'],
                ywhy_yongchun: ['攻守兼备，后发制人！', '寸劲收发，绵绵不绝！', '咏到♣️️桩法妙，春生桃李艺林香！'],
                ywhy_yangwu: ['神州尚有英雄在，愿拼热血卫中华！', '我辈习武为何事？驱逐日寇复河山！'],
                zhengwang: ['尚武精神永传承……<br><br><br>'],
            },
            design: ['蚩宇', '落影逝尘', '大熊小猫'],
        },
        ywhy_wuxie: {
            debug: {
                playerName: '吴邪',
            },
            taic: {
                ywhy_liuying: ['无声摹百绘，脱墨述骨香！', '十卷九藏，八七岁月，不忘六梦浮生！', '五湖四海，三两知己，换你一世无邪！'],
                ywhy_tongyi: ['一字勘千机，万语寻旧译！', '碑文记载，此墓凶险！'],
                ywhy_jiangu: ['这宝贝货真价实，绝非赝品！', '鎏金碧珍挂珊瑚，怀璧不逊蔺相如！', '莫使龙骨浊尘埃，销得凤翅金陵钗！'],
                zhengwang: ['岁月干净，如水淡……如酒清……<br><br><br>'],
            },
            design: ['洛', '落影逝尘', '大熊小猫'],
        },
        ywhy_liyuzhen: {
            debug: {
                playerName: '李玉甄',
            },
            taic: {},
            design: ['林曦', '棉花糖', '大熊小猫'],
        },
        ywhy_bixian: {
            debug: {
                playerName: '笔仙',
            },
            taic: {},
            design: ['林曦', '棉花糖', '大熊小猫'],
        },
        ywhy_quyuan: {
            debug: {
                playerName: '屈原',
            },
            taic: {
                ywhy_jiuge: ['固人命兮有当，孰离合兮何为？', '身既死兮神以灵，魂魄毅兮为鬼雄！'],
                ywhy_saoci: ['亦余心之所善兮，虽九死其犹未悔！', '宁溘死而流亡兮，不忍为此之常愁！'],
                zhengwang: ['安能以皓皓之白，而蒙世俗之尘埃乎……<br><br><br>'],
            },
            design: ['蓝', '霸天', '大熊小猫'],
        },
        ywhy_lupan: {
            debug: {
                playerName: '陆判',
            },
            taic: {
                ywhy_mingcao: ['天道好轮回，苍天饶过谁！', '人在做，天在看！', '阴曹有案，请君对证公堂！', '冥间清档，望君前往一叙！'],
                ywhy_huanshou: ['贪彼之美，则斧钺加颈项矣！', '断鹤续凫，矫作者之妄也！'],
                ywhy_yixin_lupan: ['心蕴大慧，何愁不入乡闱？', '易心换首，金榜题名！', '莫言君心塞茅闭窍，天下开窍几人乎？'],
                zhengwang: ['达者观之，生死一耳，何以乐生而悲死……<br><br><br>'],
            },
            design: ['末生', '棉花糖', '吃饱睡睡醒吃'],
        },
        ywhy_zongzi_female: {
            debug: {
                playerName: '粽子',
            },
            taic: {
                ywhy_zongzi_skill: [''],
            },
            design: ['', '落影逝尘', '大熊小猫'],
        },
        ywhy_zongzi_male: {
            debug: {
                playerName: '粽子',
            },
            taic: {
                ywhy_zongzi_skill: [''],
            },
            design: ['', '落影逝尘', '大熊小猫'],
        },
        ywhy_wukong: {
            debug: {
                playerName: '悟空',
            },
            taic: {},
            design: ['千狐', '落影逝尘', '大熊小猫'],
        },
        ywhy_zhaopan: {
            debug: {
                skill: {
                    界限突破情况: {
                        ywhy_shaohe: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_dengdian: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_guiqin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_datong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                    非界限突破情况: {
                        ywhy_shaohe: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_dengdian: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_guiqin: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                        ywhy_datong: '请检查该角色是否有该技能，若为衍生技能则忽略，若为界限突破则是否有界限突破的技能',
                    },
                },
                遗漏: {
                    ywhy_saohe: '注意:请检查是否遗漏了该技能',
                },
                playerName: '赵盘',
            },
            taic: {
                ywhy_fuxian: ['此人口蜜腹剑，实乃心腹大患！', '群雄逐鹿，谁主沉浮？', '咫尺之路，远于天涯！', '大丈夫，岂能偏安偏安一隅？'],
                ywhy_saohe: ['秦王扫六合，虎视何雄哉！', '普天之下，莫非王土，率土之滨，莫非王臣！'],
                ywhy_dengdian: ['尔等从龙之功，朕自有封赏！', '挥剑决浮云，诸侯尽西来！'],
                ywhy_guiqin: ['明断自天启，大略驾群才！', '六国来抗有何惧，今天命当归我大秦！'],
                ywhy_datong: ['万邦往属尽归吾，千秋霸业谈笑间！', '狼烟熄尽，一统江山！'],
                zhengwang: ['朕，终未寻得长生之法……<br><br><br>'],
            },
            design: ['水蓝', '霸天', '大熊小猫'],
        },
        ywhy_songci: {
            debug: {
                playerName: '宋慈',
            },
            taic: {
                ywhy_yangu: ['活人会说谎，尸体却不会！', '夫有死者，穷以验骨方得去伪存真！'],
                ywhy_mieji: ['凡人之所为，必有迹可循！', '天网恢恢，疏而不漏！', '毁尸灭迹者，当以帮凶论罪！', '索引痕迹，水落石出！'],
                ywhy_xiyuan: ['大辟之狱，始于检验！', '每念狱情之失，多起于发端之着、定验之误！'],
                zhengwang: ['天地扬威，镜雪沉冤……<br><br><br>'],
            },
            design: ['水蓝', '吃朵棉花糖', '大熊小猫'],
        },
        ywhy_dongtianbao: {
            debug: {
                playerName: '董天宝',
            },
            taic: {
                ywhy_tougong: ['他日艺成，必建奇功！', '神功傍身，宝剑在手！', '此招，你可识得？', '天下奇功，皆为我用！'],
                ywhy_zhuosheng: ['我命由我，不由天！', '拦我路者，格杀勿论！', '虽为蝼蚁身，当怀鸿鹄志！', '蚍蜉虽小，亦可撼树！', '蝼蚁尚有功成日，欲与诸公试比高！', '雄心万里长，只身荡寰宇！'],
                zhengwang: ['大丈夫追名逐利，何错之有……<br><br><br>'],
            },
            design: ['冬赫', '霸天', '大熊小猫'],
        },
        ywhy_chenzhen: {
            debug: {
                playerName: '陈真',
            },
            taic: {
                ywhy_jingwu: ['枯木浮海，虽巨浪不可御！', '精武之道，首在气节！'],
                ywhy_hanhun: ['寸土寸血，保我河山！', '华夏儿郎，铸我汉魂！'],
                zhengwang: ['济济华冠，竟被列强所欺……<br><br><br>'],
            },
            design: ['冬赫', '霸天、棉花糖', '大熊小猫'],
        },
        ywhy_mengdeer: {
            debug: {
                playerName: '孟德尔',
            },
            taic: {
                ywhy_jianlie: ['龙生九子各不同，虎生三子有一彪！', '万物生长，欣欣向荣！', '种瓜得瓜，种豆得豆！'],
                ywhy_zajiao: ['天才，意味着一生辛勤的劳动！', '优胜劣汰，适者生存！'],
                zhengwang: ['生命不止，代代相传……<br><br><br>'],
            },
            design: ['攀', '棉花糖', '大熊小猫'],
        },
        ywhy_wuqing: {
            debug: {
                playerName: '无情',
            },
            taic: {
                ywhy_jixia: ['藏器于匣，鬼神难定！', '飞花摘叶，信手拈来！', '袖凛摧奸剑拂霜，缉凶除佞纳锋芒！', '好一身横练功夫，可抵得住我这追魂钉？', '寒梅影横斜，香落衔霜发！', '此地早已布下蒺藜，贼寇定无所遁形！', '雀鸣晓天语，顾影玉凰来。'],
                ywhy_taxue: ['蜃光消楼阁，星汉藏乌鹊！', '孤辇乘风去，叶落雪无痕！'],
                zhengwang: ['情之一字，难得始终……<br><br><br>'],
            },
            design: ['酒酿陈玄', '霸天', '大熊小猫'],
        },
        ywhy_libai: {
            debug: {
                playerName: '李白',
            },
            taic: {
                ywhy_qianshang: ['青天有客来几时，我自停杯一问之！', '昔在长安醉花柳，五侯七贵同杯酒！'],
                ywhy_yaoyuejn: ['举杯邀明月，对影成三人！', '人生得意须尽欢，莫使金樽空对月！'],
                ywhy_jianxian: ['十步杀一人，千里不留行！', '苍榛蔽层丘，凤鸟鸣西海！', '纵死侠骨香，不惭世上英！', '精光射天地﹐雷腾不可冲！'],
                zhengwang: ['安能摧眉折腰事权贵……<br><br><br>'],
            },
            design: ['冬赫', '霸天、吃朵棉花糖', '大熊小猫'],
        },
        ywhy_baijuyi: {
            debug: {
                playerName: '白居易',
            },
            taic: {
                ywhy_jiuling: ['荔枝新熟鸡冠色，烧酒初开琥珀香。欲摘一枝倾一盏，西楼无客共谁尝。', '况吾头半白，把镜非不见。何必花下杯，更待他人劝？', '寒宵劝酒君须饮，君是孤眠七十身。', '劝君一盏君莫辞，劝君两盏君莫疑，劝君三盏君始知！'],
                ywhy_changhen: ['回眸一笑百媚生，六宫粉黛无颜色！', '云叠花颜金步摇，芙蓉帐暖度春宵！', '春宵苦短日高起，从此君王不早朝！', '在天愿作比翼鸟，在地愿为连理枝。'],
                zhengwang: ['自从花颜去，秋水无芙蓉……<br><br><br>'],
            },
            design: ['紫衫喵', '吃朵棉花糖', '大熊小猫'],
        },
        ywhy_huoyuanjia: {
            debug: {
                playerName: '霍元甲',
            },
            taic: {
                ywhy_mizong: ['疾迅如风，来去无影！', '迷而不返，是为无踪！'],
                ywhy_shuishi: ['岂其苗裔，不武如斯！', '泱泱大国，让其沦胥？'],
                ywhy_xiongshi: ['睡狮今已醒，祛敌何惶惶！', '敌寇剑及履，雄狮咆百万！'],
                ywhy_shangwu: ['崇文尚武，胆气自生！', '武者，非是好勇斗狠，实为振而兴国！'],
                zhengwang: ['男儿不尚武，河山之将亡……<br><br><br>'],
            },
            design: ['冰霜墨菊', '霸天', '大熊小猫'],
        },
        qtpz_dingbusandingbusi: {
            debug: {
                playerName: '丁不三丁不四',
            },
            taic: {
                qtpz_shadao: ['杀人亦有道，一日不过三！', '该杀就得杀，一日不过四！'],
                qtpz_guijue: ['我言天下多蠢辈，猪牛狗马遍地行。', '犯我其行罪当死，天下无人不可杀！', '丁家兄弟的心思，天下谁人能猜到？'],
                zhengwang: ['小子，这次算爷爷手下留情，下次……<br><br><br>'],
            },
            design: ['末生', '棉花糖', '大熊小猫'],
        },
        ywhy_nieyinniang: {
            debug: {
                playerName: '聂隐娘',
            },
            taic: {
                ywhy_shishi: ['托身白刃里，杀人红尘中！', '不知蝗蠹满天下，苦尽苍生皆王臣！'],
                ywhy_touming: ['先生高义，小女子愿投效以明志！', '孤飞终已倦，请随缘客游。'],
                zhengwang: ['我本闲散客，归去如沙鸥……<br><br><br>'],
            },
            design: ['昭月', '霸天', '大熊小猫'],
        },
        tlbb_zhaoqianshun: {
            debug: {
                playerName: '赵钱孙',
            },
            taic: {
                tlbb_maiming: ['已死之人，无名无姓！', '赵钱孙李周吴郑，天地玄黄宇宙洪！'],
                tlbb_wenguo: ['两国交兵，暗施偷袭，何错之有！', '宋辽争战，互相杀伐，不足为奇！'],
                tlbb_yinxing: ['百劫余生，走肉行尸！', '树上死人能复走，谷底白骨难再言！'],
                zhengwang: ['你！你……还活着……<br><br><br>'],
            },
            design: ['愛の名で', '棉花糖', '大熊小猫'],
        },
        tlbb_kurongdashi: {
            debug: {
                playerName: '枯荣大师',
            },
            taic: {
                tlbb_kuchan: ['有常无常，双树枯荣！', '南北西东，非假非空！'],
                tlbb_shaoshang: ['剑意斜疏，石破天惊！', '剑气纵横，风雨骤至！'],
                tlbb_fenpu: ['六脉神剑已作灰烬，大轮明王，请回罢！', '焚经护国，天龙寺与大理国共存亡！'],
                zhengwang: ['双树入灭，涅槃本相，常乐我净……<br><br><br>'],
            },
            design: ['末生', '霸天', '大熊小猫'],
        },
        sdyx_qulingfeng: {
            debug: {
                playerName: '曲灵风',
            },
            taic: {
                sdyx_pikong: ['劈空神掌，掌不落空！', '此掌无影无形，瞧你如何能躲！'],
                sdyx_daobao: ['西赆南琛献恩师，重回师门待指日！', '飞檐走壁破严防，奇珍异宝唾手得！'],
                zhengwang: ['芦花影落难振剑，钱塘潮生不闻箫……<br><br><br>'],
            },
            design: ['薛晨鸭', '霸天', '大熊小猫'],
        },
        sdyx_wumianfeng: {
            debug: {
                playerName: '武眠风',
            },
            taic: {},
            design: ['星空下木头', '霸天', '大熊小猫'],
        },
        qtpz_shizhongyu: {
            debug: {
                playerName: '石中玉',
            },
            taic: {
                qtpz_xialuan: ['美人若如斯，何不早入怀？哈哈哈哈……', '阿绣妹妹，你我颠鸾倒凤，岂不美哉？'],
                qtpz_guimou: ['瞒神弄鬼，抽身而退！', '瞒天过海，偷梁换柱！'],
                qtpz_mantian: ['替本公子赴死，是你与生俱来的使命！', '不惧飞来祸，自有替罪羊，哼哼！'],
                zhengwang: ['爹爹妈妈，救我，救救我……<br><br><br><br><br><br>'],
            },
            design: ['彻君', '霸天', '大熊小猫'],
        },
        sdyx_xie_yangkang: {
            debug: {
                playerName: '邪杨康',
            },
            taic: {
                sdyx_yinzhua: ['九阴魔爪，开颅取髓！', '十指贯胸，烈爪开膛！', '量小非君子，无毒不丈夫！'],
                sdyx_weidao: ['欲成霸业，安能妇人之仁！', '富贵无极，岂能不冒凶险！', '他日败寇成王定，我自富贵你自贫！'],
                zhengwang: ['父王，不要抛下孩儿……<br><br><br>'],
            },
            design: ['岛主', '霸天、棉花糖', '大熊小猫'],
        },
        qtpz_supu: {
            debug: {
                playerName: '苏普',
            },
            taic: {
                qtpz_xianyi: ['衣不如新，人不如故！', '少年英雄气，驰驹逞鲜衣！'],
                qtpz_numa: ['草原大漠，任我驰骋！', '我等驾此良驹，你已无处可逃！'],
                qtpz_qingcang: ['千里旷野雄鹰健，百兽奔走猎获丰！', '苍鹰翱翔，直入云霄，所猎之物，无处可藏！', '蒙真主庇佑，此次狩猎，必有所获！'],
                zhengwang: ['驾、驾！（远去的马蹄声）<br><br><br><br><br><br>'],
            },
            design: ['佚名', '霸天', '大熊小猫'],
        },
        ywhy_huamanlou: {
            debug: {
                playerName: '花满楼',
            },
            taic: {
                ywhy_bianwei: ['流云飞袖，盈盈万千！', '眼盲心不盲，心盲眼何用！', '路尽隐香处，翩然雪海间。', '落雪飘絮，闻声辨位。'],
                ywhy_zhiming: ['乐天知命，无喜无忧；妙性朗然，其乐难述！', '白云苍狗皆过客，也无欢喜也无愁！', '莫愁千里路，自有到来风！'],
                ywhy_linghua: ['看云卷云舒，听花开花落。', '把酒黄昏后，有暗香盈袖。', '花开花谢花满楼，云聚云散云悠悠！', '鲜花满月水长流，花满心时亦满楼。'],
                zhengwang: ['繁花落尽，物是人非……<br><br><br>'],
            },
            design: ['阿林', '霸天', '大熊小猫'],
        },
        sdxl_huodu: {
            debug: {
                playerName: '霍都',
            },
            taic: {
                sdxl_tuoqiao: ['留得青山在，不怕没柴烧！', '金蝉脱壳，险中求生！', '三十六计，走为上策！', '此仇不报，非君子！'],
                sdxl_juao: ['本王子大驾中原，尔等，为何不跪？', '龙骨为扇，杀人，如狂风迅雷！'],
                sdxl_xianzha: ['你我师徒情分，今日一刀两断！', '什么师父？我是主，你为仆！'],
                zhengwang: ['金蝉脱壳，螳螂在后……<br><br><br><br><br><br>'],
            },
            design: ['药仰', '霸天', '大熊小猫'],
        },
        sdyx_luchengfeng: {
            debug: {
                playerName: '陆乘风',
            },
            taic: {
                sdyx_sixiang: ['卦象变换，易理玄通。', '四阵生克八卦定，四象幻化八方踪。', '恩师所授遁甲之术，乘风一日未敢忘却！'],
                sdyx_chaizhen: ['何方高手，竟破我桃花岛玄门八阵！', '舍却此庄，也要擒住黑风双煞！'],
                sdyx_guiyun: ['欲将心事付瑶琴，知音少，弦断有谁听？', '潮落潮涨赴潮水，云卷云舒待云归。'],
                zhengwang: ['重回师门，此生，梦圆……<br><br><br>'],
            },
            design: ['末生', '霸天', '吃饱睡睡醒吃'],
        },
        ywhy_xiaolong: {
            debug: {
                playerName: '影小龙',
            },
            taic: {
                ywhy_zuibu: ['汉钟离醉步喝奶窝心顶！', '蓝采和单提奶瓶拦腰破！'],
                ywhy_naiquan: ['好奶，好奶！', '你们真没用诶，倒得比我还快！'],
                zhengwang: ['别拦我，我……还能喝……<br><br><br>'],
            },
            design: ['蓦焱', '霸天', '大熊小猫'],
        },
    };
    for (var i in ziliao) {
        lib.jy_player_ziliao[i] = ziliao[i];
    }
    /////////////////////////////////////////////////////////////////////
    var 未定义武将 = {
        sdxl_baiban: {
            debug: {
                playerName: '白板武将',
            },
            taic: {
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
        ywhy_yaojiyuanling: {
            debug: {
                playerName: '妖姬怨灵',
            },
            taic: {
                ywhy_yuandu: ['暂无台词'],
                ywhy_yinqi: ['暂无台词'],
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
        ywhy_shizumingdi: {
            debug: {
                playerName: '始祖冥帝',
            },
            taic: {
                ywhy_kengru: ['暂无台词'],
                ywhy_yinbing: ['暂无台词'],
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
        ywhy_moxiedadi: {
            debug: {
                playerName: '魔蝎大帝',
            },
            taic: {
                ywhy_duao: ['暂无台词'],
                ywhy_yinzhao: ['暂无台词'],
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
        ywhy_fumianceshi: {
            debug: {
                playerName: '负面测试',
            },
            taic: {
                ywhy_fumianjineng: ['暂无台词'],
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
        ywhy_yingzheng: {
            debug: {
                playerName: '嬴政',
            },
            taic: {
                zhengwang: ['暂无台词'],
            },
            design: ['配音', '编程', '设计'],
        },
    };
});
