window.jy_update = {
	version: '2024-07-11',//修改这里 则弹出更新提示
	'2024-07-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色曹娥。",
		],
		players: [
			"ywhy_caoe",
		],
		cards: [
		],
	},
	'2024-07-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色邪桃谷六仙。",
		],
		players: [
			"xajh_xie_taoguliuxian",
		],
		cards: [
		],
	},
	'2024-07-06': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色邪李青萝。",
		],
		players: [
			"tlbb_xie_liqingluo",
		],
		cards: [
		],
	},
	'2024-07-02': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色邪叶二娘。",
		],
		players: [
			"tlbb_xie_yeerniang",
		],
		cards: [
		],
	},
	'2024-06-24': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色阿二阿三。",
		],
		players: [
			"yttl_aerasan",
		],
		cards: [
		],
	},
	'2024-06-23': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色王难姑、游骥游驹。",
		],
		players: [
			"tlbb_youjiyouju",
			"yttl_wangnangu",
		],
		cards: [
		],
	},
	'2024-06-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色南怀仁汤若望。",
		],
		players: [
			"ldj_nanhuairentangruowang",
		],
		cards: [
		],
	},
	'2024-06-15': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色童百熊。",
		],
		players: [
			"xajh_tongbaixiong",
		],
		cards: [
		],
	},
	'2024-06-10': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色余人彦。",
		],
		players: [
			"xajh_yurenyan",
		],
		cards: [
		],
	},
	'2024-06-09（2）': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色无色禅师；",
			"部分技能addSkillLog改为addSkills",
			"部分技能addSkill改为addSkills",
			"部分技能removeSkillLog改为removeSkills",
			"部分技能removeSkill改为removeSkills",
			"部分技能addTempSkill改为addTempSkills",
			"部分技能removeSkill改为removeSkills",
			"部分技能addAdditionalSkill改为addAdditionalSkills",
			"部分技能removeAdditionalSkill改为removeAdditionalSkills",
			"获得帮派技能添加专属触发节点gainSkillBangPai",
		],
		players: [
			"sdxl_wusechanshi",
		],
		cards: [
		],
	},
	'2024-06-08': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色阿绣。",
		],
		players: [
			"qtpz_axiu",
		],
		cards: [
		],
	},
	'2024-06-07': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色陆无双。",
		],
		players: [
			"sdxl_luwushuang",
		],
		cards: [
		],
	},
	'2024-06-04': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色邪黛绮丝。",
		],
		players: [
			"yttl_xie_daiqisi",
		],
		cards: [
		],
	},
	'2024-06-01': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色尼摩星。",
		],
		players: [
			"sdxl_nimoxing",
		],
		cards: [
		],
	},
	'2024-05-31': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色李玉甄（含衍生角色笔仙）；",
			"界限突破红娘子、骆冰、令狐冲、哪吒等角色。",
		],
		players: [
			"ywhy_liyuzhen",
			"ywhy_bixian",
		],
		cards: [
		],
	},
	'2024-05-25': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色武眠风；",
			"整增加角色页面UI盗墓笔记（测试）；",
			"整合文件。",
		],
		players: [
			"sdyx_wumianfeng",
		],
		cards: [
		],
	},
	'2024-05-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色风波恶",
			"整合火麒麟；",
		],
		players: [
			"tlbb_fengboe",
		],
		cards: [
		],
	},
	'2024-05-13（2）': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"增加新角色绝狄云",
			"将毒龙银鞭的技能给到倚天剑，毒龙银鞭换成可以转化普通杀为邪杀；",
			"增加武器冷月宝刀（可以将普通杀转化为冰杀）；",
		],
		players: [
			"qtpz_jue_diyun",
		],
		cards: [
			"jydiy_lengyuebaodao",
		],
	},
	'2024-05-13': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"将毒龙银鞭的技能给到倚天剑，毒龙银鞭换成可以转化普通杀为邪杀；",
			"增加武器冷月宝刀（可以将普通杀转化为冰杀）；",
		],
		players: [
		],
		cards: [
			"jydiy_lengyuebaodao",
		],
	},
	'2024-05-05': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"添加voics.js适配无名杀下版本台词库",
			"修改角色界面适配下版本无名杀台词库",
			"部分技能添加audioname",
		],
		players: [
		],
		cards: [
		],
	},
	////////////////
	'2024-05-0201': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			"修改武将前缀 前缀大于一个的不加载",
			"调整赵钱孙",
			"调整有关重铸卡牌的技能",
			"补充部分武将缺失的SP前缀",
			"调整武松技能",
		],
		players: [
		],
		cards: [
		],
	},
	'2024-04-29': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪谢逊。',
		],
		players: [
			"yttl_xie_xiexun",
		],
		cards: [
		],
	},
	'2024-04-28': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色韦一笑（使用SP韦一笑的插画，SP韦一笑另用原画）。',
		],
		players: [
			"yttl_xie_weiyixiao",
		],
		cards: [
		],
	},
	'2024-04-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色成昆（原成昆改名为圆真）。',
		],
		players: [
			"yttl_chengkun",
		],
		cards: [
		],
	},
	'2024-04-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色韦小宝。',
		],
		players: [
			"ldj_jue_weixiaobao",
		],
		cards: [
		],
	},
	'2024-04-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪欧阳锋（暂无透骨）。',
		],
		players: [
			"sdyx_xie_ouyangfeng",
		],
		cards: [
		],
	},
	'2024-04-15': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪左冷禅；',
			'完善陆乘风的【拆阵】。',
		],
		players: [
			"xajh_xie_zuolengchan",
		],
		cards: [
		],
	},
	'2024-04-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色吴之荣（暂无插画）；',
			'完善陆乘风的【拆阵】。',
		],
		players: [
			"ldj_wuzhirong",
		],
		cards: [
		],
	},
	'2024-04-03': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色格伦（2023年度中元节专属）；',
			'补充角色白蛟（白蛇的衍生角色）。',
		],
		players: [
			"ywhy_gelun",
			"ywhy_baijiao",
		],
		cards: [
		],
	},
	'2024-04-01': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色贝特多特（2023年度万圣节专属）；',
			'修复法海【降妖】；',
			'修复其他内容。',
		],
		players: [
			"ywhy_beiteduote",
		],
		cards: [
		],
	},
	'2024-03-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色福临、段誉王语嫣。',
		],
		players: [
			"ldj_fulin",
			"tlbb_duanyuwangyuyan",
		],
		cards: [
		],
	},
	//////////////	
	'2024-03-12': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'添加shunshou_ai卡牌用于懒汉式顺手判断',
			'添加guohe_ai卡牌用于懒汉式拆迁判断',
			'修改部分技能顺手拆迁逻辑',
		],
		players: [
		],
		cards: [
		],
	},
	'2024-03-10': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修改添额外装备的方法',
			'属性闪酒配音适配',
			'修改额外出牌阶段的技能',
			'修改调整回合顺序的技能',
		],
		players: [
		],
		cards: [
		],
	},
	'2024-03-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修改添加属性杀的方法 废弃修改lib.element.card.init的方法',
			'修改添加势力的方法',
			'增加半成品前缀美化  添加prefix.js',
			'废弃使用contains方法 修改为includes',
			'废弃阵亡配音的全局技能',
		],
		players: [
		],
		cards: [
		],
	},
	'2023-08-29': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色董鄂妃。',
		],
		players: [
			"ldj_dongefei",
		],
		cards: [
			"sha",
		],
	},
	'2023-08-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色紫霞仙子。',
		],
		players: [
			"ywhy_zixia",
		],
		cards: [
			"ywhy_ziqingbaojian",
		],
	},
	'2023-08-14': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色梅兰竹菊。',
		],
		players: [
			"tlbb_meilanzhuju",
		],
		cards: [
		],
	},
	'2023-08-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色包来硬；添加姬昌、绿竹翁配音。',
		],
		players: [
			"ywhy_baolaiying",
		],
		cards: [
		],
	},
	'2023-08-03': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加绝虚竹配音；添加皮肤评级、显示画师信息功能（感谢西野七濑大佬技术支持）。',
		],
		players: [
		],
		cards: [
		],
	},
	'2023-07-31': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色戚长发（其他篇章：连城诀）。',
		],
		players: [
			"qtpz_qichangfa",
		],
		cards: [
		],
	},
	'2023-07-30（2）': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色姬昌（电影《封神第一部》）；',
			'新增角色苏木（电影《八角笼中》）。',
		],
		players: [
			"ywhy_jichang",
			"ywhy_sumu",
		],
		cards: [
		],
	},
	'2023-07-28': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪岳不群。',
		],
		players: [
			"xajh_xieyuebuqun",
		],
		cards: [
			"jydiy_bixiejianpu",
		],
	},
	'2023-07-25': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色言达平【煽斗】。',
		],
		players: [
			"qtpz_yandaping",
		],
		cards: [
		],
	},
	'2023-07-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色绝袁崇焕。',
		],
		players: [
			"ywhy_guohuai",
		],
		cards: [
		],
	},
	'2023-07-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色郭槐；',
			'增加赫连铁树、邪杨康配音。',
		],
		players: [
			"ywhy_guohuai",
		],
		cards: [
		],
	},
	'2023-07-19': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪康敏；',
			'增加尼奥配音。',
		],
		players: [
			"tlbb_xie_kangmin",
		],
		cards: [
		],
	},
	'2023-07-18': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色赫连铁树；',
			'增加邪公孙止、霍都、向问天配音。',
		],
		players: [
			"tlbb_heliantieshu",
		],
		cards: [
		],
	},
	'2023-07-17': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色绿竹翁。',
		],
		players: [
			"xajh_lvzhuwong",
		],
		cards: [
		],
	},
	'2023-07-14': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色绝石破天、绝王重阳。',
		],
		players: [
			"sdxl_jue_wangchongyang",
			"qtpz_jue_shipotian",
		],
		cards: [
		],
	},
	'2023-07-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色绝虚竹。',
		],
		players: [
			"tlbb_jue_xuzhu",
		],
		cards: [
		],
	},
	'2023-07-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪公孙止（解情待完成）；',
			'补充丁不三丁不四配音；',
			'更换帮派技详情页面UI。',
		],
		players: [
			"sdxl_xie_gongsunzhi",
		],
		cards: [
		],
	},
	'2023-07-08': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色聂风。',
		],
		players: [
			"ywhy_niefeng",
		],
		cards: [
		],
	},
	'2023-07-05': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色邪任我行。',
		],
		players: [
			"xajh_xie_renwoxing",
		],
		cards: [
		],
	},
	'2023-07-04': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'优化完成暗器牌库（测试期，请在卡牌界面开启“暗器牌”）；',
			'突破魔蝎大帝技能【阴招】。',
		],
		players: [
		],
		cards: [
		],
	},
	'2023-06-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新侠客雄霸（暂无谶言）、邪周芷若（刀光）；',
		],
		players: [
			"ywhy_xiongba",
			"yttl_xie_zhouzhiruo",
		],
		cards: [
		],
	},
	'2023-06-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新侠客汪剑通；；',
			'增加宠物阿黄狗（石破天的宠物）；',
			'增加邪血刀老祖配音、为行尸角色添加配音。',
		],
		players: [
			"tlbb_wangjiantong",
			"jycw_ahuanggou",
		],
		cards: [
		],
	},
	'2023-06-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加潇湘子尹克西、燕赤霞；',
			'增加玄苦、邪赵敏配音。',
		],
		players: [
			"ywhy_yanchixia",
			"sdxl_xiaoxiangziyinkexi",
		],
		cards: [
		],
	},
	'2023-06-20（2）': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加史麦戈、咕噜插画；',
			'增加巨蝮蛇插画；',
			'增加绝洪七公配音。',
		],
		players: [
		],
		cards: [
		],
	},
	'2023-06-20': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加巨蝮蛇，',
			'现在不开启宠物包只是牌堆不洗入宠物精灵',
			'避免其他与宠物有关的技能产生bug',
			'修复天逆ai bug',
			'修复无情不触发将牌置入武将牌时机的 bug',
			'优化其他技能',
		],
		players: [
		],
		cards: [
		],
	},
	'2023-06-19': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增史麦戈、咕噜；补充邪慕容复、无情、聂隐娘配音。',
		],
		players: [
			"ywhy_shimaige",
			"ywhy_gulu",
		],
		cards: [
			"ywhy_zhizunmojie"
		],
	},
	'2023-06-15（2）': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增马钰、乌老大；青蛇（端午节专属角色）；增加霍元甲配音。',
		],
		players: [
			"ywhy_qingshe",
			"sdyx_mayu",
			'tlbb_wulaoda',
		],
		cards: [
		],
	},
	'2023-06-10': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'调整武将技能',
		],
		players: [
			"sdyx_shagu",
			"yttl_weiyixiao",
		],
		cards: [
		],
	},
	'2023-06-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'调整武将技能',
		],
		players: [
			"sdyx_kezhene",
			"sdxl_jinlunfawang",
			"yttl_changyuchun",
		],
		cards: [
		],
	},
	'2022-12-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'调整【圣婴】【精甲】。',
			'【斡旋】ai调整',
			'修改【结党】',
			'其他技能代码微调',
		],
	},
	'2022-12-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'调整凤天南【豪夺】。',
			'完成绝杨改之。',
		],
	},
	'2022-12-21-2': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加场景【精绝古城】。',
			'调整绝杨改之。',
		],
	},
	'2022-12-20': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复小虾米弹窗；',
			'增加交换牌堆的时机；',
			'优化《迁移》；',
			'修复邪慕容复BUG；',
			'增加宠物【九尾灵狐】；',
		],
	},
	'2022-11-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色汤沛；',
		],
	},
	'2022-09-20': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加角色【邪蛛儿】。',
		],
	},
	'2022-09-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加角色【扎木合】。',
		],
	},
	'2022-09-06': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加中秋限定角色【嫦娥】，金庸群侠传祝所有玩家阖家团圆、幸福安康！',
		],
	},
	'2022-09-01': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加庞斑。',
		],
	},
	'2022-08-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加邪慕容复。',
		],
	},
	'2022-08-16': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加邪血刀老祖【邪尊】；修复铁手。',
		],
	},
	'2022-08-12': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加中元节限定角色秋容【幻术】。',
		],
	},
	'2022-08-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加皮肤显示称号的功能；',
			'增加新角色窝阔台；',
			'修改拓疆、双刀、贪嗔等技能。',
		],
	},
	'2022-08-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成邪杨康技能【阴爪】；',
			'调整场景技【万卷】时机；',
			'调整真武剑、负隅AI。',
		],
	},
	'2022-08-04': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'优化真武剑，不需要再逐张选牌；',
			'石中玉的诡谋调整为每轮一次；',
			'增加七夕限定角色牛郎织女【梦莹】【鹊桥】技能；',
			'增加三首BGM。',
		],
	},
	'2022-07-28': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加武当山场景技参悟；',
			'完成邪赵敏技能【劫亲】；',
			'$logskill大改；',
			'补充卡牌素材，请到后台一键点击安装卡牌；',
		],
	},
	'2022-07-25': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复页面弹窗、修复BUG、增加宠物模式；',
		],
	},
	'2022-07-24': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复TAICi；',
			'完成孟德尔技能。',
		],
	},
	'2022-07-23': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成新角色绝洪七公；',
			'增加新角色邪赵敏；',
			'调整部分卡牌技能。',
		],
	},
	'2022-07-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色绝洪七公；',
		],
	},
	'2022-07-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色心砚（陈家洛书童、红花会第15当家）；',
		],
	},
	'2022-07-15': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色梅超风；',
			'增加帮派技【行刺】；',
			'修复、补充一堆素材；',
		],
	},
	'2022-07-14': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色山上徹也；',
			'修复向问天营救、韦氏后宫逢源；',
		],
	},
	'2022-07-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色向问天；',
		],
	},
	'2022-07-05': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复李白剑仙、调整削弱苏普擎苍、突破SP阿紫；',
		],
	},
	'2022-07-01': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成空见、玄苦；',
		],
	},
	'2022-06-25': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加陆乘风、苗若兰。',
		],
	},
	'2022-06-19': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'界限突破小昭、石破天；优化海大富。',
		],
	},
	'2022-06-18': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'界限突破东方不败、SP东方不败。',
		],
	},
	'2022-06-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成韩小莹、增加石中玉【狎乱】。',
		],
	},
	'2022-06-03': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加帮派技：丐帮、泰山派；',
			'修复SP周芷若弹窗、修复横刀AI；',
		],
	},
	'2022-05-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'突破黛绮丝、金花婆婆等；',
			'增加新角色乐厚（嵩山派）；',
		],
	},
	'2022-05-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加龙木岛主、玄苦；调整伍子胥、完善李文秀；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加绝逍遥子【长春】；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新角色苏普；',
			'补充耶律涅鲁古、韦氏后宫配音；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-17-2': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新绝：渡厄渡劫渡难；',
			'增加韦氏后宫技能：玲珑；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-17': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加苏菲亚配音；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-15-2': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加说不得配音；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-15': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'角色韦氏后宫；界限突破SP玄冥二老；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-14-1': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加韦氏后宫的技能惊鸿、冤种、秀外，但还未建立角色；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-14': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加阳顶天、汝阳王（部分）配音；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-12-2': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加场景技绝酒（聚贤庄）、加强十香软筋散；',
			'界限突破王承恩、丁典；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加柳朗月、春三十娘、绝欧阳锋(不完整)、少年包拯配音；',
			'修复大量角色配音、台词不显示问题；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-10': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加铁手；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-09': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加场景技素材，在后台一键安装；',
			'增加李文秀的【专情】；',
			'增加场景技夺帅；',
			'优化小虾米；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-08': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加聂隐娘；',
			'增加场景模式；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-06': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复幕篱BUG；',
			'增加场景模式；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-04': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加崔百泉、左子穆辛双清、张君宝、林震南、万震山、小龙、石清露、小倩配音；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-05-02': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加绝欧阳锋【流毒】、小虾米【野球】；',
			'《以武会友》分类细化；',
			'界限突破：左冷禅、谢烟客；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'补充古墓派帮派技【双修】；',
			'增加新角色少年包拯技能【演绎】；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-28': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成上官剑南；',
			'增加帮派：后宫，技能为【勾心】，代表角色：建宁、海大富、王承恩、魏忠贤等；',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-27': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复武将评级；',
			'柳朗月优化强化；',
			'邱莫言界限突破；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-25': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完善李白技能（增加五种酒）；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-24': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完善李白技能；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-23': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加暑假限定角色：孟德尔；',
			'增加角色：柳朗月、李白；',
			'完成林震南技能；',
			'增加儿童节专属角色：小龙（暂未完结）；',
			'萧峰帮派调整为游侠；小龙帮派调整为少林；智光大师调整为游侠；',
			'增加武器：金丝大环刀；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-22': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加角色：林震南、始祖冥帝、魔蝎大帝（测试）；',
			'增加武器：金丝大环刀；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-21': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'以武会友新增分类《怪形入侵》；',
			'增加轻功闪（相较普通闪，多了附加技能；先到后台一键安装卡牌重启）；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-20': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加侠客说不得（测试）；',
			'修复纳兰元述【师夷】；',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-17': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加侠客空见（目前拥有技能【铁躯】）。',
			'界限突破：周伯通。',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-16': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'优化林平之技能。',
			'完善技能描述。',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-14': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'界限突破郭靖、任我行。',
			'增加负面技能库的函数jy_fmSkills。',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-13': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加负面技能库的函数jy_fmSkills。',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-12': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'金丝大环刀回归。',
			'切换角色页面UI不需要再重启即可生效了，也不担心更新被覆盖风格选项了，感谢西野大佬技术支持。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-11': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加帮派技【修真】（白素贞等神话角色专属帮派技）。',
			'增加新角色汝阳王（倚天屠龙记——赵敏之父）。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-10': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加小丑、都大锦、智光大师配音。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-08': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'完成小丑的【王牌】，需要到后台安装一键卡牌素材；',
			'修复大量角色台词和配音错位问题、无台词问题；',
			'优化SP阳顶天的【牵移】。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-06': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加SP阳顶天尝鲜版牵移；',
			'优化角色页面《十周年UI》。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-05 21:30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增角色春三十娘；',
			'新增角色SP阳顶天（暂有2个技能）；',
			'优化角色页面：十周年UI。',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-05': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'补充新角色的资料、台词等',
			'修复部分配音不触发的问题',
			'新增背景音乐何为永恒、俩俩相忘、随缘',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-03 22：55': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'新增愚人节限定角色小丑（暂时只有一个技能）',
			'增加页面UI《大海海棠》',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-03': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复bug',
			'调整大量技能描述',
			'卡牌名字添加【】',
			'技能名字添加〖〗',
			'可能有遗漏',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-04-02': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'修复bug',
			'微调师夷',
			'调整技能描述',
			'调整到神雕侠侣',
			'没时间调整了',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-03-31': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加新武将纳兰元述',
			'回复金丝背心、回复金丝大环刀，需重装一键安装卡牌',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-03-30': { //这里的日期与上面的 version 的日期保持一致 就会显示这个日期的更新内容了//
		changeLog: [
			'增加左子穆辛双清',
			'复制素材选项添加进度条功能',
			'完善技能描述中的卡牌和技能名添加括号，方便检索',
			'界限突破',
			'修复装备bug',
			'bug修复',
			'新版更新记录',
			'新增update.js',
			'以后的更新记录就在update.js改就行了',
			'以下测试用',
		],
		players: [
			'sdxl_daerba',
			'sdxl_wudunruwuxiuwen',
			'sdxl_huodu',
			'guojia',
			'lvbu',
		],
		cards: [
			'sha',
			'shan',
			'tao',
			'jiu',
		],
	},
	//以下为旧的旧的更新日志，以后再也不怕没更新记录了
	'2022-03-11': {
		changeLog: [
			'界限突破',
			'修复装备bug',
			'bug修复',
			'bug修复',
			'新版更新记录',
			'新增update.js',
			'以下测试用',
		],
		players: [
		],
		cards: [
		],
	},
	'2022-03-1': {
		changeLog: [
		],
		players: [
		],
		cards: [
		],
	},
};
