'use strict';
qyhcCL.arenaReady.push((lib, game, ui, get, ai, _status, config) => {
    qyhcCL.YinWen = function (result) {
        qyhcCL.Trans = {};
        //十分感谢@这就是秋夜所整理的称号专栏,我仅需用正则表达式进行替换就能得到部分称号,专栏链接:https://www.bilibili.com/read/cv3599213
        //十分感谢@紫髯的小乔的@紫髯的小号的紫乔图鉴,令我可批量得知部分武将称号,专栏链接:https://www.bilibili.com/read/cv3599213
        var titleMap = {
            周处: '英情天逸',
            王濬: '舳舻覆江',
            刘徽: '周天古率',
            吴苋: '庄姝晏晏',
            孙邵: '廊庙之才',
            辛评: '全忠尽节',
            邓艾: '壮士解腕',
            丁原: '饲虎成患',
            周妃: '温玉软香',
            李异谢旌: '踵蹑袭进',
            滕芳兰: '铃兰凋落',
            贾逵: '肃齐万里',
            陆凯: '青辞宰辅',
            庞会: '临渭亭侯',
            王粲: '溢才捷密',
            吴懿: '建兴鞍辔',
            阮瑀: '斐章雅律',
            陈矫: '渊清玉絜',
            杨芷: '武悼皇后',
            芮姬: '柔荑弄钺',
            夏侯紫萼: '孤草飘零',
            廖化: '历尽沧桑',
            司马昭: '嘲风开天',
            王祥: '邦国不空',
            法正: '季汉辅翼',
            荀彧: '王佐之才',
            童渊: '凤鸣麟出',
            樊稠: '庸生变难',
            姜维: '龙的衣钵',
            陈登: '湖海豪气',
            祝融: '野性女王',
            贾充: '凶凶踽踽',
            徐晃: '亚夫之风',
            马超: '一骑当千',
            杨婉: '融沫之鲡',
            荀采: '怀刃自誓',
            赵统赵广: '效捷致果',
            曹操: '魏武大帝',
            司马懿: '断狱仲达',
            曹真: '佳人子丹',
            夏侯渊: '绝尘妙才',
            夏侯惇: '枯目元让',
            张郃: '巧魁儁乂',
            卧龙诸葛: '天候孔明',
            贾诩: '冷酷的毒士',
            魏贾诩: '算无遗策',
            关羽: '翊汉云长',
            刘备: '烈帝玄德',
            赵云: '扶危子龙',
            庞统: '浴火士元',
            黄月英: '工神月英',
            荀粲: '分钗断带',
            孙休: '兴学重教',
            郭嘉: '天生奉孝',
            许褚: '虎痴',
            张辽: '百计文远',
            甄姬: '薄幸美人',
            李典: '深明大义',
            张飞: '万夫莫当',
            马超: '一骑当千',
            徐庶: '化剑为犁',
            孙权: '虎踞江东',
            孙尚香: '弓腰姬',
            大乔: '矜持之花',
            黄盖: '轻身为国',
            周瑜: '大都督',
            吕蒙: '吴下阿蒙',
            华佗: '神医',
            貂蝉: '绝世舞姬',
            华雄: '飞扬跋扈',
            吕布: '武的化身',
            袁术: '野心渐增',
            公孙瓒: '白马将军',
            伊籍: '礼仁同渡',
            曹仁: '鬼神之勇',
            黄忠: '万军取首',
            魏延: '好战独狼',
            小乔: '矫情之花',
            周泰: '历战之躯',
            于吉: '太平道人',
            张角: '天公将军',
            神关羽: '鬼神再临',
            神吕蒙: '圣光之国士',
            典韦: '古之恶来',
            荀彧: '王佐之才',
            太史慈: '笃烈之士',
            颜良文丑: '虎狼兄弟',
            袁绍: '高贵的名门',
            庞德: '人马一体',
            神周瑜: '赤壁的火神',
            神诸葛亮: '赤壁的妖术师',
            曹丕: '存道辟业',
            孟获: '勒格诗惹',
            祝融: '野性女王',
            鲁肃: '系盟子敬',
            孙策: '暴虎伯符',
            神曹操: '超世之英杰',
            神吕布: '修罗之道',
            甘宁: '折冲兴霸',
            周瑜: '英隽公瑾',
            陆逊: '驭火伯言',
            孙坚: '江东猛虎',
            董卓: '魔王',
            刘禅: '素丝无常',
            张昭张纮: '经天纬地',
            左慈: '谜之仙人',
            神赵云: '神威如龙',
            神司马懿: '晋国之祖',
            蒯越蒯良: '雍论臼谋',
            王基: '经行合一',
            王平: '兵谋以致用',
            严颜: '断头将军',
            陆绩: '瑚琏之器',
            孙亮: '寒江枯木',
            卢植: '国之桢干',
            许攸: '朝秦暮楚',
            毌丘俭: '镌功铭征荣',
            郝昭: '扣弦的豪将',
            陈到: '白毦督',
            诸葛瞻: '临难死义',
            周妃: '软玉温香',
            陆抗: '社稷之瑰宝',
            张绣: '北地枪王',
            神刘备: '誓守桃园义',
            神陆逊: '红莲业火',
            神甘宁: '江表之力牧',
            神张辽: '雁门之刑天',
            张春华: '此心孤寂',
            曹植: '八斗之才',
            于禁: '讨暴坚垒',
            于禁: '魏武之刚',
            马谡: '怀才自负',
            凌统: '豪情烈胆',
            徐盛: '整军经武',
            徐盛: '江东铁壁',
            吴国太: '武烈皇后',
            陈宫: '刚直壮烈',
            高顺: '攻无不克',
            荀攸: '曹魏谋主',
            曹彰: '黄须儿',
            王异: '决意巾帼',
            钟会: '桀骜野心',
            关兴张苞: '将门虎子',
            廖化: '历尽沧桑',
            马岱: '临危受命',
            步练师: '无冕之后',
            程普: '三朝虎臣',
            韩当: '石城侯',
            华雄: '魔将',
            刘表: '跨蹈汉南',
            曹冲: '仁爱神童',
            满宠: '政法兵谋',
            郭淮: '垂问秦雍',
            关平: '忠臣孝子',
            简雍: '优游风议',
            刘封: '骑虎之殇',
            潘璋马忠: '擒龙伏虎',
            虞翻: '狂直之士',
            朱然: '不动之督',
            伏皇后: '孤注一掷',
            李儒: '魔仕',
            陈群: '万世臣表',
            韩浩史涣: '中军之主',
            张松: '怀璧待凤仪',
            吴懿: '建兴鞍辔',
            周仓: '披肝沥胆',
            孙鲁班: '为虎作伥',
            朱桓: '中洲拒天人',
            顾雍: '庙堂玉磬',
            蔡夫人: '襄江的蒲苇',
            沮授: '监军谋国',
            曹叡: '天资明君',
            曹休: '千里骐骥',
            蔡文姬: '异乡的孤女',
            乐蔡文姬: '胡笳十八拍',
            武诸葛亮: '忠武良弼',
            钟繇: '正楷萧曹',
            刘谌: '血荐轩辕',
            夏侯氏: '采缘撷睦',
            张嶷: '通壮逾古',
            孙休: '弥殇景君',
            全琮: '慕势耀族',
            朱治: '王事靡盬',
            公孙渊: '狡徒悬海',
            郭图逄纪: '凶蛇两端',
            郭皇后: '月华驱霾',
            孙资刘放: '服谗搜慝',
            李严: '矜风流务',
            黄皓: '便辟佞慧',
            孙登: '才高德茂',
            岑昏: '伐梁倾瓴',
            刘虞: '甘棠永固',
            张让: '窃幸绝禋',
            嵇康: '峻峰孤松',
            辛宪英: '名门智女',
            秦宓: '彻天之舌',
            薛综: '彬彬之玊',
            徐氏: '节义双全',
            蔡邕: '大鸿儒',
            曹节: '献穆皇后',
            甘夫人: '昭烈皇后',
            丁奉: '清侧重臣',
            乐进: '奋强突固',
            纪灵: '仲家的主将',
            孔融: '凛然重义',
            马腾: '驰骋西陲',
            潘凤: '联军上将',
            田丰: '河北瑰杰',
            邹氏: '惑心之魅',
            曹洪: '魏之福将',
            蒋琬费祎: '社稷股肱',
            蒋钦: '祁奚之器',
            何太后: '弄权之蛇蝎',
            于吉: '魂绕左右',
            臧霸: '节度青徐',
            糜夫人: '乱世沉香',
            陈武董袭: '壮怀激烈',
            张任: '索命神射',
            卞夫人: '奕世之雍容',
            沙摩柯: '五溪蛮王',
            马谡: '帷幄经谋',
            吕范: '忠笃亮直',
            李傕郭汜: '犯祚倾祸',
            崔琰毛玠: '日出月盛',
            卑弥呼: '亲魏倭王',
            曹昂: '取义成仁',
            诸葛诞: '薤露蒿里',
            张星彩: '敬哀皇后',
            步骘: '积跬靖边',
            刘协: '受困天子',
            司马朗: '再世神农',
            董允: '骨鲠良相',
            诸葛瑾: '联盟的维系者',
            张鲁: '政宽教惠',
            刘焉: '裂土之宗',
            杜畿: '卧镇京畿',
            严畯: '志存补益',
            戏志才: '负俗的夭才',
            孙乾: '折冲樽俎',
            潘濬: '方严疾恶',
            王粲: '七子之冠冕',
            文聘: '坚城宿将',
            马忠: '笑合南中',
            糜竺: '挥金追义',
            贺齐: '马踏群峦',
            吕岱: '清身奉公',
            刘繇: '宗英外镇',
            周鲂: '下发载义',
            关银屏: '武姬',
            马云騄: '剑胆琴心',
            祖茂: '碧血染赤帻',
            踏顿: '北狄王',
            张梁: '人公将军',
            吕虔: '恩威并诸',
            曹洪: '福将',
            陈琳: '破竹之咒',
            程昱: '泰山捧日',
            李通: '万亿吾独往',
            鲁芝: '夷夏慕德',
            王朗: '凤鹛',
            杨修: '恃才放旷',
            鲍三娘: '平南之巾帼',
            关索: '倜傥孑侠',
            马良: '白眉智士',
            夏侯霸: '棘途壮志',
            赵襄: '拾梅鹊影',
            诸葛果: '凤阁乘烟',
            大乔小乔: '江东之花',
            阚泽: '慧眼的博士',
            孙皓: '时日曷丧',
            孙鲁育: '舍身饲虎',
            诸葛恪: '兴家赤族',
            董白: '魔姬',
            伏完: '沉毅的国丈',
            灵雎: '情随梦逝',
            麹义: '名门的骁将',
            士燮: '雄长百越',
            司马徽: '水镜先生',
            王允: '忠魂不泯',
            兀突骨: '霸体金刚',
            严白虎: '豺牙落涧',
            张宝: '地公将军',
            曹婴: '龙城凤鸣',
            蒋干: '江淮之器',
            徐荣: '玄菟战魔',
            张济: '威武雄豪',
            李傕: '奸谋恶勇',
            郭汜: '党豺为虐',
            唐咨: '工学之奇才',
            黄权: '道绝殊途',
            苏飞: '与子同袍',
            刘琦: '居外而安',
            卑弥呼: '亲魏倭王',
            张恭: '西域长歌',
            吕凯: '永昌烈臣',
            卫温诸葛直: '帆至夷州',
            张琪瑛: '禳祷西东',
            曹纯: '虎豹骑首',
            沙摩柯: '五奚蛮夷',
            许贡: '独计击流',
            忙牙长: '蛮王上勇',
            崔琰: '伯夷之风',
            皇甫嵩: '志定雪霜',
            韩遂: '蹯踞西疆',
            何进: '色厉内荏',
            牛金: '独进的兵胆',
            淳于琼: '昔袍今臣',
            高览: '诽殇之柱',
            审配: '正南义北',
            董越: '东中郎将',
            牛辅董翓: '蛇夫蝎妇',
            华雄: '飞扬跋扈',
            神姜维: '怒鳞布武',
            神马超: '神威天将军',
            神张飞: '两界大巡环使',
            神张角: '末世的起首',
            神曹丕: '诰天仰颂',
            神甄姬: '洛水凌波',
            神郭嘉: '星月奇佐',
            神荀彧: '洞心先识',
            神孙策: '踞江鬼雄',
            神太史慈: '义信天武',
            神貂蝉: '欲界非天',
            神邓艾: '带砺山河',
            尹夫人: '委身允翕',
            吴班: '豪侠督进',
            荀淑: '长儒赡宗',
            韩韶: '分投急所',
            韩融: '虎口扳渡',
            司马师: '岳镇开宇',
            张虎乐綝: '遗风余烈',
            王元姬: '文明皇后',
            杜预: '文成武德',
            司马伷: '兵羁石头',
            石苞: '从公于迈',
            卫瓘: '一笔靖乱',
            郭槐: '妒海推波',
            羊祜: '德亘江流',
            魏关羽: '汉寿亭侯',
            董翓: '魔女',
            马元义: '黄天擎炬',
            赵俨: '扬历干功',
            孙茹: '呦呦鹿鸣',
            笮融: '刺血济饥',
            王瓘: '假降误撞',
            刘辩: '弘农怀王',
            张华: '双剑化龙',
            卞喜: '伏龛蛇影',
            杜袭: '平阳乡侯',
            王烈: '通识达道',
            赵昂: '剜心筑城',
            梁兴: '凶豺掠豹',
            李彦: '暴虎冯河',
            杨彪: '德彰海内',
            难升米: '率善中郎将',
            傅肜: '矢忠不二',
            张芝: '草圣',
            向朗: '校书翾翻',
            孟节: '万安隐者',
            王越: '驭龙在天',
            阮籍: '命世大贤',
            冯方: '监彻京师',
            秦朗: '跼高蹐厚',
            李遗: '伏被俞元',
            杜夔: '律吕调阳',
            曹爽: '骄奢跋扈',
            桥玄: '泛爱博容',
            吾彦: '断浪南竹',
            夏侯令女: '女义如山',
            张媱: '琼楼孤蒂',
            南华老仙: '冯虚御风',
            乐就: '仲家军督',
            管亥: '掠地劫州',
            张虎: '击艮援懿',
            王淩: '风节格尚',
            王凌: '风节格尚',
            赵嫣: '霞蔚青歇',
            胡昭: '阖门守静',
            段煨: '凉国之英',
            樊稠: '庸生变难',
            牛辅: '魔郎',
            牛辅董翓: '虺伴蝎行',
            张横: '戾鹘枭鹰',
            唐姬: '弘农王妃',
            张昌蒲: '矜严明训',
            辛毗: '一节肃六军',
            张温: '抱德炀和',
            韩猛: '锥锋不虞',
            吕旷吕翔: '数合斩将',
            赵忠: '骄纵窃幸',
            穆顺: '疾风劲草',
            李采薇: '啼雨孤鸯',
            孟达: '据国向己',
            糜芳傅士仁: '进退维谷',
            孙狼: '恶惮远役',
            是仪: '清恪贞佐',
            杜夫人: '沛王太妃',
            胡班: '血火照路',
            关宁: '承义秉文',
            胡金定: '怀子求怜',
            秦宜禄: '尘垢粃糠',
            王威: '苍心辟道',
            庞德公: '德懿举世',
            张宁: '大贤后人',
            蔡阳: '一据千里',
            夏侯杰: '当阳虎胆',
            曹性: '护主健儿',
            邢道荣: '零陵上将',
            周善: '荆吴刑天',
            何晏: '傅粉何郎',
            王桃: '晔兮如华',
            王悦: '温乎如莹',
            滕胤: '厉操遵蹈',
            张嫙: '玉宇嫁蔷',
            刘永: '甘陵王',
            吕玲绮: '无双虓姬',
            滕公主: '芳华荏苒',
            万年公主: '还汉明珠',
            蔡瑁张允: '乘雷潜狡',
            陈珪: '戏虎如婴',
            雷薄: '背仲豺寇',
            桥蕤: '跛夫猎虎',
            张勋: '仲家将军',
            马日磾: '南冠楚囚',
            管宁: '辟境归元',
            黄承彦: '捧月共明',
            邓芝: '坚贞简亮',
            宗预: '九醞鸿胪',
            冯熙: '东吴苏武',
            陆郁生: '义姑',
            祢衡: '鸷鹗啄孤凤',
            刘辟: '慕义渠帅',
            张闿: '无餍狍鸮',
            傅肜傅佥: '奕世忠义',
            傅佥: '危汉绝勇',
            刘巴: '清河一鲲',
            霍峻: '葭萌铁狮',
            吉平: '白虹贯日',
            公孙度: '雄张海东',
            刘宏: '轧庭焚礼',
            朱儁: '征无遗虑',
            韩馥: '度势恇然',
            麴义: '名门的骁将',
            王荣: '灵怀皇后',
            曹嵩: '依权弼子',
            丘力居: '乌丸王',
            陶谦: '膺秉温仁',
            张邈: '苔岑往却',
            曹安民: '履薄临深',
            胡车儿: '夜盗神行',
            董承: '沥胆卫汉',
            阎柔: '冠玉啸北',
            朱灵: '良将之亚',
            郝萌: '悖虎之伥',
            严夫人: '霜天薄裳',
            高干: '才志弘邈',
            邴原: '峰名谷怀',
            公孙康: '沸流腾蛟',
            曹宪曹华: '与君化木',
            曹华: '殊凰求凤',
            周夷: '靛情雨黛',
            程秉: '通达五经',
            夏侯玄: '明皎月影',
            张瑾云: '慧秀淑德',
            吴景: '汗马鎏金',
            谢灵毓: '淑静才媛',
            桥公: '高风硕望',
            毛玠: '清公素履',
            张翼: '奉公弗怠',
            曹髦: '霸业的终耀',
            曹金玉: '金乡公主',
            管辂: '问天通神',
            刘晔: '佐世之才',
            马钧: '没渊瑰璞',
            王双: '遏北的悍锋',
            文钦: '勇而无算',
            华歆: '清素拂浊',
            田豫: '震江扫寇',
            董昭: '移尊易鼎',
            邓忠: '惠唐亭侯',
            清河公主: '蛊虿之谗',
            蔡贞姬: '舍心顾腹',
            袁涣: '随车致雨',
            丁尚涴: '与君不载',
            李婉: '才媛淑美',
            羊徽瑜: '景献皇后',
            司马孚: '阐忠弘道',
            阮慧: '明察福祸',
            杨阜: '勇捍雄狮',
            郭照: '碧海青天',
            薛灵芸: '霓裳缀红妆',
            周宣: '夜华青乌',
            郑浑: '民安寇灭',
            王昶: '攥策及江',
            曹肇: '宛童啖桃',
            蒋济: '盛魏昌杰',
            张既: '边安人宁',
            夏侯尚: '魏胤前驱',
            夏侯恩: '长板剑灵',
            花鬘: '清泽载馨',
            周群: '占天明徵',
            蒲元: '淬炼白兵',
            李丰: '继父尽事',
            彭羕: '难别菽麦',
            陈震: '忠惇笃粹',
            杨仪: '积恨孤鹬',
            诸葛尚: '尚节殉义',
            王甫赵累: '忱忠不移',
            谯周: '观星知命',
            卧龙凤雏: '扭转乾坤',
            马承: '孤蹄踏乱',
            罗宪: '介然毕命',
            张世平: '中山大商',
            雷铜: '石凯之鼋',
            吴兰: '剑齿之鼍',
            赵直: '捕梦黄粱',
            冯习: '赤胆的忠魂',
            张南: '澄辉的义烈',
            黄祖: '引江为弣',
            张陵: '祖天师',
            卫兹: '倾家资君',
            刘璋: '半圭黯暗',
            张仲景: '医理圣哲',
            刘赪: '泣梧湘女',
            轲比能: '瀚海鲸波',
            冯妤: '天姿国色',
            彻里吉: '高凉铁骨',
            阿会喃: '维绳握雾',
            马休马铁: '西凉世胄',
            阎圃: '盱衡识势',
            郑玄: '兼采定道',
            来莺儿: '雀台歌女',
            卢奕: '落子惊鸿',
            董贵人: '衣雪宫柳',
            朱建平: '识面知秋',
            武安国: '虎口斩腕',
            杨弘: '柔迩驭远',
            樊玉凤: '红鸾寡宿',
            童渊: '红鸾寡宿',
            葛玄: '冲应真人',
            朵思大王: '踞泉毒蛟',
            刘夫人: '酷妒海棠',
            鲍信: '坚朴忠相',
            张曼成: '南阳渠帅',
            蹇硕: '西园硕犀',
            于夫罗: '援汉雄狼',
            呼厨泉: '踞北桀鹰',
            阎象: '明尚夙达',
            魏续: '缚陈降曹',
            赵娥: '烈女誓仇',
            凌操: '激流勇进',
            留赞: '啸天亢声',
            许贡: '独计击流',
            范疆张达: '暗潮决堰',
            骆统: '蹇谔匪躬',
            屈晃: '泥头自缚',
            孙弘: '佞伪邪僻',
            孙寒华: '挣绽青莲',
            孙綝: '食髓的朝堂客',
            吴范: '占星定卜',
            曹不兴: '一点须弥',
            全惠解: '春早宫深',
            张奋: '御驰大攻',
            濮阳兴: '协邪肆民',
            夏侯徽: '景怀皇后',
            左棻: '无宠的才女',
            钟琰: '聪慧弘雅',
            宣公主: '高陵公主',
            辛敞: '英鉴中铭',
            王衍: '狡兔三窟',
            袁姬: '袁门贵女',
            袁谭袁尚: '兄弟阋墙',
            袁谭袁尚袁熙: '兄弟阋墙',
            李白: '青莲居士',
            小约翰可汗: '硬核狠人',
            朱铁雄: '国风变装',
            公孙范: '助瓒讨袁',
            孙悟空: '斗战胜佛',
            孙杨: '逐浪追风',
            叶诗文: '出水青莲',
            东海龙王: '群龙之首',
            涛神: '呼风唤雨',
            严纲: '马下败将',
            卢氏: '天师道姑',
            吴匡: '诛绝宦竖',
            十常侍: '祸乱纲常',
            段巧笑: '柔荑点绛唇',
            文鸯: '万将披靡',
            神典韦: '襢裼暴虎',
            陈泰: '岳峙渊渟',
            桓范: '雍国竝世',
            董荼那: '铅刀拿云',
            桓范: '雍国竝世',
            潘淑: '江东神女',
            乐綝: '广昌亭侯',
            郤正: '君子有取',
            周不疑: '幼有异才',
            曹羲: '魁立倾厦',
            张楚: '大贤后裔',
            孙翎鸾: '弦凤栖梧',
            郝普: '恨渐入地',
            裴元绍: '买椟还珠',
            牵招: '威风远振',
            甘夫人糜夫人: '千里婵娟',
            段颎: '束马县锋',
            高翔: '玄乡侯',
            钟毓: '础润殷忧',
            董绾: '蜜言如鸩',
            王浑: '献捷横江'
        };
        var titleMap2 = {
            jsrg_sunce: '问鼎的霸王',
            wu_luxun: '释武怀儒',
            jsrg_zhanghe: '微子去殷',
            jsrg_xuyou: '毕方矫翼',
            sb_lvmeng: '苍江一笠',
            tw_wangchang: '识度良臣',
            clan_wangyun: '零圭断壁',
            jsrg_wangyun: '居功自矜',
            zhangyì: '亢锐怀忠',
            sp_wangcan: '词章纵横',
            tw_wangcan: '溢才捷密',
            ol_huban: '险误忠身',
            dc_sunziliufang: '谄陷负讥',
            db_wenyang: '独骑破军',
            QUN_sp_diaochan: "暗黑傀儡师",
            sp_pangtong: "荆楚之高俊",
            sp_diaochan: "暗黑傀儡师",
            yj_huangzhong: "强挚烈弓",
            old_machao: "西凉雄狮",
            ps_machao: "西凉雄狮",
            sp_machao: "西凉雄狮",
            decade_sp_machao: "西凉雄狮",
            jsp_guanyu: "汉寿亭侯",
            wz_sp_guanyu: "汉寿亭侯",
            jsp_zhaoyun: "白马先锋",
            sp_zhaoyun: "白马先锋",
            WEI_sp_caiwenji: "金璧之才",
            sp_caiwenji: "金璧之才",
            WEI_sp_jiangwei: "幼麟",
            sp_jiangwei: "幼麟",
            WEI_sp_pangde: "抬榇之悟",
            sp_pangde: "抬榇之悟",
            SHU_sp_sunshangxiang: "梦醉良缘",
            sp_sunshangxiang: "梦醉良缘",
            QUN_jsp_huangyueying: "闺中璞玉",
            jsp_huangyueying: "闺中璞玉",
            WU_re_jsp_pangtong: "南州士冠",
            re_jsp_pangtong: "南州士冠",
            QUN_sp_taishici: "北海酬恩",
            re_sp_taishici: "北海酬恩",
            sp_taishici: "北海酬恩",
            sp_ol_zhanghe: '倾柱覆州',
            yj_zhanghe: '宁国中郎将',
            old_yj_zhanghe: '宁国中郎将',
            sp_zhanghe: '名门的梁柱',
            tw_caocao: '峥嵘而立',
            jsrg_caocao: '汉征西将军',
            yj_caocao: '谯水击蛟',
            yj_xuhuang: '沉详性严',
            xia_lusu: '性善好施',
            jsrg_liubei: '负戎荷戈',
            yj_zhangliao: '蹈锋饮血',
            sp_zhangliao: '功果显名',
            sp_ganning: '怀铃的乌羽',
            yj_ganning: '铃震没羽',
            yj_weiyan: '鸷勇孤战',
            tw_yujin: '逐暴定乱',
            xia_xushu: '仗剑为侠',
            xia_dianwei: '任侠报怨',
            jsrg_guanyu: '羊左之义',
            jsrg_zhenji: '一顾倾国'
        };
        var introMap = {
            刘徽: '　　刘徽(225？～295？),汉族,山东滨州邹平市人,魏晋期间伟大的数学家,中国古典数学理论的奠基人之一.在中国数学史上作出了极大的贡献,他的杰作<九章算术注>和<海岛算经>,是中国最宝贵的数学遗产.<br> 　　刘徽思想敏捷,方法灵活,既提倡推理又主张直观.他是中国最早明确主张用逻辑推理的方式来论证数学命题的人.刘徽的一生是为数学刻苦探求的一生.他虽然地位低下,但人格高尚.他不是沽名钓誉的庸人,而是学而不厌的伟人,他给我们中华民族留下了宝贵的财富.2021年5月,国际天文学联合会(IAU)批准中国在嫦娥五号降落地点附近月球地貌的命名,刘徽(liuhui)为八个地貌地名之一.',
            吴苋: '　　穆皇后吴氏(？～245),本名不详,民间谣传为<吴苋>,陈留郡(今河南祥符)人,车骑将军吴懿之妹,三国时期蜀汉昭烈帝刘备的皇后.<br>　　吴氏早年丧父,其父生前与刘焉交情深厚,所以全家跟随刘焉来到蜀地.后刘焉听相面者说吴氏有大贵之相,于是为儿子刘瑁迎娶吴氏.刘瑁死后,吴氏成为寡妇.<br>　　214年,刘备平定益州,纳吴氏为夫人.219年,刘备自称汉中王,立吴氏为汉中王后.221年,刘备称帝,建立蜀汉,立吴氏为皇后.223年,刘备去世,太子刘禅即位,尊嫡母吴氏为皇太后.<br>　　245年,吴氏去世,谥号穆皇后,葬入刘备的惠陵.',
            邓艾: '　　邓艾(197？～264),字士载,义阳棘阳(今河南省新野县)人.三国时期曹魏名将.本名邓范,后因与同乡人同名而改名.<br>　　邓艾文武双全,深谙兵法,对内政也颇有建树.他在曹魏西边战线防备蜀汉姜维多年.公元263年他与钟会分别率军攻打蜀汉,最后他率先进入成都,使得蜀汉灭亡.后因遭到钟会的污蔑和陷害,被司马昭猜忌而被收押,最后与其子邓忠一起被卫瓘派遣的武将田续所杀害.273年,邓艾被平反昭雪.917年,邓艾被王建追谥为彰顺王.',
            辛评: '　　辛评(？～204),字仲治,颍川阳翟人,东汉末年人物.曹魏卫尉辛毗之兄.原是韩馥部下,韩馥逃亡后转而辅佐袁绍.袁绍死后,辛评、郭图欲立袁谭为主,与审配等不和.后来曹操破邺,其弟辛毗在城下劝降.审配怒遣手下将辛评全家杀害.',
            孙邵: '　　孙邵(163～225),字长绪,青州北海国人(今山东潍坊市昌乐县西).孙邵早年作北海相孔融的功曹,孔融称他是<廊庙才(指才能可任朝廷要职的人)>.194年,孙邵跟随刘繇到达江东.200年,孙策去世,孙权继位.孙邵数次向孙权陈述建议,认为应该向朝廷上贡、通书信,孙权采纳了他的建议.孙邵被任命为庐江太守,后来升为车骑长史.222年,孙权称吴王,孙邵为首任丞相,并被加封为威远将军,封阳羡侯.张温、暨艳曾上奏弹劾他,孙邵请求辞职来谢罪,孙权释免了他,仍让他作丞相.225年,夏五月,孙邵病逝,谥曰肃.由顾雍继任丞相之职.',
            荀粲: '　　荀粲(210～238),字奉倩,颍川郡颍阴县(今河南省许昌市)人.三国时期曹魏大臣、玄学家,荀彧幼子.<br>　　个性简贵,不轻易交接常人,所交之辈皆一时俊杰.聪颖过人,善谈玄理,名噪一时.娶大将军曹洪之女为妻,生活美满.<br>　　景初二年,面对妻子去世,悲痛过度而死,时年二十九,成语<荀令伤神>与之有关.',
            孙休: '　　吴景帝孙休(235～264/9/3),字子烈,吴大帝孙权第六子,东吴第三位皇帝(258/11/30～264/9/3在位).<br>　　孙休十八岁时,受封为琅琊王.258年,孙綝发动政变,罢黜孙亮为会稽王,迎立孙休为帝,孙休三让而受,改元永安.孙休登基后,封孙綝为丞相.孙綝权倾朝野,孙休与张布、丁奉合谋,遂除孙綝.孙休在位期间,颁布良制,嘉惠百姓,促进了东吴的繁荣.孙休好文,即位后于永安元年创建国学,设太学博士制度,诏立五经博士,为南京太学之滥觞,韦昭为首任博士祭酒.<br>　　264年9月3日,孙休去世,谥号景皇帝,葬于定陵.',
            赵云: qyhcCL.characterIntro.zhaoyun
        };
        // for (var x in lib.character) {
        //     var i = lib.character[x];
        //     var k = lib.translate[x];
        //     if (typeof k == "string" && typeof x == 'string') {
        //         k = get.colorful(k, '#', x);
        //         if (!qyhcCL.Trans[k]) qyhcCL.Trans[k] = [];
        //         qyhcCL.Trans[k].push(x);
        //         var title = get.colorful(lib.characterTitle[x], '^');
        //         if (title && !titleMap[k]) titleMap[k] = title;
        //     }
        // }
        // for (var i in titleMap) {
        //     if (qyhcCL.Trans[i]) {
        //         for (var k of qyhcCL.Trans[i]) {
        //             lib.characterTitle[k] = titleMap[i] + get.colorful(lib.characterTitle[k], '$');
        //         }
        //     }
        // }//称号样式消除
        for (var i in titleMap2) {
            lib.characterTitle[i] = titleMap2[i] + get.colorful(lib.characterTitle[i], '$');
        }
        for (var i in introMap) {
            if (qyhcCL.Trans[i]) for (var k of qyhcCL.Trans[i]) if (!lib.characterIntro[k] || !qyhcCL.characters.includes(k)) lib.characterIntro[k] = introMap[i];
        }
        var obj = {};
        //锦囊
        ///延时锦囊
        obj.lebu = '此间乐,不思蜀.——<汉晋春秋>';
        obj.bingliang = '是故军无辎重则亡,无粮食则亡,无委积则亡.——<孙子兵法>';
        obj.shandian = '嗯,哼,哼,啊啊啊啊啊啊啊啊啊啊啊啊——<114514>';
        obj.caomu = '金戈铁血淝河腻,草木皆兵鹤唳惊.——<七律·过八公山>';
        obj.dongfeng = '东风飘兮神灵雨,留灵脩兮憺忘归.——<楚辞>';
        ///基础锦囊
        obj.jiedao = '敌已明,友未定,引友杀敌,不自出力,以<损>推演.——<三十六计>';
        obj.shunshou = '效马效羊者右牵之.——<礼记>';
        obj.guohe = '你休得顺水推船,偏不许我过河拆桥.——<李逵负荆>';
        obj.wanjian = '安得夫差水犀手,三千强弩射潮低.——苏轼';
        obj.tiesuo = '或三十为一排,或五十为一排,首尾用铁环连锁,上铺阔板,休言人可渡,马亦可走矣,乘此而行,任他风浪潮水上下,复何惧哉？——<三国演义>';
        obj.wuxie = '击其懈怠,出其空虚.——<孙子略解>';
        obj.juedou = '喊声震动天地翻,杀气迷漫牛斗寒.——<三国演义>';
        obj.wuzhong = '天下万物生于有,有生于无.——<老子>';
        obj.taoyuan = '既结为兄弟,则同心协力,救困扶危;上报国家,下安黎庶,不求同年同月同日生,只愿同年同月同日死,皇天后土,实鉴此心,背义忘恩,天人共戮.——<三国演义>';
        obj.wugu = '是故风雨时节,五谷丰熟,社稷安宁.——<六韬>';
        obj.huogong = '行火必有因,烟火必素具.——<孙子兵法>';
        obj.yiyi = '以近待远,以逸待劳,以饱待饥,此治力者也.——<孙子兵法>';
        obj.shuiyanqijunx = '四面八方,大水骤至;七军乱窜,随波逐浪者,不计其数.——<三国演义>';
        obj.shuiyanqijun = '以水佐攻者强,水因地而成势,为源高於城,本大於末,可以遏而止,可以决而流.——<太白阴经>';
        ///扩展锦囊
        obj.lulitongxin = '昔逮我献公及穆公相好,勠力同心,申之以盟誓.——<左传>';
        obj.huoshaolianying = '初更时分,东南风骤起.只见御营左屯火发.方欲救时,御营右屯又火起.风紧火急,树木皆着,喊声大震.——<三国演义>';
        obj.tunliang = '彼军无粮,利在急战;我军有粮,宜且缓守.若能旷以日月,则彼军不战自败矣.——<三国演义>';
        obj.kanpo = '看破空花尘世,放轻昨梦浮名.——陆游';
        obj.yuanjun = '曹公兵精,往必破琼等;琼等破,则将军事去矣,宜急引兵救之.——<三国志>';
        obj.diaohulishan = '待天以困之,用人以诱之,往蹇来返.——<三十六计>';
        obj.dongzhuxianji = '卓智之人,洞烛机先.——<菜根谭>';
        obj.yihuajiemu = '花接上林新木变,水分清洛旧池深.——梅尧臣';
        obj.suijiyingbian = '不必拘执,随机应变.——<三国演义>';
        obj.jinchan = '存其形,完其势;友不疑,敌不动;巽而止蛊.——<三十六计>';
        obj.fulei = '砂篆一挥走神鬼,雷电霹雳动天地.——白玉蟾';
        obj.shengdong = '敌志乱萃,不虞.坤下兑上之象,利其不自主而取之.——<三十六计>';
        obj.qijia = '填然鼓之;兵刃既接;弃甲曳兵而走;或百步而后止;或五十步而后止.——<孟子>';
        obj.jiejia = '叔孙通起于桴鼓之间,解甲投戈,遂作君臣之仪,得也.——<解嘲>';
        obj.zengbin = '彼三晋之兵素悍勇而轻齐,齐号为怯,善战者因其势而利导之.——孙子';
        obj.weishiyique = '故用兵之法,高陵勿向,背丘勿逆,佯北勿从,锐卒勿攻,饵兵勿食,归师勿遏,围师遗阙,穷寇勿迫,此用兵之法也.——<孙子兵法>';
        obj.gubuzifeng = '昔有学步于邯郸者,曾未得其仿佛,又复失其故步,遂匍匐而归耳.——<汉书>';
        obj.tiaojiyanmei = '若作和羹,尔惟盐梅.——<尚书>';
        obj.qizhengxiangsheng = '战势不过奇正,奇正之变,不可胜穷也.奇正相生,如循环之无端,孰能穷之哉.——<孙子兵法>';
        obj.jiwangkailai = '所以继往圣,开来学,而大有功于斯世也.——<朱子全书>';
        obj.yuanjiao = '形禁势格,利从近取,害以远隔.上火下泽.——<三十六计>';
        obj.mantian = '备周则意怠;常见则不疑.阴在阳之内,不在阳之对.太阳,太阴.——<三十六计>';
        obj.dz_mantianguohai = obj.mantian;
        obj.zhibi = '知彼知己,百战不殆.——<孙子兵法>';
        obj.chuqibuyi = '攻其无备,出其不意.——<孙子兵法>';
        obj.tongzhougongji = '夫吴人与越人相恶也,当其同舟而济,遇风,其相救也如左右手.——<孙子兵法>';
        obj.jintuiziru = '进而不可御者,冲其虚也;退而不可追者,速而不可及也.——<孙子兵法>';
        obj.gongshoujianbei = '故善攻者,敌不知其所守;善守者,敌不知其所攻.——<孙子兵法>';
        obj.lizhengshangyou = '所以才智人,不肯自弃暴,力欲争上游,性灵乃其要.——赵翼';
        obj.nishuixingzhou = '人之处于世也,如逆水许舟,不进则退.——梁启超';
        obj.caochuan = '一天浓雾满长江,远近难分水渺茫.骤雨飞蝗来战舰,孔明今日伏周郎.——<三国演义>';
        obj.xietianzi = '然操遂能克绍,以弱为强者,非惟天时,抑亦人谋也.今操已拥百万之众,挟天子而令诸侯.——<隆中对>';
        obj.geanguanhuo = '阳乖序乱,明以待逆.暴戾恣睢,其势自毙.顺以动豫,豫顺以动.——<三十六计>';
        obj.nanman = config.clwt_mizhi_card == 'guandu' ? obj.xietianzi : '南蛮一人持矛入侵,川兵百人见而奔逃.——无名氏';
        //装备
        ///武器
        ///官方
        obj.cixiong = '又名鸳鸯剑,鸳剑长三尺七寸,鸯剑长三尺四寸,利可断金.——<三国演义>';
        obj.fangtian = '龙驹跳踏起天风,画戟荧煌射秋水.——<三国演义>';
        obj.guanshi = '斧,甫也,甫,始也.凡将制器,始用斧伐木,已乃制之也.——<释名>';
        obj.qilin = '虎筋弦响弓开处,雕羽翅飞箭到时.——<三国演义>';
        obj.quehuagong = '再放第三箭时,因用力太猛,拽折了鹊画弓,只得弃弓纵马而奔.——<三国演义>';
        obj.sizhaodao = '袁绍,在黎阳梦有一神授一宝刀,及觉,果在卧所,铭曰思召.绍解之曰:思召,绍字也.——<古今刀剑录>';
        obj.qinggang = '…有宝剑二口,一名‘倚天’,一名‘青釭’,并称绝世双剑…——<三国演义>';
        obj.chixueqingfeng = obj.qinggang;
        obj.lengyanju = '云长造青龙偃月刀,又名‘冷艳锯’,重八十二斤.——<三国演义>'
        obj.qinglong = '刀势即大,其三十六刀法,兵仗遇之,无不屈者,刀类中以此为第一.——<三才图会>';
        obj.zhangba = '马上所持,言其俏俏便杀也;又曰激矛,激截也,可以激截敌阵之矛也.——<释名>';
        obj.zhuge = '又损益连弩,谓之元戎,以铁为矢,矢长八寸,一弩十矢俱发.——<魏氏春秋>';
        obj.zhuque = '诸葛武侯与宣王在渭边,将战,武侯乘素舆,葛巾,白羽扇,指挥三军,三军皆随其进止.——<语林>';
        obj.hanbing = '银瓶乍破水浆迸,铁骑突出刀枪鸣.——<琵琶行>';
        obj.yinyueqiang = '匹马单枪敢独行,摧锋破敌任纵横.——<三国演义>';
        ///自改
        obj.feilongduofeng = '枭雄玄德掣双锋,抖擞天威施勇烈.——无名氏';
        obj.longfenghemingjian = '鸳剑长三尺七寸,鸯剑长三尺四寸,利可断金.——<三国演义>';
        obj.wuxinghelingshan = '天有五行,水火金木土,分时化育,以成万物.——<五帝>';
        obj.liannu = '两边伏弩齐发,一弩发十矢……前军连人带马射死不知其数.——<三国演义>';
        obj.piliche = '太祖乃为发石车,击绍楼,皆破.绍众号曰霹雳车.——<三国志>';
        obj.ly_piliche = obj.piliche;
        obj.yitianjian = '壮士愤,雄风生.安得倚天剑,跨海斩长鲸？——李白';
        obj.wutiesuolian = '武夫则猛气纷纭,雄心四据,陆拔山岳,水断虬龙…——蔡景历';
        obj.zhungangshuo = '遍体疮痍犹痛饮,血痕残酒满征衣.——罗贯中';
        obj.qibaodao = '刀长尺余,七宝嵌饰,极其锋利,果宝刀也.——<三国演义>';
        obj.bintieshuangji = '帐下壮士有典君,提一双戟八十斤.——<三国志>';
        ///防具宝物
        obj.bagua = '乾三连,坤六断,震仰盂,艮覆碗,离中虚,坎中满,兑上缺,巽下断.——<八卦歌诀>';
        obj.baiyin = '马超纵骑持枪而出,狮盔兽带,银甲白袍.——<三国演义>';
        obj.tengjia = '穿在身上,渡江不沉,浸水不湿,刀箭皆不能入.——<三国演义>';
        obj.kaihua = '借局布势,力小势大.鸿渐于陆,其羽可用为仪也.——<三十六计>';
        obj.renwang = '握仁王之宝镜,日月重光;驱梵帝之金轮,雷霆静祲.——王勃';
        obj.heiguangkai = '先帝赐臣铠,黑光、明光各一领,两当铠一领,环锁铠一领,马铠一领.今代以升平,兵革无事,乞悉以付铠曹自理.——曹植';
        obj.minguangkai = obj.heiguangkai;
        obj.guofengyupao = '志在取鳞,心期探虎.——陈元靓';
        obj.lanyinjia = '孙坚披烂银铠,裹赤帻,横古锭刀,骑花鬃马.——<三国演义>';
        obj.yinfengjiacl = '友人有疾,不忍委之,宁以我身代友人命.——<世说新语>';
        obj.yinfengjia = '淮北蜂毒,尾能杀人.——<江淮之蜂蟹>';
        obj.yinfengyi = obj.yinfengjia;
        obj.nvzhuang = '明珠交玉体,珊瑚间木难.罗衣何飘飘,轻裾随风还.——曹植';
        obj.clnvzhuang = obj.nvzhuang;
        obj.suolianjia = '铠如环锁,射不可入.——<晋书>';
        obj.huxinjing = '坚大怒,命黄盖出战.蔡瑁舞刀来迎,斗到数合,盖挥鞭打瑁,正中护心镜.——<三国演义>';
        obj.yexingyi = '剪制未为春步幛,暗投先作夜行衣.——释德洪';
        obj.linglongshimandai = '头戴三叉束发紫金冠,体挂西川红锦百花袍,身披兽面吞头连环铠,腰系勒甲玲珑狮蛮带,弓箭随身,手持画戟,坐下嘶风赤兔马:果然是‘人中吕布,马中赤兔’!——<三国演义>';
        obj.hongmianbaihuapao = obj.linglongshimandai;
        obj.shufazijinguan = obj.linglongshimandai;
        obj.zhaogujing = '…有方镜,径丈余,照人五藏,秦皇世号为照骨宝…——<酉阳杂俎>';
        obj.muniu = '十年,亮休士劝农于黄沙,作流马木牛毕,教兵讲武.——<三国志>';
        obj.taigongyinfu = '诸奉使行符,稽留者,若符事泄,闻者、告者皆诛之.——<六韬>';
        obj.tongque = '东风不与周郎便,铜雀春深锁二乔.——<赤壁>';
        obj.tianjitu = '其耆欲深者,其天机浅.——<庄子>';
        obj.dinglanyemingzhu = '皎洁圆明内外通,清光似照水晶宫.只缘一点玷相秽,不得终宵在掌中.——<十离诗·珠离掌>';
        ///马
        obj.chitu = '人中吕布,马中赤兔.——<三国演义>';
        obj.hualiu = '枥下骅骝思鼓角,门前老将识风云.——<上将行>';
        obj.jueying = '公所乘马名绝影.——<三国志>';
        obj.zhuahuang = '操骑爪黄飞电马,引十万之众,与天子猎于许田.——<三国演义>';
        obj.dilu = '备急曰:‘的卢,今日危矣,可努力.’的卢乃一踊三丈,遂得过.——<世说新语>';
        obj.dawan = '大宛汗血古共知,青海龙种骨更奇,网丝旧画昔尝见,不意人间今见之.——<天马歌>';
        obj.zixin = '怀夏后之九代,想陈王之紫骍.——<梁书>';
        obj.jingfanma = '曹真有駃马,名为惊帆,言其驰骤如烈风之举帆疾也.——<古今注>';
        obj.yuzhui = '人守有张飞,马中有玉追.——无名氏';
        ///美猴王&长安大舰
        obj.changandajian_equip1 = '权於武昌新装大船,名为长安.——<江表传>';
        obj.changandajian_equip2 = obj.changandajian_equip1;
        obj.changandajian_equip3 = obj.changandajian_equip1;
        obj.changandajian_equip4 = obj.changandajian_equip1;
        obj.changandajian_equip5 = obj.changandajian_equip1;
        obj.ruyijingubang = '悟空十分欢喜,拿出海藏看时,原来两头是两个金箍,中间乃一段乌铁;紧挨箍有镌成的一行字,唤做‘如意金箍棒’,重一万三千五百斤.——<西游记>';
        obj.ruyijingubang_cl = obj.ruyijingubang;
        obj.ousibuyunlv1 = '北海龙王敖顺道:‘说的是.我这里有一双藕丝步云履哩.’——<西游记>';
        obj.ousibuyunlv2 = '北海龙王敖顺道:‘说的是.我这里有一双藕丝步云履哩.’——<西游记>';
        obj.suozihuangjinjia = '西海龙王敖闰道:‘我带了一副锁子黄金甲哩.’——<西游记>';
        obj.fengchizijinguan = '南海龙王敖钦道:‘我有一顶凤翅紫金冠哩.’——<西游记>';
        for (var i in obj) obj[i] = '<i><font size="2"><span style="Pstext1"><' + obj[i].replace('——', '><span style="Pstext2">——') + '</span></span></font></i><font size="2"><br></font>';
        obj.guding = '<i><font size="2"><span style="Pstext1"><span style="text-decoration:line-through;opacity:0.8;"><犯大吴疆土者,盛必击而破之.><span style="Pstext2"><span style="text-decoration:line-through;opacity:0.8;">——<三国杀></span></span></span></span></font></i><i><font size="2"><span style="Pstext1"><孙坚披烂银铠,裹赤帻,横古锭刀,骑花鬃马.><span style="Pstext2">——<三国演义></span></span></font></i>';
        obj.xinge = '<i><font size="2"><span style="Pstext1">咕~咕~咕~</span></font></i>';
        for (var i in obj) {
            lib.translate[i + "_append"] = obj[i].replace(/Pstext1/g, 'float:left;margin-left:37px;margin-right:6px;text-indent:-0.6em;font-family:yuanli;"').replace(/Pstext2/g, 'float:right;margin-right:17px;font-family:yuanli;"');
        }
    }
    qyhcCL.YinWen();
    return [lib, game, ui, get, ai, _status];
});