import { lib, game, ui, get, ai, _status } from '../../noname.js'
game.import('extension', function (lib, game, ui, get, ai, _status) {
    //daice
    return {
        name: '永远的七日之都',
        content(config, pack) { },
        precontent() {
            game.kongfunc = function () {
                return game.kong;
            };
            game.kong = {
                set() {
                    return this;
                },
                get player() {
                    return game.me;
                }, //先声明后赋值的,后面调用会是underfined,所以用getter实时获取
                cards: [],
                result: {
                    cards: [],
                },
                gaintag: [],
                forResult() { },
            };
            game.import('character', function (lib, game, ui, get, ai, _status) {
                const QQQ = {
                    name: '永远的七日之都',
                    connect: true,
                    character: {
                        安托涅瓦: ['female', 'shu', 3, ['fznyfz', 'szlc', 'yxhy', 'yjfz', 'xkzs'], ['zhu', 'des:中央庭的创始人之一,温柔又坚强的姐姐.原本是文学系研究生,在异变发生的时候目睹亲人惨死在黑雾中,她的身体发生异化,成为第一批神器使.擅长文字、记录相关的工作,做事巨细无遗,自中央庭建立以来就一直担当繁重的文书工作.看起来非常温和好相处,会开玩笑,也会在恰当的时候认真严肃,很容易和人打成一片.是个能够为了自己的理念,忍受任何痛苦的坚强女性.']],
                        阿希莉亚: ['female', 'qun', 3, ['fyz', 'syzj', 'yydqrzd_xzd', 'rojxyz'], ['des:白夜馆的管家,优雅而神秘的人偶师.来历不明,被问到会拒绝回答,就连霞也不会说.种族不是人类,但也不是人偶.是霞的管家,也是白夜馆4个小人偶的制造者.人偶的名字为阿尔法、贝塔、伽马、德尔塔,会说话,能做事,亦可在战场上配合战斗.对她来说,4个小人偶既是她的儿女,也是她的分身.对于外人,阿希莉亚表现得非常冷淡严厉,但对人偶则较为温情,会给他们缝衣服.']],
                        羽弥: ['female', 'qun', 5, ['wy', 'bwdyw', 'xshx', 'ysxj'], ['des:被抛弃在路边,被院长捡回来的少女.作为研究素材,意外成为了唯一的成功样本.院长对羽弥表现出病态的占有欲望,不仅把她关在地下深处,还命令她称自己为<父亲>.在对她观察研究的同时,还给幼小的她灌输绝对服从的命令.胆小的羽弥,总是战战兢兢.开口必会先说:<对不起>.幼小少女心中的愿望,只有<和父亲永远生活在一起>这一点而已.随着年岁的增长,羽弥逐渐长大.提出了要到地面上的要求.却反而被变本加厉虐待.最终在一次意外事故中,医院崩塌,院长也死在废墟中.继续生活在废墟之中的羽弥,<和父亲永远生活在一起>的这个愿望,从某种意义上也确实实现了.']],
                        爱缪莎: ['female', 'shu', 3, ['qrzd_tlp', 'mydlp', 'qpss', 'qrzd_zpw'], ['des:看似天真却蕴含着可怕力量的牌场女王.出生在乡下,不甘心成为普通的农家女孩度过一生,便孤身一人来到大城市,因为长相甜美,赌场老板破例收下她.最开始只是普通的侍应,在一次店里举办的扑克比赛中,她抱着尝试的心态参加,结果一举夺得了冠军奖金,叫人刮目相看.后来她投身于各类高级比赛,奖金迅速累积,名气也迅速增长,很快,各种各样的高级邀请函纷至沓来.长久浸淫在上流场所的氛围中,逐渐成长为一名优雅贵气的社交名媛.无论是决定孤身一人来到大城市,还是决定以自己的天赋投身比赛赚取奖金,甚至在之后毅然决定加入中央庭,甚至再往后的人生道路……爱缪沙的人生中总是充满了一次次的豪赌.以后她也会这样继续下去吧,这便是她所演绎的人生.']],
                        十玖: ['female', 'qun', 3, ['sbtzqag', 'wlsxlz', 'tss', 'wledfq'], ['des:忍者家庭培养出的忍者少女. 初见是帅气的冰山美人,实则极为率直又过于认真,简而言之就是<单纯>.加上解决问题时习惯性使用忍者思维,使得她说话办事往往跟旁人不在一个频段里,显得有些难以捉摸. 十玖与一般忍者不同,比起速度更擅长力量.天赐的怪力让她拥有劈山断海般杀伤力的同时,也剥夺了她一部分使用忍术的天赋.所以十玖使用忍术的水准非常一般,只会一些基础忍术.多数时间十玖都以自己摸索的剑术解决敌人.<这样的自己究竟算不算忍者呢？>是十玖最大的心结. 立志以忍者身份活下去的少女便以最严苛的忍者法则要求自己.既然能力上无法成为一流的忍者,那就用意志证明自己的身份.']],
                        安: ['female', 'wei', 3, ['sjsgzj', 'sgzr', 'szssjs', 'sjhs'], ['des:温柔热心,天真耀眼的女孩子.因为太过快乐,因此总是会遗忘自己实际上不是真正的人的事实.会是个善解人意的好太太.没有洁癖,很喜欢劳动时候被弄脏的感觉.非常崇拜能够靠自己的力量劳动丰衣足食的人类,于是选择了心目中符合<劳动者>身份的装束.一直穿着女仆装,感觉自己的心都和劳动者接近了呢(并没有)']],
                        珈儿: ['female', 'wu', 4, ['ljbdyh', 'bd', 'rzd', 'yd', 'jjlw'], ['des:公立高中三年级在读,史上最强女子高中生.除了剑术一流之外其他方面全都一窍不通,十足十的天然呆,如果不是战斗状态的话就算普普通通走着也会平地摔.成绩非常糟糕,虽然并不讨厌念书,但是一翻开书就会不自觉地睡过去,被摇醒后会呆呆地自语<啊,又睡着了>,纯良无害的笑脸叫人难以板着脸责骂她.为了成为能够帮助他人的剑士而努力中.家里人也很理解她的做法.父亲以剑之道教育她做人要正直且懂得回报社会,珈儿谨记在心.真是从各种方面来看都是非常正派的人生呢.']],
                        丽: ['female', 'qun', 4, ['bs', 'hjs', 'jyfc', 'hjjz'], ['zhu', 'des:早熟的财团大小姐.任性的机甲爱好者.性格高傲,自尊心强,牢牢记住每一笔账单,不只是金钱,人情方面也算计得非常清楚,绝对不会欠人任何东西.在商场上格外冷酷无情,如同横扫棋盘的皇后,但同时又是个慈善家.虽然本人坚持说<我只是借钱给那些孩子们,等他们长大了还会收回的>,实际上所有人都知道大小姐只不过是面冷心热罢了.本身是机甲的狂热拥护者,自己身上也配置了昂贵的机甲设备,让她能够在战斗中飞行.想见她很简单,在大街上批评机甲之后,隔天就会有保镖把你捆起来丢到大小姐面前去了.至于之后发生的事情,请您自求多福.']],
                        零: ['female', 'wei', 3, ['hdtymt', 'smdzl', 'swdcm'], ['des:温室中的花朵,受家人百般呵护长大的女孩.家人遭遇意外去世后,家产被心怀不轨的叔父夺走,自己也失去了自由.被禁足在家中的日子里,唯有书库中的书籍所展现的世界能给予她安慰.在大量的学习中,她逐渐显露了自己异常的天赋和过目不忘的本领,这一能力被希罗看中,将她解救出来,在之后的黑门研究中提供了很大的助力.性格如同白纸一般纯净.单纯却不无知.真心地想要所有人都能得到幸福.非常在意年龄问题,讨厌被人当作小孩子,迫切地想要长大,成为理想中的坚强勇敢的女性.']],
                        艾露比: ['female', 'qun', 3, ['jdskdzj', 'lhjq', 'cmzj', 'yydqrzd_dqhl'], ['des:超腹黑小学生.心机重.性格乖张不好驾驭.擅长当面一套背后一套,演技极为精湛.地下公司<白鸟>的千金.家里想把她培养成普通人平安长大,但她自己却对家族产业、地下手段非常感兴趣,想要继承家业.在父母面前装作乖乖女,但经常背着父母接触公司运作的事情,和公司一些高层关系很好.社会经历极为丰富,小小年纪混迹在黑市、旧街等地方,是个老江湖了.千万不可被她的乖巧外表欺骗咯.']],
                        雯梓: ['female', 'wu', 3, ['wqwzzy', 'zxhzgs', 'rxbzys', 'zzhzly'], ['des:经营棋馆的职业女性.单身,独居.原本是被当作深闺小姐来养的,但当爷爷发现小雯梓未满十岁就把自己书架上的兵法棋谱背得滚瓜烂熟,并且在其他小屁孩来找茬的时候出手把对方暴揍一顿,才发现把孙女养歪了.拥有现代少有的<侠者>风范.性格火爆,敢爱敢恨,直率且热心肠,路见不平时常拔刀相助.完全不会做家务,只有在这方面才像个深闺小姐.哪天她说要下厨请在第一时间逃走.没有特殊情况不会离开棋馆,心情不好的时候就去找她喝酒吧.']],
                        伽梨耶: ['female', 'shu', 3, ['sjsmj', 'tydjs', 'ydzs', 'gzj'], ['des:来自异国的舞者,太阳般热情开朗的女孩子.超级无敌粗神经,凡事不顾后果冲动行事,不擅长脑力劳动,如果把她放在迷宫里,是会采取破坏所有墙壁一路前行的性格.在靠近东方古街的小酒馆工作,有一个只要赚到了钱就不怎么管事的老板,因此店里很多事情是她说了算.相当随性,碰到顺眼的客人会自掏腰包请他喝酒,但碰到讨厌的客人会立刻把人赶出去,不少客人喜欢这样率真的她进而成为常客,酗酒的恶客也渐渐不见了踪影.虽然宣称酒量惊人,但她也是会喝醉的.所以就算她表示忘记了昨天把你暴揍了一顿丢出门去这件事,也是情理之中的事情.']],
                        奥蕾西娅: ['female', 'wei', 3, ['kptlp', 'msyayzz', 'ezh', 'xhwh'], ['des:当红的模特儿兼演员.擅长演绎各种恋爱故事.幼年辗转于远亲之间,寄人篱下生活.之后偶然间被星探发掘步入星途,她感受到了来自诸多粉丝们的<爱>.她第一次感到,被人爱是多么幸福的事情啊.她对爱的渴望越来越强烈.她希望有人能疼爱自己,能保护自己,会为自己担心,会为自己喜悦……不够,这些还不够,还需要更多的爱,每一个人的爱,更强烈的爱.全心全意,爱到极致,奉献全部,充满独占欲,宁可击杀对方也要将其占有.……她的感情,究竟是爱……还是其他什么更可怕的东西呢？']],
                        亚修: ['male', 'qun', 3, ['ymzszy', 'zxzl', 'hlxtd', 'qrzd_cjzy'], ['des:经常性睡眠不足,黑眼圈缠身的高中生侦探.语出惊人,我行我素.经常受到警局和媒体的委托进行各种侦探活动,缺点在于调查过程中不仅是嫌疑人,就连委托人都会受到他的语言攻击.当然,他并不是想要伤害别人,也不是针对谁,只是他真心觉得在座的各位…… 不过,和他熟识了之后(被虐习惯了之后……),其实也没有那么难相处.']],
                        重渊: ['male', 'wu', 4, ['sjzq', 'lgyc', 'hxfs', 'znly'], ['des:擅长淬炼铸造的铁匠,被一些人称为交界都市第一剑客.从小学习铸剑,只醉心于钢与火的匠心手艺.不接受订制武器,也不售卖.因为手艺了得,经常被商人骚扰,所以跑到山上隐居了几年,专心铸剑.整天打铁使得听力受到一定影响.平常沉稳寡言,气场强大.内心一直执着地坚信尖兵利器本无杀心,全看落入谁手中.信奉天地道法,顺应自然.偶尔会去古街巷子的一个简陋道场指点孩子们练剑,是个严格的老师,但很受孩子们尊敬.']],
                        白歌: ['female', 'qun', 4, ['qsj', 'qstj', 'yzjm', 'ghqs'], ['des:中央城区私立女子高中毕业生,戏剧社台柱.作为直升生留校继续研习中. 外型优雅潇洒,时常饰演男性或是中性角色,在学园中拥有巨大的拥簇群.无论是男性还是女性的情书和礼物都收到非常多,个人也非常享受被围绕的状态. 性格爽朗热情,行事大气自然,是个完全没有架子的人,对待各种请求总是保持热诚和耐心,也会坚持自己的本心,不为外界所扭曲. 除了应付繁忙的演出以外,还是中央庭下所属的神器使,常常在排练之余抽空出任务.']],
                        塞拉菲姆: ['female', 'shen', 3, ['smyl', 'xtfj', '永远的七日之都'], ['des:如果能够斩破苍穹,裂解大地,将那高傲之人 <高高在上的神明自然无法理解芸芸众生的悲喜,既然 如此,你就自己下来看看吧>安托涅瓦说过,< 身为凡 人的你,拥有无限的可能性,其中一定能找到让所有人 都幸福的结局>,幼小的神明怀揣着同样的愿望,在无 限空间中创造了箱庭,以此寻找解决一切的出路.但是 ,弱小的人类面对黑门无能为力,神器使又束缚于命运 .指挥使,作为<被甄选之人>进入了箱庭.虽然如此 <在指挥使加入之后,所有人的行为都趋于乱序,但 又都逃不过最终的轨迹>.但凡人们只能看见神明的傲 慢与冷漠,却看不见<在毁灭的尽头,她的愤怒与悲伤>.  在一次次的轮回和神明近乎玩弄般的嘲讽中,凡人感到万丈的怒火,随着那颗击穿时空位面的子弹,<从此,神明坠入了箱庭>']],
                        蓬莱山辉夜: ['female', 'shen', 3, ['plyz', 'hsq', 'yyyxydzr', 'plzy', 'zhai'], ['des:辉夜公主窝居永远亭千年,在御宅族中传为佳话,获得了<NEET姬>的美称(穿运动服,玩online游戏,躲在暖炉,耍厨…)高傲的NEET姬蓬莱山辉夜酷爱上网和电脑游戏,虽然没人知道她是怎么在幻想乡架设因特网的……  和时下的一些年轻人一样,NEET姬也喜欢通宵打网游,冬天时则喜欢躺在被炉里泡论坛.  原本和藤原妹红定期展开的殊死决斗,现在也改成家用机对战和网络PK了.　  有明显的腹黑属性  蓬莱山家具屋的店长,蓬莱山家具屋是为了支付NEET姬昂贵的网游费用而变卖家具的地方  欺负铃仙,纠缠永琳  经常命属下抢宝物']],
                        受: ['female', 'shen', 3, ['rxklywz', 'hpcycm', 'bsfkdyt'], ['des:铃仙·优昙华院·稻叶是只和其它妖兽气质大不相同的妖怪兔.  　　她身体修长,步姿端正,不像妖兽.在妖兽之中算是活动缓慢.虽是妖兽,却从不袭击人类.相反会避开人类.有着很长耳朵和头发.总的来说,是只与众不同的妖怪兔.  　　因幡·帝是兔子们的领袖,而她则能对帝下命令(听说对方一直都不听话).是真正的兔子们的领袖.  　　据说一直看着她的红眼会让人发狂,而且她的声音,要听也听不进去,相反在远处有时会听到在耳边说话.因为这么让人厌恶,几乎无法和她对话.  　　平时住在永远亭,在那里行动不明.有时也会来村庄售药.带着一堆怪药出现在村庄是出了名的(例如一些很苦的药).由于性格比较老实,总是扮演被人欺负的形象,被认为是三大总受之一.  　　经常被迫充当永琳的新开发药物的实验对象、被帝恶作剧.  　　铃仙的名字优昙华院(うどんげいん)在日文发音里近<乌冬>(うどん),所以讨厌乌冬面,觉得那是要吃她.  　　幻想乡的另一道名菜便是兔肉(神主自己就喜欢吃兔肉),铃仙和因幡们因此组成<兔角同盟>提出抗议,而抗议的原因却不是恐为刀下俎……']],
                        狂气: ['female', 'shen', 3, ['kqzt', 'kmmhsj', 'bsrsdyt'], ['des:铃仙·优昙华院·稻叶是只和其它妖兽气质大不相同的妖怪兔.  　　她身体修长,步姿端正,不像妖兽.在妖兽之中算是活动缓慢.虽是妖兽,却从不袭击人类.相反会避开人类.有着很长耳朵和头发.总的来说,是只与众不同的妖怪兔.  　　因幡·帝是兔子们的领袖,而她则能对帝下命令(听说对方一直都不听话).是真正的兔子们的领袖.  　　据说一直看着她的红眼会让人发狂,而且她的声音,要听也听不进去,相反在远处有时会听到在耳边说话.因为这么让人厌恶,几乎无法和她对话.  　　平时住在永远亭,在那里行动不明.有时也会来村庄售药.带着一堆怪药出现在村庄是出了名的(例如一些很苦的药)由于性格比较老实,总是扮演被人欺负的形象,被认为是三大总受之一.  　　经常被迫充当永琳的新开发药物的实验对象、被帝恶作剧.  　　铃仙的名字优昙华院(うどんげいん)在日文发音里近<乌冬>(うどん),所以讨厌乌冬面,觉得那是要吃她.  　　幻想乡的另一道名菜便是兔肉(神主自己就喜欢吃兔肉),铃仙和因幡们因此组成<兔角同盟>提出抗议,而抗议的原因却不是恐为刀下俎……']],
                        奴良陆生: ['male', 'shu', 4, ['mmqw', '畏', 'jhsy', 'bgyx'], ['zhu', 'des: 传记一  我是关东大妖怪任侠一家奴良组少组、滑头鬼之孙--奴良陆生.  今晚不知道为什么,热血沸腾,难道我体力的妖怪之血.....  以小孩为食的妖怪们是很可怕的......不过!我绝不会让那种欺软怕硬的妖怪成为鬼界之主!  我会成为三代目,统领百鬼!  而且,我决不饶恕危害人类的家伙!  传记二  我很欣赏你.虽然你有些奇怪,但是却是个有趣的人.  我们是任侠,而不是武士.取敌人首级什么的,我毫无兴趣,我唯一想要的,是实力强劲的伙伴.  如果你就这么死了,实在是太可惜了.你愿意借我一臂之力吗？  传记三  所谓「鬼界之主」,必须要让人类怀有敬畏之心......那才是很真正的「畏」.  为了不让那些妖怪肆意妄为,我一定会振兴奴良组、重现百鬼夜行.  我会看清那些家伙是不是真的有资格成为我百鬼夜行中的一员.  我向所有的妖怪宣告,我将成为魑魅魍魉之主,你们都追随我成为百鬼夜行之众.']],
                        赤瞳: ['female', 'wei', 3, ['帝具【一斩必杀·村雨】', 'qrzd_yexi', 'zangsong', 'jiushu'], ['des: 赤瞳(アカメ),日本漫画<斩·赤红之瞳!>、<斩·赤红之瞳!零>及其衍生作品中的主角,曾是帝国暗杀精英七人众之一,现在是Night Raid队员之一,有<王牌杀手>之称. 赤瞳性格稳重,正义感强,极为珍视同伴.从小接受帝国残酷磨练,被娜杰坦说服后,反叛帝国加入了Night Raid并成为队中的王牌.后来和Night Raid三人攻入帝都,与艾斯德斯战斗并将其击败.战争结束后,独自一人背负了革命军所有的阴暗面离开了大家,继续作为除暴安良的杀手而前进着.  中文名 赤瞳  外文名 アカメ  Akame  配    音 雨宫天  登场作品 <斩·赤红之瞳!>  <斩·赤红之瞳!零>  年    龄 十几岁  性    别 女  血    型 A型  身    高 164cm  三    围 B81 W56 H83  兴    趣 吃肉、做模型  亲    人 黑瞳(妹)  帝    具 一斩必杀·村雨  所    属 Night Raid小队(夜袭)  阵    营 帝国方(原)革命军(现)  职    位 小队代理队长  收起 角色形象  赤瞳 人设  秘密组织「Night Raid」的主要成员,传闻中帝都最凶恶的杀手之一.有着一头秀丽的黑发、赤红的双眸、不服输的眼神和不需要化妆也很俏丽的面孔.虽然常常暴饮暴食但有着姣好的身材,被战友雷欧奈等人评价为<可爱的美少女>.说话时语气谦逊,战斗时有着<葬送>的口头禅.  曾隶属于帝国暗杀部队<精英7人>.执行任务时能够冷静地分析情势,有着丰富的战斗经验.对付敌人毫不手软,注重一击解决.持有帝具<一斩必杀·村雨>,虽然帝具非常强悍,但是她并不过分依赖其能力.  喜欢吃肉,有个名叫黑瞳的妹妹.  角色性格 性格属性  赤瞳的笑容 个性有些呆萌,平时沉默寡言.某次看到塔兹米裤子的拉链开了,以为是流行时尚便没有出声,令对方颇为尴尬.  十分珍视自己的伙伴,曾在塔兹米初次任务成功、摆脱危险时展露笑容.也曾在希尔被杀害后因塔兹米的误解而袒露心声,阐明自己对于希尔的死有多么的难过和无助.作为杀手的她不仅有着温柔体贴的一面,也会有脆弱难耐的时刻.  对待敌人毫不留情,战斗时异常凶狠,深明帝国的黑暗.虽然是只有十几岁的少女,但从小就接受帝国残酷磨练的赤瞳,为了完成帝国下派的任务,埋葬了无数敌人.曾经独自一人完成了所有的暗杀工作']],
                        艾斯德斯: ['female', 'shu', 6, ['djmsxx', 'dous', 'bldjj', 'mkttm'], ['des: <狩猎者>的首领,帝国最年轻且最强的将军,和 动画人设动画人设 动画人设 布德大将军齐名.超S女王,出身于北方边境地区,是专门狩猎危险种的种族——巴鲁特斯族族长的女儿,从小弱肉强食的思想根深蒂固.在一次单独狩猎归来后发现全族被北方异民族所灭,从此更加认定若要生存只有成为强者.  战斗狂人,对待敌人和战俘十分残忍,曾经转眼间平定了被认为无论如何也至少需要一年才能击败的北方异民族,并将四十万人给活埋.击溃敌人肉体的同时也将对方的心智摧残掉,经常为了尽情享受战斗而故意放对手一马.对待部下和百姓却十分宽厚,总是将获得的赏赐分给部下并与士兵们一起吃饭.  虽然是抖S的性格,但内心也有着小女人的一面,第一次见到塔兹米即对其一见钟情,不顾一切地将其带回基地中.后来对塔兹米的感情渐深,但并不愿意因此改变自己效忠帝国的立场,几次与塔兹米相见后又不断分开.教团激斗篇中两人第一次正式交手,帝都动乱篇里知晓了塔兹米的身份,意识到对方无论如何也不会被自己劝诱后声称将亲手葬送塔兹米.  帝都决战时在至高帝具被打倒后艾斯德斯以一人之力对抗十余名帝具使和百万大军,展现出了天下无双的强劲实力,但因过分沉浸于战斗中而露出了破绽,被赤瞳的村雨砍中,为了对抗咒毒只好自断手腕,以冰刀代替右臂.之后艾斯德斯在与领悟了村雨秘技的赤瞳的对战中落败,临死前用冰块包裹住自己,带着得不到塔兹米心意的遗憾,身体化为冰尘消失.']],
                        见崎鸣: ['female', 'shu', 3, ['yydqrzd1', 'swdys', 'rozy', 'yydqrzd-eozy', 'yydqrzd2', 'zaie'], ['des: 学校:夜见山北中学校  班级:三年三班  位置:5,6  兴趣:绘画  亲人:藤冈未咲(孪生姐妹)、雾果(养母)  角色歌:「 しずかに 」(安静的)   一头蓬松的黑色鲍伯式短发,精致秀气的面孔,诡异的眼罩,鲜红的右眸,苍白的皮肤,小巧玲珑的身材,拥有三无少女的气质,鸣的任何地方都在吸引着人的眼球,让人不由地被她吸引着.  4岁时因长了恶性肿瘤而失去左眼,剩下了一个空洞,母亲似乎出于普通义眼不可爱的原因,给鸣做了一个<人偶义眼>(注:TV0话里提到,左眼是绿色的是因为虹膜异色症,是对妹妹藤冈未咲的解释).  在出生时因为父母家经济能力的原因,在加上母亲的姐妹失去了生育能力,为抚平姐妹的悲伤,所以被理所当然地送到了见崎家,但是和双胞胎妹妹未咲的感情十分深厚.(注:据鸣所说,没有把未咲送出去的原因是因为其中的名字就会变成见崎未咲,罗马音是<MISAKI MISAKI>,在日语中,见崎与未咲发音是一样的.)  不幸的是,未咲因受到<灾厄>的影响,患重症而死,成为在<灾厄>中第一个死亡的人.鸣在未咲在世时也差不多和这个年纪的孩子一样开朗,在未咲逝世后变得更加地沉默寡言.  平日绑有眼罩.曾在夜间的医院跟榊原恒一说话,兴趣是绘画,是让人感觉不可思议的存在.美术社的社员,与三班同学相处得一般,但与低年级的社员们关系不错.被遮住的左眼是<人偶义眼>,能够看到<眼不见为净>的东西,所以在学校里一般不会摘下来.  家里开了一家玩偶店,就住在玩偶店的楼上.不善解答语文考卷上的分析题,小说中有提到理科比文科好.  性格孤傲冰冷而稳重,却也有相当可爱的一面.TV第8话中被小章鱼吓得以为会被它给吃了.  被选中成为<不存在之人>,表面上被3年3班<无视>从动画中可以看出鸣本来的座位是在望月那边的,成为<不存在之人>之后换到了角落靠窗的破旧座位.  漫画形象动画人设见崎鸣和藤冈未咲6张 各种形象 对策委员赤泽泉美误认为是同为对策委员的见崎鸣没有尽到<不存在之人>的本分而引发的灾难,而灾难早已经开始.  TV11话中因身为班中对策委员的杉浦多佳子将小学时的藤冈未咲错认成鸣,被其误认为<死者>,而阻止厄运的方法就是<让死者回归死亡>,于是便煽动全班同学,使见崎鸣遭到3班学生的追杀.  目睹了多佳子的死亡之后为了3班同学的安危下定决心要杀掉<死者']],
                        夜夜: ['female', 'qun', 4, ['mshljgl', 'pqsy', 'xwdxz', 'jqsnbhss'], ['des:赤羽雷真的搭档,少女型人形自动人偶.在两年前的事件中花柳斋硝子将自己交给了雷真,是<花柳斋BRAND>的最高级人形<雪月花>系列中的<月>.虽然是少女的外表,但在她那华丽的外表下却有着强大的力量.身着哥特式和服,黑色长发,脚蹬雷真送给她的靴子,是<花柳斋>最高级人形<雪月花>的次女<月之少女>.华丽的外表下有着强大的力量,被硝子称为<最适合保护重要>的人偶.  性格天真乖巧,把赤羽雷真看做最重要的人,只要是雷真的话和命令完全听从(女人方面除外).在雷真面前表现出毫无羞耻心且有很大程度的幻想,经常沉浸在夜里袭击雷真但屡屡不得手的超残念中,在人前也毫不掩饰对雷真的爱,经常说些让人误会的话从而让雷真被当作大变态看待,独占欲强烈,只要雷真和其他女人接触都会嫉妒不已,散发出超强的怨气.夜夜是一个十分接近人类少女的自动人偶,情感十分丰富.']],
                        我妻由乃: ['female', 'shen', 4, ['ft', 'wlrj', 'yydqrzd-btda', 'yydqrzd-bj', 'yydqrzdpz', 'yzmds'], ['des:我妻由乃,<未来日记>的女主角.一周目的胜利者(一周目的神)、二周目2nd以及三周目的由乃.粉红长发梳成两股辫子在脑后,是成绩优秀,长相端丽的美少女,平时对同学的性格都很好,喜欢雪辉到了疯狂的地步.我妻由乃是<病娇>的典型代表角色.本来是主人公天野雪辉的同学,心中暗恋他到达了偏执和痴狂的地步,成为了不折不扣的跟踪狂.由于这种爱,她也成为了未来日记所有者之一,通称2nd(后面剧情解释其实2nd由乃,是一周目赢得游戏并成为神的由乃,再击杀二周目的自己后,成为了二周目的2nd).为了天野雪辉,我妻由乃可以牺牲一切东西,甚至包括自己.也正是她病态的执着和对雪辉的爱,让天野雪辉一次次渡过难关,并除掉一切挡在面前的敌人.结局最后,雪辉为了拯救三周目的世界和三周目的由乃,主动要求一周目的由乃杀了自己,但由乃在最后并没有选择击杀雪辉,而是选择击杀了自己,让雪辉成为了二周目的神.']],
                        面灵气: ['female', 'shen', 3, ['yydqrzd-xsqm', '川胜之灵', 'jxzm', 'yydqrzd_zl', 'yydqrzd_qmgz'], ['des:传记一:代表失败的面具蝉丸被敌人刺死.蝉丸带着哭泣和嫉妒,用最后的力气望向了福神.蝉丸的眼神中带着黑色的恨意,以及红色的笑意.五彩斑斓的小丑只剩下黑红两色. 象征喜悦的福神喝着胜利的祝酒,嘲笑着嫉妒而死的小丑,却在醉酒中死去.酒洒了出来里面掺杂着一滴小丑的眼泪.永远冷静的小面想去寻找凶手的线索,却被阻止并偷袭.他临死之前说,所有人都会死去,没有人能逃离.    传记二:  一惊一乍的面具大飞出成功偷袭之后,顿觉一身轻松,安安稳稳的睡了个好觉,却不知道自己永远不会再醒来.再他的梦中,他获得了所有人的力量,成为了活下来的唯一面.面具狐隐喻智慧.狐为了给大家复仇,对梦中的同伴痛下毒手.得到了其他四人的力量的狐止不住的哭泣,为什么自己没有早一点开始这场杀戮..... 没有感情的空白面具姥,在最初的时候身体就不听使唤,拿起手中的刀刺向蝉丸,这就是一切的开始......    传记三:     心怀恐惧的面具猿,看到所有人互相残杀,尖叫着远离,请求主人的保护,但却......被主人背叛. 父亲留下来的七个面具,喜怒哀乐等七种情绪蕴含其中.每个面具都想吞噬其他面具,这样它就能获得其他面具的力量.但是,如果真的只能留下一个面具,那就太可惜了......这七个我都想要......那么就让它们都和我合为一体吧......']],
                        yydqrzd_sihuang: ['female', 'qun', 3, ['sqnzl', 'wendao', 'tianming3', 'yydqrzdstfm', 'wwhs', 'qrzd_stfx'], ['des:来自南海以南的术士,萝月的师父.作为<天命>一脉的术士,她能够看见周围的命数,净化邪祟,护佑同伴,甚至更改他人的死期——但是需要付出极其巨大的代价,轻易无法使用.当徒弟萝月先行一步来到交界都市时,她发现了这座城市异常的死期现象,无法坐视不理而踏上了旅程,同时也走向了注定的命运.因为自小修习,性情沉静,对人情世故也不甚熟络,以至于让旁人觉得高冷难以亲近.其实只是不知如何与旁人相处罢了.尽管知道凡人窥探天道会遭到无法想象的反噬,但她仍抱持着想要一睹天道的理想奋力前行着.']],
                        乌鹭: ['male', 'shen', 4, ['qrzd_mj', 'qrzd_zrsh', 'qrzd_qnbf', 'qrzd_dpmj', 'qrzd_yzzzz'], ['des:温柔的树先生,在教会旁的孤儿院中担任院长.没有异变发生前的记忆,似乎是被刻意抹去了,但本人不是很在意,只专注于孩子们的事情.绝对的好人,十分温柔,体贴但不婆妈,对待小东西都小心翼翼,必要的时候也会非常严厉,很受孩子们欢迎.每天忙于孤儿院(保姆)工作,在孤儿院一定能碰到他, 不过很可能会被请求帮忙做杂事最后演变成义工,事先做好准备哦.']],
                        雾岛董香: ['female', 'wu', 4, ['qrzd_hzyh', 'qrzd_ssg', 'qrzd_js', 'qrzd_ym'], ['des:清巳高中普通科二年级生.同时也在一家名为<古董>的咖啡厅里打工,面对陌生人会变得非常腼腆,对熟人则心直口快.喜欢的动物是兔子,同时也非常珍视校园生活.  真实身份为20区食尸鬼之一,赫子为羽赫(刚开始只有一边完整,另一边残缺,在<东京战记:re>中成长为双羽赫).平时以刘海遮住右眼,在某些战斗中或特别描写时右眼会显露出来.  父亲雾岛新在年幼的时候被喰种搜查官驱逐.有一个弟弟绚都,但后来因为对人类的观念不和而分道扬镳.']],
                        璐璐: ['female', 'wu', 3, ['qrzd_ehsnxz', 'qrzd_yyqd', 'qrzd_xcyl', 'qrzd_wjxk'], ['des:无口且无表情的腹黑少女.从不轻易开口说话,开口必毒舌.语速很快,当你反应过来的时候她已经说完闭嘴重新陷入沉默.敏感,洁癖,强迫症,有点神经质的完美主义者.来自东方国家,家中经营占卜馆,爷爷是一位神神叨叨的老占星师,跟在爷爷身边学习了很多星辰方面的知识,从小就对星星产生了巨大兴趣.绘制星图极为准确,无法容忍任何一点误差.']],
                        濑由衣: ['female', 'qun', 3, ['qrzd_cgajjw', 'xzd', 'qrzd_hm', 'qrzd_yhdjy'], ['des:来自东洋国家的少数民族.在山野中体会着丛林法则长大,充满警戒心以及野性直觉.像一头小野兽,不擅长和人交流,很凶,脾气很差,动不动就发怒,长大后虽然有所改善,但骨子里的野兽性格却没有被抹去.对城市生活一窍不通,但掌握着较高野味料理和缝纫技巧,身上的衣服就是她自己设计的.']],
                        黑死: ['male', 'qun', 3, ['手杖【日蚀之杖】', 'qrzd_szrszz1', 'qrzd_szwsem', 'daidinh', 'qrzd_xsdg1', 'qrzd_mrcx'], ['des:受雇于古研所却一直游离在交界都市各个角落的高端医学专家,始终带着用意不明的鸟嘴面具.']],
                        塔兹米: ['male', 'wei', 4, ['剑术精通', '成长'], ['des:塔兹米是出身乡村的年轻剑士,个子不高,但身体很结实.有着纯洁的笑容,被雷欧奈评价为<可爱的少年>.  生来拥有杀手的资质,小时候在村子里接受过一位退役军人教官的训练,拥有一定的武术和锻造基础.擅长使用剑,曾凭借剑技狩猎过巨型危险种.在得知好友被帝都富商害死后加入暗杀组织Night Raid.每次有同伴战牺牲都会十分伤心,但又能迅速够调整心态.  被赤瞳评价能够成为<将军>级别的大器.布兰德曾说塔兹米领悟能力很强,只要严格训练日后定能成为超越自己的男人,他十分期待那一天.']],
                        千式: ['female', 'shen', 3, ['qrzd', '易式·辉月', '逆式·烁星', '千式·淬羽', 'xingzhiyuanye', 'qrzd_xzyy', '绝式·蔽日'], ['des:千式:<我希望能有一天,能与大家一起,在星星铺就的原野上,自由的漫步……现在....我的愿望是否....已经实现了？>四周渐渐陷入黑暗,但唯有星辰闪耀.在她的视觉系统即将报废的时候,少女终于看到脚下开启的巨大黑门 但她已经不能动弹了']],
                        伊斯卡里奥: ['male', 'western', 3, ['圣枪【郎努基斯】', 'yvz', 'ms', '大地为之怮哭'], ['des:伊斯卡里奥自幼冷酷无情,不如说存在于他体内的只有神性、神以下众生皆为蝼蚁.认为自己就是神最完美的青睐者.只有完美的存在才配生活在神明所追求的完美世界中.自己只是替代神让这个世界变得符合神想要的<完美的世界>罢了. 直到他发现自己得了先天性白化病,随着身体的白化,那股对蝼蚁的蔑视逐渐蔓延到了自己身上.他开始觉得自己也是残次品,自己永远不会得到神的注目. 世间在他的眼中慢慢失去了兴趣,他开始厌恶这个世界上所有的残次品,包括他自己.自己将永远带着这个名为伊斯卡里奥的丑陋躯壳生存下去. 为了能帮助神明建立真正完美的世界,扭曲的伊斯卡里奥制定了是灾厄之种计划. 这是为了净化世界和消灭指挥使斩断轮回来获得神的垂青的灭世计划. 伊斯卡里奥认为只有将这个世界所有的残次品清理干净而不是靠着所谓的天选之人的轮回才能得到<神的注目> 为此伊斯卡里奥开始跟海底研究所的科学家让•塔克的合作(甚至希罗也参与了其中),他们欺瞒了教会并利用教会的影响力诱拐了无数的孩童来进行试验.通过牺牲了无数诱拐来的孩子的生命,伊斯卡里奥制造出了用来灭世的灾厄之种,一名由外力催生出的可以用来灭世的人造神器使——伊萨克.可是伊萨克也是一个残次品,他无法控制神器并出现了暴走,在暴走的过程中,伊萨克被教会的处刑人格雷穆发现并拯救.伊斯卡里奥为了避免计划被暴露只好暂时搁置了培养灾厄之种的计划. 但是让塔克却并未停止研究,他也向伊斯卡里奥隐瞒了研究进展,并将二人合作后得到的研究成果运用到了自己的<女儿>身上,最终成功的培育出更为优秀的灾厄之种——羽弥. 为了支撑灭世计划的进行,伊斯卡里奥也在和希罗进行着表面上的合作,二人在相互利用的同时也一起在暗处绞杀着对交界都市有着不轨之心的其他势力 伊斯卡里奥的阴谋表面上不为人知,实际是早就引起了圣星教会上层的注意,瑟蕾斯就是专门由宗座理事会派来监视他的监视者赛斯也是监视者之一,他直接得到了了来自了教皇的命令,负责监视伊斯卡里奥在交界都市的一切行为. 因为神器的能力,伊斯卡里奥至始至终都能察觉的到指挥使和神明的存在和身份,明白指挥使是神选之人.也明白教会所记载的神并不是神像里的女神而是从未见过面的塞拉菲姆,但是伊斯卡里奥所具有的能力也只是感知,在塞拉菲姆出现在了伊斯卡里奥面前后,他也无法识别出塞拉菲姆的真实身份. 因为崇拜神明,伊斯卡里奥就算牺牲世界为代价也只是想见神明一面.']],
                    },
                    translate: {
                        安托涅瓦: '安托涅瓦',
                        阿希莉亚: '阿希莉亚',
                        羽弥: '羽弥',
                        爱缪莎: '爱缪莎',
                        十玖: '十玖',
                        安: '安',
                        珈儿: '珈儿',
                        丽: '丽',
                        零: '零',
                        艾露比: '艾露比',
                        雯梓: '雯梓',
                        伽梨耶: '伽梨耶',
                        奥蕾西娅: '奥蕾西娅',
                        亚修: '亚修',
                        重渊: '重渊',
                        白歌: '白歌',
                        塞拉菲姆: '塞拉菲姆',
                        蓬莱山辉夜: '蓬莱山辉夜',
                        受: '铃仙·优昙华院·稻叶',
                        狂气: '铃仙·优昙华院·稻叶',
                        奴良陆生: '奴良陆生',
                        赤瞳: '赤瞳',
                        艾斯德斯: '艾斯德斯',
                        见崎鸣: '见崎鸣',
                        夜夜: '夜夜',
                        我妻由乃: '我妻由乃',
                        面灵气: '面灵气',
                        yydqrzd_sihuang: '司篁',
                        乌鹭: '乌鹭',
                        雾岛董香: '雾岛董香',
                        璐璐: '璐璐',
                        濑由衣: '濑由衣',
                        黑死: '黑死',
                        塔兹米: '塔兹米',
                        千式: '千式',
                        伊斯卡里奥: '伊斯卡里奥',
                        yydqrzd1: '不存在之人',
                        yydqrzd1_info: '每回合限一次,你可以弃置一张牌,令自己在下个回合开始前,你不能被成为卡牌的目标.',
                        yydqrzd: '不存在之人',
                        yydqrzd_info: '',
                        yydqrzd2: '死亡的颜色',
                        yydqrzd2_info: '',
                        'yydqrzd-eozy': '人偶之眼',
                        'yydqrzd-eozy_info': '',
                        'yydqrzd-btda': '病态的爱',
                        'yydqrzd-btda_info': '出牌阶段,你可以弃置一张♠️️牌,令一名其他角色先弃置所有手牌再摸5张牌并展示之,你可以弃置其中所有非基本牌,并对其造成等量的伤害.',
                        'yydqrzd-bj': '病娇',
                        'yydqrzd-bj_info': '锁定技,当你受到伤害后,你可以进行一次判定.若结果不为♥️️,则伤害来源须弃置三张手牌,否则受到来自你的一点伤害.',
                        yydqrzdpz: '偏执',
                        yydqrzdpz_info: '回合开始前,你可令除你以外的角色的非锁定技于本回合内失效.',
                        yzmds: '一周目的神',
                        yzmds_info: '当你进入濒死状态时,可以指定一名其他角色流失三点体力,你回复体力值至生命上限并摸4张牌,并且在当前游戏回合结束后立即开始一个新回合,之后你失去此技能',
                        fyz: '缝衣针【克洛托之针】',
                        fyz_info: '锁定技,你使用牌无距离限制,你的杀有75%概率强制命中',
                        wy: '乌鸦【茉莉安】',
                        wy_info: '锁定技,你使用【杀】指定的目标数上限+2,次数上限+自己已损失的体力值+1,造成的伤害+1.',
                        qpss: '切牌圣手',
                        qpss_info: '任一角色回合开始前,你可以观看牌堆顶的一张牌,你可以选择一项:用一张手牌替换之;若你的手牌数不是全场最多的(或之一),你可以获得之.',
                        xshx: '血色虹吸',
                        xshx_info: '体力不大于2时,造成伤害后可以随机获得一张基本牌并回复一体力.',
                        szlc: '时滞力场',
                        szlc_info: '锁定技,打出一张闪后,可以获得一个额外的回合.',
                        syzj: '闪耀重击',
                        syzj_info: '一回合最多使用5次,你可以弃置1张非延时锦囊牌,对1名其他角色造成1点伤害.',
                        yxhy: '移形换影',
                        yxhy_info: '你受到伤害时,你可以与伤害来源交换座位,获得攻击距离内敌方角色各1～2张牌并对这些角色造成1点神圣伤害.',
                        bwdyw: '卑微的愿望',
                        bwdyw_info: '锁定技,当你受到伤害后,你展示牌堆顶x张牌,每有一张红色牌,你回复一点体力,你摸等同于展示的牌中黑色牌数量的牌,x为你已损失体力值,且最多为4',
                        yjfz: '异界放逐',
                        yjfz_info: '出牌阶段限一次,你可与一名角色拼点,若你赢对方翻面并受到2点雷属性伤害',
                        kptlp: '魔索【格莱普尼尔】',
                        kptlp_info: '锁定技,防止你即将受到的伤害,改为流失一点体力;你不能成为其他角色的延时锦囊的目标',
                        xzd: '红莲之剑痕',
                        xzd_info: '每回合最多发动三次,每当你造成伤害后,你获得等量的护甲,回复一点体力.',
                        zpw: '路人',
                        zpw_info: '锁定技,你不能成为【顺手牵羊】、【铁索连环】、【火攻】和【乐不思蜀】的目标.',
                        nyfz: '诺亚方舟',
                        nyfz_info: '任意一名角色进行判定前,你可以观看牌堆顶的两张牌,并可以将其调换顺序',
                        mydlp: '命运的轮盘',
                        mydlp_info: '出牌阶段限1次,你可以弃置2张手牌选择1名其他角色进行判定,根据判定牌的点数亮出牌堆顶等量的牌,你对其造成等同于亮出牌中黑色牌数量的伤害.',
                        fznyfz: '方舟【诺亚方舟】',
                        fznyfz_info: '锁定技,部分负面类锦囊牌对你无效',
                        wlsxlz: '我流·碎星连斩',
                        wlsxlz_info: '摸牌阶段,你可以放弃摸牌,改为亮出牌堆顶的6张牌,其中每有1张非延时锦囊牌,你可视为对1名其他角色使用1张杀.将这些非延时锦囊牌置入弃牌堆,其余收入手牌.',
                        tss: '替身术',
                        tss_info: '每当你即将受到伤害时,你可以进行一次判定,若结果为黑色,你隐身取消此伤害,否则你摸两张牌.',
                        wledfq: '我流·二段风切',
                        wledfq_info: '锁定技,你造成伤害之后有55%的概率附加一点雷属性伤害',
                        sbtzqag: '神兵【童子切安纲】',
                        sbtzqag_info: '锁定技,造成伤害后回复等量体力并随机获得一件装备牌.',
                        sgzr: '时光之刃',
                        sgzr_info: '锁定技,你造成的伤害会扣除目标等量体力上限,你摸等量的牌.',
                        ysxj: '鸦神血祭',
                        ysxj_info: '每当你受到一次伤害,你可以对伤害来源造成一次伤害',
                        sjsgzj: '双剑【时光之剑】',
                        sjsgzj_info: '锁定技,回合结束时,若你有装备武器牌,你可以摸2张牌并回复1点体力,获得2点护甲',
                        sjhs: '时间回溯',
                        sjhs_info: '锁定技,回合结束后,你进行一个额外的回合',
                        hjjz: '黄金眷族',
                        hjjz_info: '出牌阶段限一次,你可以弃置所有手牌并翻面,指定一个目标,从你下家开始场上所有角色依次与对使用【决斗】,直到体力为0为止.',
                        bs: '宝伞【毗沙门天慧伞】',
                        bs_info: '锁定技,在结束阶段,若你于此回合内造成过伤害,你可以获得3点护甲并摸2张牌',
                        ljbdyh: '灵剑【布都御魂】',
                        ljbdyh_info: '锁定技,当你使用【杀】指定一名角色为目标后,目标需进行一次判定并且该角色的非锁定技失效直到回合结束,除非该角色弃置一张与判定结果花色相同的牌,否则不能使用【闪】抵消此【杀】.',
                        rzd: '刃之道',
                        rzd_info: '',
                        bd: '拔刀',
                        bd_info: '锁定技,你可以无限出【杀】,你的进攻距离无限.忍之道:回合开始和回合结束时,你摸两张牌.',
                        yd: '影打',
                        yd_info: '受到伤害时,35%格挡并对伤害来源造成伤害,你摸两张牌并回复体力.',
                        jyfc: '金翼俯冲',
                        jyfc_info: '场上所有角色若在弃牌阶段有弃牌时,你可以对其造成1点伤害并摸两张牌',
                        hlzl: '火灵之力',
                        hlzl_info: '准备阶段,你可以对一名其他角色造成1点火焰伤害并随机摸1~2张牌',
                        smdzl: '生命的赞礼',
                        smdzl_info: '出牌阶段限两次,你可以弃置一张手牌并令一名角色回复一点体力并摸两张牌,之后你回复一点体力.',
                        swdcm: '死亡的触摸',
                        swdcm_info: '锁定技.当你受到一次伤害后,你摸两张牌,伤害来源失去一体力上限',
                        skll: '时空乱流',
                        skll_info: '锁定技,回合结束时若你已受伤,你对其他全体角色造成1点雷属性伤害',
                        hdtymt: '混沌【提亚马特】',
                        hdtymt_info: '当一名角色处于濒死状态时,你可以亮出牌堆顶的3张牌,该角色回复等同于其中红色牌数量的体力,将这些红色牌置入弃牌堆,最后你获得其余的牌.',
                        szssjs: '时针·瞬间加速',
                        szssjs_info: '出牌阶段限1次,你可以弃置任意类型不同的牌各1张并对等量的其他角色各造成1点伤害',
                        hjs: '黄金伞',
                        hjs_info: '当你成为其他角色使用的卡牌目标时,可以进行判定,若为红色此牌对你无效,若为黑色你摸1张牌',
                        jjlw: '剑技乱舞',
                        jjlw_info: '出牌阶段限1次,你可以对至多3名其他角色造成0~2点伤害',
                        jdskdzj: '剪刀【诗寇蒂之剪】',
                        jdskdzj_info: '锁定技,你使用【杀】的次数与目标+1,且指定目标后,目标角色须弃置一张锦囊牌,否则此【杀】不可被【闪】响应.',
                        zxhzgs: '执先·黑之攻势',
                        zxhzgs_info: '当一张红色【杀】或红色非延时锦囊牌仅指定一名角色为目标后,你可以弃置一张手牌令其无效,对目标角色造成1一次雷属性伤害.',
                        lhjq: '灵魂剪切',
                        lhjq_info: '在回合开始和回合结束时,你可以选择1名角色进行判定,若判定牌为红色,目标失去一点体力上限,你摸一张牌并回复1点体力,若判定牌为黑色,你对其造成2点伤害并摸1张牌',
                        wqwzzy: '围棋【王者之弈】',
                        wqwzzy_info: '锁定技,你的攻击距离+2,你造成的伤害翻倍',
                        yx: '影袭',
                        yx_info: '锁定技,造成伤害+1,你使用【杀】指定的目标数上限+1,',
                        rxbzys: '让先·白之守御',
                        rxbzys_info: '每当你受到伤害后,你可以令1名角色进行1次判定,若结果为红色,该角色回复1点体力,你摸1张牌;若结果为黑色,你获得1点护甲并摸1张牌',
                        cmzj: '沉默之剪',
                        cmzj_info: '你可以将你的任意一张黑色手牌当作【无懈可击】使用.',
                        qlzj: '青龙之卷',
                        qlzj_info: '锁定技,你使用【杀】指定的目标数上限+2,次数上限+1,',
                        gzj: '光之酒',
                        gzj_info: '出牌阶段限一次,你可以弃置一张♥️️牌,令一名角色先弃置所有手牌再摸等量的牌并展示,其中每有一张非基本牌,你令其回复1点体力,以此法回复的过量体力效果改为令其摸等量的牌.',
                        ydzs: '跃动之水',
                        ydzs_info: '你可以将一张红色手牌当做【闪】使用或打出,在你某些时刻你会摸1张牌',
                        tydjs: '跳跃的酒水',
                        tydjs_info: '回合结束阶段,你可以选择1~2名角色,令其摸1张牌,你摸2张牌并回复1点体力',
                        sjsmj: '神酒【苏摩酒】',
                        sjsmj_info: '出牌阶段限一次,你可以令一名其他角色摸2张牌回复一点体力或弃置3张牌并受到1点伤害.',
                        dqhl: '氮气滑轮',
                        dqhl_info: '锁定技,当你受到伤害后:若此伤害是你本回合第1次受到伤害,则你回复1点体力;若不是你本回合第1次受到伤害,则你摸1张牌.',
                        msyayzz: '迷失于爱意中',
                        msyayzz_info: '出牌阶段限一次,你可以弃一张牌并选择两名男性角色.若如此做,视为其中一名男性角色对另一名男性角色使用一张【决斗】.你若为此做, 技能结算后你回复一点体力.',
                        ms: '痛苦的救赎',
                        ms_info: '锁定技,每当你受到一次伤害后,当前回合结束,你执行一个额外回合',
                        ezh: '恶之花',
                        ezh_info: '当你成为【杀】的目标时,你可以令另一名其他角色选择一项:交给你一张【闪】或者也成为此【杀】的额外目标并失去一点体力.',
                        ymzszy: '羽毛【真实之羽】',
                        ymzszy_info: '锁定技,当你有手牌时,你防止受到的属性伤害;当你没有手牌时,你防止受到的非属性伤害.',
                        zxzl: '真相追猎',
                        zxzl_info: '回合开始/结束阶段开始时,你可以观看牌堆顶的Ｘ张牌(Ｘ为存活角色的数量,且最多为5),将其中任意数量的牌以任意顺序置于牌堆顶,其余以任意顺序置于牌堆底.',
                        hlxtd: '合理性推断',
                        hlxtd_info: '当你于回合外需要使用或打出一张基本牌时,你可以观看牌堆顶的两张牌.若你观看的牌中有此牌,你可以使用打出之.若推断成功,你回复一点体力获得一点护甲.',
                        ljyd: '灵机一动',
                        ljyd_info: '锁定技,你的武将牌始终正面向上,你的判定区内的牌效果反转',
                        hxfs: '凰血凤髓',
                        hxfs_info: '限定技,当你处于濒死状态时,你可以弃置你区域内的所有牌并复原你的武将牌,摸4张牌并将体力回复至3点并获得3点护甲.',
                        sjzq: '神剑【朱雀】',
                        sjzq_info: '你的回合内,你打出的【杀】结算后可以进行一次判定,若为红色,则视为你对目标使用一张【杀】.否则你回复一点体力',
                        znly: '朱鸟燎原',
                        znly_info: '限定技.出牌阶段,你可以令所有其他角色各选择一项:弃置至少X张牌(X为该角色的上家以此法弃置牌的数量+1);或受到你对其造成的3点火焰伤害,且在技能结算后回复三点体力.',
                        xws: '完杀',
                        xws_info: '锁定技,你的回合内,除你以外,不处于濒死状态的角色不能使用【桃】.',
                        guanx: '观星',
                        guanx_info: '锁定技,准备阶段,你观看牌堆的X张牌(X为场上存活人数)并且任意移动Y张牌(Y为你当前体力值)',
                        ghqs: '光辉驱散',
                        ghqs_info: '锁定技,回合结束阶段,若场上的[阳]标记总数不小于4,你须依次从每名被标记的角色处获得等同于其[阳]标记数量的手牌.若该角色手牌不足,则你获得其全部手牌,该角色受到你对其造成的1点神圣伤害.最后移除场上全部的[阳]标记.',
                        lgyc: '陵光以蹴',
                        lgyc_info: '你造成一次伤害后,若此伤害是你本回合第一次造成伤害,你摸两张牌获得两点护甲且回复一点体力;否则你摸一张牌.',
                        qsj: '骑士剑【伽伦廷】',
                        qsj_info: '每当你使用决斗造成伤害,你可以让受伤一方丢弃一张牌,你摸一张牌获得一点护甲.',
                        qstj: '骑士突击',
                        qstj_info: '出牌阶段最多使用三次,你可以将你的任意一张红色手牌当作决斗使用.',
                        xtfj: '箱庭风景',
                        xtfj_info: '出牌阶段,其他角色的手牌对你可见.',
                        yvz: '神迹所到之处',
                        yvz_info: '出牌阶段限1次或每自己回合开始前,你可以从3个随机亮出的技能中选择一个获得其技能.',
                        yzjm: '阳之剑芒',
                        yzjm_info: '每当一名角色受到【杀】或【决斗】造成的一次伤害时,你可以将一枚[阳]标记放置在该角色或伤害来源(不为你)的武将牌上.',
                        yyyxydzr: '永远与须臾的罪人',
                        yyyxydzr_info: '锁定技,当其他一名角色打出一张闪后,可以获得一个额外的回合并回复体力.',
                        hsq: '神宝【火鼠裘】',
                        hsq_info: '锁定技,你防止即将受到的火焰伤害,改为回复1点体力,并可以摸两张牌',
                        yydgzdx: '永远的公主殿下',
                        yydgzdx_info: '每当你受到或造成1点伤害后,你随机获得一个技能',
                        plyz: '神宝【蓬莱玉枝】',
                        plyz_info: '每回合限用一次,你可以对一名其他角色造成两点伤害并使其翻面,你摸两张牌.',
                        smyl: '</font> <font color=#f00>神明陨落</font>',
                        smyl_info: '</font> <font color=#f00>  在一次次的轮回和神明近乎玩弄般的嘲讽中,凡人感到万丈的怒火,随着那颗击穿时空位面的子弹,<从此,神明坠入了箱庭></font>',
                        plzy: '</font> <font color=#f00>蓬莱之药</font>',
                        plzy_info: '</font> <font color=#f00>不老不死药是禁药,而偷吃了不老不死药的辉夜公主成了不死之身,也因此被流放.</font>',
                        kmmhsj: '狂梦『梦幻世界』',
                        kmmhsj_info: '出牌阶段限一次,你可以对3名其他角色造成一点伤害并使其混乱状态,你每对一名角色发动你获得一张牌.',
                        hpcycm: '幻波『赤眼催眠』',
                        hpcycm_info: '出牌阶段限一次,你可与一名角色拼点,若你赢对方翻面混乱且失去一点体力上限流失一点体力,你获得三张牌.',
                        rxklywz: '弱小可怜又无助',
                        rxklywz_info: '锁定技,别人对你造成的伤害始终-1',
                        kqzt: '狂气之瞳',
                        kqzt_info: '锁定技,你的【杀】无视防具且伤害+1,可使用的【杀】的次数额外＋1.',
                        bsrsdyt: '变身弱受的月兔',
                        bsrsdyt_info: '出牌阶段限一次,你可以变身成弱受铃仙,并回复体力',
                        lx: '铃仙',
                        lx_info: '每当你于回合外使用或打出一张手牌,你可以选择攻击范围外的一名其他角色与你各摸一张牌,并回复一点体力.',
                        zhai: '宅',
                        zhai_info: '',
                        yexi: '潜伏',
                        yexi_info: '每当你使用一张锦囊牌,你可以视为对一名不是此牌目标的角色使用一张杀,若如此做,你获得潜行直到下一回合开始',
                        wlrj: '未来日记',
                        wlrj_info: '回合阶段开始时,你可以观看牌堆顶的Ｘ张牌(Ｘ为存活角色的数量,且最多为7),将其中任意数量的牌以任意顺序置于牌堆顶,其余以任意顺序置于牌堆底.',
                        ft: '斧头',
                        ft_info: '锁定技,你始终视为装备着贯石斧,用杀造成伤害后,目标流失一点体力,你获得一点体力上限并回复一点体力,之后你摸两张牌.',
                        pqsy: '破却水月',
                        pqsy_info: '每回合限用一次,你可以弃置1张非延时锦囊牌,对一名其他角色造成两点伤害并使其翻面,之后你翻面获得一点护甲.',
                        jqsnbhss: '机巧少女不会受伤',
                        jqsnbhss_info: '受到伤害时,有一定概率格挡此伤害并摸一张牌.',
                        mshljgl: '魔术回路【金刚力】',
                        mshljgl_info: '锁定技,你的【杀】无视防具且伤害+1,可选择的目标+2.',
                        xwdxz: '夏娃的心脏',
                        xwdxz_info: '锁定技,弃牌阶段结束时,你获得一点体力上限并回复一点体力获得一点护甲.',
                        jdfys: '绝对防御s',
                        jdfys_info: '锁定技,当你受到伤害时,你防止之,摸等同于此伤害值数量的牌.',
                        cyby: '村雨备用',
                        cyby_info: '锁定技,你造成的伤害会偷取目标等量体力上限,你可使用【杀】的次数＋3.',
                        jiushu: '救赎',
                        jiushu_info: '当你失去最后的手牌时,你可以摸十张牌,回复两点体力,如果自己在翻面状态则解除自己的翻面.',
                        zaie: '</font> <font color=#f00>灾厄</font>',
                        zaie_info: '</font> <font color=#f00>大家……都在惧怕,已经开始了,大家都这么想……</font>',
                        rozy: '人偶之眼',
                        rozy_info: '出牌阶段限两次,你可以观看一名其他角色的手牌,可以用一张手牌替换其中的一张.另外在一名角色的判定牌生效前,你可以打出一张黑色牌替换之.',
                        mkttm: '</font> <font color=#f00>摩珂钵特摩</font>',
                        mkttm_info: '</font> <font color=#f00>冷却两回合,你可以对至多7名其他角色造成两点伤害并使其翻面,丢弃六张手牌</font>',
                        djcy: '帝具【一斩必杀·村雨】',
                        djcy_info: '锁定技,你可使用【杀】的次数＋1,你造成的伤害会扣减目标等量体力上限,你摸一张牌,回复一点体力并获得一点护甲.',
                        bldjj: '冰岚大将军',
                        bldjj_info: '锁定技,其他角色摸牌时,若摸牌数不少于2,须将摸到的牌中的一张交给你.',
                        dous: '抖s',
                        dous_info: '锁定技,距离你为1的角色受到伤害时,你回复两点体力,若你没受伤,改为摸两张牌',
                        djmsxx: '帝具【魔神显现·恶魔之粹】',
                        djmsxx_info: '每当你使用杀造成伤害,你可以令受伤害角色流失两点体力,你流失一点体力,你摸两张牌,目标丢失一点体力上限并弃置两张牌.',
                        zangsong: '葬送',
                        zangsong_info: '锁定技,当你对别人使用【杀】时,回合后获得潜行直到下回合开始,若你处于潜行状态时,你的【杀】不可闪避.',
                        mmqw: '弥弥切丸',
                        mmqw_info: '锁定技,每当你的装备区有武器时,你使用【杀】指定一个目标后,该角色需要依次使用两张【闪】才能抵消此【杀】',
                        bgyx: '百鬼夜行',
                        bgyx_info: '出牌阶段限一次,你可以弃4枚<畏>标记并选择所有其他角色,这些角色先各弃置其装备区里的牌,再各弃置两张手牌,受到来自你的一点伤害,你发动此技能后可以摸三张牌,你将武将牌翻面.',
                        jhsy: '镜花水月',
                        jhsy_info: '当一名其他角色的牌指定你为唯一目标时,你可以弃置一张<畏>标记,选择该角色或者该角色攻击范围的另一名角色,该牌的目标转移为该指定角色,你获得一张牌.',
                        bsfkdyt: '变身疯狂的月兔',
                        bsfkdyt_info: '每回合限一次,你可以变成为狂气铃仙,并回复体力',
                        xhwh: '猩红舞会',
                        xhwh_info: '出牌阶段限一次,你可以弃置一张锦囊牌,获得一名其他角色的所有手牌,你与该角色同时翻面,你与该角色流失一点体力.',
                        xkzs: '虚空之神',
                        xkzs_info: '锁定技,其他角色的回合开始时,你摸一张牌并回复一点体力.',
                        rojxyz: '人偶交响乐章',
                        rojxyz_info: '每当你对一名角色造成一次伤害并结算完毕后,你可以随机摸0~2张牌,你的杀指定的角色+1,可使用杀次数加自己已损失体力值+2',
                        swdys: '死亡的颜色',
                        swdys_info: "'每当有角色进入濒死状态时,你可以令其进行1次判定,若结果为红色,其回复1点体力,若为黑色令其立即死亡,当你使得一名角色体力为0时,该目标直接死亡",
                        畏: '畏',
                        畏_info: '锁定技,每当你受到一点伤害或造成一点伤害时,你获得一个<畏>标记.',
                        zzhzly: '镇子·黑子领域',
                        zzhzly_info: '其他角色的回合开始时,你可以令1名角色判定,若为红色,你回复1点体力并摸1张牌;若为黑色,你使其流失1点体力(无<棋子>时不可使用)',
                        'yydqrzd busi': '不死',
                        'yydqrzd busi_info': '锁定技,当你进入濒死状态时,你进行一次判定,若结果不为♠️️,你将体力回复至1并将武将牌翻至背面',
                        yydqrzd_xzd: '弦之盾',
                        yydqrzd_xzd_info: '锁定技,在每名角色的准备阶段,若你没有护甲,你获得2点护甲;每当你的护甲抵消一次伤害,你摸一张牌',
                        yydqrzd_zl: '注灵',
                        yydqrzd_zl_info: '每当一名角色受到【杀】,【火攻】,【万箭齐发】,【南蛮入侵】或【决斗】造成的一次伤害时,你可以将一枚[面]标记放置在该角色或伤害来源(不为你)的武将牌上.',
                        yydqrzd_qmgz: '七面归真',
                        yydqrzd_qmgz_info: '锁定技,出牌开始前,若场上的[面]标记总数不小于7,你依次从每名被标记的角色处获得等同于其[面]标记数量的手牌.若该角色手牌不足,则你获得其全部手牌,该角色受到你对其造成的3点神圣伤害.最后移除场上全部的[面]标记.',
                        jxzm: '禁断之面',
                        jxzm_info: '当有角色受到【杀】造成的伤害后,你可以弃一张牌,并令其进行一次判定,若判定结果为:♥️️则会触发<福神>,该角色回复2点体力;♦️️︎则会触发<狐面>该角色摸三张牌;♣️️则会触发<姥>,伤害来源弃三张牌;♠️️则会触发<猿>伤害来源流失一点体力',
                        教皇: '教皇',
                        教皇_info: '锁定技,其他角色的出牌阶段开始时,若其手牌数不小于你,其须交给你一张手牌.',
                        换手牌: '换手牌',
                        换手牌_info: '<font color=#F0F>孢子之术</font> 回合外,当你需要打出一张卡牌【杀】或者【闪】时,你可以观看任意一名其他角色的手牌并将其视为你的手牌打出(白绝有柱间细胞,故类似千手柱间的技能木遁,兼有侦察能力)',
                        永远的七日之都: '永远的七日之都',
                        永远的七日之都_info: '——想要被爱的机械人偶 ——渡世而不渡己的方舟 ——许下愿望的黑白羽翼 ——守护弱小的世界之树 ——独自肩负众生的侠者 ——永远无法成人的少年 ——希望圆满箱庭的神明 ——莫名卷到局中的凡人 ——永远轮回的交界都市',
                        yydqrzd_dqhl: '氮气滑轮',
                        yydqrzd_dqhl_info: '锁定技,只要你的体力值大于2点,你的进攻距离+3;只要你的体力值为2点或更低,你的防御距离+3',
                        'yydqrzd-xsqm': '心生七面',
                        'yydqrzd-xsqm_info': '摸牌阶段,你可以放弃摸牌,令至多其他七名角色依次选择一项:1、交给你一张牌;2、令你摸一张牌.',
                        守护: '守护',
                        守护_info: '',
                        川胜之灵: '川胜之灵',
                        川胜之灵_info: '出牌阶段限一次,你可以弃置任意张不同花色的牌(至少一张),令等量其他角色选择受到一点伤害或翻面.',
                        死亡判定: '死亡判定',
                        死亡判定_info: '当一名角色进入濒死状态时,你可以弃置一张牌并令其进行一次判定,若结果为红色,其回复一点体力,否则其获得你弃置的牌',
                        wendao: '问道',
                        wendao_info: '当你于回合外需要使用或打出一张牌时,你可以观看牌堆顶的7张牌.若你观看的牌中有此牌,你可以使用打出之.',
                        yydqrzdstfm: '万物化生',
                        yydqrzdstfm_info: '出牌阶段限一次,你可以弃置一张红色手牌对一名角色发动<阵法>且造成一点伤害并使该角色翻面,<阵法>直到你下一个回合开始.',
                        fuxie2: '阵法',
                        fuxie2_info: '',
                        fuxie1: '阵法',
                        fuxie1_info: '',
                        sqnzl: '鸟羽【三青鸟之翎】',
                        sqnzl_info: '当你使用【杀】指定目标后,你可以展示牌堆顶的3张牌,其中每有1张非基本牌,你弃置目标角色1张牌.',
                        wwhs: '五岳真形',
                        wwhs_info: '锁定技,弃牌阶段结束后,如果你的手牌小于或等于3时,你摸x张牌并获得x点护甲回复一点体力,x为你的已损失体力值+1',
                        tianming3: '天命',
                        tianming3_info: '在任意角色的判定牌生效前,你可以打出一张牌代替之(天命反噬:若该角色为你或在你的回合,你摸两张牌受到一点雷属性伤害)',
                        '神木【三珠树】': '神木【三珠树】',
                        '神木【三珠树】_info': '锁定技,你的手牌数至少为3',
                        qrzd_zpw: '纸牌屋',
                        qrzd_zpw_info: '当你即将受到伤害,若伤害来源体力比你高,你可弃置一张黑色手牌令伤害-1,当你即将造成你受到伤害时,若对方体力值比你高,你可弃置一张红色手牌令此伤害+1',
                        qrzd_stfx: '司天伏邪',
                        qrzd_stfx_info: '出牌开始前,你可永久封印一名角色所有技能(冷却三回合).',
                        qrzd_hf: '回复',
                        qrzd_hf_info: '回合开始时,你可以展示所有手牌,令至多X名角色获得1点护甲(X为你红色手牌的数量),若如此做,你回复1点体力.',
                        qrzd_tlp: '卡牌【塔罗牌】',
                        qrzd_tlp_info: '锁定技,你即将造成的伤害均视为失去体力.',
                        qrzd_cjzy: '裁决之羽',
                        qrzd_cjzy_info: '出牌阶段限一次,你可以将一张手牌置于牌堆顶,令一名其他角色选择一种花色后摸一张牌并展示之,若此牌与所选花色不同,你对其造成2点神圣伤害.',
                        qrzd_mj: '魔剑【米斯特汀】',
                        qrzd_mj_info: ' 当一名角色使用的锦囊牌指定了至少两名角色为目标时,你可以令此牌对其中任意名角色无效.',
                        qrzd_qnbf: '潜能迸发',
                        qrzd_qnbf_info: '摸牌阶段,若你已受伤,你可以放弃摸牌并展示牌堆顶的X张牌,X为你已损失的体力值,其中每有一张红色牌你回复1点体力,并将其余的黑色牌收入手牌.',
                        qrzd_zrsh: '自然守护',
                        qrzd_zrsh_info: '每当你受到1点伤害后,你可以摸两张牌,获得两点护甲提高两点生命上限,可以将至多两张手牌交给其他角色.',
                        qrzd_dpmj: '盾牌猛击',
                        qrzd_dpmj_info: '出牌阶段限一次,你可以对攻击范围内的至多X名其他角色各造成一点神圣伤害弃置其两张手牌,你失去等量的护甲,X为你的护甲数',
                        qrzd_yzzzz: '育种者之章',
                        qrzd_yzzzz_info: '每当你使用或打出一张♥️️牌,你可以令一名角色回复两点体力',
                        qrzd_hzyh: '赫子【羽赫】',
                        qrzd_hzyh_info: '当你使用【杀】时,若目标的手牌数大于等于你的体力值,或小于等于你的攻击范围,你可令此【杀】不能被闪避.',
                        qrzd_ssg: 'SS级喰种',
                        qrzd_ssg_info: '锁定技,每当有一名角色死亡时,你获得两点体力上限回复四点体力,并摸三张牌',
                        qrzd_js: '进食',
                        qrzd_js_info: '出牌阶段限一次,你可以与一名其他角色拼点:若你赢,视为对其使用一张【杀】(此【杀】不计入每回合的使用限制)且回复两点体力;若你没赢,你摸两张牌.',
                        qrzd_ym: '羽幕',
                        qrzd_ym_info: '出牌阶段限三次,你可以流失一点体力,视为使用一张【南蛮入侵】',
                        qrzd_hm: '箭术·命悬一线',
                        qrzd_hm_info: '出牌阶段开始时,你可以对一名其他角色造成X点火焰伤害(X为该角色体力值)并使其翻面,你弃置两张手牌并结束出牌阶段.冷却五回合.',
                        qrzd_xcyl: '星辰陨落',
                        qrzd_xcyl_info: '每当一名其他角色受到伤害后,若在你的攻击范围内,你可以弃置一张牌并令其进行一次判定,若判定结果为黑色,你对其造成一点雷电伤害且你回复一点体力摸两张牌',
                        qrzd_ehsnxz: '耳环【室女星坠】',
                        qrzd_ehsnxz_info: '每当你造成伤害,若此伤害是你本回合第一次造成的伤害,你摸一张牌获得两点护甲,此外造成伤害后你回复一点体力.',
                        qrzd_wjxk: '无尽虚空',
                        qrzd_wjxk_info: '出牌阶段限一次,你可以弃置一张牌,最多选择三名其他角色依次判定,若判定牌与你弃置的牌花色不同,该目标需弃置两张牌并受到来自于你的一点雷属性伤害并翻面.',
                        qrzd_yyqd: '预言确定',
                        qrzd_yyqd_info: '一名角色的判定牌生效前,你可以用一张手牌或场上的牌代替之.',
                        火: '火',
                        火_info: '每当你使用或打出一张杀,可以弃置一张牌并对目标以外的一名角色造成一点火焰伤害.',
                        qrzd_cgajjw: '长弓【阿贾伽瓦】',
                        qrzd_cgajjw_info: '锁定技,你使用【杀】可以选择你距离不大于此【杀】点数的角色为目标;当你使用【杀】指定一个目标后,你可以根据下列条件执行相应的效果:1.其手牌数小于等于你的手牌数,此【杀】不可被【闪】响应,2.其体力值大于等于你的体力值,此【杀】伤害+1.',
                        qrzd_yhdjy: '业火的箭雨',
                        qrzd_yhdjy_info: '出牌阶段限1次,你可以对至多3名其他角色依次使用三张火属性【杀】,每对一名角色发动你摸两张牌,将你的武将牌翻面.',
                        qrzd_hsb1: '黑死病',
                        qrzd_hsb1_info: '',
                        动能折跃: '动能折跃',
                        动能折跃_info: '出牌阶段限1次,你可以弃置1名其他角色装备区里1张牌,视为对其使用1张杀;若以此法弃置的装备牌为黑色,你弃置其1张手牌视为对其使用1张杀,若以此法弃置的手牌为黑色,你重复此流程(最多3次).',
                        魅惑: '魅惑',
                        魅惑_info: '锁定技,当你受到伤害时,若伤害来源为男性则该伤害-1',
                        qrzd_mrcx: '末日残响',
                        qrzd_mrcx_info: '出牌阶段限一次,你可以弃置一张♠️️手牌,对至多3名其他角色造成两点伤害后并使其回复一点体力.',
                        daidinh: '亡灵余歌',
                        daidinh_info: '出牌阶段限两次,你可以令一名已受伤角色失去一点体力上限并回复两点体力.',
                        '手杖【日蚀之杖】': '手杖【日蚀之杖】',
                        '手杖【日蚀之杖】_info': '锁定技,其他角色回合结束时,若其于回合内造成过伤害,你摸两张牌执行额外一个出牌阶段,若你已受伤,你回复1点体力,否则你获得一点护甲,你造成伤害时,可以使对方感染<黑死病>.',
                        qrzd_xsdg1: '腥膻祷告',
                        qrzd_xsdg1_info: '锁定技,若场上存活的角色不小于三,则其他角色使用的【杀】、【顺手牵羊】、【过河拆桥】、【决斗】指定你为目标时,须额外指定1名角色(不得是此牌的使用者)为目标,否则对你无效',
                        qrzd_szrszz1: '手杖【日蚀之杖】',
                        qrzd_szrszz1_info: '',
                        qrzd_szwsem: '丧钟为谁而鸣',
                        qrzd_szwsem_info: '锁定技,当你使一名角色进入濒死阶段时,该角色立即死亡',
                        qrzd_复制: '数据入侵',
                        qrzd_复制_info: '冷却三回合,在自己出牌阶段时,你可以复制1名其他角色的全部技能.',
                        减疗: '减疗',
                        减疗_info: '',
                        灼烧: '灼烧',
                        灼烧_info: '',
                        龙魂: '龙魂',
                        龙魂_info: '你可以将同花色的X张牌按下列规则使用或打出:♥️️当【桃】,♦️️当具火焰伤害的【杀】,♣️️当【闪】,♠️️当【无懈可击】.若你以此法使用了两张红色牌,则此牌回复值或伤害值+1.若你以此法使用了两张黑色牌,则你弃置当前回合角色一张牌',
                        龙魂1: '龙魂',
                        龙魂1_info: '',
                        龙魂2: '龙魂',
                        龙魂2_info: '',
                        龙魂3: '龙魂',
                        龙魂3_info: '',
                        龙魂4: '龙魂',
                        龙魂4_info: '',
                        杀戮: '杀戮',
                        杀戮_info: '妖刀姬锁定一个目标连续多段攻击直到目标死亡,每次造成一点神圣伤害,如果目标死亡则重新锁定一个目标,最多进行6次攻击',
                        悲愿: '悲愿',
                        悲愿_info: '场上阵亡角色越多,造成的伤害越高',
                        轮回: '轮回',
                        轮回_info: '锁定技,准备阶段,若你的体力小于等于2,则你与场上除你以外体力最高且大于2的角色交换体力值.',
                        qrzd_egcs: '帝具【恶鬼缠身】',
                        qrzd_egcs_info: '锁定技,当你造成伤害后,你摸两张牌,手牌上限+1;防止你受到的等于1点的伤害',
                        qrzd_yexi: '夜袭',
                        qrzd_yexi_info: '锁定技,你的进攻距离和防御距离均+X(X为女性角色数)',
                        束缚: '束缚',
                        束缚_info: '',
                        定身: '定身',
                        定身_info: '',
                        剑术精通: '剑术精通',
                        剑术精通_info: '当你使用【杀】指定目标时,你可以进行一次判定.若结果为红色,则此【杀】不可被闪避.',
                        成长: '成长',
                        成长_info: '当其他角色死亡后,你可以摸三张牌,或者获得下列技能中的任意一个:<帝具【恶鬼缠身】>、 <潜伏>和<悲愿>',
                        '帝具【一斩必杀·村雨】': '帝具【一斩必杀·村雨】',
                        '帝具【一斩必杀·村雨】_info': '锁定技,你对一名角色造成伤害后,会清除目标所有护甲且,使目标获得<咒毒>(咒毒:回合开始流失自己当前生命值,失去一点体力上限)',
                        qrzd_咒毒: '咒毒',
                        qrzd_咒毒_info: '',
                        qrzd_xzyy: '星之原野',
                        qrzd_xzyy_info: '<我想,<我想许下的愿生..... 流星划过天际,少女望着无边的星空,低声喃喃.自由....像一个人类般活着.想去知道, 去思考,想拥有自己的<灵魂>一想要成为 <我>  已经成为个吗？...会了质疑学会了思考,学会 我的感望实现了吗? 不,我还想要更多,更多的 指挥使,下次,我们再一起.....',
                        永恒的信标: '永恒的信标',
                        永恒的信标_info: '于未知处发来的神秘信息,斯开了世界的一角.追踪这屡微光 渐渐发觉了被神藏起的秘密.求生的少女,求知的少年,各自握着破碎的线索踽踽独行,不愿停下脚步.',
                        qrzd: '数据干扰',
                        qrzd_info: '出牌阶段限一次,你可以弃置一张装备牌,获得一名其他角色的所有手牌,使该角色陷入混乱一回合.',
                        qrzd_zydtk: '自由的天空',
                        qrzd_zydtk_info: '锁定技,你不能成为【顺手牵羊】、【乐不思蜀】和【杀】的目标',
                        xingzhiyuanye: '星之原野',
                        xingzhiyuanye_info: '',
                        易式·辉月: '易式·辉月',
                        易式·辉月_info: '出牌阶段限一次,你可以与一名其他角色拼点:若你赢,则封印该角色技能,你视为对其使用一张【决斗】,你获得两层<千式·淬羽>标记;若你没赢,你获得两点护甲,和一层<千式·淬羽>标记.',
                        逆式·烁星: '逆式·烁星',
                        逆式·烁星_info: '一回合最多使用两次,你可以弃置1张非延时锦囊牌,对一名其他角色造成使用两张杀.',
                        千式·淬羽: '千式·淬羽',
                        千式·淬羽_info: '锁定技,开局你获得两层<千式·淬羽>标记,每当你受到一点伤害后,你获得等同于受到伤害值的<千式·淬羽>标记,你获得一点护甲摸三张牌.',
                        绝式·蔽: '绝式·蔽',
                        绝式·蔽_info: '出牌阶段限1次,你可以弃置8层<千式·淬羽>标记,选择其他任意角色,令其非锁定技失效和获得<定身>效果直到此技能结束,每对一名角色发动你获得两点护甲,你视为对其使用5张杀,你获得两层<千式·淬羽>标记.',
                        绝式·蔽日: '绝式·蔽日',
                        绝式·蔽日_info: '出牌阶段限1次,若你的"千式·淬羽"达到8层或更多,你可以弃置8枚"千式·淬羽"标记,选择其他1名角色,使其获得<定身>效果和非锁定技失效,视为你对其使用5次【杀】,对一名角色发动时获得四点护甲和四层<千式·淬羽>标记',
                        大地为之怮哭: '大地为之怮哭',
                        大地为之怮哭_info: '出牌阶段,你可以弃置所有手牌进行一次判定,若结果不为【闪电】,你令其他所有角色选择一项:<br>1,弃置一张桃.<br>2,受到两点伤害.',
                        '圣枪【郎努基斯】': '圣枪【郎努基斯】',
                        '圣枪【郎努基斯】_info': '锁定技,当你使用【杀】指定一个目标后,若你装备区的牌数少于该角色,则其不能使用【闪】响应此【杀】,你的【杀】无视距离.',
                    },
                    skill: {
                        yydqrzd1: {
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            content() {
                                player.chooseToDiscard(1, true).ai = get.disvalue;
                                player.addTempSkill('yydqrzd', { player: 'phaseBegin' });
                                var chat = ['你还是不要接近我比较好,也不要再像现在这样和我说话了.', '大家都看不见我的存在,能看到我的只有榊原君,你一个人……或许？'].randomGet();
                                player.say(chat);
                            },
                            ai: {
                                order: 10,
                                result: {
                                    player(player) {
                                        return 1;
                                    },
                                    target(player, target) {
                                        return 1;
                                    },
                                },
                                threaten: 1.5,
                                effect: {
                                    target(card) {
                                        if (card.name == 'guiyoujie') return [0, 2];
                                    },
                                },
                            },
                        },
                        yydqrzd: {
                            mark: true,
                            intro: {
                                content: '桃以外的牌不能指定你为目标',
                            },
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (card.name != 'tao') return false;
                                },
                            },
                        },
                        yydqrzd2: {
                            trigger: {
                                source: 'damage',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.player.hp <= 0;
                            },
                            forced: true,
                            content() {
                                trigger.player.die(trigger);
                                player.say('sakakibara 这个名字,不禁会让人联想到‘死’.而且还不是 单纯的‘死’,是以学校为舞台,残酷无情的死.');
                            },
                        },
                        'yydqrzd-eozy': {
                            trigger: {
                                global: 'judge',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return player.countCards('he', { color: 'black' }) > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player
                                    .chooseCard(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',' + get.prompt('人偶之眼'), 'he', function (card) {
                                        return get.color(card) == 'black';
                                    })
                                    .set('ai', function (card) {
                                        var trigger = _status.event.getTrigger();
                                        var player = _status.event.player;
                                        var judging = _status.event.judging;
                                        var result = trigger.judge(card) - trigger.judge(judging);
                                        var attitude = get.attitude(player, trigger.player);
                                        if (attitude == 0 || result == 0) return 0;
                                        if (attitude > 0) {
                                            return result;
                                        } else {
                                            return -result;
                                        }
                                    })
                                    .set('judging', trigger.player.judging[0]);
                                ('step 1');
                                if (result.bool) {
                                    player.respond(result.cards, 'highlight', 'yydqrzd-eozy');
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.$gain2(trigger.player.judging[0]);
                                    player.gain(trigger.player.judging[0]);
                                    trigger.player.judging[0] = result.cards[0];
                                    if (!get.owner(result.cards[0], 'judge')) {
                                        trigger.position.appendChild(result.cards[0]);
                                    }
                                    game.log(trigger.player, '的判定牌改为', result.cards[0]);
                                }
                                player.say('人偶是不真实的.死也是虚幻的.他们跟我有一样的左眼,或许也能看到人的<死亡的颜色>.在学校我是不会脱掉眼罩的.');
                                ('step 3');
                            },
                            ai: {
                                tag: {
                                    rejudge: 1,
                                },
                            },
                        },
                        'yydqrzd-btda': {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.num('he', { suit: 'spade' }) > 0;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            position: 'he',
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            content() {
                                'step 0';
                                var num = target.countCards('h');
                                target.discard(target.getCards('h'));
                                target.draw(5);
                                target.showHandcards();
                                ('step 1');
                                var num = target.countCards('h', function (card) {
                                    return get.type(card) != 'basic';
                                });
                                target.discard(
                                    targe.getCards('h', function (card) {
                                        return get.type(card) != 'basic';
                                    })
                                );
                                if (num > 0) target.damage(num);
                                player.say('没有你的世界,毁了也无所谓.');
                            },
                            ai: {
                                order: 5,
                                expose: 0.3,
                                threaten: 1.8,
                                result: {
                                    target(player, target) {
                                        return -target.countCards('h') - 1;
                                    },
                                },
                            },
                        },
                        'yydqrzd-bj': {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,//QQQ
                            nobracket: true,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            check(event, player) {
                                return get.attitude(player, event.source) <= 0;
                            },
                            logTarget: 'source',
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    if (card.suit == 'heart') return -2;
                                    return 2;
                                });
                                ('step 1');
                                if (result.judge < 2) {
                                    event.finish();
                                    return;
                                }
                                trigger.source.chooseToDiscard(3).set('ai', function (card) {
                                    if (card.name == 'tao') return -10;
                                    if (card.name == 'jiu' && _status.event.player.hp == 1) return -10;
                                    return get.unuseful(card) + 2.5 * (5 - get.owner(card).hp);
                                    player.say('阿雪,就由我来守护!阿雪只要利用我就好了!');
                                });
                                ('step 2');
                                if (result.bool == false) {
                                    trigger.source.damage();
                                    player.say('疯了的是没能让我与阿雪结合的这个世界!');
                                }
                            },
                            ai: {
                                maixie_defend: true,
                                effect: {
                                    target(card, player, target) {
                                        if (player.hasSkillTag('jueqing', false, target)) return [1, -1];
                                        return 0.8;
                                        // if(get.tag(card,'damage')&&get.damageEffect(target,player,player)>0) return [1,0,0,-1.5];
                                    },
                                },
                            },
                        },
                        yydqrzdpz: {
                            trigger: {
                                player: 'phaseBefore',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('yydqrzdpz'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    if (target.hasSkillTag('noturn')) return 0;
                                    var player = _status.event.player;
                                    if (get.attitude(_status.event.player, target) == 0) return 0;
                                    if (get.attitude(_status.event.player, target) > 0) {
                                        if (target.classList.contains('turnedover')) return 1000 - target.countCards('h');
                                        if (player.maxHp - player.hp < 3) return -1;
                                        return 100 - target.countCards('h');
                                    } else {
                                        if (target.classList.contains('turnedover')) return -1;
                                        if (player.maxHp - player.hp >= 3) return -1;
                                        return 1;
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].addTempSkill('fengyin');
                                    player.say('为何要做解释这种徒劳的东西.既然不想听,就把耳朵留给我慢慢说好了.');
                                }
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
                                            if (target.hp <= 1) return;
                                            if (!target.hasFriend()) return;
                                            var hastarget = false;
                                            var turnfriend = false;
                                            var players = game.filterPlayer();
                                            for (var i of players) {
                                                if (get.attitude(target, i) < 0 && !i.isTurnedOver()) {
                                                    hastarget = true;
                                                }
                                                if (get.attitude(target, i) > 0 && i.isTurnedOver()) {
                                                    hastarget = true;
                                                    turnfriend = true;
                                                }
                                            }
                                            if (get.attitude(player, target) > 0 && !hastarget) return;
                                            if (turnfriend || target.hp == target.maxHp) return [0.5, 1];
                                            if (target.hp > 1) return [1, 0.5];
                                        }
                                    },
                                },
                            },
                        },
                        yzmds: {
                            nobracket: true,
                            enable: 'chooseToUse',
                            mark: true,
                            init(player) {
                                player.storage.yzmds = false;
                            },
                            filter(event, player) {
                                if (event.type != 'dying') return false;
                                if (player != event.dying) return false;
                                if (player.storage.yzmds) return false;
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('yzmds');
                                player.hp = player.maxHp;
                                player.storage.yzmds = true;
                                ('step 1');
                                player.draw(4);
                                player.phase('nodelay');
                                ('step 2');
                                target.loseHp(3);
                                player.say('这个世界本身就像一场游戏,我们都是棋子而已.');
                                player.removeSkill('yzmds');
                            },
                            ai: {
                                skillTagFilter(player) {
                                    if (player.storage.yzmds) return false;
                                    if (player.hp > 0) return false;
                                },
                                save: true,
                                result: {
                                    player: 4,
                                    target(player, target) {
                                        if (target.hp == target.maxHp) return 2;
                                        return 4;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.yzmds) return 0.8;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        fyz: {
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return Math.random() <= 5.7;
                            },
                            content() {
                                trigger.directHit = true;
                            },
                            mod: {
                                targetInRange() {
                                    return true;
                                },
                                nobracket: true,
                            },
                            nobracket: true,
                        },
                        wy: {
                            nobracket: true,
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            content() {
                                trigger.num += 1;
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    if (card.name == 'sha') range[1] += 2;
                                },
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return num + player.maxHp - player.hp + 1;
                                },
                                nobracket: true,
                            },
                        },
                        qpss: {
                            nobracket: true,
                            trigger: {
                                global: 'phaseBefore',
                            },
                            filter(event, player) {
                                if (ui.cardPile.hasChildNodes() == false) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                event.top = [];
                                event.top = event.top.concat(ui.cardPile.firstChild);
                                event.dialog = ui.create.dialog('切牌圣手', event.top);
                                var controls = [];
                                if (
                                    game.hasPlayer(function (target) {
                                        return player.countCards('h') <= target.countCards('h') && target != player;
                                    })
                                ) {
                                    controls.push('获得');
                                }
                                controls.push('替换');
                                player.chooseControl(controls, 'cancel', event.dialog).ai = function () {
                                    if (event.top[0].name == 'du') return 'cancel';
                                    return 0;
                                };
                                ('step 1');
                                if (result.control == '获得') {
                                    player.draw();
                                    event.finish();
                                } else if (result.control == '替换') {
                                    player.chooseCard('选择一张牌置于牌堆顶', 'h', true).ai = function (card) {
                                        if (_status.currentPhase == player) {
                                            if (player.hp <= player.maxHp / 2 && player.countCards('h', { type: 'basic' })) {
                                                return get.type(card) == 'basic';
                                            }
                                            if (player.hp > player.maxHp / 2 && player.countCards('h', { type: 'trick' })) {
                                                return get.type(card) == 'trick';
                                            }
                                        } else {
                                            return 15 - get.value(card);
                                        }
                                    };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                event.card = result.cards[0];
                                player.storage.cygd_mengjingyuyan_top = get.type(event.card, 'trick');
                                player.lose(event.card, ui.special);
                                player.draw();
                                var cardx = ui.create.card();
                                cardx.classList.add('infohidden');
                                cardx.classList.add('infoflip');
                                player.$throw(cardx, 1000);
                                ('step 3');
                                if (player == game.me) game.delay(0.5);
                                ('step 4');
                                if (event.card) {
                                    event.card.fix();
                                    ui.cardPile.insertBefore(event.card, ui.cardPile.firstChild);
                                }
                            },
                        },
                        xshx: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (player.hp >= 3) return false;
                                return get.distance(player, event.player, 'attack') <= 1;
                            },
                            content() {
                                trigger.source.loseHp(-1);
                                var card = get.cardPile(function (card) {
                                    return get.type(card) == 'basic';
                                });
                                if (card) {
                                    trigger.source.gain(card, 'gain2');
                                    game.log(player, '从牌堆获得了', card);
                                }
                            },
                            ai: {
                                order() {
                                    return lib.card.sha.ai.order - 1;
                                },
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                    nobracket: true,
                                },
                                nobracket: true,
                            },
                        },
                        szlc: {
                            nobracket: true,
                            trigger: {
                                player: 'respond',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'shan';
                            },
                            forced: true,
                            content() {
                                'step 1';
                                player.storage.cygd_duanlie = false;
                                player.phase('nodelay');
                                player.say('和我一起,到世界尽头去吧');
                            },
                        },
                        syzj: {
                            nobracket: true,
                            usable: 5,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('h', { type: 'trick' }) > 0;
                            },
                            filterCard(card) {
                                return get.type(card) == 'trick';
                            },
                            position: 'h',
                            selectCard: [1],
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(card) {
                                10 - get.value(card);
                            },
                            content() {
                                target.damage(cards.length);
                            },
                            ai: {
                                order() {
                                    return 6;
                                },
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                        },
                        yxhy: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                return event.source;
                            },
                            content() {
                                'step 0';
                                game.swapSeat(player, trigger.source);
                                ('step 1');
                                var players = game.filterPlayer(function (current) {
                                    return get.distance(player, current, 'attract') <= 1 && player.getEnemies().includes(current);
                                });
                                players.sort(lib.sort.seat);
                                var num = [1, 2];
                                for (var i of players) {
                                    player.line(i, 'fire');
                                    player.gainPlayerCard('he', i, num.randomGet(), true);
                                    i.damage()._triggered = null;
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        bwdyw: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                if (player.maxHp - player.hp <= 4) {
                                    event.cards = get.cards(player.maxHp - player.hp);
                                } else {
                                    event.cards = get.cards(3);
                                }
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (get.color(i) == 'red') {
                                        num++;
                                        ui.discardPile.appendChild(i);
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    player.recover(num);
                                }
                                ('step 2');
                                if (event.cards.length) {
                                    player.draw(event.cards.length);
                                }
                                player.say('不对不起,我无法实现你的愿望~别容易困呢……');
                            },
                        },
                        yjfz: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player.canCompare(target);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    target.damage(2, 'thunder');
                                    target.turnOver();
                                    player.say('虚无的时空,有去无回.');
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        if (target.hasJudge('lebu')) return -get.effect(target, { name: 'lebu' }, player, target);
                                        return get.effect(target, { name: 'lebu' }, player, target);
                                    },
                                },
                                order: 9,
                            },
                        },
                        kptlp: {
                            trigger: {
                                player: 'damageBefore',
                            },
                            nobracket: true,
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.loseHp();
                            },
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                        },
                        xzd: {
                            nobracket: true,
                            usable: 3,
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            _priority: 50,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.changeHujia(trigger.num);
                                player.recover();
                                var chat = ['喔', '你这家伙,少管我!'].randomGet();
                                player.say(chat);
                            },
                        },
                        zpw: {
                            nobracket: true,
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (card.name == 'shunshou' || card.name == 'lebu' || card.name == 'tiesuo' || card.name == 'huogong') return false;
                                },
                            },
                        },
                        nyfz: {
                            trigger: {
                                global: 'judgeBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return ui.cardPile.childNodes.length > 1;
                            },
                            check() {
                                return false;
                            },
                            content() {
                                'step 0';
                                var str = '';
                                if (trigger.card) str = get.translation(trigger.card.viewAs || trigger.card.name);
                                else if (trigger.skill) str = get.translation(trigger.skill);
                                else str = get.translation(trigger.parent.name);
                                var cards = [ui.cardPile.childNodes[0], ui.cardPile.childNodes[1]];
                                var att = get.attitude(player, trigger.player);
                                var delta = trigger.judge(ui.cardPile.childNodes[1]) - trigger.judge(ui.cardPile.childNodes[0]);
                                player.chooseControl('调换顺序', 'cancel', ui.create.dialog('nyfz:' + get.translation(trigger.player) + '的' + str + '判定', cards, 'hidden')).ai = function () {
                                    if (att * delta > 0) return '调换顺序';
                                    else return 'cancel';
                                };
                                ('step 1');
                                if (result.control == '调换顺序') {
                                    var card = ui.cardPile.firstChild;
                                    ui.cardPile.removeChild(card);
                                    ui.cardPile.insertBefore(card, ui.cardPile.firstChild.nextSibling);
                                    game.log(player, '调换了牌堆顶两张牌的顺序');
                                }
                            },
                            ai: {
                                expose: 0.1,
                                tag: {
                                    rejudge: 0.5,
                                },
                            },
                        },
                        mydlp: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: 1,
                            filterCard: true,
                            selectCard: 2,
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                var num = result.number;
                                event.cards = get.cards(num);
                                player.showCards(event.cards);
                                ('step 2');
                                event.num = 0;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        //QQ
                                        if (get.color(i) == 'black') event.num++;
                                        ui.discardPile.appendChild(i);
                                    }
                                player.$throw(event.cards);
                                if (event.num) {
                                    target.damage(event.num);
                                }
                                player.say('要跟我赌的话,你的筹码还远远不够哦.');
                            },
                            ai: {
                                order: 6,
                                threaten: 2,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        fznyfz: {
                            nobracket: true,
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            content() {
                                trigger.cancel();
                            },
                            _priority: 10,
                            filter(event, player) {
                                return (event.card && event.card.name == 'tiesuo') || event.card.name == 'nanman' || event.card.name == 'shunshou' || event.card.name == 'guohe' || event.card.name == 'huogong' || event.card.name == 'wanjian' || event.card.name == 'lebu' || event.card.name == 'bingliang' || event.card.name == 'shandian' || event.card.name == '雷链' || event.card.name == '火链' || event.card.name == '降智打击';
                            },
                        },
                        wlsxlz: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            check(event) {
                                return event.num <= 6;
                            },
                            prompt: '是否发动技能【我流·碎星连斩】,展示牌中每有一张非延时锦囊牌便可视为对一名角色使用一张【杀】',
                            content() {
                                player.say('主人的命令,十玖一定会完成.');
                                ('step 0');
                                trigger.untrigger();
                                trigger.finish();
                                event.cards = get.cards(6);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        //QQ
                                        if (get.type(i) == 'trick') {
                                            num++;
                                        }
                                    }
                                if (num > 0) {
                                    var next = player.chooseCardButton('请选择视为【杀】使用的牌', event.cards);
                                    next.ai = function (button) {
                                        if (
                                            game.hasPlayer(function (target) {
                                                return player.canUse('sha', target, false) && get.effect(target, { name: 'sha' }, player, player) > 0;
                                            })
                                        ) {
                                            return 8 - get.value(button.link);
                                        }
                                        return 0;
                                    };
                                    next.filterButton = function (button) {
                                        return get.type(button.link) == 'trick';
                                    };
                                } else {
                                    player.gain(event.cards, 'gain2');
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    event.cards1 = result.links[0];
                                    player
                                        .chooseTarget('请选择目标', function (card, player, target) {
                                            return player.canUse('sha', target, false);
                                        })
                                        .set('ai', function (target) {
                                            return get.effect(target, { name: 'sha' }, player, player);
                                        });
                                } else {
                                    player.gain(event.cards, 'gain2');
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool) {
                                    player.useCard({ name: 'sha' }, result.targets, [event.cards1], false);
                                    event.cards.remove(event.cards1);
                                    event.goto(1);
                                } else {
                                    player.gain(event.cards, 'gain2');
                                    player.say('主人的命令,十玖一定会完成.');
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2,
                                expose: 0.2,
                            },
                        },
                        tss: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBefore',
                            },
                            _priority: null,
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'black' ? 1 : 0;
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.untrigger();
                                    trigger.finish();
                                } else {
                                    player.draw(2);
                                }
                            },
                        },
                        wledfq: {
                            nobracket: true,
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player != player && Math.random() <= 0.55;
                            },
                            content() {
                                var mubiao = trigger.player;
                                player.line(mubiao, 'thunder');
                                trigger.player.damage('thunder');
                            },
                        },
                        sbtzqag: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                trigger.source.loseHp(trigger.num * -1);
                                var card = get.cardPile(function (card) {
                                    return get.type(card) == 'equip';
                                });
                                if (card) {
                                    trigger.source.gain(card, 'gain2');
                                    game.log(player, '从牌堆获得了', card);
                                }
                            },
                            ai: {
                                order() {
                                    return lib.card.sha.ai.order - 1;
                                },
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                        },
                        sgzr: {
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 1000,
                            filter(event, player) {
                                return player != event.player;
                            },
                            nobracket: true,
                            content() {
                                trigger.player.loseMaxHp(trigger.num);
                                player.draw(trigger.num);
                            },
                        },
                        ysxj: {
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0 || (event.source && event.source.countCards('he') > 0);
                            },
                            content() {
                                'step 0';
                                if (trigger.source) {
                                    var hs = trigger.source.getCards('he');
                                    if (hs.length) {
                                        trigger.source.damage();
                                    }
                                }
                            },
                            ai: {
                                maixie_defend: true,
                            },
                        },
                        sjsgzj: {
                            nobracket: true,
                            forced: true,
                            trigger: {
                                player: 'phaseEnd',
                            },
                            filter(event, player) {
                                if (player.getEquips(1)) return true;
                                return false;
                            },
                            content() {
                                player.draw(2);
                                player.recover();
                                player.changeHujia(2);
                            },
                        },
                        sjhs: {
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.parent.name != 'sjhs';
                            },
                            content() {
                                player.phase('nodelay');
                                player.say('一定要努力,努力的过好每一天.');
                            },
                            nobracket: true,
                            ai: {
                                threaten: 1.8,
                            },
                        },
                        hjjz: {
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            selectCard: -1,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            prepare(cards, player, targets) {
                                player.line(targets);
                            },
                            discard: true,
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                if (event.current == undefined) event.current = player.next;
                                if (targets[0].hp <= 0 || targets[0].isDead() || event.current == player) {
                                    event.goto(2);
                                } else {
                                    event.current.useCard(
                                        {
                                            name: 'juedou',
                                        },
                                        targets,
                                        false
                                    );
                                }
                                ('step 1');
                                event.current = event.current.next;
                                event.goto(0);
                                ('step 2');
                                player.turnOver();
                                player.say('庶民,谁允许你和我说话了.');
                            },
                            nobracket: true,
                            ai: {
                                expose: 0.6,
                                order: 1,
                                result: {
                                    player(player, target) {
                                        if (target.hp <= 1) return -10;
                                        var num = -get.attitude(player, target);
                                        var dhp = target.hp - 1;
                                        var ncn = player.countCards('h');
                                        if (num > 0) {
                                            if (ncn < dhp) {
                                                num += dhp - ncn;
                                            } else {
                                                num -= ncn - dhp;
                                            }
                                        }
                                        return num;
                                    },
                                },
                            },
                        },
                        bs: {
                            nobracket: true,
                            forced: true,
                            trigger: {
                                player: 'phaseEnd',
                            },
                            _priority: 20,
                            filter(event, player) {
                                return player.getStat('damage') >= 1;
                            },
                            content() {
                                player.changeHujia(3);
                                player.draw(2);
                            },
                        },
                        ljbdyh: {
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            nobracket: true,
                            check(event, player) {
                                return get.attitude(player, event.target) < 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function () {
                                    return 0;
                                });
                                if (!trigger.target.hasSkill('fengyin')) {
                                    trigger.target.addTempSkill('fengyin', 'phaseAfter');
                                }
                                ('step 1');
                                var suit = result.card.suit;
                                var target = trigger.target;
                                var num = target.countCards('h', 'shan');
                                target
                                    .chooseToDiscard('请弃置一张' + get.translation(suit) + '牌,否则不能使用闪抵消此杀', 'he', function (card) {
                                        return card.suit == _status.event.suit;
                                    })
                                    .set('ai', function (card) {
                                        var num = _status.event.num;
                                        if (num == 0) return 0;
                                        if (card.name == 'shan') return num > 1 ? 2 : 0;
                                        return 8 - get.value(card);
                                    })
                                    .set('num', num)
                                    .set('suit', suit);
                                player.say('灵剑,拔刀!');
                                ('step 2');
                                if (!result.bool) {
                                    trigger.directHit = true;
                                }
                            },
                        },
                        rzd: {
                            forced: true,
                            nobracket: true,
                            trigger: {
                                player: ['phaseDrawBefore', 'phaseEnd'],
                            },
                            content() {
                                player.draw(2);
                            },
                        },
                        bd: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                player.gainMaxHp(0);
                            },
                            nobracket: true,
                            ai: {
                                threaten: 1.5,
                            },
                            mod: {
                                cardUsable(card) {
                                    if (get.info(card) && get.info(card).forceUsable) return;
                                    return Infinity;
                                },
                                targetInRange() {
                                    return true;
                                },
                            },
                        },
                        yd: {
                            trigger: {
                                player: 'damageBefore',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return Math.random() <= 0.35;
                            },
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.draw();
                                player.recover(1);
                                if (trigger.source) trigger.source.damage();
                            },
                        },
                        jyfc: {
                            trigger: {
                                global: ['phaseDiscardBefore'],
                            },
                            filter(event, player) {
                                return event.player.countCards('h') > event.player.getHandcardLimit();
                            },
                            content() {
                                'step 0';
                                trigger.player.damage();
                                player.draw(2);
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            nobracket: true,
                            ai: {
                                order: 1,
                                expose: 0.1,
                                threaten: 4,
                            },
                        },
                        hlzl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('hlzl'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].damage('fire');
                                    var num = [1, 2].randomGet();
                                    if (num == 1) player.draw();
                                    if (num == 2) player.draw(2);
                                }
                            },
                        },
                        smdzl: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filterCard: true,
                            usable: 2,
                            check(card) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            content() {
                                target.recover();
                                target.draw(2);
                                player.recover();
                                player.say('呐,再多告诉我一些关于你的事吧!');
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        if (target.hp == 1) return 5;
                                        if (player == target && player.countCards('h') > player.hp) return 5;
                                        return 2;
                                    },
                                },
                                threaten: 2,
                            },
                        },
                        swdcm: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            content() {
                                player.draw(2);
                                trigger.source.loseMaxHp(1);
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == 1) return 0.5;
                                },
                                effect: {
                                    target(card, player, target, current) {
                                        if (target.hp <= 1 && get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing')) return [1, -5];
                                            if (!target.hasFriend()) return;
                                            if (player.hp > 2 && get.attitude(player, target) <= 0) return [0, 2];
                                            return [1, 0, 0, -player.hp];
                                        }
                                    },
                                },
                            },
                        },
                        skll: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp != player.maxHp;
                            },
                            content() {
                                'step 0';
                                event.players = get.players(player);
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    if (current.isEnemiesOf(player)) {
                                        player.line(current, 'thunder');
                                        current.damage(1, 'thunder');
                                    }
                                    event.redo();
                                }
                            },
                            nobracket: true,
                            ai: {
                                order: 2,
                                result: {
                                    player(player) {
                                        if (player.countCards('h', 'shan')) return 1;
                                        var num = 0;
                                        for (var i of game.players) {
                                            //QQ
                                            if (i.canUse('sha', player) && i.countCards('h') > 1) {
                                                num--;
                                            } else {
                                                num++;
                                            }
                                        }
                                        return num;
                                    },
                                },
                            },
                        },
                        hdtymt: {
                            trigger: {
                                global: 'dying',
                            },
                            nobracket: true,
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            _priority: 10,
                            content() {
                                'step 0';
                                event.cards = get.cards(3);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (get.color(i) == 'red') {
                                        num++;
                                        ui.discardPile.appendChild(i);
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    trigger.player.recover(num);
                                }
                                ('step 2');
                                if (event.cards.length) {
                                    player.gain(event.cards, 'gain2');
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        szssjs: {
                            enable: 'phaseUse',
                            usable: 1,
                            complexCard: true,
                            nobracket: true,
                            filterCard(card) {
                                var type = get.type(card);
                                for (var i = 0; i < ui.selected.cards.length; i++) {
                                    if (get.type(ui.selected.cards[i]) == type) return false;
                                }
                                return true;
                            },
                            selectCard: [1, 3],
                            position: 'he',
                            selectTarget(card) {
                                if (ui.selected.targets.length > ui.selected.cards.length) {
                                    game.uncheck('target');
                                }
                                return ui.selected.cards.length;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(card) {
                                return 5 - get.value(card);
                            },
                            multiline: true,
                            line: 'green',
                            content() {
                                target.damage();
                            },
                            ai: {
                                order: 7.5,
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                },
                                expose: 0.2,
                            },
                        },
                        hjs: {
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            nobracket: true,
                            _priority: 5.9,
                            filter(event, player) {
                                return event.player != player;
                            },
                            content() {
                                'step 0';
                                var effect = get.effect(player, trigger.card, trigger.player, player);
                                player.judge(function (card) {
                                    switch (get.color(card)) {
                                        case 'red':
                                            return -effect;
                                        case 'black':
                                            return 1;
                                        default:
                                            return 0;
                                    }
                                });
                                ('step 1');
                                switch (result.color) {
                                    case 'red': {
                                        trigger.cancel();
                                        break;
                                    }
                                    case 'black': {
                                        player.draw();
                                        break;
                                    }
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        return 0.7;
                                    },
                                },
                                threaten: 2,
                            },
                        },
                        jjlw: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: [1, 3],
                            filter(event, player) {
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                var damage = [0, 1, 2];
                                target.damage(damage.randomGet());
                                player.say('不到最后一刻绝不放弃!');
                            },
                            ai: {
                                threaten: 2.1,
                                order: 6,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        jdskdzj: {
                            srlose: true,
                            trigger: {
                                player: 'shaBegin',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                trigger.target.chooseToDiscard('请弃置一张锦囊牌,否则不能使用闪抵消此杀', 'he', function (card) {
                                    return get.type(card) == 'trick';
                                }).ai = function (card) {
                                    var num = trigger.target.countCards('h', 'shan');
                                    if (num == 0) return 0;
                                    return 8 - get.value(card);
                                };
                                ('step 1');
                                if (!result.bool) {
                                    trigger.directHit = true;
                                }
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 1;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 1;
                                },
                            },
                        },
                        zxhzgs: {
                            nobracket: true,
                            trigger: {
                                global: 'useCardToBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') > 0 && (get.type(event.card) == 'trick' || event.card.name == 'sha') && get.color(event.card) == 'red' && event.targets.length == 1;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard('是否对' + get.translation(trigger.target) + '发动【执先·黑之攻势】？', 'h').ai = function (card) {
                                    if (get.attitude(player, trigger.target) <= 0) return 4 - get.value(card);
                                    return -1;
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.untrigger();
                                    trigger.finish();
                                    trigger.target.damage('thunder');
                                    player.say('大丈夫少婆婆妈妈,能打的赢我再说吧!');
                                }
                            },
                            ai: {
                                expose: 0.2,
                            },
                        },
                        lhjq: {
                            nobracket: true,
                            trigger: {
                                player: ['phaseDrawBefore', 'phaseEnd'],
                            },
                            forced: true,
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('lhjq')).ai = function (target) {
                                    return get.damageEffect(target, _status.event.player, _status.event.player);
                                };
                                ('step 1');
                                if (result.bool) {
                                    event.target = result.targets[0];
                                    player.judge(function (card) {
                                        var color = get.color(card);
                                        if (color == 'red') return 2;
                                        if (color == 'black') return 2;
                                    });
                                }
                                ('step 2');
                                if (result.color == 'red') {
                                    event.target.loseMaxHp();
                                    player.draw();
                                    player.recover();
                                } else if (result.color == 'black') {
                                    event.target.damage(2);
                                    player.draw();
                                    player.say('没有什么是一刀剪不断的!如果有~那就两刀~');
                                }
                            },
                            ai: {
                                threaten: 2,
                                order: 5,
                            },
                        },
                        wqwzzy: {
                            nobracket: true,
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            content() {
                                trigger.num += trigger.num;
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 2;
                                    player.say('大丈夫少婆婆妈妈的,赢了我再说吧!');
                                },
                            },
                            ai: {
                                unequip: true,
                            },
                        },
                        yx: {
                            nobracket: true,
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                trigger.num += 1;
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (card.name == 'sha') range[1] += 1;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - Infinity;
                                },
                            },
                        },
                        rxbzys: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt2('rxbzys')).set('ai', function (target) {
                                    var player = _status.event.player;
                                    if (get.attitude(player, target) > 0) {
                                        return get.recoverEffect(target, player, player) + 1;
                                    }
                                    return 0;
                                });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    target.judge(function (card) {
                                        if (target.hp == target.maxHp) {
                                            if (get.color(card) == 'red') return -1;
                                        }
                                        if (get.color(card) == 'red') return 1;
                                        return 0;
                                    });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.color) {
                                    if (result.color == 'red') {
                                        if (event.target.hp < event.target.maxHp) event.target.recover();
                                        event.player.draw(1);
                                    } else {
                                        event.player.changeHujia(1);
                                        event.player.draw(1);
                                    }
                                }
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                            },
                        },
                        cmzj: {
                            nobracket: true,
                            position: 'he',
                            enable: 'chooseToUse',
                            filterCard(card) {
                                return get.color(card) == 'black';
                                player.draw(2);
                            },
                            viewAsFilter(player) {
                                return player.countCards('he', { color: 'black' }) > 0;
                            },
                            viewAs: {
                                name: 'wuxie',
                            },
                            prompt: '将一张黑色手牌当无懈可击使用',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            threaten: 1.2,
                            ai: {
                                basic: {
                                    useful: [6, 4],
                                    value: [6, 4],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        qlzj: {
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 2;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 1;
                                },
                            },
                        },
                        gzj: {
                            nobracket: true,
                            usable: 1,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.num('he', { suit: 'heart' }) > 0;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            filterTarget(card, player, target) {
                                return target.countCards('h') > 0;
                            },
                            position: 'he',
                            content() {
                                'step 0';
                                var num = target.countCards('h');
                                target.discard(target.getCards('h'));
                                target.draw(num);
                                target.showHandcards();
                                ('step 1');
                                var num = target.countCards('h', function (card) {
                                    return get.type(card) != 'basic';
                                });
                                if (num == 0) {
                                    event.finish();
                                } else {
                                    var recover = target.maxHp - target.hp;
                                    if (num > 0 && num <= recover) {
                                        target.recover(num);
                                    } else {
                                        if (recover > 0) target.recover(recover);
                                        target.draw(num - recover);
                                    }
                                }
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        var recover = target.maxHp - target.hp;
                                        var nh = target.countCards('h');
                                        if (recover >= 2) return nh + recover;
                                        return nh;
                                    },
                                },
                                threaten: 2,
                            },
                        },
                        ydzs: {
                            enable: ['chooseToRespond'],
                            nobracket: true,
                            filterCard(card) {
                                return get.color(card) == 'red';
                            },
                            viewAs: {
                                name: 'shan',
                            },
                            viewAsFilter(player) {
                                if (!player.countCards('h', { color: 'red' })) return false;
                                player.draw();
                            },
                            prompt: '将一张红色手牌当闪打出',
                            check() {
                                return 1;
                            },
                            ai: {
                                respondShan: true,
                                skillTagFilter(player) {
                                    if (!player.countCards('h', { color: 'red' })) return false;
                                },
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'respondShan') && current < 0) return 0.6;
                                    },
                                },
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        tydjs: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget([1, 2], get.prompt('tydjs'), function (card, player, target) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        var att = get.attitude(_status.event.player, target);
                                        if (att > 0) return att + 1;
                                        if (att == 0) return Math.random();
                                        return att;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    event.targets = result.targets;
                                    if (result.targets.length == 1) {
                                        event.targets[0].draw();
                                    } else {
                                        event.targets[0].draw();
                                    }
                                } else {
                                    event.finish();
                                    player.say('不会跳舞的话,我教你呀');
                                }
                                ('step 2');
                                if (targets.length == 2) {
                                    targets[1].draw();
                                }
                                ('step 3');
                                player.draw(2);
                                player.recover();
                            },
                        },
                        sjsmj: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            content() {
                                'step 0';
                                player.chooseControl('摸2张牌', '弃3张牌').ai = function () {
                                    if (get.attitude(player, target) > 0) return '摸2张牌';
                                    return '弃3张牌';
                                };
                                ('step 1');
                                if (result.control == '摸2张牌') {
                                    target.draw(2);
                                    target.recover();
                                } else {
                                    target.chooseToDiscard(3, 'he', true);
                                    target.damage('fire');
                                }
                            },
                            ai: {
                                order: 10,
                                result: {
                                    player(player) {
                                        if (player.isZhu) {
                                            if (player.hp <= 2) return -5;
                                            return -1;
                                        }
                                        return -1;
                                    },
                                    target(player, target) {
                                        if (get.attitude(player, target) > 0) return 3;
                                        if (get.attitude(player, target) < 0) {
                                            if (target.countCards('he') < 3) return 0;
                                            return -3;
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        dqhl: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                if (player.hasSkill('dqhl_damaged')) {
                                    player.draw();
                                } else {
                                    player.recover();
                                }
                            },
                            group: 'dqhl_mark',
                            subSkill: {
                                mark: {
                                    trigger: {
                                        player: 'damageAfter',
                                    },
                                    silent: true,
                                    content() {
                                        player.addTempSkill('dqhl_damaged');
                                    },
                                    forced: true,
                                    popup: false,
                                },
                                damaged: {
                                },
                                ai: {
                                },
                            },
                            ai: {
                                maixie_defend: true,
                                threaten: 0.9,
                                effect: {
                                    target(card, player, target) {
                                        if (player.hasSkillTag('jueqing')) return;
                                        if (target.hujia) return;
                                        if (player._dqhl_tmp) return;
                                        if (target.hasSkill('dqhl_ai')) return;
                                        if (_status.event.getParent('useCard', true) || _status.event.getParent('_wuxie', true)) return;
                                        if (get.tag(card, 'damage')) {
                                            if (target.hasSkill('dqhl_damaged')) {
                                                return [1, -2];
                                            } else {
                                                if (get.attitude(player, target) > 0 && target.hp > 1) {
                                                    return 0;
                                                }
                                                if (get.attitude(player, target) < 0 && !player.hasSkillTag('damageBonus')) {
                                                    if (card.name == 'sha') return;
                                                    var sha = false;
                                                    player._shibei_tmp = true;
                                                    var num = player.countCards('h', function (card) {
                                                        if (card.name == 'sha') {
                                                            if (sha) {
                                                                return false;
                                                            } else {
                                                                sha = true;
                                                            }
                                                        }
                                                        return get.tag(card, 'damage') && player.canUse(card, target) && get.effect(target, card, player, player) > 0;
                                                    });
                                                    delete player._shibei_tmp;
                                                    if (player.hasSkillTag('damage')) {
                                                        num++;
                                                    }
                                                    if (num < 2) {
                                                        var enemies = player.getEnemies();
                                                        if (enemies.length == 1 && enemies[0] == target && player.needsToDiscard()) {
                                                            return;
                                                        }
                                                        return 0;
                                                    }
                                                }
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        msyayzz: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return (
                                    game.countPlayer(function (current) {
                                        return current != player && current.sex == 'male';
                                    }) > 1
                                );
                            },
                            check(card) {
                                return 10 - get.value(card);
                            },
                            filterCard: true,
                            position: 'he',
                            filterTarget(card, player, target) {
                                if (player == target) return false;
                                if (target.sex != 'male') return false;
                                if (ui.selected.targets.length == 1) {
                                    return target.canUse({ name: 'juedou' }, ui.selected.targets[0]);
                                }
                                return true;
                            },
                            targetprompt: ['先出杀', '后出杀'],
                            selectTarget: 2,
                            multitarget: true,
                            content() {
                                'step 0';
                                targets[1].addSkill('msyayzz');
                                targets[1].useCard({ name: 'juedou' }, targets[0], 'noai').animate = false;
                                ('step 1');
                                targets[1].removeSkill('msyayzz');
                                player.recover();
                            },
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target) {
                                        if (ui.selected.targets.length == 0) {
                                            return -3;
                                        } else {
                                            return get.effect(target, { name: 'juedou' }, ui.selected.targets[0], target);
                                        }
                                    },
                                },
                                expose: 0.4,
                                threaten: 3,
                            },
                        },
                        ms: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            _priority: 100,
                            content() {
                                player.phase('nodelay');
                                player.say('<为什么,获得神的青睐的——不是自己.>');
                            },
                        },
                        ezh: {
                            nobracket: true,
                            trigger: {
                                target: 'shaBefore',
                            },
                            forced: true,
                            _priority: 11,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt2('ezh'), function (card, player, target) {
                                        return target != player && _status.event.getTrigger().player.canUse('sha', target, false);
                                    })
                                    .set('ai', function (target) {
                                        var trigger = _status.event.getTrigger();
                                        var player = _status.event.player;
                                        return get.effect(target, trigger.card, trigger.player, player) + 0.1;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    target
                                        .chooseCard({ name: 'shan' }, '交给' + get.translation(player) + '一张闪,或成为此杀的额外目标')
                                        .set('ai', function (card) {
                                            return get.attitude(target, _status.event.source) >= 0 ? 1 : -1;
                                        })
                                        .set('source', player);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.gain(result.cards, event.target);
                                    event.target.$give(result.cards, player);
                                } else {
                                    trigger.targets.push(event.target);
                                    game.log(event.target, '成为了额外目标');
                                    target.loseHp();
                                }
                            },
                            ai: {
                                expose: 0.2,
                                effect: {
                                    target(card, player, target) {
                                        if (card.name != 'sha') return;
                                        var players = game.filterPlayer();
                                        for (var i of players) {
                                            var target2 = i;
                                            if (player != target2 && target != target2 && player.canUse(card, target2, false) && get.effect(target2, { name: 'shacopy', nature: card.nature, suit: card.suit }, player, target) < 0) {
                                                if (target.hp == target.maxHp) return [0, 1];
                                                return [0, 0];
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        ymzszy: {
                            nobracket: true,
                            srlose: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                if (event.nature && player.countCards('h')) return true;
                                if (!event.nature && !player.countCards('h')) return true;
                                return false;
                            },
                            mark: true,
                            forced: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                            },
                            ai: {
                                nofire(player) {
                                    return player.countCards('h') > 0;
                                },
                                nothunder(player) {
                                    return player.countCards('h') > 0;
                                },
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'natureDamage') && target.countCards('h') > 0) return 0;
                                        if (card.name == 'tiesuo' && target.countCards('h') > 0) return [0, 0];
                                        if (!get.tag(card, 'natureDamage') && !target.countCards('h')) return [0, 0];
                                    },
                                },
                            },
                            intro: {
                                content(storage, player) {
                                    var str = '';
                                    if (player.countCards('h')) {
                                        str += '防止属性伤害';
                                    } else {
                                        str += '防止非属性伤害';
                                    }
                                    return str;
                                },
                            },
                        },
                        zxzl: {
                            nobracket: true,
                            srlose: true,
                            trigger: {
                                player: ['phaseBegin', 'phaseEnd'],
                            },
                            forced: true,
                            content() {
                                'step 0';
                                if (player.isUnderControl()) {
                                    game.modeSwapPlayer(player);
                                }
                                var cards = get.cards(Math.min(5, game.players.length));
                                event.cards = cards;
                                var switchToAuto = function () {
                                    _status.imchoosing = false;
                                    if (event.dialog) event.dialog.close();
                                    if (event.control) event.control.close();
                                    const target = event.triggername == 'phaseBegin' ? player : player.next;
                                    const att = get.attitude(player, target);
                                    const top = [], bottom = cards;
                                    for (const i of target.getCards('j')) {
                                        const judge = get.judge(i);
                                        bottom.sort((a, b) => (judge(b) - judge(a)) * att); //态度大于0价值高的牌放前面
                                        if (bottom.length) {
                                            top.push(bottom.shift());
                                        }
                                    }
                                    bottom.sort((a, b) => (get.value(b) - get.value(a)) * att); //态度大于0价值高的牌放前面
                                    while (bottom.length) {
                                        top.push(bottom.shift());
                                    }
                                    top.reverse();
                                    for (var i = 0; i < top.length; i++) {
                                        ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
                                    }
                                    for (var i = 0; i < bottom.length; i++) {
                                        ui.cardPile.appendChild(bottom[i]);
                                    }
                                    player.popup(get.cnNumber(top.length) + '上' + get.cnNumber(bottom.length) + '下');
                                    game.log(player, '将' + get.cnNumber(top.length) + '张牌置于牌堆顶');
                                };
                                var chooseButton = function (online, player, cards) {
                                    var event = _status.event;
                                    player = player || event.player;
                                    cards = cards || event.cards;
                                    event.top = [];
                                    event.bottom = [];
                                    event.status = true;
                                    event.dialog = ui.create.dialog('按顺序选择置于牌堆顶的牌(先选择的在上)', cards);
                                    event.switchToAuto = function () {
                                        event._result = 'ai';
                                        event.dialog.close();
                                        event.control.close();
                                        _status.imchoosing = false;
                                    };
                                    event.control = ui.create.control('ok', 'pileTop', 'pileBottom', function (link) {
                                        var event = _status.event;
                                        if (link == 'ok') {
                                            if (online) {
                                                event._result = {
                                                    top: [],
                                                    bottom: [],
                                                };
                                                for (var i = 0; i < event.top.length; i++) {
                                                    event._result.top.push(event.top[i].link);
                                                }
                                                for (var i = 0; i < event.bottom.length; i++) {
                                                    event._result.bottom.push(event.bottom[i].link);
                                                }
                                            } else {
                                                var i;
                                                for (var i = 0; i < event.top.length; i++) {
                                                    ui.cardPile.insertBefore(event.top[i].link, ui.cardPile.firstChild);
                                                }
                                                for (var i = 0; i < event.bottom.length; i++) {
                                                    ui.cardPile.appendChild(event.bottom[i].link);
                                                }
                                                for (var i = 0; i < event.dialog.buttons.length; i++) {
                                                    if (event.dialog.buttons[i].classList.contains('glow') == false && event.dialog.buttons[i].classList.contains('target') == false) ui.cardPile.appendChild(event.dialog.buttons[i].link);
                                                }
                                                player.popup(get.cnNumber(event.top.length) + '上' + get.cnNumber(event.cards.length - event.top.length) + '下');
                                                game.log(player, '将' + get.cnNumber(event.top.length) + '张牌置于牌堆顶');
                                            }
                                            event.dialog.close();
                                            event.control.close();
                                            game.resume();
                                            _status.imchoosing = false;
                                        } else if (link == 'pileTop') {
                                            event.status = true;
                                            event.dialog.content.childNodes[0].innerHTML = '按顺序选择置于牌堆顶的牌';
                                        } else {
                                            event.status = false;
                                            event.dialog.content.childNodes[0].innerHTML = '按顺序选择置于牌堆底的牌';
                                        }
                                    });
                                    for (var i = 0; i < event.dialog.buttons.length; i++) {
                                        event.dialog.buttons[i].classList.add('selectable');
                                    }
                                    event.custom.replace.button = function (link) {
                                        var event = _status.event;
                                        if (link.classList.contains('target')) {
                                            link.classList.remove('target');
                                            event.top.remove(link);
                                        } else if (link.classList.contains('glow')) {
                                            link.classList.remove('glow');
                                            event.bottom.remove(link);
                                        } else if (event.status) {
                                            link.classList.add('target');
                                            event.top.unshift(link);
                                        } else {
                                            link.classList.add('glow');
                                            event.bottom.push(link);
                                        }
                                    };
                                    event.custom.replace.window = function () {
                                        for (var i = 0; i < _status.event.dialog.buttons.length; i++) {
                                            _status.event.dialog.buttons[i].classList.remove('target');
                                            _status.event.dialog.buttons[i].classList.remove('glow');
                                            _status.event.top.length = 0;
                                            _status.event.bottom.length = 0;
                                        }
                                    };
                                    game.pause();
                                    game.countChoose();
                                };
                                event.switchToAuto = switchToAuto;
                                if (event.isMine()) {
                                    chooseButton();
                                    event.finish();
                                } else if (event.isOnline()) {
                                    event.player.send(chooseButton, true, event.player, event.cards);
                                    event.player.wait();
                                    game.pause();
                                } else {
                                    event.switchToAuto();
                                    event.finish();
                                }
                                ('step 1');
                                if (event.result == 'ai' || !event.result) {
                                    event.switchToAuto();
                                } else {
                                    var top = event.result.top || [];
                                    var bottom = event.result.bottom || [];
                                    for (var i = 0; i < top.length; i++) {
                                        ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
                                    }
                                    for (var i = 0; i < bottom.length; i++) {
                                        ui.cardPile.appendChild(bottom[i]);
                                    }
                                    if (Array.isArray(event.cards))
                                        for (var i of event.cards) {
                                            //QQ
                                            if (!top.includes(i) && !bottom.includes(i)) {
                                                ui.cardPile.appendChild(i);
                                            }
                                        }
                                    player.popup(get.cnNumber(top.length) + '上' + get.cnNumber(event.cards.length - top.length) + '下');
                                    game.log(player, '将' + get.cnNumber(top.length) + '张牌置于牌堆顶');
                                    player.changeHujia(1);
                                }
                            },
                            ai: {
                                threaten: 1.2,
                            },
                        },
                        hlxtd: {
                            nobracket: true,
                            trigger: {
                                player: 'chooseToRespondBegin',
                            },
                            filter(event, player) {
                                if (event.responded) return false;
                                return _status.currentPhase !== player;
                            },
                            content() {
                                'step 0';
                                var cards = [];
                                if (ui.cardPile.childNodes.length < 2) {
                                    var discardcards = get.cards(2);
                                    game.cardsDiscard(discardcards);
                                }
                                for (var i = 0; i < 2; i++) {
                                    cards.push(ui.cardPile.childNodes[i]);
                                }
                                player.chooseCardButton('合理性推断:选择一张卡牌打出', cards).set('filterButton', function (button) {
                                    return get.type(button.link) == 'basic' && _status.event.getTrigger().filterCard(button.link);
                                });
                                ('step 1');
                                if (result.bool) {
                                    game.log(player, '推断成功');
                                    trigger.untrigger();
                                    trigger.responded = true;
                                    result.links[0].remove();
                                    player.recover();
                                    player.changeHujia(1);
                                    trigger.result = { bool: true, card: result.links[0] };
                                    player.say('我不是想针对谁,只是觉得在座的各位都是垃圾罢了.');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, effect) {
                                        if (get.tag(card, 'respondShan')) return 0.7;
                                        if (get.tag(card, 'respondSha')) return 0.7;
                                    },
                                },
                            },
                        },
                        ljyd: {
                            nobracket: true,
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        hxfs: {
                            nobracket: true,
                            enable: 'chooseToUse',
                            mark: true,
                            limited: true,
                            init(player) {
                                player.storage.hxfs = false;
                            },
                            filter(event, player) {
                                if (player.storage.hxfs) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('hxfs');
                                player.storage.hxfs = true;
                                player.discard(player.getCards('hej'));
                                ('step 1');
                                if (player.hp < 3) {
                                    player.recover(3 - player.hp);
                                }
                                ('step 2');
                                player.draw(4);
                                ('step 3');
                                player.link(false);
                                ('step 4');
                                player.turnOver(false);
                                ('step 5');
                                player.changeHujia(3);
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player) {
                                    if (player.storage.hxfs) return false;
                                    if (player.hp > 0) return false;
                                },
                                save: true,
                                result: {
                                    player(player) {
                                        if (player.hp == 0) return 10;
                                        if (player.hp <= 2 && player.countCards('he') <= 1) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.hxfs) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        sjzq: {
                            trigger: {
                                player: 'useCardEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && _status.currentPhase == player && event.targets[0].isAlive();
                            },
                            check(event, player) {
                                return get.attitude(player, event.targets[0]) < 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red' ? 1.5 : -0.5;
                                });
                                ('step 1');
                                if (result.judge > 0) {
                                    player.useCard({ name: 'sha' }, trigger.targets);
                                } else {
                                    player.recover(1);
                                }
                            },
                        },
                        znly: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return !player.storage.znly;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            limited: true,
                            selectTarget: -1,
                            multitarget: true,
                            multiline: true,
                            mark: true,
                            line: 'fire',
                            content() {
                                'step 0';
                                player.storage.znly = true;
                                player.awakenSkill('znly');
                                event.num = 1;
                                event.targets = targets.slice(0);
                                event.targets.sort(lib.sort.seat);
                                ('step 1');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    event.target = target;
                                    var res = get.damageEffect(target, player, target, 'fire');
                                    target
                                        .chooseToDiscard('he', '弃置至少' + get.cnNumber(event.num) + '张牌或受到3点火焰伤害', [num, Infinity])
                                        .set('ai', function (card) {
                                            if (ui.selected.cards.length >= _status.event.parent.num) return -1;
                                            if (_status.event.player.hasSkillTag('nofire')) return -1;
                                            if (_status.event.res >= 0) return 6 - get.value(card);
                                            if (get.type(card) != 'basic') {
                                                return 10 - get.value(card);
                                            }
                                            return 8 - get.value(card);
                                        })
                                        .set('res', res);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (!result.bool) {
                                    event.target.damage(3, 'fire');
                                    event.num = 1;
                                } else {
                                    event.num = result.cards.length + 1;
                                }
                                event.goto(1);
                                player.recover(3);
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        var num = 0,
                                            players = game.filterPlayer();
                                        for (var i of players) {
                                            if (player != i && get.damageEffect(i, player, i, 'fire') < 0) {
                                                var att = get.attitude(player, i);
                                                if (att > 0) {
                                                    num--;
                                                } else if (att < 0) {
                                                    num++;
                                                }
                                            }
                                        }
                                        if (game.players.length < 5) {
                                            return num - 1;
                                        } else {
                                            return num - 2;
                                        }
                                    },
                                },
                            },
                            init(player) {
                                player.storage.znly = false;
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        xws: {
                            global: 'xws',
                            trigger: {
                                global: 'dying',
                            },
                            _priority: 15,
                            forced: true,
                            filter(event, player, name) {
                                return _status.currentPhase == player && event.player != player;
                            },
                            content() { },
                        },
                        guanx: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp > 0;
                            },
                            content() {
                                'step 0';
                                event.cards = get.cards(game.countPlayer());
                                event.chosen = [];
                                event.num = player.hp;
                                ('step 1');
                                var js = player.getCards('j');
                                var pos;
                                var choice = -1;
                                var getval = function (card, pos) {
                                    if (js[pos]) {
                                        return get.judge(js[pos])(card);
                                    } else {
                                        return get.value(card);
                                    }
                                };
                                for (pos = 0; pos < Math.min(event.cards.length, js.length + 2); pos++) {
                                    var max = getval(event.cards[pos], pos);
                                    for (var j = pos + 1; j < event.cards.length; j++) {
                                        var current = getval(event.cards[j], pos);
                                        if (current > max) {
                                            choice = j;
                                            max = current;
                                        }
                                    }
                                    if (choice != -1) {
                                        break;
                                    }
                                }
                                player
                                    .chooseCardButton('观星:选择要移动的牌(还能移动' + event.num + '张)', event.cards)
                                    .set('filterButton', function (button) {
                                        return !_status.event.chosen.includes(button.link);
                                    })
                                    .set('chosen', event.chosen)
                                    .set('ai', function (button) {
                                        return button.link == _status.event.choice ? 1 : 0;
                                    })
                                    .set('choice', event.cards[choice]);
                                event.pos = pos;
                                ('step 2');
                                if (result.bool) {
                                    var card = result.links[0];
                                    var index = event.cards.indexOf(card);
                                    event.card = card;
                                    event.chosen.push(card);
                                    event.cards.remove(event.card);
                                    var buttons = event.cards.slice(0);
                                    player
                                        .chooseControl(function () {
                                            return _status.event.controlai;
                                        })
                                        .set('controlai', event.pos || 0)
                                        .set('sortcard', buttons)
                                        .set('tosort', card);
                                } else {
                                    event.goto(4);
                                }
                                ('step 3');
                                if (typeof result.index == 'number') {
                                    if (result.index > event.cards.length) {
                                        ui.cardPile.appendChild(event.card);
                                    } else {
                                        event.cards.splice(result.index, 0, event.card);
                                    }
                                    event.num--;
                                    if (event.num > 0) {
                                        event.goto(1);
                                    }
                                }
                                ('step 4');
                                while (event.cards.length) {
                                    ui.cardPile.insertBefore(event.cards.pop(), ui.cardPile.firstChild);
                                }
                                var js = player.getCards('j');
                                if (js.length == 1) {
                                    if (get.judge(js[0])(ui.cardPile.firstChild) < 0) {
                                        player.addTempSkill('guanx');
                                    }
                                }
                            },
                            ai: {
                                guanxing: true,
                            },
                        },
                        ghqs: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                var num = 0;
                                for (var i of game.players) {
                                    //QQ
                                    num += i.storage.yzjm_mark;
                                }
                                if (num >= 4) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                for (var i of game.players) {
                                    //QQ
                                    if (i.storage.yzjm_mark) {
                                        player.line(i, 'fire');
                                        if (i.countCards('h') >= i.storage.yzjm_mark) {
                                            player.gainPlayerCard(i.storage.yzjm_mark, i, 'h', true);
                                        } else {
                                            player.gain(i.getCards('h'));
                                            i.$give(i.countCards('h'), player);
                                            i.damage(1)._triggered = null;
                                        }
                                    }
                                }
                                ('step 1');
                                for (var i of game.players) {
                                    //QQ
                                    i.unmarkSkill(' yzjm_mark');
                                    i.storage.yzjm_mark = 0;
                                }
                            },
                        },
                        lgyc: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                if (player.getStat().damage > trigger.num) {
                                    player.draw();
                                } else {
                                    player.draw(2);
                                    player.recover();
                                    player.changeHujia(2);
                                    player.say('陵光以蹴');
                                }
                            },
                            ai: {
                                damageBonus: true,
                            },
                        },
                        qsj: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'juedou' && event.player.isAlive();
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) >= 0) return false;
                                if (player.hp > 2) return true;
                                if (player.hp < 1) return false;
                                return player.hp >= event.player.hp;
                            },
                            content() {
                                'step 0';
                                trigger.player.chooseToDiscard(1, true);
                                ('step 1');
                                player.changeHujia();
                                player.draw();
                                player.say('我会一直守护你.');
                            },
                        },
                        qstj: {
                            audio: 'ext:永远的七日之都/audio:2',
                            enable: 'chooseToUse',
                            usable: 3,
                            filterCard(card) {
                                return get.color(card) == 'red';
                            },
                            nobracket: true,
                            viewAs: {
                                name: 'juedou',
                                nature: 'fire',
                            },
                            viewAsFilter(player) {
                                if (!player.countCards('h', { color: 'red' })) return false;
                            },
                            prompt: '将一张红色牌当决斗使用',
                            check(card) {
                                var player = _status.currentPhase;
                                if (player.countCards('h') > player.hp) {
                                    return 6 - get.value(card);
                                }
                                return 4 - get.value(card);
                            },
                            ai: {
                                basic: {
                                    order: 8,
                                    value: [3, 1],
                                    useful: 1,
                                },
                                wuxie(target, card, player, current, state) {
                                    if (get.attitude(current, player) >= 0 && state > 0) return false;
                                },
                                result: {
                                    player(player) {
                                        var nh = player.countCards('h');
                                        if (nh <= player.hp && nh <= 4 && _status.event.name == 'chooseToUse') {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'juedou' }, player)) {
                                                return -10;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'juedou') return -10;
                                                if (viewAs && viewAs.name == 'juedou') return -10;
                                            }
                                        }
                                        return 0;
                                    },
                                    target(player, target) {
                                        if (target.hasSkill('juedou') || target.countCards('h') == 0) return 0;
                                        if (player.countCards('h') <= 1) return 0;
                                        if (target == player) {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'juedou' }, player)) {
                                                return -1.5;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'juedou') return -1.5;
                                                if (viewAs && viewAs.name == 'juedou') return -1.5;
                                            }
                                            return 0;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    damage: 1,
                                    fireDamage: 1,
                                    natureDamage: 1,
                                    norepeat: 1,
                                    respond: 2,
                                    respondSha: 2,
                                },
                            },
                        },
                        xtfj: {
                            enable: 'phaseUse',
                            forced: true,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            nobracket: true,
                            content() {
                                player.viewCards('' + get.translation(target) + '的手牌', target.getCards('h'));
                            },
                        },
                        yvz: {
                            nobracket: true,
                            trigger: {
                                player: ['gameDrawBegin', 'phaseBefore'],
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            forced: true,
                            delay: false,
                            forced: true,
                            content() {
                                'step 0';
                                var list = get.gainableSkills();
                                list.remove('yvz');
                                list = list.randomGets(3);
                                event.skillai = function () {
                                    return get.max(list, get.skillRank, 'item');
                                };
                                if (event.isMine()) {
                                    var dialog = ui.create.dialog('forcebutton');
                                    dialog.add('选择获得一项技能');
                                    var clickItem = function () {
                                        _status.event._result = this.link;
                                        dialog.close();
                                        game.resume();
                                    };
                                    for (var i = 0; i < list.length; i++) {
                                        if (lib.translate[list[i] + '_info']) {
                                            var translation = get.translation(list[i]);
                                            if (translation[0] == '新' && translation.length == 3) {
                                                translation = translation.slice(1, 3);
                                            } else {
                                                translation = translation.slice(0, 2);
                                            }
                                            var item = dialog.add('<div class="popup pointerdiv" style="width:80%;display:inline-block"><div class="skill">【' + translation + '】</div><div>' + lib.translate[list[i] + '_info'] + '</div></div>');
                                            item.firstChild.addEventListener('click', clickItem);
                                            item.firstChild.link = list[i];
                                        }
                                    }
                                    dialog.add(ui.create.div('.placeholder'));
                                    event.switchToAuto = function () {
                                        event._result = event.skillai();
                                        dialog.close();
                                        game.resume();
                                    };
                                    _status.imchoosing = true;
                                    game.pause();
                                } else {
                                    event._result = event.skillai();
                                }
                                ('step 1');
                                _status.imchoosing = false;
                                var link = result;
                                player.addSkill(link);
                                player.popup(link);
                                game.log(player, '获得了技能', '【' + get.translation(link) + '】');
                                player.say('<但是为什么,一个浑身是缺陷的丑陋造物,一个只会不断犯错的普通人,却可以获得神的青睐.>');
                            },
                            ai: {
                                order: 11,
                                result: {
                                    player(player) {
                                        if (player.getStat().skill.yvz) return 0;
                                        return 1;
                                    },
                                },
                            },
                        },
                        yzjm: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && (event.card.name == 'sha' || event.card.name == 'juedou') && event.notLink();
                            },
                            init(player) {
                                for (var i of game.players) {
                                    //QQ
                                    i.storage.yzjm_mark = 0;
                                }
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('yzjm'), function (card, player, target) {
                                    return (trigger.source == target || trigger.player == target) && player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].storage.yzjm_mark += 1;
                                    result.targets[0].markSkill('yzjm_mark');
                                }
                            },
                            subSkill: {
                                mark: {
                                    marktext: '阳',
                                    intro: {
                                        content: 'mark',
                                    },
                                },
                            },
                        },
                        yyyxydzr: {
                            nobracket: true,
                            trigger: {
                                global: 'respond',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'shan';
                            },
                            forced: true,
                            content() {
                                'step 1';
                                player.storage.cygd_duanlie = false;
                                player.phase('nodelay');
                                player.recover(100);
                                player.say('嘻嘻~想要和妾身玩游戏吗？');
                            },
                        },
                        hsq: {
                            trigger: {
                                player: 'damageBefore',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.nature == 'fire';
                            },
                            content() {
                                trigger.cancel();
                                player.recover();
                                player.draw(2);
                            },
                            ai: {
                                effect: {
                                    target(card) {
                                        if (get.tag(card, 'fireDamage')) {
                                            return [0, 2];
                                        }
                                    },
                                },
                            },
                        },
                        yydgzdx: {
                            trigger: {
                                source: 'damageEnd',
                                player: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 2';
                                var skills = [];
                                for (var i in lib.character) {
                                    for (var j = 0; j < lib.character[i][3].length; j++) {
                                        var info = lib.skill[lib.character[i][3][j]];
                                        if (info && (info.gainable || !info.unique)) {
                                            skills.add(lib.character[i][3][j]);
                                        }
                                    }
                                }
                                var link = skills.randomGet();
                                if (!player.storage.feng_mingdao) player.storage.feng_mingdao = [];
                                player.storage.feng_mingdao.push(link);
                                player.addSkill(link);
                                player.mark(link, {
                                    name: get.translation(link),
                                    content: lib.translate[link + '_info'],
                                });
                                game.log(player, '获得技能', '【' + get.translation(link) + '】');
                            },
                        },
                        plyz: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: [1],
                            filter(event, player) {
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                var damage = [2];
                                target.damage(damage.randomGet(), 'thunder');
                                target.turnOver();
                                player.draw(2);
                            },
                            ai: {
                                threaten: 2.1,
                                order: 6,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        smyl: {
                            trigger: {
                                player: 'dieBefore',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return player.hp >= 1;
                            },
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.hp == player.hp;
                            },
                        },
                        plzy: {
                            trigger: {
                                player: 'dieBefore',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return player.maxHp >= 0;
                            },
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.hp = 0;
                                player.recover(100);
                            },
                        },
                        kmmhsj: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: [3],
                            filter(event, player) {
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                var damage = [1];
                                target.damage(damage.randomGet());
                                target.goMad({ player: 'phaseBegin' });
                                player.recover(0);
                                player.draw(1);
                                player.say('啊啊啊!还请阁下不要这样做!');
                            },
                            ai: {
                                threaten: 2.1,
                                order: 6,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        hpcycm: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player.canCompare(target);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    target.loseMaxHp();
                                    target.loseHp();
                                    target.turnOver();
                                    target.goMad({ player: 'phaseBegin' });
                                    player.draw(3);
                                    player.say('看不见我看不见我……');
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        if (target.hasJudge('lebu')) return -get.effect(target, { name: 'lebu' }, player, target);
                                        return get.effect(target, { name: 'lebu' }, player, target);
                                    },
                                },
                                order: 9,
                            },
                        },
                        rxklywz: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                trigger.num--;
                                player.say('呜呜呜,不要吃我啊……');
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (player.hasSkillTag('jueqing', false, target)) return;
                                        var num = get.tag(card, 'damage');
                                        if (num > 0) {
                                            if (num > 1) return 0.5;
                                            return 0;
                                        }
                                    },
                                },
                            },
                        },
                        kqzt: {
                            trigger: {
                                source: 'damageBegin',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.notLink();
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                trigger.num++;
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 0;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 1;
                                },
                            },
                            ai: {
                                unequip: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        bsrsdyt: {
                            nobracket: true,
                            usable: 1,
                            enable: 'phaseUse',
                            content() {
                                player.init('受');
                                player.update();
                                ui.clear();
                            },
                        },
                        lx: {
                            trigger: {
                                player: ['respond', 'useCard'],
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (player == _status.currentPhase) return false;
                                if (get.itemtype(event.cards) != 'cards') return false;
                                return game.hasPlayer(function (current) {
                                    return get.distance(player, current, 'attack') > 1 && player != current;
                                });
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('lx'), function (card, player, target) {
                                    return get.distance(player, target, 'attack') > 1 && player != target;
                                }).ai = function (target) {
                                    var att = get.attitude(player, target);
                                    if (att <= -0.5) return 0;
                                    if (att <= 3) return att + 0.5;
                                    return att + Math.min(0.5, 5 - target.countCards('h'));
                                };
                                ('step 1');
                                if (result.bool) {
                                    game.asyncDraw([player, result.targets[0]]);
                                    player.recover(1);
                                }
                            },
                            ai: {
                                mingzhi: false,
                                effect: {
                                    target(card, player, target) {
                                        if (player == _status.currentPhase) return;
                                        if (
                                            !game.hasPlayer(function (current) {
                                                return get.distance(player, current, 'attack') > 1 && player != current && get.attitude(player, current) >= 0;
                                            })
                                        ) {
                                            return;
                                        }
                                        if (get.type(card) == 'equip' && player == target) {
                                            var distance = get.info(card).distance;
                                            if (distance) {
                                                if (distance.attackFrom < 0 || distance.globalFrom < 0) return 0;
                                            }
                                        } else {
                                            if (!target.hasFriend()) return;
                                            var hs = target.countCards('h');
                                            if (get.tag(card, 'respondShan')) {
                                                var shans = target.countCards('h', 'shan');
                                                if (shans > 1) return [0, 1];
                                                if (shans && hs > 2) return [0, 1];
                                                if (shans) return [0, 0];
                                                if (hs > 2) return [0, 0];
                                                if (hs > 1) return [1, 0.5];
                                                return [1.5, 0];
                                            }
                                            if (get.tag(card, 'respondSha')) {
                                                var shas = target.countCards('h', 'sha');
                                                if (shas > 1) return [0, 1];
                                                if (shas && hs > 2) return [0, 1];
                                                if (shas) return [0, 0];
                                                if (hs > 2) return [0, 0];
                                                if (hs > 1) return [1, 0.5];
                                                return [1.5, 0];
                                            }
                                        }
                                    },
                                },
                                threaten: 0.8,
                                expose: 0.1,
                            },
                        },
                        zhai: {
                            trigger: {
                                global: 'gameStart',
                            },
                            forced: true,
                            content() {
                                player.goMad = game.kongfunc;
                            },
                        },
                        yexi: {
                            trigger: {
                                player: 'useCard',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                var type = get.type(event.card, 'trick');
                                return (
                                    type == 'trick' &&
                                    game.hasPlayer(function (current) {
                                        return player.canUse('sha', current, false) && !event.targets.includes(current);
                                    })
                                );
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('yexi'), function (card, player, target) {
                                    return player.canUse('sha', target, false) && !trigger.targets.includes(target);
                                }).ai = function (target) {
                                    return get.effect(target, { name: 'sha' }, player, player);
                                };
                                ('step 1');
                                if (result.bool) {
                                    if (!event.isMine()) {
                                    }
                                    player.useCard({ name: 'sha' }, result.targets, false);
                                    player.tempHide();
                                    player.say('因为我的心告诉我那边才是正确的,我要走自己相信的路!');
                                }
                            },
                            ai: {
                                expose: 0.2,
                                threaten: 1.5,
                                noautowuxie: true,
                            },
                        },
                        wlrj: {
                            nobracket: true,
                            srlose: true,
                            trigger: {
                                player: ['phaseBegin'],
                            },
                            content() {
                                'step 0';
                                if (player.isUnderControl()) {
                                    game.modeSwapPlayer(player);
                                }
                                var cards = get.cards(Math.min(7, game.players.length));
                                event.cards = cards;
                                var switchToAuto = function () {
                                    _status.imchoosing = false;
                                    if (event.dialog) event.dialog.close();
                                    if (event.control) event.control.close();
                                    const top = [], bottom = cards;
                                    for (const i of player.getCards('j')) {
                                        const judge = get.judge(i);
                                        bottom.sort((a, b) => (judge(b) - judge(a))); //价值高的牌放前面
                                        if (bottom.length) {
                                            top.push(bottom.shift());
                                        }
                                    }
                                    bottom.sort((a, b) => (get.value(b) - get.value(a))); //把价值高的牌放前面
                                    while (bottom.length) {
                                        top.push(bottom.shift());
                                    }
                                    top.reverse();
                                    for (var i = 0; i < top.length; i++) {
                                        ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
                                    }
                                    for (var i = 0; i < bottom.length; i++) {
                                        ui.cardPile.appendChild(bottom[i]);
                                    }
                                    player.popup(get.cnNumber(top.length) + '上' + get.cnNumber(bottom.length) + '下');
                                    game.log(player, '将' + get.cnNumber(top.length) + '张牌置于牌堆顶');
                                };
                                var chooseButton = function (online, player, cards) {
                                    var event = _status.event;
                                    player = player || event.player;
                                    cards = cards || event.cards;
                                    event.top = [];
                                    event.bottom = [];
                                    event.status = true;
                                    event.dialog = ui.create.dialog('按顺序选择置于牌堆顶的牌(先选择的在上)', cards);
                                    event.switchToAuto = function () {
                                        event._result = 'ai';
                                        event.dialog.close();
                                        event.control.close();
                                        _status.imchoosing = false;
                                    };
                                    event.control = ui.create.control('ok', 'pileTop', 'pileBottom', function (link) {
                                        var event = _status.event;
                                        if (link == 'ok') {
                                            if (online) {
                                                event._result = {
                                                    top: [],
                                                    bottom: [],
                                                };
                                                for (var i = 0; i < event.top.length; i++) {
                                                    event._result.top.push(event.top[i].link);
                                                }
                                                for (var i = 0; i < event.bottom.length; i++) {
                                                    event._result.bottom.push(event.bottom[i].link);
                                                }
                                            } else {
                                                var i;
                                                for (var i = 0; i < event.top.length; i++) {
                                                    ui.cardPile.insertBefore(event.top[i].link, ui.cardPile.firstChild);
                                                }
                                                for (var i = 0; i < event.bottom.length; i++) {
                                                    ui.cardPile.appendChild(event.bottom[i].link);
                                                }
                                                for (var i = 0; i < event.dialog.buttons.length; i++) {
                                                    if (event.dialog.buttons[i].classList.contains('glow') == false && event.dialog.buttons[i].classList.contains('target') == false) ui.cardPile.appendChild(event.dialog.buttons[i].link);
                                                }
                                                player.popup(get.cnNumber(event.top.length) + '上' + get.cnNumber(event.cards.length - event.top.length) + '下');
                                                game.log(player, '将' + get.cnNumber(event.top.length) + '张牌置于牌堆顶');
                                            }
                                            event.dialog.close();
                                            event.control.close();
                                            game.resume();
                                            _status.imchoosing = false;
                                        } else if (link == 'pileTop') {
                                            event.status = true;
                                            event.dialog.content.childNodes[0].innerHTML = '按顺序选择置于牌堆顶的牌';
                                        } else {
                                            event.status = false;
                                            event.dialog.content.childNodes[0].innerHTML = '按顺序选择置于牌堆底的牌';
                                        }
                                    });
                                    for (var i = 0; i < event.dialog.buttons.length; i++) {
                                        event.dialog.buttons[i].classList.add('selectable');
                                    }
                                    event.custom.replace.button = function (link) {
                                        var event = _status.event;
                                        if (link.classList.contains('target')) {
                                            link.classList.remove('target');
                                            event.top.remove(link);
                                        } else if (link.classList.contains('glow')) {
                                            link.classList.remove('glow');
                                            event.bottom.remove(link);
                                        } else if (event.status) {
                                            link.classList.add('target');
                                            event.top.unshift(link);
                                        } else {
                                            link.classList.add('glow');
                                            event.bottom.push(link);
                                        }
                                    };
                                    event.custom.replace.window = function () {
                                        for (var i = 0; i < _status.event.dialog.buttons.length; i++) {
                                            _status.event.dialog.buttons[i].classList.remove('target');
                                            _status.event.dialog.buttons[i].classList.remove('glow');
                                            _status.event.top.length = 0;
                                            _status.event.bottom.length = 0;
                                        }
                                    };
                                    game.pause();
                                    game.countChoose();
                                };
                                event.switchToAuto = switchToAuto;
                                if (event.isMine()) {
                                    chooseButton();
                                    event.finish();
                                } else if (event.isOnline()) {
                                    event.player.send(chooseButton, true, event.player, event.cards);
                                    event.player.wait();
                                    game.pause();
                                } else {
                                    event.switchToAuto();
                                    event.finish();
                                }
                                ('step 1');
                                if (event.result == 'ai' || !event.result) {
                                    event.switchToAuto();
                                } else {
                                    var top = event.result.top || [];
                                    var bottom = event.result.bottom || [];
                                    for (var i = 0; i < top.length; i++) {
                                        ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
                                    }
                                    for (var i = 0; i < bottom.length; i++) {
                                        ui.cardPile.appendChild(bottom[i]);
                                    }
                                    if (Array.isArray(event.cards))
                                        for (var i of event.cards) {
                                            //QQ
                                            if (!top.includes(i) && !bottom.includes(i)) {
                                                ui.cardPile.appendChild(i);
                                            }
                                        }
                                    player.popup(get.cnNumber(top.length) + '上' + get.cnNumber(event.cards.length - top.length) + '下');
                                    game.log(player, '将' + get.cnNumber(top.length) + '张牌置于牌堆顶');
                                }
                            },
                            ai: {
                                threaten: 1.2,
                            },
                        },
                        ft: {
                            nobracket: true,
                            trigger: {
                                source: 'damageBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            init(player) {
                                player.addTempSkill('guanshi_skill', { player: 'dieAfter' });
                            },
                            content() {
                                player.say('去死!去死!都去死吧!要杀阿雪的家伙!都去死吧!');
                                player.gainMaxHp();
                                player.recover();
                                player.draw(2);
                                trigger.player.loseHp();
                            },
                        },
                        pqsy: {
                            nobracket: true,
                            usable: 1,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('h', { type: 'trick' }) > 0;
                            },
                            filterCard(card) {
                                return get.type(card) == 'trick';
                            },
                            position: 'h',
                            selectCard: [1],
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(card) {
                                10 - get.value(card);
                            },
                            content() {
                                target.damage(2);
                                target.turnOver();
                                player.changeHujia();
                                player.turnOver();
                                player.say('夜夜世界第一可爱!');
                            },
                            ai: {
                                order() {
                                    return 6;
                                },
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                        },
                        jqsnbhss: {
                            trigger: {
                                player: 'damageBefore',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return Math.random() <= 0.4;
                            },
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.draw();
                                player.say('夜夜可是不会怀孕也不会漏气的自动人偶哦.');
                            },
                        },
                        mshljgl: {
                            trigger: {
                                source: 'damageBegin',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.notLink();
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                trigger.num++;
                                player.say('只要是为了指挥官,哪怕是上刀山下油锅,或是进被窝,夜夜都在所不辞!');
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 2;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 0;
                                },
                            },
                            ai: {
                                unequip: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        xwdxz: {
                            nobracket: true,
                            forced: true,
                            trigger: {
                                player: 'phaseDiscardEnd',
                            },
                            content() {
                                player.gainMaxHp(1);
                                player.recover(1);
                                player.changeHujia(1);
                                player.say('可以哦,夜夜的全部都是指挥官的东西,请任意的使用我吧.');
                            },
                        },
                        jdfys: {
                            forced: true,
                            nobracket: true,
                            subSkill: {
                                damage: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        return event.num > 0;
                                    },
                                    forced: true,
                                    content() {
                                        trigger.untrigger();
                                        trigger.finish();
                                        player.draw(trigger.num);
                                    },
                                    ai: {
                                        threaten: 0.8,
                                        result: {
                                            effect(card, player, target) {
                                                if (get.tag(card, 'damage')) {
                                                    if (player.hasSkill('jueqing')) return [1, -2];
                                                    if (target.countCards('h') + 1 <= target.hp) return [0, 1];
                                                    if (target.hasFriend()) return [1, 1];
                                                }
                                            },
                                        },
                                    },
                                },
                                recover: {
                                    trigger: {
                                        player: 'recoverBegin',
                                    },
                                    filter(event, player) {
                                        return event.num > 0;
                                    },
                                    forced: true,
                                    content() {
                                        trigger.untrigger();
                                        trigger.finish();
                                        player.draw(trigger.num);
                                    },
                                },
                            },
                        },
                        cyby: {
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 1000,
                            filter(event, player) {
                                return player != event.player;
                            },
                            nobracket: true,
                            content() {
                                trigger.player.loseMaxHp(trigger.num);
                                player.draw(trigger.num);
                                player.gainMaxHp(trigger.num);
                                player.recover(trigger.num);
                                player.say('正因为背负着,我才更应决斗.');
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 0;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 3;
                                },
                            },
                        },
                        jiushu: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'loseEnd',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        //QQ
                                        if (i.original == 'h') return true;
                                    }
                                return false;
                            },
                            content() {
                                player.draw(10);
                                player.recover(2);
                                player.turnOver(false);
                                player.say('所有人都祈祷着要活下去,所有人都曾期盼要活下去,生命并不是供人蹂躏的玩物!');
                            },
                            ai: {
                                threaten: 0.8,
                                effect: {
                                    target(card) {
                                        if (card.name == 'guohe' || card.name == 'liuxinghuoyu') return 0.5;
                                    },
                                },
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh') {
                                        if (player.countCards('h') != 1) return false;
                                    }
                                },
                            },
                        },
                        zaie: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.player != player && Math.random() <= 0.3;
                            },
                            content() {
                                player.say('大家都在惧怕……已经开始了');
                                const next = game.createEvent('diex', false);
                                next.source = player;
                                next.player = trigger.player;
                                next._triggered = null;
                                next.restMap = { type: null, count: null, audio: null };
                                next.excludeMark = [];
                                next.setContent('die');
                            },
                        },
                        rozy: {
                            enable: 'phaseUse',
                            usable: 2,
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h');
                            },
                            nobracket: true,
                            content() {
                                'step 0';
                                if (player.countCards('h')) {
                                    player.chooseCardButton('人偶之眼', target.getCards('h')).ai = function (button) {
                                        return get.value(button.link) - 5;
                                    };
                                } else {
                                    player.viewHandcards(target);
                                    event.finish();
                                }
                                ('step 1');
                                if (result.bool) {
                                    event.card = result.links[[0]];
                                    player.chooseCard('h', true, '用一张手牌替换' + get.translation(event.card)).ai = function (card) {
                                        return -get.value(card);
                                    };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.gain(event.card, target);
                                    target.gain(result.cards, player);
                                    player.$giveAuto(result.cards, target);
                                    target.$giveAuto(event.card, player);
                                    game.log(player, '与', target, '交换了一张手牌');
                                    player.say('我的左眼是<人偶之眼>,因为能看见不该看见的东西,所以平常都藏起来.');
                                }
                            },
                            ai: {
                                threaten: 1.3,
                                result: {
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                                order: 10,
                                expose: 0.2,
                            },
                        },
                        mkttm: {
                            nobracket: true,
                            enable: 'phaseUse',
                            round: 2,
                            selectTarget: [1, 7],
                            filter(event, player) {
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                //QQQ
                                var damage = [2];
                                target.damage(damage.randomGet());
                                target.turnOver();
                                target.chooseToDiscard(6, true);
                                player.say('</font> <font color=#f00>世间万物都将在我面前冻结.</font>');
                            },
                            ai: {
                                threaten: 2.1,
                                order: 12,
                                result: {
                                    target: -3,
                                },
                            },
                            group: ['mkttm_roundcount'],
                        },
                        djcy: {
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: 1000,
                            filter(event, player) {
                                return player != event.player;
                            },
                            nobracket: true,
                            content() {
                                trigger.player.loseMaxHp(trigger.num);
                                player.draw();
                                player.changeHujia();
                                player.recover();
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') range[1] += 0;
                                },
                                cardUsable(card, player, num) {
                                    //if(player.getEquip(1)) return;
                                    if (card.name == 'sha') return num + 1;
                                },
                            },
                        },
                        bldjj: {
                            trigger: {
                                global: 'drawAfter',
                            },
                            nobracket: true,
                            forced: true,
                            logTarget: 'player',
                            filter(event, player) {
                                return event.result && event.result.length >= 2 && event.player != player;
                            },
                            content() {
                                'step 0';
                                trigger.player.chooseCard(
                                    function (card) {
                                        return trigger.result.includes(card);
                                    },
                                    '冰岚大将军:交给' + get.translation(player) + '一张牌',
                                    true
                                );
                                ('step 1');
                                if (result.bool) {
                                    player.gain(result.cards, trigger.player);
                                    trigger.player.$give(1, player);
                                    player.say('我是一切的征服者,不管对谁.');
                                }
                            },
                        },
                        dous: {
                            trigger: {
                                global: 'damageAfter',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.player != player && get.distance(player, event.player) <= 1;
                            },
                            content() {
                                if (player.isDamaged()) {
                                    player.recover(2);
                                } else {
                                    player.draw(2);
                                    player.say('用你死前最后的挣扎来取悦我吧.');
                                }
                            },
                        },
                        djmsxx: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.player.isAlive();
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) >= 0) return false;
                                if (player.hp > 2) return true;
                                if (player.hp < 2) return false;
                                return player.hp >= event.player.hp;
                            },
                            content() {
                                'step 0';
                                trigger.player.loseHp(2);
                                ('step 1');
                                player.loseHp();
                                ('step 2');
                                player.draw(2);
                                trigger.player.chooseToDiscard(2, true);
                                trigger.player.loseMaxHp();
                                player.say('废话少说,想要否定我的话,就让我看看你有多强吧!');
                            },
                        },
                        zangsong: {
                            trigger: {
                                player: ['shaBegin'],
                            },
                            nobracket: true,
                            forced: true,
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            content() {
                                'step 0';
                                player.addSkill('qianxing');
                                if (target != player) {
                                    trigger.directHit = true;
                                    trigger.num *= 2;
                                    player.say('一击必杀,葬送!');
                                }
                            },
                        },
                        mmqw: {
                            trigger: {
                                player: 'shaBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return !event.directHit && player.getEquip(1);
                            },
                            _priority: -1,
                            content() {
                                if (typeof trigger.shanRequired == 'number') {
                                    trigger.shanRequired++;
                                } else {
                                    trigger.shanRequired = 2;
                                    player.say('好像……血液在沸腾……');
                                }
                            },
                        },
                        bgyx: {
                            audio: 'ext:七日之都/audio:2',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.storage.畏 >= 4;
                            },
                            nobracket: true,
                            usable: 1,
                            content() {
                                'step 0';
                                player.storage.畏 -= 4;
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                player.line(event.targets, 'green');
                                event.targets2 = event.targets.slice(0);
                                player.say('我就是魑魅魍魉之主!');
                                ('step 1');
                                if (event.targets2.length) {
                                    event.targets2.shift().damage(1);
                                    event.redo();
                                }
                                ('step 2');
                                if (event.targets.length) {
                                    event.current = event.targets.shift();
                                    event.current.discard(event.current.getCards('e')).delay = false;
                                }
                                ('step 3');
                                event.current.chooseToDiscard('h', true, 2).delay = false;
                                ('step 4');
                                if (event.targets.length) event.goto(2);
                                ('step 5');
                                player.draw(3);
                                player.turnOver();
                            },
                            ai: {
                                combo: '畏',
                                order: 10,
                                result: {
                                    player(player) {
                                        return game.countPlayer(function (current) {
                                            if (current != player) {
                                                return get.sgn(get.damageEffect(current, player, player));
                                            }
                                        });
                                    },
                                },
                            },
                        },
                        jhsy: {
                            nobracket: true,
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            _priority: 5,
                            filter(event, player) {
                                return event.card && event.player != player && event.targets.length == 1 && player.storage.畏 > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(function (card, player, target) {
                                    return get.distance(trigger.player, target, 'attack') <= 1 && target != player;
                                }, '是否发动镜花水月？');
                                ('step 1');
                                if (result.bool) {
                                    player.storage.畏--;
                                    if (trigger.player != result.targets) {
                                        trigger.player.line(result.targets[0]);
                                    }
                                    trigger.target = result.targets[0];
                                    trigger.targets.remove(player);
                                    trigger.targets.push(result.targets[0]);
                                    player.judge();
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.color == `red` && player.hp != player.maxHp) {
                                    player.draw();
                                } else {
                                    player.draw();
                                }
                                trigger.untrigger();
                                trigger.trigger('useCardToBefore');
                                trigger.trigger('shaBefore');
                                player.say('滑头鬼是映于镜里之花浮于水中之月.');
                            },
                        },
                        bsfkdyt: {
                            nobracket: true,
                            usable: 1,
                            enable: 'phaseUse',
                            content() {
                                player.init('狂气');
                                player.update();
                                ui.clear();
                            },
                        },
                        xhwh: {
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('he', { type: 'trick' });
                            },
                            nobracket: true,
                            check(card) {
                                return 10 - get.value(card);
                            },
                            filterCard: {
                                type: 'trick',
                            },
                            position: 'he',
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            content() {
                                player.gain(target.getCards('h'));
                                target.$give(target.getCards('h').length, player);
                                target.turnOver();
                                player.turnOver();
                                target.loseHp();
                                target.loseHp();
                                player.say('喂,我爱你啊,喂,你听到了吗？');
                            },
                            ai: {
                                order: 12,
                                result: {
                                    player: -1,
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                            },
                        },
                        xkzs: {
                            nobracket: true,
                            trigger: {
                                global: 'phaseBegin',
                            },
                            filter(event, player) {
                                return event.player != player;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw();
                                player.recover();
                            },
                        },
                        rojxyz: {
                            nobracket: true,
                            srlose: true,
                            forced: true,
                            trigger: {
                                source: 'damageAfter',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0 && event.notLink();
                            },
                            _priority: 5,
                            content() {
                                'step 0';
                                var num = [1, 2].randomGet();
                                if (num == 1) player.draw();
                                player.say('这是主人吩咐的事情,我自然要听从.');
                                if (num == 2) player.draw(2);
                            },
                            mod: {
                                selectTarget(card, player, range) {
                                    if (Array.isArray(range) && range[1] == -1) return;
                                    if (card.name == 'sha') range[1] += 1;
                                },
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return num + player.maxHp - player.hp + 2;
                                },
                            },
                        },
                        swdys: {
                            trigger: {
                                global: 'dying',
                            },
                            _priority: 55,
                            filter(event, player) {
                                return event.player.hp <= 0;
                            },
                            nobracket: true,
                            content() {
                                'step 0';
                                trigger.player.judge(function (card) {
                                    if (get.color(card) == 'black') return -10;
                                    if (get.color(card) == 'red') return 5;
                                });
                                ('step 1');
                                if (result.color == 'black') {
                                    trigger.player.die();
                                    player.say('死啊,可能并不温柔.虽然进经常说到<安详的死亡>,但却不是那样的,黑暗——无论到处都是黑暗,无论何处都是孤自一人.');
                                } else {
                                    if (result.color == 'red') {
                                        trigger.player.recover();
                                        player.say('saka kibara 这个名字,不禁会让人联想到‘死’.而且还不是 单纯的‘死’,是以学校为舞台,残酷无情的死.');
                                    }
                                }
                                ('step 2');
                                if (!trigger.player.isAlive()) {
                                    trigger.untrigger(true);
                                    trigger.finish();
                                }
                            },
                        },
                        畏: {
                            init(player) {
                                player.storage.畏 = 0;
                            },
                            intro: {
                                content: 'mark',
                            },
                            forced: true,
                            trigger: {
                                source: 'damageEnd',
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.storage.畏 += trigger.num;
                                player.markSkill('畏');
                            },
                        },
                        zzhzly: {
                            nobracket: true,
                            trigger: {
                                global: 'phaseBegin',
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0 && event.player != player;
                            },
                            forced: true,
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('镇子·黑子领域')).ai = function (target) {
                                    return get.damageEffect(target, _status.event.player, _status.event.player);
                                };
                                ('step 1');
                                if (result.bool) {
                                    event.target = result.targets[0];
                                    player.judge(function (card) {
                                        var color = get.color(card);
                                        if (color == 'red') return 2;
                                        if (color == 'black') return 2;
                                    });
                                }
                                ('step 2');
                                if (result.color == 'red') {
                                    player.draw();
                                    player.recover();
                                    player.say('镇子·白子领域');
                                } else if (result.color == 'black') {
                                    var mubiao = event.target;
                                    player.line(mubiao);
                                    event.target.loseHp();
                                    player.say('镇子·黑子领域');
                                }
                            },
                        },
                        'yydqrzd busi': {
                            nobracket: true,
                            trigger: {
                                player: 'dying',
                            },
                            _priority: 7,
                            forced: true,
                            filter(event, player) {
                                return player.hp <= 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return card.suit == 'spade' ? -1 : 1;
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.recover(3 - player.hp);
                                    player.turnOver(true);
                                }
                            },
                            ai: {
                                threaten: 0.8,
                            },
                        },
                        yydqrzd_xzd: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return !player.hujia;
                            },
                            content() {
                                player.changeHujia(2);
                            },
                            subSkill: {
                                hujia: {
                                    trigger: {
                                        player: 'damageZero',
                                    },
                                    filter(event, player) {
                                        return event.hujia;
                                    },
                                    forced: true,
                                    content() {
                                        player.draw();
                                    },
                                },
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hujia) {
                                        return 0.5;
                                    } else {
                                        return 2;
                                    }
                                },
                            },
                        },
                        yydqrzd_zl: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && (event.card.name == 'sha' || event.card.name == 'huogong' || event.card.name == 'wanjian' || event.card.name == 'nanman' || event.card.name == 'juedou') && event.notLink();
                            },
                            init(player) {
                                for (var i of game.players) {
                                    //QQ
                                    i.storage.yydqrzd_zl_mark = 0;
                                }
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('yydqrzd_zl'), function (card, player, target) {
                                    return (trigger.source == target || trigger.player == target) && player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].storage.yydqrzd_zl_mark += 1;
                                    result.targets[0].markSkill('yydqrzd_zl_mark');
                                    var chat = ['谁都无法逃离这里……', '这是你丢失的痛苦.'].randomGet();
                                    player.say(chat);
                                }
                            },
                            subSkill: {
                                mark: {
                                    marktext: '面',
                                    intro: {
                                        content: 'mark',
                                    },
                                },
                            },
                        },
                        yydqrzd_qmgz: {
                            trigger: {
                                player: 'phaseUseBefore',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                var num = 0;
                                for (var i of game.players) {
                                    //QQ
                                    num += i.storage.yydqrzd_zl_mark;
                                }
                                if (num >= 7) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                for (var i of game.players) {
                                    //QQ
                                    if (i.storage.yydqrzd_zl_mark) {
                                        player.line(i, 'fire');
                                        if (i.countCards('h') >= i.storage.yydqrzd_zl_mark) {
                                            player.gainPlayerCard(i.storage.yydqrzd_zl_mark, i, 'h', true);
                                        } else {
                                            player.gain(i.getCards('h'));
                                            i.$give(i.countCards('h'), player);
                                            i.damage(3)._triggered = null;
                                        }
                                    }
                                }
                                ('step 1');
                                for (var i of game.players) {
                                    //QQ
                                    i.unmarkSkill(' yydqrzd_zl_mark');
                                    i.storage.yydqrzd_zl_mark = 0;
                                    var chat = ['破坏一切,成为最后的黑吧!', '大家,与我合为一体吧!'].randomGet();
                                    player.say(chat);
                                }
                            },
                        },
                        jxzm: {
                            audio: 'ext:永远的七日之都/audio:4',
                            trigger: {
                                global: 'damageEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.source && event.player.classList.contains('dead') == false && player.countCards('he');
                            },
                            forced: true,
                            checkx(event, player) {
                                var att1 = get.attitude(player, event.player);
                                var att2 = get.attitude(player, event.source);
                                return att1 > 0 && att2 <= 0;
                            },
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard('he', get.prompt2('jxzm', trigger.player));
                                var check = lib.skill.beige.checkx(trigger, player);
                                next.set('ai', function (card) {
                                    if (_status.event.goon) return 8 - get.value(card);
                                    return 0;
                                });
                                next.set('goon', check);
                                ('step 1');
                                if (result.bool) {
                                    trigger.player.judge();
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                switch (result.card.suit) {
                                    case 'heart':
                                        trigger.player.recover(2);
                                        break;
                                    case 'diamond':
                                        trigger.player.draw(3);
                                        break;
                                    case 'club':
                                        trigger.source.chooseToDiscard('he', 3, true);
                                        break;
                                    case 'spade':
                                        trigger.source.loseHp();
                                        break;
                                        player.say('黑色的怨恨,与红色的笑容.');
                                }
                            },
                            ai: {
                                expose: 0.3,
                            },
                        },
                        教皇: {
                            trigger: {
                                global: 'phaseUseBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.player != player && event.player.countCards('h') >= player.countCards('h');
                            },
                            content() {
                                'step 0';
                                trigger.player.chooseCard('交给' + get.translation(player) + '一张手牌', true).ai = function (card) {
                                    if (get.attitude(trigger.player, player) > 0) {
                                        return get.value(card);
                                    } else {
                                        return -get.value(card);
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.gain(result.cards[0]);
                                    trigger.player.$give(1, player);
                                }
                            },
                        },
                        换手牌: {
                            trigger: {
                                player: 'chooseToRespondBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (event.responded) return false;
                                return game.hasPlayer(function (current) {
                                    return current != player && current.countCards('h') > 0;
                                });
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('xwj_xhuoying_baozi'), function (card, player, target) {
                                    if (target == player) return false;
                                    var nh = target.countCards('h');
                                    if (nh == 0) return false;
                                    return true;
                                }).ai = function (target) {
                                    return 1 - get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    var cards = target.getCards('h');
                                    player.chooseCardButton('选择' + get.translation(target) + '的一张卡手牌打出', cards).filterButton = function (button) {
                                        return trigger.filterCard(button.link);
                                    };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    var chat = ['这个孢子之术,竟没人发现', '我虽为晓的侦察兵,但就隐藏、侦察能力而言,没人能胜我'].randomGet();
                                    player.say(chat);
                                    game.log(player, '使用了', event.target, '的手牌');
                                    event.target.$throw(result.links);
                                    event.target.lose(result.links);
                                    trigger.untrigger();
                                    trigger.animate = false;
                                    trigger.responded = true;
                                    result.buttons[0].link.remove();
                                    trigger.result = { bool: true, card: result.buttons[0].link };
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card) {
                                        if (get.tag(card, 'respondShan')) return 0.4;
                                        if (get.tag(card, 'respondSha')) return 0.4;
                                    },
                                },
                            },
                        },
                        永远的七日之都: {
                            trigger: {
                                player: 'phaseAfter',
                            },
                            nobracket: true,
                            forced: true,
                            init(player) {
                                player.storage.永远的七日之都 = 0;
                            },
                            intro: {
                                content: 'mark',
                            },
                            _priority: null,
                            marktext: '永远的七日之都',
                            content() {
                                player.storage.永远的七日之都++;
                                player.markSkill('永远的七日之都');
                                if (player.storage.永远的七日之都 >= 7) {
                                    if (player == game.me) {
                                        game.forceOver(true);
                                    } else {
                                        game.forceOver(false);
                                    }
                                }
                            },
                        },
                        yydqrzd_dqhl: {
                            trigger: {
                                player: ['changeHp'],
                            },
                            nobracket: true,
                            audio: 'ext:永远的七日之都/audio:2',
                            forced: true,
                            filter(event, player) {
                                return get.sgn(player.hp - 2.5) != get.sgn(player.hp - 2.5 - event.num);
                            },
                            content() { },
                            mod: {
                                globalFrom(from, to, current) {
                                    if (from.hp > 2) return current - 3;
                                },
                                globalTo(from, to, current) {
                                    if (to.hp <= 2) return current + 3;
                                },
                            },
                            ai: {
                                threaten: 0.8,
                            },
                        },
                        'yydqrzd-xsqm': {
                            nobracket: true,
                            trigger: {
                                player: 'phaseDrawBefore',
                            },
                            check(event, player) {
                                if (game.players.length < 3) return 0;
                            },
                            content() {
                                var chat = ['忘却一切,变回最初的白吧.', '爸爸对不起,我是个坏孩子呢……'].randomGet();
                                player.say(chat);
                                ('step 0');
                                trigger.finish();
                                trigger.untrigger();
                                event.current = player.next;
                                ('step 1');
                                event.current.chooseCard('交给' + get.translation(player) + '一张手牌或令其摸一张牌').ai = function (card) {
                                    if (get.attitude(event.current, player) > 0) {
                                        return -1;
                                    } else {
                                        return 3 - get.value(card);
                                    }
                                };
                                ('step 2');
                                if (result.bool == false) {
                                    event.current.line(player, 'green');
                                    game.log(get.translation(event.current) + '让' + get.translation(player) + '摸了一张牌');
                                    player.draw();
                                } else {
                                    player.gain(result.cards[0]);
                                    event.current.$give(1, player);
                                }
                                if (event.current.next != player) {
                                    event.current = event.current.next;
                                    event.goto(1);
                                }
                            },
                        },
                        守护: {
                            subSkill: {
                                守护: {
                                    trigger: {
                                        global: 'dieAfter',
                                    },
                                    check(event, player) {
                                        return get.attitude(player, event.source) <= 0;
                                    },
                                    filter(event, player) {
                                        return event.source && event.source.isAlive() && event.source != player;
                                    },
                                    content() {
                                        player.draw(2);
                                        player.useCard({ name: 'juedou' }, trigger.source);
                                    },
                                },
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        川胜之灵: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 1,
                            filterCard(card) {
                                var suit = card.suit;
                                for (var i = 0; i < ui.selected.cards.length; i++) {
                                    if (ui.selected.cards[i].suit == suit) return false;
                                }
                                return true;
                            },
                            selectCard: [1, Infinity],
                            check(card) {
                                return 5 - get.value(card);
                            },
                            complexCard: true,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            selectTarget() {
                                return [1, ui.selected.cards.length];
                            },
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                event.num = 0;
                                ('step 1');
                                targets[event.num].chooseControl(['受到伤害', '翻面']).set('ai', function () {
                                    if (targets[event.num].isTurnedOver()) return '翻面';
                                    if (((targets[event.num].countCards('h') > 2 && targets[event.num].hp > 1) || targets[event.num].countCards('h', { name: 'tao' }) > 0) && targets[event.num].countCards('j', { name: 'lebu' }) == 0) return '受到伤害';
                                    return '翻面';
                                });
                                ('step 2');
                                targets[event.num].popup(result.control);
                                if (result.control == '受到伤害') targets[event.num].damage();
                                if (result.control == '翻面') targets[event.num].turnOver();
                                if (event.num < targets.length - 1) {
                                    event.num++;
                                    event.goto(1);
                                    var chat = ['嫉妒心会给人带来不幸与悲伤', '面具被弄脏了……'].randomGet();
                                    player.say(chat);
                                }
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target(player, target) {
                                        if (player.countCards('h') > 1) {
                                            if (get.attitude(player, target) >= 0 && target.isTurnedOver()) return 1;
                                            if (get.attitude(player, target) < 0 && !target.isTurnedOver()) return -1;
                                        }
                                    },
                                },
                            },
                        },
                        死亡判定: {
                            trigger: {
                                global: 'dying',
                            },
                            _priority: 6,
                            filter(event, player) {
                                if (event.player.hp > 0) return false;
                                if (get.is.altered('huanhun')) return player.countCards('h', { color: 'red' }) > 0;
                                return player.countCards('he') > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard(get.is.altered('huanhun') ? 'h' : 'he', get.prompt2('huanhun', trigger.player), function (card) {
                                    if (get.is.altered('huanhun')) {
                                        return get.color(card) == 'red';
                                    } else {
                                        return true;
                                    }
                                });
                                next.ai = function (card) {
                                    if (card.name == 'tao') return 0;
                                    if (get.attitude(player, trigger.player) > 0) {
                                        return 8 - get.value(card);
                                    }
                                    return 0;
                                };
                                ('step 1');
                                if (result.bool) {
                                    event.card = result.cards[0];
                                    trigger.player.judge(function (card) {
                                        return get.color(card) == 'red' ? 1 : 0;
                                    });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    trigger.player.recover();
                                } else if (event.card.isInPile()) {
                                    trigger.player.gain(event.card, 'gain2');
                                }
                            },
                            ai: {
                                threaten: 1.6,
                                expose: 0.2,
                            },
                        },
                        wendao: {
                            trigger: {
                                player: 'chooseToRespondBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.responded) return false;
                                return _status.currentPhase !== player;
                            },
                            content() {
                                'step 0';
                                var cards = [];
                                if (ui.cardPile.childNodes.length < 7) {
                                    var discardcards = get.cards(7);
                                    for (var i = 0; i < discardcards.length; i++) {
                                        discardcards[i].discard();
                                    }
                                }
                                for (var i = 0; i < 7; i++) {
                                    cards.push(ui.cardPile.childNodes[i]);
                                }
                                player.chooseCardButton('问道:选择一张卡牌打出', cards).set('filterButton', function (button) {
                                    return get.type(button.link) == 'basic' && _status.event.getTrigger().filterCard(button.link);
                                });
                                ('step 1');
                                if (result.bool) {
                                    game.log(player, '问道发动成功');
                                    trigger.untrigger();
                                    trigger.responded = true;
                                    result.links[0].remove();
                                    trigger.result = { bool: true, card: result.links[0] };
                                    player.say('天命不可违,但是……');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, effect) {
                                        if (get.tag(card, 'respondShan')) return 0.7;
                                        if (get.tag(card, 'respondSha')) return 0.7;
                                        if (get.tag(card, 'recover')) return 0.7;
                                    },
                                },
                            },
                        },
                        yydqrzdstfm: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 1,
                            filterTarget(card, player, target) {
                                return target != player && !target.hasSkill('fuxie1');
                            },
                            filterCard: {
                                color: 'red',
                            },
                            filter(event, player) {
                                return player.countCards('h', { color: 'red' });
                            },
                            check(card) {
                                return 5 - get.value(card);
                            },
                            content() {
                                target.addSkill('fuxie1');
                                target.storage.fuxie1 = player;
                                target.damage();
                                target.turnOver();
                            },
                            ai: {
                                order: 10,
                                threaten: 1.2,
                                expose: 0.2,
                                result: {
                                    target(player, target) {
                                        if (target.hp == 2) return -1;
                                        if (target.hp == 3) return -0.5;
                                        return 0;
                                    },
                                },
                            },
                        },
                        fuxie2: {
                            mod: {
                                cardSavable(card, player) {
                                    if (_status.event.dying && _status.event.dying.hasSkill('fuxie1')) return false;
                                },
                            },
                        },
                        fuxie1: {
                            mark: true,
                            intro: {
                                content: '无法使用,打出,弃置基本牌.',
                            },
                            trigger: {
                                global: ['dieBegin', 'phaseBegin'],
                            },
                            nobracket: true,
                            forced: true,
                            popup: false,
                            filter(event, player) {
                                return event.player == player.storage.fuxie1;
                            },
                            content() {
                                player.removeSkill('fuxie1');
                            },
                            mod: {
                                cardDiscardable(card, player) {
                                    if (get.type(card, 'basic')) return false;
                                },
                                cardEnabled(card, player) {
                                    if (get.type(card, 'basic')) return false;
                                },
                                cardUsable(card, player) {
                                    if (get.type(card, 'basic')) return false;
                                },
                                cardRespondable(card, player) {
                                    if (get.type(card, 'basic')) return false;
                                },
                                cardSavable(card, player) {
                                    if (get.type(card, 'basic')) return false;
                                },
                            },
                            global: 'fuxie2',
                        },
                        sqnzl: {
                            trigger: {
                                player: 'shaBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return event.target.countCards('he');
                            },
                            check(event, player) {
                                return get.attitude(player, event.target) < 0;
                            },
                            content() {
                                'step 0';
                                event.cards = get.cards(3);
                                player.showCards(event.cards);
                                ('step 1');
                                event.numx = 0;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        //QQ
                                        if (get.type(i) != 'basic') event.numx++;
                                        ui.discardPile.appendChild(i);
                                    }
                                player.$throw(event.cards);
                                if (event.numx) {
                                    player.discardPlayerCard('请选择想要弃置的牌', trigger.target, [1, event.numx], 'he');
                                }
                            },
                        },
                        wwhs: {
                            trigger: {
                                player: 'phaseDiscardAfter',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                return player.countCards('h') <= 3;
                            },
                            content() {
                                event.num = event.num = Math.ceil(player.maxHp - player.hp + 1);
                                player.draw(event.num);
                                player.changeHujia(event.num);
                                player.recover();
                            },
                        },
                        tianming3: {
                            trigger: {
                                global: 'judge',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseCard(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',' + get.prompt('tianming3'), 'he')
                                    .set('ai', function (card) {
                                        var trigger = _status.event.getTrigger();
                                        var player = _status.event.player;
                                        var judging = _status.event.judging;
                                        var result = trigger.judge(card) - trigger.judge(judging);
                                        var attitude = get.attitude(player, trigger.player);
                                        if (attitude == 0 || result == 0) return 0;
                                        if (attitude > 0) {
                                            return result - get.value(card) / 2;
                                        } else {
                                            return -result - get.value(card) / 2;
                                        }
                                    })
                                    .set('judging', trigger.player.judging[0]);
                                ('step 1');
                                if (result.bool) {
                                    player.respond(result.cards, 'highlight');
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    if (trigger.player.judging[0].clone) {
                                        trigger.player.judging[0].clone.classList.remove('thrownhighlight');
                                        game.broadcast(function (card) {
                                            if (card.clone) {
                                                card.clone.classList.remove('thrownhighlight');
                                            }
                                        }, trigger.player.judging[0]);
                                        game.addVideo('deletenode', player, get.cardsInfo([trigger.player.judging[0].clone]));
                                    }
                                    trigger.player.judging[0].discard();
                                    trigger.player.judging[0] = result.cards[0];
                                    if (!get.owner(result.cards[0], 'judge')) {
                                        trigger.position.appendChild(result.cards[0]);
                                    }
                                    game.log(trigger.player, '的判定牌改为', result.cards[0]);
                                }
                                ('step 3');
                                if (_status.currentPhase == player || trigger.player == player) {
                                    player.draw(2);
                                    player.damage(1, 'thunder');
                                }
                            },
                            ai: {
                                tag: {
                                    rejudge: 1,
                                },
                            },
                        },
                        '神木【三珠树】': {
                            trigger: {
                                player: ['loseEnd', 'useCard'],
                            },
                            forced: true,
                            audio: 'ext:真三国无双/audio:2',
                            filter(event, player) {
                                return player.countCards('h') < 3;
                            },
                            content() {
                                player.draw(3 - player.countCards('h'));
                            },
                        },
                        qrzd_zpw: {
                            nobracket: true,
                            group: ['qrzd_zpw_more', 'qrzd_zpw_less'],
                            subSkill: {
                                more: {
                                    audio: ['qrzd_zpw', 2],
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (!player.countCards('h', { color: 'red' })) return false;
                                        return event.player.hp >= player.hp && player != event.player;
                                    },
                                    content() {
                                        'step 0';
                                        var goon = get.attitude(player, trigger.player) < 0;
                                        var next = player.chooseToDiscard(get.prompt('纸牌屋:是否弃置一张红色手牌令伤害＋1？', trigger.player), { color: 'red' });
                                        next.set('ai', function (card) {
                                            if (_status.event.goon) {
                                                return 8 - get.value(card);
                                            }
                                            return 0;
                                        });
                                        next.set('goon', goon);
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.num++;
                                        }
                                    },
                                },
                                less: {
                                    audio: ['qrzd_zpw', 2],
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        if (!player.countCards('h', { color: 'black' })) return false;
                                        return event.source && event.source.hp >= player.hp && player != event.source;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        var next = player.chooseToDiscard('纸牌屋:是否弃置一张黑色手牌令伤害-1？', { color: 'black' });
                                        next.set('ai', function (card) {
                                            var player = _status.event.player;
                                            if (player.hp == 1 || _status.event.getTrigger().num > 1) {
                                                return 9 - get.value(card);
                                            }
                                            if (player.hp == 2) {
                                                return 8 - get.value(card);
                                            }
                                            return 7 - get.value(card);
                                        });
                                        ('step 1');
                                        player.say('你的筹码好像不怎么够喽');
                                        if (result.bool) {
                                            trigger.num--;
                                        }
                                    },
                                },
                            },
                            ai: {
                                expose: 0.2,
                                threaten: 1.5,
                            },
                        },
                        qrzd_stfx: {
                            mark: true,
                            forced: true,
                            _priority: 5,
                            marktext: '伏',
                            round: 3,
                            nobracket: true,
                            trigger: {
                                player: 'phaseUseBefore',
                            },
                            filter(event, player) {
                                return player.isAlive();
                            },
                            intro: {
                                content: 'limited',
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseControl('司天伏邪', 'cancel2')
                                    .set('ai', function () {
                                        if (player.countCards('h', 'tao') > 0 || player.countCards('h', 'jiu') > 0) return '司天伏邪';
                                        if (player.hp <= 1) return '司天伏邪';
                                        return 'cancel2';
                                    })
                                    .set('prompt', '封印:请选择是否发动司天伏邪');
                                ('step 1');
                                if (result.control == '司天伏邪') {
                                    event.goto(2);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                player
                                    .chooseTarget('请选择封印一名目标技能', get.prompt('qrzd_stfx'), function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.damageEffect(target, player, player);
                                    });
                                ('step 3');
                                if (result.bool) {
                                    player.storage.qrzd_stfx = true;
                                    player.unmarkSkill('qrzd_stfx');
                                    player.$skill('司天伏邪', 'fire', 'red', 'avatar');
                                    player.say('天命不可违,但是……');
                                    for (var i = 0; i < result.targets.length; i++) {
                                        result.targets[i].clearSkills();
                                        if (result.targets[i].maxHp < 0) result.targets[i].maxHp = 1;
                                        result.targets[i].update();
                                        player.awakenSkill('qrzd_stfx');
                                    }
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2.1,
                                order: 10,
                                result: {
                                    target: -3,
                                },
                            },
                            group: ['qrzd_stfx_roundcount'],
                        },
                        qrzd_hf: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBefore',
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('qrzd_hf'), [0, player.countCards('h', { color: 'red' })], function (card, player, target) {
                                        return target.hp > 0;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target);
                                    });
                                ('step 1');
                                if (result.bool) {
                                    player.showHandcards();
                                    player.recover();
                                    event.targets = result.targets;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (targets && targets.length) {
                                    player.line(targets, 'thunder');
                                    for (var i = 0; i < targets.length; i++) {
                                        targets[i].changeHujia();
                                        targets[i].recover();
                                        targets[i].draw(2);
                                    }
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        qrzd_tlp: {
                            trigger: {
                                source: 'damageBefore',
                            },
                            nobracket: true,
                            forced: true,
                            audio: 'ext:永远的七日之都/audio:2',
                            _priority: 16,
                            check() {
                                return false;
                            },
                            content() {
                                trigger.cancel();
                                var ex = 0;
                                if (trigger.card && trigger.card.name == 'sha') {
                                    if (player.hasSkill('jiu')) ex++;
                                    if (player.hasSkill('luoyi2')) ex++;
                                    if (player.hasSkill('reluoyi2')) ex++;
                                }
                                trigger.player.loseHp(trigger.num + ex);
                            },
                            ai: {
                                jueqing: true,
                            },
                        },
                        qrzd_cjzy: {
                            nobracket: true,
                            srlose: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            filterCard: true,
                            check(card) {
                                return 8 - get.value(card);
                            },
                            discard: false,
                            content() {
                                'step 0';
                                var cardx = ui.create.card();
                                cardx.classList.add('infohidden');
                                cardx.classList.add('infoflip');
                                player.$throw(cardx);
                                cards[0].fix();
                                ui.cardPile.insertBefore(cards[0], ui.cardPile.firstChild);
                                target.chooseControl('heart2', 'diamond2', 'club2', 'spade2').set('ai', function (event) {
                                    switch (Math.floor(Math.random() * 6)) {
                                        case 0:
                                            return 'heart2';
                                        case 1:
                                        case 4:
                                        case 5:
                                            return 'diamond2';
                                        case 2:
                                            return 'club2';
                                        case 3:
                                            return 'spade2';
                                    }
                                });
                                ('step 1');
                                game.log(target, '选择了' + get.translation(result.control));
                                event.choice = result.control;
                                target.popup(event.choice);
                                event.cards = get.cards();
                                target.showCards(event.cards);
                                target.gain(event.cards, 'draw');
                                ('step 2');
                                player.say('这么简单的事,用你被河马踩过的单细胞大脑想想也能明白吧？');
                                if (event.cards.suit + '2' != event.choice) target.damage(2)._triggered = null;
                            },
                            ai: {
                                order: 8,
                                result: {
                                    target(player, target) {
                                        var eff = get.damageEffect(target, player);
                                        if (eff >= 0) return 1 + eff;
                                        var value = 0,
                                            i;
                                        var cards = player.getCards('h');
                                        for (var i = 0; i < cards.length; i++) {
                                            value += get.value(cards[i]);
                                        }
                                        value /= player.countCards('h');
                                        if (target.hp == 1) return Math.min(0, value - 7);
                                        return Math.min(0, value - 5);
                                    },
                                },
                            },
                        },
                        qrzd_mj: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                global: 'useCard',
                            },
                            nobracket: true,
                            _priority: 5,
                            filter(event, player) {
                                if (get.type(event.card) != 'trick') return false;
                                if (get.info(event.card).multitarget) return false;
                                if (event.targets.length < 2) return false;
                                return true;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('qrzd_mj'), [1, trigger.targets.length], function (card, player, target) {
                                        return _status.event.getTrigger().targets.includes(target);
                                    })
                                    .set('ai', function (target) {
                                        var trigger = _status.event.getTrigger();
                                        if (game.phaseNumber > game.players.length * 2 && trigger.targets.length >= game.players.length - 1) {
                                            return -get.effect(target, trigger.card, trigger.player, _status.event.player);
                                        }
                                        return -1;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    for (var i = 0; i < result.targets.length; i++) {
                                        trigger.targets.remove(result.targets[i]);
                                    }
                                }
                            },
                            ai: {
                                order: 8,
                            },
                        },
                        qrzd_qnbf: {
                            trigger: {
                                player: 'phaseDrawBefore',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return player.hp < player.maxHp;
                            },
                            check(event, player) {
                                if (player.maxHp - player.hp < 2) {
                                    return false;
                                } else if (player.maxHp - player.hp == 2) {
                                    return player.countCards('h') >= 2;
                                }
                                return true;
                            },
                            content() {
                                'step 0';
                                trigger.untrigger();
                                trigger.finish();
                                event.cards = get.cards(player.maxHp - player.hp);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (get.color(i) == 'red') {
                                        num++;
                                        ui.discardPile.appendChild(i);
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    player.recover(num);
                                }
                                ('step 2');
                                if (event.cards.length) {
                                    player.gain(event.cards);
                                    player.$gain2(event.cards);
                                }
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == 1) return 2;
                                    if (target.hp == 2) return 1.5;
                                    return 1;
                                },
                            },
                        },
                        qrzd_zrsh: {
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                'step 0';
                                event.count = 1;
                                ('step 1');
                                player.gainMaxHp();
                                player.draw(2);
                                player.changeHujia(2);
                                event.given = 0;
                                ('step 2');
                                player.chooseCardTarget({
                                    filterCard: true,
                                    selectCard: [1, 2 - event.given],
                                    filterTarget(card, player, target) {
                                        return player != target && target != event.temp;
                                    },
                                    ai1(card) {
                                        if (ui.selected.cards.length) return -1;
                                        if (card.name == 'du') return 20;
                                        return _status.event.player.countCards('h') - _status.event.player.hp;
                                    },
                                    ai2(target) {
                                        var att = get.attitude(_status.event.player, target);
                                        if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') {
                                            if (target.hasSkillTag('nodu')) return 0;
                                            return 1 - att;
                                        }
                                        return att - 4;
                                    },
                                    prompt: '请选择要送人的卡牌',
                                });
                                ('step 3');
                                if (result.bool) {
                                    player.line(result.targets, 'green');
                                    result.targets[0].gain(result.cards, player, 'giveAuto');
                                    event.given += result.cards.length;
                                    if (event.given < 2) {
                                        event.temp = result.targets[0];
                                        event.goto(2);
                                    } else if (event.count < trigger.num) {
                                        delete event.temp;
                                        event.count++;
                                        event.goto(1);
                                    }
                                } else if (event.count < trigger.num) {
                                    delete event.temp;
                                    event.num = 1;
                                    event.count++;
                                    event.goto(1);
                                }
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                result: {
                                    effect(card, player, target) {
                                        if (get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
                                            if (!target.hasFriend()) return;
                                            var num = 1;
                                            if (get.attitude(player, target) > 0) {
                                                if (player.needsToDiscard()) {
                                                    num = 0.7;
                                                } else {
                                                    num = 0.5;
                                                }
                                            }
                                            if (player.hp >= 4) return [1, num * 2];
                                            if (target.hp == 3) return [1, num * 1.5];
                                            if (target.hp == 2) return [1, num * 0.5];
                                        }
                                    },
                                },
                                threaten: 0.6,
                            },
                        },
                        qrzd_dpmj: {
                            enable: 'phaseUse',
                            usable: 1,
                            nobracket: true,
                            filter(event, player) {
                                return player.hujia ? true : false;
                            },
                            filterTarget(card, player, target) {
                                return player != target && get.distance(player, target, 'attack') <= 1;
                            },
                            selectTarget() {
                                return [1, _status.event.player.hujia];
                            },
                            contentBefore() {
                                player.changeHujia(-targets.length);
                            },
                            content() {
                                target.damage()._triggered = null;
                                target.chooseToDiscard(2, true);
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        var eff = get.damageEffect(target, player, target) + 0.5;
                                        if (eff > 0 && eff <= 0.5) return 0;
                                        return eff;
                                    },
                                },
                            },
                        },
                        qrzd_yzzzz: {
                            trigger: {
                                player: ['useCard', 'respondEnd'],
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (event.card.suit == 'heart') {
                                    return game.hasPlayer(function (current) {
                                        return current.isDamaged();
                                    });
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                var noneed = trigger.card.name == 'tao' && trigger.targets[0] == player && player.hp == player.maxHp - 1;
                                player
                                    .chooseTarget(get.prompt('qrzd_yzzzz'), function (card, player, target) {
                                        return target.hp < target.maxHp;
                                    })
                                    .set('autodelay', true).ai = function (target) {
                                        var num = get.attitude(player, target);
                                        if (num > 0) {
                                            if (noneed && player == target) {
                                                num = 0.5;
                                            } else if (target.hp == 1) {
                                                num += 3;
                                            } else if (target.hp == 2) {
                                                num += 1;
                                            }
                                        }
                                        return num;
                                    };
                                ('step 1');
                                if (result.bool) {
                                    result.targets[0].recover(2);
                                    player.say('好孩子不能挑食.');
                                }
                            },
                            ai: {
                                expose: 0.3,
                                threaten: 1.5,
                            },
                        },
                        qrzd_hzyh: {
                            nobracket: true,
                            trigger: {
                                player: 'shaBegin',
                            },
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            logTarget: 'target',
                            filter(event, player) {
                                var length = event.target.countCards('h');
                                return length >= player.hp || length <= player.getAttackRange();
                            },
                            content() {
                                trigger.directHit = true;
                            },
                            mod: {
                                attackFrom(from, to, distance) {
                                    if (get.zhu(from, 'shouyue')) return distance - 1;
                                },
                            },
                        },
                        qrzd_ssg: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw(3);
                                player.gainMaxHp(2);
                                player.recover(4);
                                player.say('那你告诉我,像我这样的异类应以什么样的姿态,才能在这世界上苟活.');
                            },
                            ai: {
                                threaten: 1.4,
                            },
                        },
                        qrzd_js: {
                            srlose: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h') > 0;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    player.useCard({ name: 'sha' }, target, false);
                                    player.recover(2);
                                    player.say('如果你那么想当个人类,就试着让自己饿到极限啊.话说在前头,喰种的饥饿可是真正的地狱.');
                                } else {
                                    player.draw(2);
                                }
                            },
                            ai: {
                                order(name, player) {
                                    var cards = player.getCards('h');
                                    if (player.countCards('h', 'sha') == 0) {
                                        return 1;
                                    }
                                    for (var i = 0; i < cards.length; i++) {
                                        if (cards[i].name != 'sha' && cards[i].number > 11 && get.value(cards[i]) < 7) {
                                            return 9;
                                        }
                                    }
                                    return lib.card.sha.ai.order - 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('h', 'sha') > 0) return 0.6;
                                        var num = player.countCards('h');
                                        if (num > player.hp) return 0;
                                        if (num == 1) return -2;
                                        if (num == 2) return -1;
                                        return -0.7;
                                    },
                                    target(player, target) {
                                        var num = target.countCards('h');
                                        if (num == 1) return -1;
                                        if (num == 2) return -0.7;
                                        return -0.5;
                                    },
                                },
                                threaten: 1.3,
                            },
                        },
                        qrzd_ym: {
                            enable: 'phaseUse',
                            usable: 3,
                            content() {
                                player.loseHp();
                                var players = [];
                                for (var i of game.players) {
                                    //QQ
                                    if (i != player) players.push(i);
                                }
                                player.useCard({ name: 'nanman' }, players);
                                var chat = ['我们也想活下去,这有什么错.', '说一切都糟糕透了,别开玩笑了!'].randomGet();
                                player.say(chat);
                            },
                            ai: {
                                order: 10,
                                result: {
                                    player(player) {
                                        if (
                                            player.hp > 2 &&
                                            game.countPlayer(function (current) {
                                                return get.attitude(player, current) >= 0 && current != player && current.countCards('h', { name: 'sha' }) == 0;
                                            }) == 0 &&
                                            game.countPlayer(function (current) {
                                                return get.attitude(player, current) < 0 && current.countCards('h', { name: 'sha' }) == 0;
                                            }) > 0
                                        )
                                            return 1;
                                    },
                                },
                            },
                        },
                        qrzd_hm: {
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            nobracket: true,
                            round: 5,
                            mark: true,
                            filter(event, player) {
                                if (player.storage.qrzd_hm) return false;
                                if (player.countCards('h') < 2) return false;
                                return true;
                            },
                            check(event, player) {
                                return (
                                    game.countPlayer(function (current) {
                                        return get.attitude(player, current) < 0 && current.hp > 2;
                                    }) > 0
                                );
                            },
                            content() {
                                'step 0';
                                player.chooseTarget('选择【箭术·命悬一线】的目标', function (card, player, target) {
                                    return target != player;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.bool) {
                                    event.target = result.targets[0];
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.target) {
                                    player.line(event.target);
                                    event.target.damage(target.hp, 'fire');
                                    target.turnOver();
                                    player.chooseToDiscard(2, true, 'h');
                                    trigger.untrigger();
                                    trigger.finish();
                                    var chat = ['你,够强么？', '呐,够了!'].randomGet();
                                    player.say(chat);
                                }
                            },
                            intro: {
                                content: 'limited',
                            },
                            group: ['qrzd_hm_roundcount'],
                        },
                        qrzd_xcyl: {
                            trigger: {
                                global: 'damageAfter',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return get.distance(player, event.player, 'attack') <= 1 && player.countCards('h') > 0 && player != event.player && event.player.isAlive() && event.qrzd_xcyl != true;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseCard(get.prompt('qrzd_xcyl'), 1, 'h').set('ai', function (card) {
                                    if (get.attitude(player, trigger.player) < 0) return 5 - get.value(card);
                                    return false;
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.discard(result.cards);
                                    player.line(trigger.player);
                                    trigger.player.judge(function (card) {
                                        if (get.color(card) == 'black') return -1;
                                        return 1;
                                    });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (get.color(result.card) == 'black') trigger.player.damage(1, 'thunder').qrzd_xcyl = true;
                                player.recover();
                                player.draw(2);
                            },
                        },
                        qrzd_ehsnxz: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                if (player.getStat().damage > trigger.num) {
                                    player.recover();
                                } else {
                                    player.draw(1);
                                    player.changeHujia(2);
                                }
                            },
                            ai: {
                                damageBonus: true,
                            },
                        },
                        qrzd_wjxk: {
                            nobracket: true,
                            enable: 'phaseUse',
                            selectTarget: [1, 3],
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            filterCard: true,
                            usable: 1,
                            content() {
                                'step 0';
                                var color = get.color(cards[0]);
                                target.judge(function (card) {
                                    return get.color(card) == color ? 1 : 0;
                                });
                                ('step 1');
                                if (!result.bool) {
                                    var mubiao = target;
                                    player.line(mubiao);
                                    target.chooseToDiscard(2, true);
                                    target.damage('thunder');
                                    target.turnOver();
                                    player.say('看来和聪明人说话并不能让你脱离白痴的范畴.');
                                }
                            },
                            ai: {
                                order: 8,
                                threaten: 2,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        qrzd_yyqd: {
                            nobracket: true,
                            trigger: {
                                global: 'judge',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',是否发动【预言确定】？', function (card, player, target) {
                                    if (target == player) return target.countCards('hej');
                                    return target.countCards('ej');
                                }).ai = function (target) {
                                    return player == target;
                                };
                                ('step 1');
                                if (result.bool) {
                                    event.target = result.targets[0];
                                    if (result.targets[0] == player) {
                                        player
                                            .chooseCard('请选择改判牌', 'hej')
                                            .set('ai', function (card) {
                                                var trigger = _status.event.getTrigger();
                                                var player = _status.event.player;
                                                var judging = _status.event.judging;
                                                var result = trigger.judge(card) - trigger.judge(judging);
                                                var attitude = get.attitude(player, trigger.player);
                                                if (attitude == 0 || result == 0) return 0;
                                                if (attitude > 0) {
                                                    return result - get.value(card) / 2;
                                                } else {
                                                    return -result - get.value(card) / 2;
                                                }
                                            })
                                            .set('judging', trigger.player.judging[0]);
                                    } else {
                                        player
                                            .choosePlayerCard('请选择改判牌', result.targets[0], 'ej')
                                            .set('ai', function (button) {
                                                var trigger = _status.event.getTrigger();
                                                var player = _status.event.player;
                                                var judging = _status.event.judging;
                                                var result = trigger.judge(button) - trigger.judge(judging);
                                                var attitude = get.attitude(player, trigger.player);
                                                if (attitude == 0 || result == 0) return 0;
                                                if (attitude > 0) {
                                                    return result - get.value(button) / 2;
                                                } else {
                                                    return -result - get.value(button) / 2;
                                                }
                                            })
                                            .set('judging', trigger.player.judging[0]);
                                    }
                                }
                                ('step 2');
                                if (result.bool) {
                                    event.cardx = result.cards[0] || result.links[0];
                                    event.target.lose(event.cardx);
                                    player.respond(event.cardx, 'highlight');
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool) {
                                    if (trigger.player.judging[0].clone) {
                                        trigger.player.judging[0].clone.classList.remove('thrownhighlight');
                                        game.broadcast(function (card) {
                                            if (card.clone) {
                                                card.clone.classList.remove('thrownhighlight');
                                            }
                                        }, trigger.player.judging[0]);
                                        game.addVideo('deletenode', player, get.cardsInfo([trigger.player.judging[0].clone]));
                                    }
                                    ui.discardPile.appendChild(trigger.player.judging[0]);
                                    trigger.player.judging[0] = event.cardx;
                                    if (!get.owner(event.cardx, 'judge')) {
                                        trigger.position.appendChild(event.cardx);
                                    }
                                    game.log(trigger.player, '的判定牌改为', event.cardx);
                                }
                            },
                            ai: {
                                tag: {
                                    rejudge: 1,
                                },
                            },
                        },
                        火: {
                            trigger: {
                                player: ['useCard', 'respondAfter'],
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return game.countPlayer() > 2 && event.card && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                player.chooseCardTarget({
                                    prompt: get.prompt('qrzd_hzyh'),
                                    filterCard: lib.filter.cardDiscardable,
                                    position: 'he',
                                    filterTarget(card, player, target) {
                                        if (player == target) return false;
                                        if (trigger.name == 'respond') {
                                            return trigger.source != target;
                                        } else {
                                            return !trigger.targets.includes(target);
                                        }
                                    },
                                    ai1(card) {
                                        return 8 - get.value(card);
                                    },
                                    ai2(target) {
                                        return get.damageEffect(target, player, player, 'fire');
                                    },
                                });
                                ('step 1');
                                if (result.bool && !event.isMine()) {
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.discard(result.cards);
                                    result.targets[0].damage('fire');
                                    player.say('我还在等待,花落花开.');
                                }
                            },
                            ai: {
                                expose: 0.3,
                                threaten: 1.6,
                            },
                        },
                        qrzd_cgajjw: {
                            mod: {
                                targetInRange(card, player, target) {
                                    if (card.name == 'sha' && card.number) {
                                        if (get.distance(player, target) <= card.number) return true;
                                    }
                                },
                            },
                            forced: true,
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'shaBegin',
                            },
                            logTarget: 'target',
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                if (event.target.countCards('h') <= player.countCards('h')) return true;
                                if (event.target.hp <= player.hp) return true;
                                return false;
                                player.say('做好觉悟吧.');
                            },
                            content() {
                                if (trigger.target.countCards('h') <= player.countCards('h')) trigger.directHit = true;
                                if (trigger.target.hp >= player.hp) {
                                    if (typeof trigger.extraDamage != 'number') {
                                        trigger.extraDamage = 0;
                                    }
                                    trigger.extraDamage++;
                                }
                            },
                            ai: {
                                threaten: 0.5,
                            },
                        },
                        qrzd_yhdjy: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: [1, 3],
                            filter(event, player) {
                                return true;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                player.useCard({ name: 'sha', nature: 'fire' }, target, false);
                                player.useCard({ name: 'sha', nature: 'fire' }, target, false);
                                player.useCard({ name: 'sha', nature: 'fire' }, target, false);
                                var chat = ['贯穿万物吧!', '为了保护重要的人,我要成为强者.'].randomGet();
                                player.say(chat);
                                ('step 1');
                                player.draw(2);
                                player.turnOver();
                            },
                            ai: {
                                threaten: 2.1,
                                order: 6,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        qrzd_hsb1: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBefore',
                            },
                            mark: true,
                            intro: {
                                content: '已被感染黑死病,回合开始流失一点体力丢弃一张牌,有百分之五十的概率失去一点体力上限',
                            },
                            forced: true,
                            content() {
                                var damage = [0, 1];
                                player.loseHp();
                                player.loseMaxHp(damage.randomGet());
                                player.chooseToDiscard(1, true);
                            },
                        },
                        动能折跃: {
                            nobracket: true,
                            enable: 'phaseUse',
                            selectTarget: 1,
                            usable: 1,
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                event.num = 3;
                                player.discardPlayerCard('h', target, true);
                                ('step 1');
                                var card = result.cards[0];
                                if (get.color(card) == 'black' && target.countCards('h') > 0) {
                                    player.useCard({ name: 'juedou' }, target, false);
                                    event.goto(2);
                                } else {
                                    player.useCard({ name: 'juedou' }, target, false);
                                    event.finish();
                                }
                                ('step 2');
                                if (target.countCards('h') > 0 && target.isAlive()) {
                                    player.discardPlayerCard('h', target, true);
                                }
                                ('step 3');
                                var card = result.cards[0];
                                if (get.color(card) == 'black') {
                                    player.useCard({ name: 'juedou' }, target, false);
                                    event.num--;
                                    if (target.countCards('h') > 0 && event.num > 0 && target.isAlive()) {
                                        event.goto(2);
                                    } else {
                                        event.finish();
                                    }
                                } else {
                                    player.useCard({ name: 'juedou' }, target, false);
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2,
                                order: 8,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        魅惑: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                return event.source && event.source.sex == 'male' && Math.random() <= 1.0;
                            },
                            forced: true,
                            content() {
                                trigger.num--;
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        qrzd_mrcx: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return true;
                            },
                            check(card) {
                                return 6 - get.value(card);
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            position: 'he',
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            selectTarget: [1, 3],
                            content() {
                                'step 0';
                                var damage = [2];
                                target.damage(damage.randomGet());
                                target.recover(1);
                                player.say('无法正常交流的病人么？罢了,只要配合治疗就好.');
                            },
                            ai: {
                                threaten: 2.1,
                                order: 6,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        daidinh: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 2,
                            filterTarget(card, player, target) {
                                return target.hp < target.maxHp;
                            },
                            content() {
                                'step 0';
                                target.loseMaxHp();
                                ('step 1');
                                if (target.hp < target.maxHp) {
                                    target.recover(2);
                                    player.say('虽然这个病症不在我治疗范围之内,不过我想我们应该会想当合得来.');
                                }
                            },
                            ai: {
                                threaten: 1.4,
                                expose: 0.2,
                                order: 9,
                                result: {
                                    target(player, target) {
                                        if (target.hp == target.maxHp) return 0;
                                        if (target.hp == target.maxHp - 1) return -1;
                                        if (target.hp == 1) return 1;
                                        if (target.hp < target.maxHp - 2) return 0.5;
                                        return 0;
                                    },
                                },
                            },
                        },
                        '手杖【日蚀之杖】': {
                            nobracket: true,
                            trigger: {
                                global: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player != player && event.player.getStat('damage') > 0;
                            },
                            content() {
                                'step 0';
                                if (player.hp < player.maxHp) {
                                    player.recover();
                                } else {
                                    player.changeHujia();
                                    player.say('死伤意味着研究资料与经验的增加.');
                                }
                                player.draw(2);
                                player.phaseUse();
                                game.log(player, '<span style="color: green">执行额外一个出牌阶段</span>');
                                ('step 1');
                                player.getStat().card = {};
                                player.getStat().skill = {};
                            },
                        },
                        qrzd_xsdg1: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                target: 'useCardToBegin',
                            },
                            nobracket: true,
                            filter(event, player) {
                                if (game.players.length < 3) return false;
                                if (event.card.name == 'juedou' || event.card.name == 'sha' || event.card.name == 'shunshou' || event.card.name == 'guohe') return event.player != player;
                                return false;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.player = player;
                                trigger.player.chooseTarget('腥膻祷告:请选择1名额外目标否则' + get.translation(trigger.card) + '无效', function (card, player, target) {
                                    return player != target && event.player != target;
                                }).ai = function (target) {
                                    if (trigger.card.name == 'sha') {
                                        if (target.num('e', '2') && target.getCards('e') != 'baiyin') return 0;
                                        if (target.hp <= 1) return Math.random < 0.3;
                                        return 0.5;
                                    }
                                    if (trigger.card.name == 'juedou') {
                                        if (target.hp <= 1) return Math.random < 0.3;
                                        return 0.5;
                                    }
                                    if (trigger.card.name == 'guohe' || trigger.card.name == 'shunshou') {
                                        if (target.countCards('h') == 0) return Math.random < 0.3;
                                        return 1;
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    for (var i = 0; i < result.targets.length; i++) {
                                        trigger.targets.push(result.targets[i]);
                                        game.log(result.targets[i], '成为了额外目标');
                                        trigger.player.line(trigger.targets);
                                    }
                                } else {
                                    trigger.untrigger();
                                    trigger.finish();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (game.players.length < 3) return;
                                        if (card.name == 'juedou' || card.name == 'guohe' || card.name == 'shunshou' || card.name == 'sha') return 0.5;
                                    },
                                },
                            },
                        },
                        qrzd_szrszz1: {
                            nobracket: true,
                            trigger: {
                                source: 'damage',
                            },
                            content() {
                                trigger.player.addSkill('qrzd_hsb1');
                            },
                        },
                        qrzd_szwsem: {
                            trigger: {
                                source: 'damage',
                            },
                            nobracket: true,
                            filter(event, player) {
                                return event.player.hp <= 0;
                            },
                            forced: true,
                            content() {
                                trigger.player.die(trigger);
                                player.say('感情是自然喷涌而出的,就像胸口绽放的血花那样.');
                            },
                        },
                        qrzd_复制: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseUseBefore',
                            },
                            round: 3,
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('qrzd_复制'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return Math.random();
                                };
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    for (var i = 0; i < target.skills.length; i++) {
                                        player.addSkill(target.skills[i]);
                                    }
                                }
                            },
                            group: ['qrzd_复制_roundcount'],
                        },
                        减疗: {},
                        灼烧: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBegin',
                            },
                            mark: true,
                            intro: {
                                content: '处于灼烧状态',
                            },
                            forced: true,
                            content() {
                                player.damage('fire', 'nosource');
                            },
                        },
                        龙魂: {
                            group: ['龙魂1', '龙魂2', '龙魂3', '龙魂4', '龙魂_num', '龙魂_discard'],
                            ai: {
                                skillTagFilter(player, tag) {
                                    switch (tag) {
                                        case 'respondSha': {
                                            if (player.countCards('he', { suit: 'diamond' }) == 0) return false;
                                            break;
                                        }
                                        case 'respondShan': {
                                            if (player.countCards('he', { suit: 'club' }) == 0) return false;
                                            break;
                                        }
                                        case 'save': {
                                            if (player.countCards('he', { suit: 'heart' }) == 0) return false;
                                            break;
                                        }
                                    }
                                },
                                save: true,
                                respondSha: true,
                                respondShan: true,
                                threaten: 1.8,
                            },
                            subSkill: {
                                num: {
                                    trigger: {
                                        source: ['damageBegin', 'recoverBegin'],
                                    },
                                    forced: true,
                                    popup: false,
                                    filter(event, player) {
                                        var evt = event.parent;
                                        return (evt.skill == '龙魂1' || evt.skill == '龙魂2') && evt.cards && evt.cards.length == 2;
                                    },
                                    content() {
                                        trigger.num++;
                                    },
                                },
                                discard: {
                                    trigger: {
                                        player: ['useCard', 'respond'],
                                    },
                                    forced: true,
                                    popup: false,
                                    logTarget() {
                                        return _status.currentPhase;
                                    },
                                    autodelay(event) {
                                        return event.name == 'respond' ? 0.5 : false;
                                    },
                                    filter(evt, player) {
                                        return (evt.skill == '龙魂3' || evt.skill == '龙魂4') && evt.cards && evt.cards.length == 2 && _status.currentPhase && _status.currentPhase != player && _status.currentPhase.countDiscardableCards(player, 'he');
                                    },
                                    content() {
                                        player.line(_status.currentPhase, 'green');
                                        player.discardPlayerCard(_status.currentPhase, 'he', true);
                                    },
                                },
                            },
                        },
                        龙魂1: {
                            audio: 'ext:永远的七日之都/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将' + get.cnNumber(Math.max(1, _status.event.player.hp)) + '张♥️️牌当作桃使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (_status.event.player.hp > 1) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard() {
                                return Math.max(1, _status.event.player.hp);
                            },
                            viewAs: {
                                name: 'tao',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'heart' }) >= player.hp;
                            },
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            ai: {
                                basic: {
                                    order(card, player) {
                                        if (player.hasSkillTag('pretao')) return 5;
                                        return 2;
                                    },
                                    useful: [8, 6.5, 5, 4],
                                    value: [8, 6.5, 5, 4],
                                },
                                result: {
                                    target(player, target) {
                                        // if(player==target&&player.hp<=0) return 2;
                                        if (player.hasSkillTag('nokeep')) return 2;
                                        var nd = player.needsToDiscard();
                                        var keep = false;
                                        if (nd <= 0) {
                                            keep = true;
                                        } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                            keep = true;
                                        }
                                        var mode = get.mode();
                                        if (target.hp >= 2 && keep && target.hasFriend()) {
                                            if (target.hp > 2 || nd == 0) return 0;
                                            if (target.hp == 2) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        if (target != current && get.attitude(target, current) >= 3) {
                                                            if (current.hp <= 1) return true;
                                                            if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                        }
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                        if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                        var att = get.attitude(player, target);
                                        if (att < 3 && att >= 0 && player != target) return 0;
                                        var tri = _status.event.getTrigger();
                                        if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                                var num = game.countPlayer(function (current) {
                                                    if (current.identity == 'fan') {
                                                        return current.countCards('h', 'tao');
                                                    }
                                                });
                                                if (num > 1 && player == target) return 2;
                                                return 0;
                                            }
                                        }
                                        if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                                return 0;
                                            }
                                        }
                                        if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                            return 0;
                                        }
                                        return 2;
                                    },
                                },
                                tag: {
                                    recover: 1,
                                    save: 1,
                                },
                            },
                        },
                        龙魂2: {
                            audio: 'ext:永远的七日之都/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将' + get.cnNumber(Math.max(1, _status.event.player.hp)) + '张♦️️当作火杀使用或打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (_status.event.player.hp > 1) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard() {
                                return Math.max(1, _status.event.player.hp);
                            },
                            viewAs: {
                                name: 'sha',
                                nature: 'fire',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'diamond' }) >= player.hp;
                            },
                            filterCard(card) {
                                return card.suit == 'diamond';
                            },
                            ai: {
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order() {
                                    if (_status.event.player.hasSkillTag('presha', true, null, true)) return 10;
                                    return 3;
                                },
                                result: {
                                    target(player, target) {
                                        if (player.hasSkill('jiu') && !target.getEquip('baiyin')) {
                                            if (get.attitude(player, target) > 0) {
                                                return -6;
                                            } else {
                                                return -3;
                                            }
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                        },
                        龙魂3: {
                            audio: 'ext:永远的七日之都/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将' + get.cnNumber(Math.max(1, _status.event.player.hp)) + '张♠️️牌当作无懈可击使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (_status.event.player.hp > 1) return 0;
                                return 7 - get.value(card);
                            },
                            selectCard() {
                                return Math.max(1, _status.event.player.hp);
                            },
                            viewAs: {
                                name: 'wuxie',
                            },
                            viewAsFilter(player) {
                                return player.countCards('he', { suit: 'spade' }) >= player.hp;
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4],
                                    value: [6, 4],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        龙魂4: {
                            audio: 'ext:永远的七日之都/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将' + get.cnNumber(Math.max(1, _status.event.player.hp)) + '张♣️️牌当作闪打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (_status.event.player.hp > 1) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard() {
                                return Math.max(1, _status.event.player.hp);
                            },
                            viewAs: {
                                name: 'shan',
                            },
                            filterCard(card) {
                                return card.suit == 'club';
                            },
                            ai: {
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        杀戮: {
                            enable: 'phaseUse',
                            usable: 1,
                            content() {
                                'step 0';
                                event.num = 6;
                                player.chooseTarget(true, '锁定一个目标', function (card, player, target) {
                                    return target != player;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                event.target = result.targets[0];
                                ('step 2');
                                if (event.num > 0) {
                                    if (!event.target.isAlive())
                                        player.chooseTarget(true, '重新锁定一个目标', function (card, player, target) {
                                            return target != player;
                                        }).ai = function (target) {
                                            return -get.attitude(player, target);
                                        };
                                    else event.goto(2);
                                } else event.finish();
                                ('step 4');
                                event.target = result.targets[0];
                                event.goto(2);
                            },
                            ai: {
                                basic: {
                                    order: 10,
                                },
                                result: {
                                    target: -5,
                                },
                            },
                        },
                        悲愿: {
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                trigger.num += game.dead.length;
                            },
                        },
                        轮回: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return (
                                    player.hp <= 2 &&
                                    game.hasPlayer(function (current) {
                                        return current != player && current.hp > 2;
                                    })
                                );
                            },
                            content() {
                                var list = game.filterPlayer(function (current) {
                                    return current != player && current.hp > 2;
                                });
                                if (list.length) {
                                    var target = list.randomGet();
                                    player.line(target);
                                    var hp1 = player.hp;
                                    var hp2 = target.hp;
                                    player.hp = Math.min(player.maxHp, hp2);
                                    target.hp = Math.min(target.maxHp, hp1);
                                    player.update();
                                    target.update();
                                    game.log(player, '和', target, '交换了体力值');
                                }
                            },
                        },
                        qrzd_egcs: {
                            init(player) {
                                player.storage.qrzd_egcs = 0;
                            },
                            nobracket: true,
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                                player.storage.qrzd_egcs++;
                                player.markSkill('qrzd_egcs');
                            },
                            intro: {
                                content: '手牌上限+#',
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.storage.qrzd_egcs;
                                },
                            },
                            group: 'qrzd_egcs_cancel',
                            subSkill: {
                                cancel: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num < 2;
                                    },
                                    content() {
                                        trigger.num = 0;
                                    },
                                },
                            },
                        },
                        qrzd_yexi: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return (
                                        distance -
                                        game.countPlayer(function (current) {
                                            return current.sex == 'female';
                                        })
                                    );
                                },
                                globalTo(from, to, distance) {
                                    return (
                                        distance -
                                        game.countPlayer(function (current) {
                                            return current.sex == 'female';
                                        })
                                    );
                                },
                            },
                        },
                        束缚: {
                            nobracket: true,
                            mark: true,
                            marktext: '束',
                            intro: {
                                content: '无法成为卡牌目标',
                            },
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    return false;
                                },
                            },
                        },
                        定身: {
                            mod: {
                                cardEnabled() {
                                    return false;
                                },
                                cardUsable() {
                                    return false;
                                },
                                cardRespondable() {
                                    return false;
                                },
                                cardSavable() {
                                    return false;
                                },
                            },
                            mark: true,
                            intro: {
                                content: '处于定身状态,你无法使用或打出任何手牌',
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'respondShan') || get.tag(card, 'respondSha')) {
                                            if (current < 0) return 1.5;
                                        }
                                    },
                                },
                            },
                        },
                        剑术精通: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            nobracket: true,
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    if (get.zhu(_status.event.player, 'shouyue')) {
                                        if (card.suit != 'spade') return 2;
                                    } else {
                                        if (get.color(card) == 'red') return 2;
                                    }
                                    return -0.5;
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.parent.directHit.add(trigger.target);
                                }
                            },
                        },
                        成长: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var list = ['摸牌'];
                                if (!player.hasSkill('qrzd_egcs')) {
                                    list.push('qrzd_egcs');
                                }
                                if (!player.hasSkill('yexi')) {
                                    list.push('yexi');
                                }
                                if (!player.hasSkill('悲愿')) {
                                    list.push('悲愿');
                                }
                                list.push('cancel2');
                                if (list.length) {
                                    player
                                        .chooseControl(list)
                                        .set('prompt', get.prompt2('成长'))
                                        .set('ai', function () {
                                            if (list.includes('qrzd_egcs')) return 1;
                                            return 0;
                                        });
                                }
                                ('step 1');
                                if (result.control == 'cancel2') return;
                                if (result.control == '摸牌') {
                                    player.draw(3);
                                    return;
                                }
                                player.addSkill(result.control);
                                player.popup(result.control);
                                game.log(player, '获得了技能', '#g【' + get.translation(result.control) + '】');
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        '帝具【一斩必杀·村雨】': {
                            nobracket: true,
                            trigger: {
                                source: 'damage',
                            },
                            forced: true,
                            content() {
                                trigger.player.addSkill('qrzd_咒毒');
                            },
                        },
                        qrzd_咒毒: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBefore',
                            },
                            mark: true,
                            intro: {
                                content: '处于咒毒状态',
                            },
                            forced: true,
                            content() {
                                player.hp = player.maxHp;
                                player.loseHp(player.hp);
                                player.loseMaxHp();
                            },
                        },
                        qrzd_xzyy: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'die',
                            },
                            nobracket: true,
                            forced: true,
                            forceDie: true,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt2('qrzd_xzyy'), function (card, player, target) {
                                        return player != target && _status.event.sourcex != target;
                                    })
                                    .set('forceDie', true)
                                    .set('ai', function (target) {
                                        var num = get.attitude(_status.event.player, target);
                                        if (num > 0) {
                                            if (target.hp == 1) {
                                                num += 2;
                                            }
                                            if (target.hp < target.maxHp) {
                                                num += 2;
                                            }
                                        }
                                        return num;
                                    })
                                    .set('sourcex', trigger.source);
                                ('step 1');
                                if (result.bool) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    player.say('我嘛……大概会被卷入时空的缝隙吧……就是……就是……会有点寂寞……那就让我像个坚强的男孩子一样和前辈告别吧……那么……我要出门了……');
                                    target.recover();
                                    target.draw(3);
                                    target.addSkill('永恒的信标');
                                }
                            },
                            ai: {
                                expose: 0.5,
                            },
                        },
                        永恒的信标: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            filterCard: true,
                            position: 'h',
                            selectCard: 3,
                            content() {
                                'step 0';
                                player.$skill('永恒的信标');
                                var fellow = game.addFellow(1, '千式');
                                fellow.style.left = 'calc(55% - 70px)';
                                fellow.style.top = 'calc(50%)';
                                fellow.classList.add('minskin');
                                fellow.side = player.side;
                                fellow.identity = player.identity;
                                if (fellow.identity == 'zhu') fellow.identity = 'zhong';
                                fellow.showIdentity();
                                fellow.node.identity.dataset.color = 'nei';
                                fellow.draw(4)._triggered = null;
                                fellow.changeHujia(7);
                                game.log(player, '<span style="color: red">召唤了 [千式]</span>');
                                player.removeSkill('永恒的信标');
                            },
                            ai: {
                                order: 8,
                                result: {
                                    player: 3,
                                },
                            },
                        },
                        qrzd: {
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('he', { type: 'equip' });
                            },
                            nobracket: true,
                            check(card) {
                                return 10 - get.value(card);
                            },
                            filterCard: {
                                type: 'equip',
                            },
                            position: 'he',
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            content() {
                                player.gain(target.getCards('h'));
                                target.$give(target.getCards('h').length, player);
                                target.goMad({ player: 'phaseBegin' });
                            },
                            ai: {
                                order: 12,
                                result: {
                                    player: -1,
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                            },
                        },
                        qrzd_zydtk: {
                            nobracket: true,
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (card.name == 'shunshou' || card.name == 'lebu' || card.name == 'sha') return false;
                                },
                            },
                        },
                        xingzhiyuanye: {
                            audio: 'ext:永远的七日之都/audio:2',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        易式·辉月: {
                            nobracket: true,
                            srlose: true,
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h') > 0;
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    target.addSkill('fengyin');
                                    player.useCard({ name: 'juedou' }, target, false);
                                    player.storage.千式·淬羽 += 2;
                                    player.markSkill('千式·淬羽');
                                } else {
                                    player.changeHujia(2);
                                    player.storage.千式·淬羽 += 1;
                                    player.markSkill('千式·淬羽');
                                }
                            },
                            ai: {
                                order(name, player) {
                                    var cards = player.getCards('h');
                                    if (player.countCards('h', 'juedou') == 0) {
                                        return 1;
                                    }
                                    for (var i = 0; i < cards.length; i++) {
                                        if (cards[i].name != 'juedou' && cards[i].number > 11 && get.value(cards[i]) < 7) {
                                            return 9;
                                        }
                                    }
                                    return lib.card.sha.ai.order - 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('h', 'juedou') > 0) return 0.6;
                                        var num = player.countCards('h');
                                        if (num > player.hp) return 0;
                                        if (num == 1) return -2;
                                        if (num == 2) return -1;
                                        return -0.7;
                                    },
                                    target(player, target) {
                                        var num = target.countCards('h');
                                        if (num == 1) return -1;
                                        if (num == 2) return -0.7;
                                        return -0.5;
                                    },
                                },
                                threaten: 1.3,
                            },
                        },
                        逆式·烁星: {
                            nobracket: true,
                            usable: 2,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('h', { type: 'trick' }) > 0;
                            },
                            filterCard(card) {
                                return get.type(card) == 'trick';
                            },
                            position: 'h',
                            selectCard: [1],
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(card) {
                                10 - get.value(card);
                            },
                            content() {
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                            },
                            ai: {
                                order() {
                                    return 6;
                                },
                                result: {
                                    target(player, target) {
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                        },
                        千式·淬羽: {
                            init(player) {
                                player.storage.千式·淬羽 = 2;
                            },
                            intro: {
                                content: 'mark',
                            },
                            nobracket: true,
                            forced: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.storage.千式·淬羽 += trigger.num;
                                player.markSkill('千式·淬羽');
                            },
                        },
                        绝式·蔽: {
                            audio: 'ext:永远的七日之都/audio:2',
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 2,
                            selectTarget: [1, 16],
                            content() {
                                'step 0';
                                player.storage.千式·淬羽 -= 8;
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                player.line(event.targets, 'green');
                                event.targets2 = event.targets.slice(0);
                                ('step 1');
                                game.log(player, '发动了技能<span style="color: gold">绝式·蔽日</span>');
                                ('step 2');
                                target.addSkill('定身');
                                target.addSkill('fengyin');
                                ('step 3');
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.changeHujia(2);
                                player.storage.千式·淬羽 += 2;
                                player.markSkill('千式·淬羽');
                                ('step 3');
                                event.num--;
                                if (event.num > 0 && target.isAlive()) {
                                    event.goto(2);
                                } else {
                                    target.removeSkill('定身');
                                    target.removeSkill('fengyin');
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2,
                                order: 12,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        绝式·蔽日: {
                            nobracket: true,
                            enable: 'phaseUse',
                            usable: 1,
                            selectTarget: [1],
                            filter(event, player) {
                                return player.storage.千式·淬羽 >= 8;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                game.log(player, '发动了技能<span style="color: gold">绝式·蔽日</span>');
                                ('step 1');
                                player.storage.千式·淬羽 -= 8;
                                target.addSkill('定身');
                                target.addSkill('fengyin');
                                ('step 2');
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.useCard({ name: 'sha' }, target, false);
                                player.changeHujia(4);
                                player.storage.千式·淬羽 += 4;
                                player.markSkill('千式·淬羽');
                                ('step 3');
                                event.num--;
                                if (event.num > 0 && target.isAlive()) {
                                    event.goto(2);
                                } else {
                                    target.removeSkill('定身');
                                    target.removeSkill('fengyin');
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2.1,
                                order: 100,
                                result: {
                                    target: -3,
                                },
                            },
                        },
                        大地为之怮哭: {
                            enable: 'phaseUse',
                            nobracket: true,
                            usable: 1,
                            filterCard: true,
                            selectCard: -1,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return card.name != 'shandian';
                                });
                                ('step 1');
                                if (result.bool) {
                                    var targets = game
                                        .filterPlayer(function (current) {
                                            return current != player;
                                        })
                                        .sortBySeat();
                                    event.targets = targets;
                                    player.line(targets);
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.target = event.targets[event.num];
                                    if (event.target.countCards('h', 'tao')) {
                                        event.target.chooseToDiscard('弃置一张桃或受到2点伤害', function (card, player) {
                                            return card.name == 'tao';
                                        }).ai = function (card) {
                                            return true;
                                        };
                                    } else {
                                        event.target.damage(2);
                                        event.num++;
                                        event.redo();
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool == false) {
                                    event.target.damage(2);
                                    event.num++;
                                    event.goto(2);
                                    player.say('<那么,将所受神宠爱的缺陷品弑杀掉吧,与这个充满残缺的世界一起,亲手为神清理她箱庭里的不完美吧.>');
                                } else {
                                    event.num++;
                                    event.goto(2);
                                }
                            },
                            ai: {
                                threaten: 1.5,
                                result: {
                                    player(player, target) {
                                        return 10;
                                    },
                                },
                                order: 10,
                                expose: 0.4,
                            },
                        },
                        '圣枪【郎努基斯】': {
                            trigger: {
                                player: 'shaBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                return player.countCards('e') < event.target.countCards('e');
                            },
                            mod: {
                                targetInRange(card) {
                                    if (card.name == 'sha') return true;
                                },
                            },
                            content() {
                                trigger.directHit = true;
                            },
                        },
                    },
                };
                lib.config.all.characters.add('永远的七日之都');
                lib.config.characters.add('永远的七日之都');
                for (var i in QQQ.character) {
                    QQQ.character[i][4].add(`ext:永远的七日之都/image/${i}.jpg`)
                }
                lib.translate['永远的七日之都_character_config'] = `永远的七日之都`;
                return QQQ;
            });
        },
        package: {
            intro: "七日之都和部分动漫角色的拓展包,技能多数搬运,神器使强度略高,为神将水准,节奏快,适合与高强度拓展一起玩耍.在此非常感谢冷雨、轮回中的消逝者、咫尺天涯等众多大佬的支持! ฅ( ̳• ◡ • ̳)ฅ<br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br></span>",
            author: '死神之吻乃离别之味',
            version: '2.6',
        },
    };
});
