import { lib, game, ui, get, ai, _status } from '../../../../noname.js';
import { mrfzfuc } from '../SJZXfuc.js';
game.import('character', function (lib, game, ui, get, ai, _status) {
  var epicSJZX = {
    name: 'epicSJZX',
    connect: true,
    characterSort: {},
    characterTitle: {
      lutuomrfz: '<font color=#00868B>止戈胜悼</font>',
      shendianmrfz: '<font color=#00E68A>灯塔守卫者</font>',
      teleixiyamrfz: '<font color=#00868B>瑰丽理想</font>',
      teleixisimrfz: '<font color=#00868B>执剑斩棘</font>',
      puruisaisimrfz: '<font color=#77be6a>女祭司</font>',
      haojiaomrfz: '<font color=#ed7e78>维多利亚的白狼</font>',
      chongyuemrfz: '<font color=#FFF68F>玉门戍卫</font>',
      daifeienmrfz: '<font color=#FFF68F>濯洗剑锋</font>',
      lingmrfz: '<font color=#BFEFFF>千年一梦</font>',
      nianmrfz: '<font color=#FFA500>地生五金</font>',
      amiyamrfz: '<font color=#00868B>魔王</font>',
      xigymrfz: '<font color=#f6b3fa>工笔入画</font>',
      midiexiangmrfz: '<font color=#f91c01>勿忘我</font>',
      qiubaimrfz: '<font color=#1885f2>春江逢雪</font>',
      miumiumrfz: '<font color=#6575f1>孑然水灵</font>',
      duoluoximrfz: '<font color=#13a022>绿野幻梦</font>',
      sphemomrfz: '<font color=#4EEE94>伦理坚守者</font>',
      spamiyamrfz: '<font color=#00868B>争斗在此止歇</font>',
      kaierximrfz: '<font color=rgb(255,45,62)>旧日残影</font>',
      geleidiyamrfz: '<font color=rgb(1,255,22)>执政官</font>',
      spdegoumrfz: '<font color=rgb(255,25,22)>破斩桎梏</font>',
      spshihuaiyamrfz: '<font color=#e44997>万民安生</font>',
      spsongzangrenmrfz: '<font color#f1ca13>圣徒</font>',
      tifengmrfz: '<font color=2942BA>永恒狩猎</font>',
      kelisitengmrfz: '<font color=#DC143C>先驱者</font>',
      weiweiannamrfz: '<font color=#efd02a>金盏花</font>',
      shuangxingmrfz: '<font color=rgb(59,98,115)>理想之焰</font>',
      spxiaoyanmrfz: '<font color=#DC143C>登山者</font>',
      suxinmrfz: '<font color=#DC143C>感性与自由</font>',
      ailisimrfz: '<font color=#77be6a>梦境守护者</font>',
      doushitalulamrfz: '<font color=#be260e>诅咒缠身</font>',
      shumrfz: '<font color=#42b983>百谷长青</font>',
      haimomrfz: '<font color=#8ccfcc>归于海潮</font>',
      xiaomanmrfz: '<font color=#42b983>竹笛飞声</font>',
      chizuimrfz: '<font color=#8F3ED7>斩棘卫法</font>',
      wanqingmrfz: '<font color=#C0C0C0>牵风者</font>',
      saileiyamrfz: '<font color=#FFF68F>守望者</font>',
      haidimrfz: '<font color=#DC143C>风暴中的信使</font>',
      chuxuemrfz: '<font color=#C0C0C0>谢拉格的圣女</font>',
      zuolemrfz: '<font color=#DC143C>心系苍生</font>',
      yemomrfz: '<font color=#efd02a>双生花</font>',
      docmrfz: '<font color=#DC143C>利他主义</font>',
      medical_amiyamrfz: '<font color=#00868B>万千愿景</font>',
      hainimrfz: '<font color=#00868B>山静水流开画景</font>',
      shenxunmrfz: '<font color=#DC143C>执者失之</font>',
      mingjiaomrfz: '<font color=#DC143C>蹒跚求索</font>',
      xirenmrfz: '<font color=#00868B>凋敝魂灵</font>',
    },
    dynamicTranslate: {
      chonggoumrfz(player) {
        if (player.storage.chonggoumrfz) return '摸牌阶段开始时,若你的手牌数不小于你的体力值,你可以弃置所有手牌,回复一点体力,摸X张牌.(X=弃置牌的数量)';
        return '摸牌阶段开始时,若你的手牌数不小于你的体力值<span class=thundertext>且已受伤</span>,你可以弃置所有手牌,回复一点体力,摸X张牌.(X=弃置牌的数量<span class=thundertext>-已损失体力值</span>)';
      },
      kuanmrfz(player) {
        if (!player.storage.kuanmrfz) return '锁定技,游戏开始时,你废除所有装备栏和判定区并摸3张牌<span class=thundertext>;判定阶段,你依次进行【乐不思蜀】和【兵粮寸断】的判定</span>;你可以将装备牌当【杀】、【闪】或【酒】使用或打出,你的装备牌不计入手牌上限.';
        return '锁定技,游戏开始时,你废除所有装备栏和判定区并摸3张牌);你可以将装备牌当【杀】、【闪】或【酒】使用或打出,你的装备牌不计入手牌上限.';
      },
      zhuguangmrfz(player) {
        if (!player.storage.zhuguangmrfz_change) return '准备阶段,你可以选择一名角色,视为对其使用【决斗】,当你因此牌对其他角色造成伤害时,你可以防止此伤害,选择一项:①删除【苦暗】描述中蓝色的文字;②修改【逐光】的描述;③摸一张牌.';
        return '准备阶段,你可以选择一名角色,视为对其使用【决斗】且此牌不可被其他角色响应,当你因此牌对其他角色造成伤害时,你可以选择一项:①删除【苦暗】描述中蓝色的文字;②摸两张牌.';
      },
      shuoguangmrfz(player) {
        if (player.storage.shuoguangmrfz) return '<font color=#696969>锁定技,你跳过你的第一个弃牌阶段.</font>';
        return '锁定技,你跳过你的第一个弃牌阶段.';
      },
      xunlumrfz(player) {
        return `锁定技,摸牌阶段,你改为随机摸<span class=thundertext>${player.storage.xunlumrfz_draw}</span>至6张牌;准备阶段,你将本回合出牌阶段使用【杀】的基数随机改为<span class=firetext>${player.storage.xunlumrfz_sha}</span>至5次;你的手牌上限随机改为<span class=greentext>${player.storage.xunlumrfz_h}</span>至8张.当你造成伤害时,你可以令一个有颜色的数字+1.(有颜色的数字的最大值至多为4,且本技能中的随机生成的随机数均符合正态分布)`;
      },
      chaoshengmrfz(player) {
        if (player.countMark('jianshumrfz') == 15) return '结束阶段,若你连续<span class=thundertext>1</span>个回合没有造成过伤害,你可以摸两张牌并回复一点体力.';
        return '结束阶段,若你连续<span class=thundertext>' + player.countMark('jianshumrfz') >= 10 && player.countMark('jianshumrfz') < 15 ? 2 : 3 - Math.floor(player.countMark('jianshumrfz') / 5) + '</span>个回合没有造成过伤害,你可以选择摸两张牌或回复一点体力.';
      },
      heishimrfz(player) {
        if (player.hasSkill('junumrfz_effect')) return '锁定技,你的【杀】无视防具;你对有防具的角色造成的伤害+1,对与你距离小于等于3的角色造成的伤害+1.';
        return '锁定技,你的使用的【杀】仅能指定与你距离不大于2的角色为目标,你的【杀】无视防具;你对有防具的角色造成的伤害+1,对与你距离为1的角色造成的伤害+1.';
      },
      wowumrfz(player) {
        if (player.countMark('wowumrfz_time') < 5) return '<span class=firetext>【劲发江潮落】</span></br>你的回合内,你每使用三张牌可视为使用一张不计入次数的【杀】,若此【杀】造成了伤害,你摸一张牌;锁定技,当你本局游戏累计发动5次【我无】时,修改此技能.';
        return '<span class=firetext>【气收秋毫平】</span></br>每当你累计使用或打出三张牌时,你可以视为使用一张无距离限制且不计入次数的【杀】,你摸一张牌.';
      },
      xuezhanmrfz(player) {
        if (!player.storage.xuezhanmrfz) return '锁定技,当你首次即将死亡时,取消之,你将体力值和体力上限调整至2,并摸4张牌.';
        return '<font color=#696969>锁定技,当你首次即将死亡时,取消之,你将体力值和体力上限调整至2,并摸4张牌.</font>';
      },
      dunpaomrfz(player) {
        if (!player.storage.dunpaomrfz) return '锁定技,你的攻击范围+5,你不能指定与你距离为1的角色为目标;当你使用【杀】对距离你大于1的角色造成伤害时,该角色进行判断,若不为红色,此伤害+1;回合开始时,你可以修改此技能.';
        return '锁定技,你的手牌上限+2.';
      },
      biaohaomrfz(player) {
        return '蓄力技(<font color=#e00500>' + player.countMark('charge') + '</font>/4),出牌阶段限两次,你可以弃置一张带有伤害类标签的牌,你增加一点蓄力值;你可以按照下列规则消耗蓄力值:①:消耗1点蓄力值,视为使用一张【杀】;②:出牌阶段,消耗4点蓄力值,视为使用三张【杀】和一张【万箭齐发】,失去3点体力.';
      },
      dianjingmrfz(player) {
        return !player.storage.dianjingmrfz ? '转换技,当你使用转化牌时,你可以从牌堆中获得与你使用的转化牌的<span class=thundertext>阳:牌名相同</span><font color=#696969>;阴:类型相同</font>的牌.' : '转换技,当你使用转化牌时,你可以从牌堆中获得与你使用的转化牌的<font color=#696969>阳:牌名相同;</font><span class=thundertext>阴:类型相同</span>的牌.';
      },
      yongwomrfz(player) {
        if (player.isTurnedOver()) return '①锁定技,<span class=thundertext>当你武将牌背面朝上时,你获得如下效果:1.当你的上家或下家使用牌后,其须弃置一张牌,其每累计因此弃置两张牌,你对其造成一点伤害,你可以选择将你的武将牌翻面;2.其他角色计算与你的距离+1;</span><font color=#696969>当你的武将牌正面朝上时,你获得如下效果:1.当你于一轮内首次进入濒死状态时,你将体力值回复至1,将你的武将牌翻面;2.任意角色的回合结束阶段,若你本回合受到或造成了伤害,你可以将你的武将牌翻面.</font>②锁定技,当你翻面至正面朝上时,你摸两张牌.';
        return '①锁定技,<font color=#696969>当你武将牌背面朝上时,你获得如下效果:1.当你的上家或下家使用牌后,其须弃置一张牌,其每累计因此弃置两张牌,你对其造成一点伤害,你可以选择将你的武将牌翻面;2.其他角色计算与你的距离+1;</font><span class=thundertext>当你的武将牌正面朝上时,你获得如下效果:1.当你于一轮内首次进入濒死状态时,你将体力值回复至1,将你的武将牌翻面;2.任意角色的回合结束阶段,若你本回合受到或造成了伤害,你可以将你的武将牌翻面.</span>②锁定技,当你翻面至正面朝上时,你摸两张牌.';
      },
      yuechuimrfz(player) {
        var mark = player.countMark('yuechuimrfz') > 0 ? player.countMark('yuechuimrfz') : 1;
        return `当你使用【杀】后,你可以摸[ ${mark} ]张牌,你可以选择依次执行下列任意个效果:<br>1.弃置一张装备牌,令[]中的数字+1(至多为3);<br>2.对与其距离为1的一名其他角色造成一点伤害.`;
      },
      zhenzamrfz(player) {
        return '①锁定技,游戏开始时你获得一个‘壁’标记;当有角色获得‘壁’标记时,若其没有护甲,其获得一点护甲;每轮各限两次,每名角色的准备阶段(<span class=thundertext>已发动:' + (player.hasMark('zhenzamrfz_time1') ? player.countMark('zhenzamrfz_time1') : 0) + '次</span>)或有其他角色因你造成的伤害而进入濒死状态时(<span class=thundertext>已发动:' + (player.hasMark('zhenzamrfz_time2') ? player.countMark('zhenzamrfz_time2') : 0) + '次</span>),若你没有‘壁’标记,你获得一个‘壁’标记.②有‘壁’标记的角色受到伤害后,若其因此伤害触发过护甲且没有护甲,其可以随机获得攻击范围内一名其他角色的' + (player.storage.liuliemrfz ? '两' : '一') + '张牌并对其造成一点伤害.';
      },
      yiyinmrfz(player) {
        return '①蓄力技(' + player.countMark('charge') + '/3),出牌阶段,你可以弃置一张带有伤害类标签的牌,增加一点蓄力值.②当你使用【杀】的时,你可以消耗一点蓄力值并令此【杀】的伤害基数+1.';
      },
      kuangyumrfz(player) {
        if (player.storage.kuangyumrfz) return '每回合每名角色限一次,当你使用单一目标的锦囊牌指定其他角色为目标后,若该角色没有‘风起’标志,你可以使其获得一个<风起>标记(持续到其回合结束),且令其下回合随机跳过两个阶段,若该角色在你的攻击范围内,其于此牌结算完成之前,你对有‘风起’标记的角色造成的伤害+1.';
        return '每回合每名角色限一次,当你使用单一目标的普通锦囊牌或【杀】指定其他角色为目标后,若该角色没有‘风起’标志,你可以使其获得一个<风起>标记(持续到其回合结束),且令其下回合随机跳过两个阶段,若该角色在你的攻击范围内,其于此牌结算完成之前,你对有‘风起’标记的角色造成的伤害+1,若对其造成了伤害,你修改【狂语】直到下一轮开始.';
      },
      amy_qingyanmrfz(player) {
        var str1 = '①锁定技,';
        var str2 = '.②出牌阶段结束时,你可以删除【青焱①】中[]、{}或()的内容直到本轮结束,令一名其他角色获得你删除的内容的效果直到其回合结束.';
        var str = '';
        var list = [player.storage.amy_qingyanmrfz_damage, player.storage.amy_qingyanmrfz_time, player.storage.amy_qingyanmrfz_direct];
        var del = ['<span style="text-decoration:line-through">{你每回合使用的第一张【杀】的伤害基数+1},</span>', '<span style="text-decoration:line-through">[你使用【杀】的次数+1],</span>', '<span style="text-decoration:line-through">(你使用的【杀】需要两张【闪】才可抵消),</span>'];
        var text = ['{你每回合使用的第一张【杀】的伤害基数+1},', '[你使用【杀】的次数+1],', '(你使用的【杀】需要两张【闪】才可抵消),'];
        for (var i = 0; i < list.length; i++) {
          if (list[i]) str = str + del[i];
          else str = str + text[i];
        }
        return str1 + str + str2;
      },
      xinyongwomrfz(player) {
        if (player.storage.xinyongwomrfz) return '转换技,<span class=thundertext>阳:当你进入濒死状态时,你可以回复至一点体力;</span><font color=#696969>阴:当你武将牌从正面朝上至背面朝上时,你可以摸两张牌,选择一项:1.弃置你攻击范围内一名其他角色区域内各一张牌;2.对你攻击范围内的一名其他角色造成一点伤害.</font>';
        return '转换技,<font color=#696969>阳:当你进入濒死状态时,你可以回复至一点体力;</font><span class=thundertext>阴:当你武将牌从正面朝上至背面朝上时,你可以摸两张牌,选择一项:1.弃置你攻击范围内一名其他角色区域内各一张牌;2.对你攻击范围内的一名其他角色造成一点伤害.</span>';
      },
      chongdanmrfz(player) {
        var str2 = '';
        if (player.storage.chongdanmrfz && player.storage.chongdanmrfz_player) str2 = '<font color=#696969>造成</font>/<font color=#696969>受到</font>';
        else if (player.storage.chongdanmrfz && !player.storage.chongdanmrfz_player) str2 = '<font color=#696969>造成</font>/受到';
        else if (player.storage.chongdanmrfz_player && !player.storage.chongdanmrfz) str2 = '造成/<font color=#696969>受到</font>';
        else str2 = '造成/受到';
        return `锁定技,每轮你至多能使用2X张牌;每轮每项限一次你第一次[${str2}]伤害后,你摸等同于你体力值张牌或回复等同你手牌数点体力.(X=你的体力上限)`;
      },
      tianyimrfz(player) {
        if (player.storage.tianyimrfz) return '转换技,一名角色的判定阶段,你可以,<span class=thundertext>阳:观看牌堆顶两张牌,并将其置于牌堆顶或牌堆底;</span><font color=#696969>阴:进行一次判定,并获得判定牌,本回合此牌视为【闪】,若判定结果为♣️️,你本局游戏使用【杀】的次数+1(至多+3).</font>';
        return '转换技,一名角色的判定阶段,你可以,<font color=#696969>阳:观看牌堆顶两张牌,并将其置于牌堆顶或牌堆底;</span><span class=thundertext>阴:进行一次判定,并获得判定牌,本回合此牌视为【闪】,若判定结果为♣️️,你本局游戏使用【杀】的次数+1(至多+3).</font>';
      },
      yirenmrfz(player) {
        return '蓄力技(<span class=thundertext>' + (player.countMark('charge') != undefined ? player.countMark('charge') : 0) + `</span>/∞).①锁定技,回合结束时,你增加X点蓄力值.(X=本回合出牌阶段剩余使用【杀】的次数)②出牌阶段,你可以消耗[<span class=thundertext> ${player.storage.yirenmrfz_use != undefined ? Math.min(player.storage.yirenmrfz_use, 5) : 1} </span>]点蓄力值,弃置两张手牌并选择至多两名其他角色,视为你对其各使用一张【杀】(目标必须合法且不计入次数限制)且其下个回合使用【杀】的次数-1,令[ ]中的数字+1(至多为5).`;
      },
      xujimrfz(player) {
        var storage = player.storage.shiyumrfz_buff;
        if (!storage) storage = 0;
        return `弃牌阶段开始时,若你本回合出牌阶段没有使用牌指定其他角色为目标,你可以令你下一张【杀】的伤害基数+1,你选择一项:1.摸[ ${2 + storage} ]张牌且本回合手牌上限+5;2.使用一张【杀】且此杀需要[ ${2 + storage} ]张【闪】才可抵消.`;
      },
      suijiamrfz(player) {
        var del = player.storage.suijiamrfz.del;
        var damage = player.storage.suijiamrfz.damage;
        return '锁定技,当你造成伤害时' + (del == true ? '' : ',[ 若其有护甲 ],则') + `,此伤害+{ ${1 + damage || 1} }.`;
      },
      yxliumingmrfz(player) {
        var hasSkill = player.hasSkill('yxliumingmrfz_ban');
        if (!hasSkill) return '①锁定技,游戏开始时或一名角色的回合开始时,若你武将牌上没有‘铭’,你将牌堆顶的一张牌置于你的武将牌上,称之为‘铭’.②锁定技,当你成为其他角色使用的牌的目标后,若此牌[花色/点数]与‘铭’[相同/不同],则[你获得武将牌上的‘铭’/此牌对你无效,你失去此技能直到当前回合结束].③你可以使用‘铭’.';
        return '①锁定技,游戏开始时或一名角色的回合开始时,若你武将牌上没有‘铭’,你将牌堆顶的一张牌置于你的武将牌上,称之为‘铭’.<font color=#696969>②锁定技,当你成为其他角色使用的牌的目标后,若此牌[花色/点数]与‘铭’[相同/不同],则[你获得武将牌上的‘铭’/此牌对你无效,你失去此技能直到当前回合结束].</font>③你可以使用‘铭’.';
      },
      lianmangmrfz(player) {
        var str = '锁定技.<br>①当你成为其他角色使用牌的目标后,你重铸至多X张牌(X=此牌牌名的字数),若你:1.因此重铸了带有伤害类标签的牌,你摸一张牌;2.因此重铸了所有手牌,对使用者造成一点伤害,你不能使用或打出手牌直到此牌结算完毕或你进入濒死状态.<br>②当你造成伤害时,你改为令你回复等量体力或摸等量的牌.';
        return player.hasSkill('zhanmangmrfz_ban') ? `<font color=#696969>${str}</font>` : str;
      },
    },
    character: {
      friston3mrfz: ['male', 'luomrfz', 4, ['shantanmrfz'], []],
      talaidingzhenmrfz: ['female', 'luomrfz', 4, ['xuebaomrfz'], []],
      shuangyemrfz: ['female', 'luomrfz', 4, ['canyinmrfz', 'bingrenmrfz'], []],
      yueyuemrfz: ['female', 'bomrfz', 4, ['xiyumrfz'], []],
      lutuomrfz: ['female', 'bomrfz', 4, ['zhengyimrfz', 'daosimrfz'], []],
      shendianmrfz: ['female', 'yimrfz', 3, ['fumumrfz', 'rouguangmrfz', 'mizongmrfz'], []],
      acemrfz: ['male', 'luomrfz', 4, ['guanyongmrfz', 'sizhanmrfz'], []],
      baocunzhemrfz: ['male', 'qianmrfz', 10, ['shouwangmrfz', 'jingmomrfz', 'xijimrfz'], []],
      yizumikemrfz: ['male', 'haimrfz', 3, ['chanshimrfz'], []],
      kelisitengmrfz: ['female', 'lymrfz', 4, ['xingtumrfz', 'poqiongmrfz'], []],
      // shuangxingmrfz: ['female', 'luomrfz', 4, ['xuexingmrfz', 'newchegumrfz', 'donghenmrfz'], []],
      aiguozhemrfz: ['male', 'zhmrfz', 4, ['junxingmrfz', 'youjimrfz'], []],
      doushitalulamrfz: ['female', 'zhmrfz', 4, ['zhuoximrfz', 'talula_shixinmrfz'], []],
      teleixiyamrfz: ['female', 'bamrfz', 3, ['bojimrfz', 'caijianmrfz'], []],
      teleixisimrfz: ['male', 'daimrfz', 4, ['yuanfumrfz', 'fenzhoumrfz'], []],
      qiaojiakelifumrfz: ['male', 'gemrfz', 4, ['chongxiemrfz', 'qj_chongjimrfz', 'leitingmrfz'], []],
      puruisaisimrfz: ['female', 'qianmrfz', 4, ['bianyimrfz'], []],
      fulankamrfz: ['female', 'gemrfz', 3, ['jifengmrfz', 'xiqiaomrfz'], []],
      xingjimrfz: ['female', 'gemrfz', 4, ['tianyimrfz', 'huijianmrfz', 'bingmingmrfz'], []],
      xingyuanmrfz: ['female', 'lymrfz', 4, ['daoliumrfz', 'gewumrfz'], []],
      zhanchemrfz: ['male', 'orthermrfz', '4/4/2', ['jiqiangmrfz', 'qingxiemrfz'], []],
      shanjimrfz: ['male', 'orthermrfz', 4, ['shandunmrfz', 'xuanmumrfz', 'chuandunmrfz'], []],
      shuanghuamrfz: ['female', 'orthermrfz', 3, ['tadianmrfz', 'xinjimrfz'], []],
      bohuimrfz: ['female', 'samimrfz', 4, ['shehunmrfz', 'yirenmrfz'], []],
      baimianxiaomrfz: ['female', 'lymrfz', 3, ['jinaomrfz', 'wutaimrfz'], []],
      cimeimrfz: ['female', 'weimrfz', 3, ['huabumrfz', 'shixinmrfz'], []],
      hongmrfz: ['female', 'luomrfz', 4, ['qunlangmrfz', 'cigumrfz', 'qingchumrfz'], ['hiddenSkill']],
      dekesasimrfz: ['female', 'qimrfz', 4, ['sudimrfz', 'jianyumrfz'], []],
      baijinmrfz: ['female', 'kamrfz', 3, ['xujimrfz', 'shiyumrfz'], []],
      yintuoluomrfz: ['female', 'weimrfz', 4, ['suijiamrfz', 'huquanmrfz'], []],
      wenmimrfz: ['female', 'leimrfz', 3, ['baiweimrfz', 'nuanxiangmrfz'], []],
      meiermrfz: ['female', 'lymrfz', 3, ['shuitamrfz'], []],
      lindongmrfz: ['female', 'wumrfz', 4, ['xianlingmrfz', 'dongjiangmrfz'], []],
      yunxingmrfz: ['female', 'luomrfz', 4, ['yxliumingmrfz', 'dingyuanmrfz'], []],
      yumaobimrfz: ['female', 'bomrfz', 4, ['tiaojiumrfz', 'rujingmrfz'], []],
      ailisimrfz: ['female', 'weimrfz', 3, ['rumianmrfz', 'alsmengxiangmrfz'], []],
      tianhuomrfz: ['female', 'weimrfz', 3, ['zhuihuomrfz', 'yihuomrfz'], []],
      linguangmrfz: ['female', 'shimrfz', '3/4/3', ['anranmrfz', 'huchimrfz', 'chongyaomrfz'], []],
      haimomrfz: ['female', 'yimrfz', 4, ['xunchaomrfz', 'paoyingmrfz'], []],
      xiaomanmrfz: ['female', 'yanmrfz', 4, ['mushoumrfz'], []],
      wanqingmrfz: ['male', 'yanmrfz', 4, ['guantianmrfz', 'yingfengmrfz'], []],
      gelaokesimrfz: ['female', 'yimrfz', 4, ['cichongmrfz', 'ganraomrfz'], []],
      haidimrfz: ['female', 'weimrfz', 3, ['anxinmrfz', 'gongchoumrfz', 'yinshimrfz'], []],
      yaxinmrfz: ['female', 'xiemrfz', 4, ['lingdingmrfz', 'yabengmrfz'], []],
      chuxuemrfz: ['female', 'xiemrfz', 3, ['shengnvmrfz', 'shenshemrfz'], []],
      shixiemrfz: ['female', 'samrfz', 3, ['qianzongmrfz', 'xiedumrfz', 'lijimrfz'], ['hiddenSkill']],
      hongsunmrfz: ['female', 'samrfz', 4, ['chihenmrfz', 'haomingmrfz'], []],
      xiyinmrfz: ['female', 'samrfz', 3, ['sheyingmrfz', 'chaozaimrfz'], []],
      yemomrfz: ['female', 'weimrfz', 3, ['biaolimrfz', 'ymkongwomrfz'], []],
      jingzhemrfz: ['female', 'yanmrfz', 3, ['chunleimrfz', 'zheqimrfz'], []],
      longshelanmrfz: ['male', 'bomrfz', 4, ['tiaojiumrfz', 'pianfengmrfz'], []],
      spamiyamrfz: ['female', 'luomrfz', 5, ['amy_qingyanmrfz', 'yingxiaomrfz'], []],
      amiyamrfz: ['female', 'luomrfz', 4, ['tongganmrfz', 'qinghemrfz'], ['zhu']],
      docmrfz: ['male', 'orthermrfz', 4, ['yizhemrfz', 'zhulimrfz'], []],
      // innamrfz: ['female', 'orthermrfz', 4, ['shuangzimrfz'], []],
      linshimrfz: ['female', 'samimrfz', 3, ['jiangtumrfz', 'jieshimrfz'], []],
      medical_amiyamrfz: ['female', 'luomrfz', 3, ['tongqingmrfz', 'cibeimrfz'], []],
      spfenmrfz: ['female', 'luomrfz', 4, ['xiaozhimrfz', 'zhishoumrfz'], []],
      hainimrfz: ['female', 'a_groupmrfz', 3, ['jingchaomrfz', 'cehuimrfz'], []],
      shenxunmrfz: ['female', 'a_groupmrfz', 5, ['yuchaomrfz', 'yanhuimrfz'], []],
      mingjiaomrfz: ['female', 'luomrfz', 3, ['suozemrfz', 'youyimrfz'], []],
      daifeienmrfz: ['female', 'weimrfz', 3, ['zhuofengmrfz', 'qianggongmrfz'], []],
      xirenmrfz: ['male', 'gemrfz', 4, ['suximrfz', 'sanzhongmrfz'], []],
      //————测试————//
      //ceshisjzx:['female','shen',5,['diymengxian','diyfujing','diyhesheng'],[]],
    },
    characterIntro: {
      friston3mrfz: 'S-C型四轮作业平台Friston-3,罗德岛智能作业平台研发团队正式成立后的首个成果.Friston-3由可露希尔亲自主持概念设计、落地组装与测试应用,依托于PRTS,实现了从底层代码到外部模块的全面革新.相比罗德岛上的其他改型作业平台,他更加轻便,却拥有更为全面也更为稳定的性能,现作为重装干员参与相关作战任务.</br>【权限记录】</br>有关Friston-3核心代码的来源、编写思路及更多的设计细节,暂不向各位干员开放查询权限,如有疑问可直接咨询可露希尔.',
      talaidingzhenmrfz: '‘今天我很荣幸,作为一个卡兹戴尔的孩子,能来到伦蒂尼姆,讲我和萨卡兹朋友们的故事.<br>我的村庄叫巴别塔,小小的,但是军委会和十王庭却很大.<br>这个世界不但属于我,也属于我的萨卡兹朋友们.<br>我们魔族佬说,一条死魂灵中都有十万个祖宗.<br>我最近一直在努力学习,在书本中学习,也在战场上学习.我想告诉大家,特蕾西娅可以教会我们很多很多.<br>我希望大家,特别是小朋友们,能来到卡兹戴尔的大自然中学习,让我的萨卡兹朋友们来教会你们.’',
      shuangyemrfz: '霜叶,前哥伦比亚少年兵,所属部队覆灭后被<退役>.在随后的流浪佣兵生活中和罗德岛建立关系,经过一段时间合作后被吸收进入罗德岛.</br>拥有非常丰富的战场经验,本身的战斗技巧也不容小觑,对罗德岛来说,是不可多得的优秀战力.',
      yueyuemrfz: '跃跃,本名卡莉·兰德,活跃于玻利瓦尔境内冲突频发的地区,承接各方势力的短期雇佣,暗中给敌对势力制造混乱.</br>为寻求新工作主动接触了当地的罗德岛办事处,对外勤干员的工作表现出浓厚兴趣,双方彼此了解后签订了合作协议.',
      lutuomrfz: '露托,曾在玻利瓦尔各交战地区活动,不从属于任何当地组织,以战场打扫工作为生.现今在本舰接受治疗,并与后勤部签订合作协议,偶尔以战场环境顾问的身份支援外勤任务.',
      shendianmrfz: '深靛,来自伊比利亚的流浪术师.曾经是一座海滨灯塔的见习看守人.在游历期间,与正执行外勤任务的蓝毒和格劳克斯相识.后经蓝毒介绍,入职罗德岛.',
      acemrfz: '罗德岛精英干员Ace,参与切尔诺伯格行动,因掩护博士救援小队撤退而阵亡.</br></br><span class=firetext>罗德岛会铭记您的贡献.</span>',
      baocunzhemrfz: '摘自PRTS的梗概</br>‘保存者’,前人类文明休眠计划的人格模拟,也是特雷弗·弗里斯顿.在4,765,403天的时光中践行着前文明的计划守望者庞大的石棺群,但在漫长的等待与空寂中失去了希望,直到克丽斯腾来访后的对谈让他对泰拉重新燃起了信心,决定以石棺中所有人永远沉睡的代价将最后的前文明能源供给为克丽斯腾突破天空屏障的巨炮.知晓凯尔希的本质,通过<辩论>的方式了解了博士与凯尔希的决心,最后请求凯尔希删去他这万年来的记忆,但在最后一刻被误入的霍尔海雅当作<神明>,被其存储记忆的源石技艺抢救下来,在保存了弗里斯顿最基础记忆的情况下被转制成为罗德岛<自研作业平台>Friston-3.',
      yizumikemrfz: '临近进化奇点的完美生物,大群的建言者与引领者,<后生的初生>,海嗣.',
      kelisitengmrfz: '摘自PRTS的梗概</br>克里斯滕·莱特,莱茵生命总辖构件科主任兼联合创始人,特里蒙理工大学高能物理博士,出身于著名的莱特家族.塞雷娅称呼其为<总辖>.</br>与塞雷娅是大学同学,又是最要好的朋友,心有灵犀,互相认为对方是唯一理解自己的人.两人一拍即合,一同创建了莱茵生命.但在炎魔事件后,克丽斯腾被塞雷娅指出其行为越过了她的底线,导致塞雷娅与克丽斯腾决裂,离开莱茵生命.</br>359号基地事件期间,斐尔迪南企图架空克丽斯腾的权力,但在塞雷娅与克丽斯腾的磋商下,斐尔迪南的图谋最终失败.',
      shuangxingmrfz: '摘自PRTS的梗概</br>霜星,本名叶莲娜,卡特斯族,整合运动法术部队干部,雪怪小队领袖.小时候在源石矿场目睹了家人被乌萨斯军官处死,后被爱国者的游击小队救下,被爱国者收为养女并与爱国者一同加入整合运动.拥有特殊体质,体温极低,并能释放出强力的寒冰系源石技艺,但矿石病感染已经进入晚期.在切尔诺伯格分城与罗德岛战斗时与博士结识,在交战中逐渐认同了罗德岛的理念.昏迷后被幻影弩手带走打算撤回切尔诺伯格,醒来时得知了雪怪小队阵亡的消息,返回龙门与罗德岛战斗,决定用自己最后的生命坚定罗德岛的决心.最终击溃了罗德岛的防线,却耗尽了自己的全部精力.临死前源石病病症消失,体温回归正常并表示愿意加入罗德岛,最后死在博士的怀里.遗体被博士带回罗德岛,由迷迭香进行处理.',
      aiguozhemrfz: '摘自PRTS的梗概</br>爱国者,本名博卓卡斯替,整合运动干部,霜星的养父.属于萨卡兹中的古老分支——温迪戈,且是最后一位纯血温迪戈.与凯尔希和特蕾西娅是旧识.曾与赫拉格同为乌萨斯军官,后不幸感染矿石病并隐瞒了病情.因在镇压感染者暴动中误杀自己的儿子格罗瓦兹尔而决定放弃军官身份组成游击队,在乌萨斯的雪原上游走,保护感染者.在雪原上的矿场救下即将被处死的霜星.后在塔露拉的邀请下加入整合运动.对下属整合运动军纪要求十分严格.非常尊敬赫拉格,并与其达成了互不开战的承诺.在守卫切尔诺伯格核心城时固执地与罗德岛发生战斗,最终以自己的阵亡反抗命运.',
      doushitalulamrfz: '摘自PRST的梗概</br>塔露拉,全名塔露拉·雅特利亚斯,种族德拉克.整合运动领袖兼发言人,性格坚定而富有感染力.使用火焰系源石技艺.爱德华的遗腹子.幼年时与陈相伴,后被科西切公爵掳走并受其教育.为防止科西切利用自己,将一小块源石结晶刺进自己的胳膊,成为了感染者,后将科西切击杀.为了自己的理想在乌萨斯的雪原上建立了感染者组织<整合运动>.但在到达雪原上的某个村庄时,目睹了人们对感染者残酷对待的现实并对自己的信念产生怀疑.受科西切留下的法术的影响,其身体被科西切的意识控制.随后将整合运动单纯地用作工具.与阿米娅和陈于切尔诺伯格核心城的指挥塔塔顶决战后,在两人的劝说下回归其原本人格,被罗德岛收监.后被九劫走.目前扣押于新整合并与其一同活跃于维多利亚,由于其被黑蛇掌控时的作为并不被维多利亚人所知,因此作为新整合用以拉拢维多利亚感染者的旗帜.',
      aibulanamrfz: '摘自PRST的梗概</br>深池领袖,拉芙希妮的姐姐.父母成为政治斗争牺牲品遇刺身亡后姐妹二人一同被橡林郡的沃里克伯爵收养、教导.不满足于沃里克伯爵建立塔拉政权、自己作为傀儡统治者的野心而亲手烧死了他,引发橡林郡内部的局势倾覆,乘机号召起塔拉人建立了深池,离开了橡林郡.成为领袖的爱布拉纳让妹妹作为影子的领袖,尽管不堪忍受深池残酷行径的妹妹在小丘郡事件中被罗德岛精英干员Outcast救下后便逃离了深池,又联合了塔拉人出身的<铁公爵>威灵顿,登上了许久未曾停靠移动城市的<加斯特里尔>号高速战舰,率领深池的队伍与威灵顿公爵的军队重返橡林郡,在城外的盖尔王古城与妹妹重逢.在伦蒂尼姆郊外独自遇到整合运动,并与塔露拉发生冲突.源石技艺燃起的火焰能够让死去的人重新站起来,成为她的战士.',
      teleixiyamrfz: '特蕾西娅,特雷西斯的妹妹,巴别塔的领袖,萨卡兹的魔王,一位谦卑的英雄,一个瑰丽的梦想.未来在她眼中凝聚,道路在她脚下消散.',
      teleixisimrfz: '特雷西斯,特蕾西娅的兄长,卡兹戴尔的摄政王,萨卡兹的利刃,一位坚韧的英雄,一个孤独的梦想.道路被他的利刃劈开,代价是他的未来.',
      qiaojiakelifumrfz: '设计:落尘星河<br>‘桥夹’克里夫,原名鲁伯特,黑钢国际的创始人,猎人伍德洛·比安奇的旧友.曾领导若干人离开拉特兰远赴哥伦比亚参加独立战争.期间在某次次营救计划中派遣伍德洛的队伍作诱兵,但因为各种原因无法按原计划行动导致伍德洛被俘.派遣B.P.R.S.前往达维镇前委托杰西卡将克里夫与伍德洛某位战友遗物的一枚子弹交予伍德洛.巴伦基地接驳达维镇,克里夫与伍德洛前后会面两次,在二人的第二次对峙中认输,但被伍德洛以<应背之罪>的理由和解,在安排好伍德洛的后续事项后与银行行长达成交易,填补资金空缺的同时收获了平台.',
      puruisaisimrfz: '博士面对石棺的回忆中的神秘女性人物,是源石的起点,曾与博士亲密无间.',
      ailinimrfz: '艾丽妮,前伊比利亚审判官,大审判官达里奥的学生.对伊比利亚历史、律法、人文地理等知识十分了解.在<愚人号>事件后,辞去审判官职务,经凯尔希亲自推荐,现以审判庭信使的身份与罗德岛签订合作协议,为应对来自海洋的威胁而做准备.',
      hongxuemrfz: '鸿雪,自称阿芙朵嘉·锐笔.可确认阿芙朵嘉为其本名,但本人不愿透露真实姓氏.在风险研判后,人事部决定不进行进一步的询问.',
      xiaoyangmrfz: '艾雅法拉,火山学家,天灾信使.于高等源石技艺、高能量法术释放等领域展现出了卓越的天赋.现于罗德岛接受治疗,同时为罗德岛提供天灾研究、环境观察与评估、危险地形航行保障等相关服务.',
      yinhuimrfz: '银灰,谢拉格军阀,喀兰贸易公司董事长,希瓦艾什家族现任族长.在经济贸易、国际政治、外交手腕与战术策划上有独到见解.于罗德岛的部分行动中提供战略支援.鉴于其实际目的不明、合作态度暧昧等理由,建议在交流中持保守态度以杜绝额外风险.',
      lingzhimrfz: '灵知,前喀兰贸易首席技术执行官.通过喀兰贸易与罗德岛的特别协议,作为干员加入罗德岛.主导了喀兰贸易众多核心技术的开发以及工业设施的设计,同时在喀兰贸易时期就已对源石有相当深入的研究.现作为罗德岛主要研究室的一员,活跃于科研一线.',
      liumingmrfz: '流明,经由极境以及凯尔希引荐,现作为罗德岛驻伊比利亚干员,协助罗德岛执行伊比利亚地区感染者的医疗救护工作.同时,流明也会列席罗德岛、阿戈尔、审判庭三方的一系列会议,基于自己的视角提出建议,与各方一起寻找一种协同合作、面对未来的可能.',
      chizuimrfz: '斥罪,原为叙拉古城邦法官,通过干员德克萨斯与罗德岛建立联系.于后勤部工作,担任罗德岛法律顾问一职.',
      amiyamrfz: '阿米娅,罗德岛的公开领袖,在内部拥有最高执行权.虽然,从外表上看起来仅仅是个不成熟的少女,实际上,她却是深受大家信任的合格的领袖.现在,阿米娅正带领着罗德岛,为了感染者的未来,为了让这片大地挣脱矿石病的阴霾而不懈努力.',
      niyanmrfz: '萨卡兹雇佣兵泥岩,随军加入整合运动后,由于意见不合而带领小队成员远离了乌萨斯.完全没有参与整合运动在切尔诺伯格及龙门的行动.为了寻找落脚点,泥岩带队前往莱塔尼亚,在当地吸纳了大量莱塔尼亚的感染者后,泥岩被众人推崇为领袖,开始以<泥岩小队>的名号被人所知.尽管泥岩多次试图避免与其他势力发生冲突,但她们依旧一次又一次地被卷入纷争,为了避免更多无意义的牺牲,泥岩选择逃往卡兹戴尔.在卡兹戴尔境内与精英干员Logos接触,随后者前往罗德岛.',
      chengshanmrfz: '澄闪,罗德岛后勤干员,主要工作地点为罗德岛理发室,一般情况下不作为外勤干员派遣.使用特殊形制的法杖,操控<浮标>对敌人进行打击.',
      wmrfz: '萨卡兹佣兵头目,W.曾参与卡兹戴尔漫长的内战,其小队以残暴而高效的作战手段闻名.在切尔诺伯格事件中与罗德岛发生冲突,后因为某些原因叛出整合运动,在凯尔希医生亲自进行了充分交涉后,与罗德岛签订战略合作条款.',
      spsikadimrfz: '照这个方向发展下去,就不会有人关心她究竟是什么了.不是斯卡蒂的问题,一个人也不能改变什么.我说的是,这种生理状态,以及该类生物性物质表现出的最终状态,可能会摧毁我们社会、历史与科学的所有度量衡.希望我们简陋的医疗科研条件现在还够使上点劲......',
      sikadimrfz: '斯卡蒂,赏金猎人,现为罗德岛所雇佣.在过去完成的赏金任务中,于对抗大型生物,破坏硬目标,攻坚战,歼灭战等多类行动中展现出强劲实力,推测与其过往战斗经验相关.成为赏金猎人之前的履历缺失.现于罗德岛某攻坚小队供职,同时身兼单兵任务预备执行干员一职.......',
      spdegoumrfz: '缄默德克萨斯,企鹅物流员工,最后的德克萨斯家族成员,单兵作战能力出类拔萃.罗德岛的老朋友.当德克萨斯带着后来成为伺夜与斥罪的两人踏入罗德岛时,许多人都是震惊的.毕竟,从着装上就能判断,不必说伺夜与斥罪,光是她的身上,就散发着浓厚的叙拉古气息.她回叙拉古了.对她有所了解的干员,对于这个结论都有些惊疑不定,毕竟,关于德克萨斯的一个共识是——她和叙拉古有关,但没有人知道她的过去是怎样的.所幸,紧跟其后的企鹅物流众人打消了这种疑虑.毕竟,有关德克萨斯的另一个共识是——只要和企鹅物流在一起,她就始终是那个德克萨斯.当然,等到众人得知,德克萨斯在叙拉古经历了什么,并且又为罗德岛带来了怎样的两位人物后,一个新的共识诞生了——德克萨斯真可怕.',
      maennamrfz: '设计:落尘星河/林登万<br>玛恩纳·临光,临光家前家主,干员临光与瑕光的叔叔,迄今并未获得过任何形式的骑士封号.于特锦赛后约两个月,接受罗德岛的合作邀请,协助罗德岛处理卡西米尔地区的各项事务.',
      splinguangmrfz: '耀骑士临光,卡西米尔耀骑士.在掩护己方队员、机动作战、歼灭战与开阔地带作战中体现出极高的战斗技巧和个人军事素养.</br>在重返卡西米尔并夺得第二十四届骑士特别锦标赛决斗赛冠军之后,留在卡西米尔处理后续事务.作为合作干员为罗德岛驻卡瓦莱利亚基办事处提供战术支援,必要时也会去往其他地区协助本舰展开各项行动.',
      kaierximrfz: '凯尔希,罗德岛高层管理人员之一,罗德岛医疗项目领头人.在冶金工业、社会学、源石技艺、考古学、历史系谱学、经济学、植物学、地质学等领域皆拥有渊博学识.于罗德岛部分行动中作为医务人员提供医学理论协助与应急医疗器械,同时也作为罗德岛战略指挥系统的重要组成人员活跃在各项目中.',
      shanmrfz: '山,哥伦比亚某建筑业龙头公司CEO之子,举家被竞争对手陷害而入狱,离开监狱后,加入罗德岛.</br>拥有几乎天生为战斗而生的体魄,现作为近卫干员活跃于各种任务的第一线.',
      geleidiyamrfz: '歌蕾蒂娅,阿戈尔人,阿戈尔技术执政官、荣誉军团长,阿戈尔军事团体<深海猎人>总战争设计师之一.登陆时间地点俱不明.于对抗大型生物,破坏硬目标,攻坚战,歼灭战,机动战与谍报战等多类行动中展现出非凡实力.现以合作姿态协助罗德岛、辅助罗德岛部分工作,在保留阿戈尔国家职能身份的同时,兼任罗德岛的阿戈尔事务负责人.',
      chenmrfz: '陈,龙门高级警司,龙门近卫局特别督察组组长,毕业于维多利亚皇家近卫学校,成绩优异,表现突出.在龙门近卫局供职期间,力主取缔龙门境内非法活动,对抗暴力犯罪和有组织犯罪,追缉武装逃犯与国际重犯等行动,并取得多项重大成果.</br>现作为特别人员协助罗德岛行动,并为现场提供战术指挥支援.',
      xingxiongmrfz: '星熊,龙门近卫局特别任务组精英干员.</br>存在数项指控记录.</br>经龙门总督魏彦吾交涉,龙门近卫局依星熊的优异能力与良好表现,破格将其吸纳进近卫局特别督察组.在处理高危险性犯罪事件、要员保护、灾害紧急救援等领域表现出较高专业性.</br>现作为重装干员协助罗德岛行动,并为现场提供战术执行与指挥支援.</br>现作为特别人员协助罗德岛行动,并为现场提供战术指挥支援.',
      kanielianmrfz: '卡涅利安,出身萨尔贡深处不受王酋管辖的某个古老部族,目前外出游学中.因接受莱塔尼亚霍恩洛厄伯爵的雇佣,作为其侍从长期停留于莱塔尼亚地区.现与罗德岛达成合作关系,作为干员为罗德岛执行莱塔尼亚境内的相关任务.',
      kuiyingmrfz: '独自行动于维多利亚及周边地区的刺客傀影,过去行踪难以查定,背景履历尚未完全实证.</br>现作为特种干员加入罗德岛,作战能力优秀,但仍需谨慎对待.',
      mositimamrfz: '莫斯提马,企鹅物流员工,总是单独行动,此前履历不详.',
      keebomrfz: '刻俄柏,流浪者,从有意识开始就在四处流浪,在流浪途中被野外恶劣环境感染,凭着常人所不具备的直觉和意志一直撑到了现在.</br>现已被罗德岛救助并顺利通过干员测试,成为罗德岛的一员.',
      feiyameitamrfz: '菲亚梅塔,拉特兰公证所高级特派员,职务名经本人强烈要求,不予记录.现依据罗德岛与拉特兰教廷的合作协议,从罗德岛获得补给,并提供相关服务.</br>天启惩罚者？每个月还会更新？让我把这些玩意输进终端归档不如直接杀了我.',
      jicimrfz: '精通剑术与药剂制作的罗德岛前线作战干员,棘刺.出身于伊比利亚腹地,于当地宗教局势动荡中离开家乡,在脱离伊比利亚地区后,受邀来到罗德岛.</br>以上关于伊比利亚境内局势的部分为棘刺自述,尚未完全经过考证.',
      yeyingmrfz: '夜莺,萨卡兹人,感染者援助团体<使徒>的一员,其它履历缺失.于源石技艺、战场急救、临床医学等领域具备高超天赋.</br>现于罗德岛接受治疗,同时为罗德岛提供战场医疗救护、源石技艺援护等服务.',
      helagemrfz: '赫拉格,曾隶属于乌萨斯帝国近卫军,切尔诺伯格感染者地下诊所<阿撒兹勒>的现任管理者,其他相关履历缺失.拥有成熟的军事理论体系知识,战斗技巧几乎能满足绝大部分类型作战的需求.现正依合作协议长驻罗德岛,为罗德岛提供战术指挥支援.',
      wendimrfz: '温蒂,生物工程学专家,伊比利亚科研世家出身,罗德岛成立之初就加入的研究者.</br>经过本人长期调整与测试,最终完成了为自己量身定做的武器.并根据自身意愿成为干员,在战场上为同僚提供远程支援.',
      senranmrfz: '森蚺,嘉维尔的故乡——阿卡胡拉中某部族的族长,经过干员测试后加入罗德岛,同时接受治疗.</br>拥有不输于嘉维尔的身体素质,目前和她的伙伴<暴躁铁皮>共同活跃在战场上.',
      ashmrfz: '<span class=firetext>联动:彩虹六号:围攻</span></br>灰烬,彩虹小队成员之一,暂时担当小队队长职务,严于律己,恪尽职守,为整个小队谋划行动方针.</br>灰烬使用一把M120CREM爆破弹发射器,可以对重装目标造成伤害,也可破开障碍物,为小队行动增加战术选择.',
      kamimrfz: '<span class=firetext>客门,我以最谦卑的姿态恳求您借我一点点力量</span></br>哥伦比亚出身的干员异客,曾在十三岁时就以极其优异的成绩跳级毕业,随后被源石工程与应用学专家索恩教授相中提拔为研究助手,进入布莱恩创生科技的研究所学习.于近二十余年前随某项目深入萨尔贡,之后销声匿迹.之后以伊巴特地区黑市主要成员的身份与罗德岛接触,并在脱离黑市后,单纯以感染者身份来到罗德岛接受治疗,并以工程部干员的身份活跃在各项行动中.',
      nianmrfz: '年,无业游民,熟习各类金属工艺,拥有与身份不符的渊博冶金知识.现凭访客身份逗留于罗德岛,偶尔为罗德岛的金属加工项目提供建议.声称自己擅长音像娱乐工作,经常提供一些罗德岛干员普遍不太喜爱的音像产品.',
      lingmrfz: '令,寓居尚蜀的诗人,与炎国司岁台等政府部门均有联系,在尚蜀事件中接触罗德岛,现通过审核,以访客身份驻留本舰.',
      fengdimrfz: '风笛,维多利亚皇家近卫学校毕业,在维多利亚军队中服役满3年后,退役并经由陈警司介绍加入罗德岛.</br>接受过系统训练的职业军人,经过一段时间的磨合,在罗德岛的各类任务中体现出了专业的战斗技巧与战术素养.',
      qinliumrfz: '琴柳,前维多利亚仪仗队执旗手,服役于维多利亚小丘郡地方部队,经历战乱后,由小丘郡办事处负责人引荐,成为罗德岛合作干员.接受过维多利亚军的基础训练,体能优异,在各类任务中展现出了强大的支援能力.',
      laolimrfz: '老鲤,私家侦探,龙门鲤氏侦探事务所的创办者.在罗德岛于龙门发展业务的过程中与罗德岛相识,随后建立合作关系.为罗德岛提供关于龙门本地信息的咨询服务,也向罗德岛引荐过一些人才.',
      amrfz: '阿,经龙门鲤氏侦探事务所所长老鲤推荐而来的医疗人员,曾是活跃于龙门灰色地带的知名黑医生.</br>在加入后,展现出了惊人的医疗理论知识储备以及临床经验,但也表现出让人担忧的医疗风格.</br>不过根据凯尔希医生的综合评估,被暂时推荐到医疗装备科和技术开发组.',
      heimrfz: '黑,前汐斯塔市市长SP兼城市治安局局长,随干员锡兰共同加入罗德岛.</br>在隐秘行动、侦察与反侦察、野外求生、弩使用等技能上拥有卓越的造诣.在担任博士护卫的同时,负责一部分罗德岛基层干员的训练工作.',
      chongyuemrfz: '重岳,留舰人员年、夕、令的兄长,与炎国兵部、司岁台等政府部门往来密切,此前担任移动城市玉门的武术教官,已卸任.因探视亲属来到罗德岛,经过审核,暂时凭访客身份驻留本舰.重岳具有丰富的战场经验,为罗德岛提供过独特的作战建议,但应凯尔希医生要求,重岳本人较少直接参加任务.',
      anjielinamrfz: '安洁莉娜,本名安心院安洁莉娜.于叙拉古从事情报递送、货物运输等公开活动,推测身份:信使.</br>现作为实习术师干员,为罗德岛提供后勤保障、战场辅助与战术协同等服务.',
      haojiaomrfz: '号角,毕业于维多利亚皇家近卫学校,现为维多利亚风暴突击队第二分队指挥官.于伦蒂尼姆事件中与罗德岛协同作战,经精英干员Misery介绍,与罗德岛签订战略合作条款.',
      yanweimrfz: '焰尾,卡西米尔的感染者骑士,同时也是自发组建的感染者骑士团<红松>的实际领袖.于卡西米尔合作期间与罗德岛接触,并主动寻求罗德岛的治疗.',
      xigymrfz: '夕,炎国画家,待业.在留舰人员年的积极行动下,被以访客身份挟持至罗德岛.擅长绘画,尤其是炎国传统绘画.现寓居罗德岛某偏僻走道的墙内.',
      nengtianshimrfz: '能天使,拉特兰公民,适用拉特兰一至十三项公民权益.企鹅物流公司成员.从事秘密联络,武装押运等非公开活动,推测身份:信使.于合约期内任企鹅物流驻罗德岛联络人员,同时为罗德岛多项行动提供协助.',
      yuanyamrfz: '<远牙>骑士查丝汀娜,于特锦赛上打响名气,目前隶属于由感染者骑士组建的红松骑士团,是一名在卡西米尔拥有相当程度知名度的感染者骑士.在卡西米尔本届特锦赛及一系列风波之后,红松骑士团与罗德岛达成合作关系,远牙骑士也作为合作者来到罗德岛,接受矿石病相关治疗,并为罗德岛提供战斗支援.',
      midiexiangmrfz: '迷迭香,罗德岛精英干员,熟练掌握极稀有的源石技艺,于对抗大型生物,破坏硬目标,设施紧急制动与中断小规模冲突等任务中表现出色,并于攻坚战、阵地战与歼灭战中体现出极强的战场掌控力与显著的战术价值.现由凯尔希指派,作为歼灭战的核心发起人之一发挥作用.</br><span class=firetext>迷迭香的所有其他档案皆移入高权限资料库.</span>',
      spzzxpmrfz: '陈,前龙门高级警司,前龙门近卫局特别督察组组长,毕业于维多利亚皇家近卫学校,成绩优异,表现突出.在龙门近卫局供职期间,力主取缔龙门境内非法活动,对抗暴力犯罪和有组织犯罪,追缉武装逃犯与国际重犯等行动,并取得多项重大成果.</br>现辞去职务,正式成为罗德岛的一员.依本人意愿,任务多以外派为主,为各地外派干员提供有力支援以及现场指导.',
      shuiyuemrfz: '水月于玻利瓦尔的多索雷斯城与我们的部分干员有所接触,并随行至本舰,经相关干员初步问询考察后批准其暂时留舰.</br>其学习能力较为优秀,现阶段已经能协助完成相当一部分的文职工作内容,或可考虑往干员的方向培养.经调查与评估后批准其长期留舰.',
      qiubaimrfz: '仇白,剑客,出生于炎国姜齐城附近的水寨,后因家庭变故离开故乡,常年行走于炎国各地,并无固定居所与工作.</br>经调查,仇白曾在不同事件中与多位干员有过接触,后接受罗德岛的合作邀请,为罗德岛在炎国境内的各项事务提供支持.',
      spyoulingshamrfz: '幽灵鲨,本名劳伦缇娜,阿戈尔军事团体<深海猎人>成员,在对抗大型生物与破坏硬目标等行动中展现出极强的技巧.</br><愚人号>事件后,其精神状态趋于稳定,记忆回复,情绪趋于稳定.',
      baitiemrfz: '白铁,机械工程师,伦蒂尼姆市民自救军十一小队队长.于伦蒂尼姆事件中与罗德岛协同作战,后与罗德岛签订长期合作条款,作为工程干员与行动队成员活跃在维多利亚地区的各项任务中.',
      weinamrfz: '推进之王,本名维纳,维多利亚公民,大部分履历缺失.存在数项未被证实的指控记录.在歼灭战、攻坚战、对抗硬目标等任务中表现出色.于多个测试中皆获得优异成绩,遂获准加入罗德岛.现作为先锋人员,于罗德岛某作战小队担任队长.',
      siyemrfz: '伺夜,叙拉古贝洛内家族最后一任领袖,叙拉古特别行政城市新沃尔西尼市长候补之一,通过干员德克萨斯,代表所属城市与罗德岛建立合作关系.</br>擅长中距离战斗,并且在种种任务上展现出了相当的谋略与领导力.',
      spjiaweiermrfz: '嘉维尔,现在仍是罗德岛医疗部的一员,但在罗德岛需要她发挥自己的战斗力而非医学素养的时候,她也会拿起战斧,冲锋陷阵.',
      semrfz: '史尔特尔,神秘的萨卡兹少女,或因矿石病影响导致缺失性记忆障碍,其情况在矿石病病理中也极其少见,现于罗德岛接受治疗中.</br>在测试过程中展现出了原因不详的强大战斗能力,很快成为了作战干员.',
      linmrfz: '林,本名林雨霞,龙门人.本职工作不明,本人提供的档案资料信息十分有限,同样存疑.</br>于<玉门事件>后,主动提出与罗德岛正式建立合作.为罗德岛在龙门收治感染者的工作提供帮助.',
      duoluoximrfz: '多萝西,莱茵生命源石技艺应用科主任,在罗德岛选择使用自己的本名作为代号.</br>多萝西·弗兰克斯小姐以<莱茵生命与罗德岛的合作项目负责人>这一身份加入我们,将会在许多研究项目上为罗德岛提供帮助.身为源石技艺应用科的主任,她对源石技艺本身的理解毋庸置疑,而在源石技艺的应用上更是炉火纯青.',
      kongxianmrfz: '设计:今天整点什么、林登万<br>空弦,来自兰登修道院的修士,本名席德佳.出于某些商业合作目的暂留罗德岛,并积极提出各项合作条款,敦促双方展开友好商业来往.同时在各项行动中均展现出极优秀的作战技巧,经本人要求,现作为罗德岛狙击干员活跃于各项任务中.',
      spyedaomrfz: '<span class=firetext>联动:怪物猎人</span></br>夜刀,经过短暂的治疗后,从东国回到岗位,继续履行罗德岛A4行动组组长的职责.换上了由艾露猫打造的全新装备,她将会承担更多高难度的攻坚行动,而她的意志也比以往都要强大.',
      yineisimrfz: '伊内丝,前萨卡兹佣兵头目.曾短暂参与卡兹戴尔的混乱内战,直到切尔诺伯格事件时,她借助假死彻底消失在所有人的视野中.此后,伊内丝隐藏了自己的踪迹,但通过最近的伦蒂尼姆事件,她正式与罗德岛回复了联系.期间她经历了什么无从查验,最后在阿斯卡纶的担保下与罗德岛签订了战略合作条款.',
      miumiumrfz: '缪尔赛思,莱茵生命生态科主任,哥伦比亚生命科学与环境科学领域专家,在特里蒙事件中与罗德岛取得联系,后与罗德岛签订长期合作条款,与生物工程研究室开展多项联合科研项目,并作为先锋干员参与相关作战任务.',
      heijianmrfz: '黑键,莱塔尼亚平民,于维谢海姆事件中感染矿石病,经干员芙蓉介绍来罗德岛治疗,在源石技艺方面展现出不凡天赋.经考核后,作为外勤干员加入罗德岛.',
      yifulitemrfz: '伊芙利特,前莱茵生命医疗对象,重度感染者.拥有极高的源石适应性,伴随有多发性点火现象.进入莱茵生命前的履历缺失.</br>现于罗德岛接受治疗,由医疗干员赫默担任监护与担保人.',
      sphemomrfz: '赫默,<特里蒙科学伦理联合宣言>发起人,莱茵生命总辖构件科执行顾问,在医疗事务方面与罗德岛展开了深度合作.</br>本人拥有丰富的医学临床经验,在罗德岛接受矿石病相关治疗的同时,为罗德岛提供医学支持.',
      saileiyamrfz: '塞雷娅,前莱茵生命防卫科主任.于生命科学、微生物学、源石技艺等领域皆有建树,同时于歼灭战、要员保全、异常事态处理等任务中表现出强大实力.</br>目前与罗德岛在科研等多个领域皆有合作,同时,正与罗德岛针对深入合作计划进行磋商.',
      spweicaomrfz: '苇草,驻留罗德岛的维多利亚南部办事处期间,曾提出撤离申请,近期再次成功与罗德岛建立联络.目前正以深池名义带领小股部队在维多利亚境内活动,以救助被暴力胁迫的塔拉人为主要行动目标.',
      huoerhaiyamrfz: '霍尔海雅,前梅兰德基金会所属特工,在凯尔希医生与博士的引荐下加入罗德岛.</br>擅长单兵作战,并且能够应对各种极端环境,在各类隐秘行动中发挥了重大价值.',
      huangmrfz: '煌,罗德岛精英干员,在机动作战、歼灭战与突袭作战中体现出了专业的战斗技巧与战术素养.现由阿米娅带领,作为攻坚战的战术核心之一发挥作用.',
      linglanmrfz: '铃兰,本名丽萨,姓氏应监护人要求隐去.铃兰小姐年纪尚小,但血统使她拥有了优秀的源石技艺天赋.在罗德岛接受治疗的同时,也在接受凯尔希医生的指导.在铃兰小姐主动提出申请后,被批准在有其他干员随行的情况下参与一些低难度任务.',
      shanlingmrfz: '闪灵,萨卡兹医师,前萨卡兹医疗组织<赦罪师>成员,感染者援助团体<使徒>的一员.于源石技艺、战场急救、医学理论、临床医学等领域拥有渊博知识.</br>现作为医疗干员为罗德岛医疗部门提供源石技艺理论,并为多项行动提供战场医疗救护服务.',
      maizhelunmrfz: '麦哲伦,莱茵生命实验室外勤专员,在合作协议的作用下,暂计划以罗德岛为据点,开始新一轮的探索活动.擅长操控高度模块化无人机,因地制宜进行攻击或支援友军.',
      cuoemrfz: '嵯峨,东国出身的云游僧人.部分经历不明.原本只是因迷路而误入罗德岛办事处,经询问本人也有求职意向,于是随后通过测试加入罗德岛.在此之前似乎已与罗德岛干员炎熔建立关系.</br>十分善用随身的薙刀,身手矫健,作为先锋干员活跃在前线.',
      palasimrfz: '帕拉斯,曾在米诺斯担任祭司职务.在离开雅赛努斯城邦去往阿克罗蒂村任职期间,带领当地民众进行了对萨尔贡周边部落长年侵扰的反抗,并在当地推行旅游及文化产业的发展.后因矿石病病况恶化,来到罗德岛进行秘密治疗.',
      xiaguangmrfz: '瑕光,本名玛莉娅·临光,来自卡西米尔的年轻骑士,干员临光的妹妹,曾有骑士竞技经验,在各项测试中均展露出优秀的作战素质.应本人期望,与干员临光共同作为重装干员行动.',
      spamiyamrfz: '阿米娅,罗德岛的公开领袖,在内部拥有最高执行权.虽然,从外表上看起来仅仅是个不成熟的少女,实际上,她却是深受大家信任的合格的领袖.</br>现在,阿米娅正带领着罗德岛,为了感染者的未来,为了让这片大地挣脱矿石病的阴霾而不懈努力.</br>史载,萨卡兹君王奎隆的佩剑,长度约在0.9到1.2米之间,宽约5厘米,材质不明,通体呈黑色,剑身铭刻萨卡兹传统文字,释作<争斗在此止歇>.',
      zaolumrfz: '早露,切尔诺伯格事变前于切城某中学就读,并担任学生会长.</br>事变后加入罗德岛,隶属后勤部门,工作期间风评极佳.现经本人申请,作为狙击干员转入前线.',
      spshihuaiyamrfz: '诗怀雅,龙门近卫局局长.</br>于汐斯塔度假归来,目前仅以私人身份视情况为罗德岛工作提供协助.</br>龙门近卫局委任状</br>经会议决定,兹任命碧翠克斯·施怀雅为近卫局局长.</br>望日后长定龙门,护一方平安,万民安生.</br>此状</br>龙门总督魏彦吾</br></br>诗怀雅捏着这张薄薄的委任状,郑重地收进抽屉里.纸张之轻、之薄,字之简约,在她手中却仿佛重若千钧.',
      spsongzangrenmrfz: '送葬人,拉特兰公证所法定专业执行者,适用于拉特兰一至十三项公民权益,由现任拉特兰教宗伊万杰利斯塔十一世亲自授予<圣徒>封号.</br>拉特兰并未限制这位特殊的<圣徒>与我们的接触,公证所与罗德岛的合作关系正日趋紧密.干员送葬人现仍旧依合约为罗德岛提供服务,执行拉特兰公民权益相关任务.',
      spjiexikamrfz: '杰西卡·布林雷,因私人原因离开黑钢基地后,选择去往拓荒地,成为了一名治安官.现作为当地办事处的合作干员为罗德岛提供帮助与支持.',
      tifengmrfz: '提丰,活跃于萨米的萨卡兹,以猎人自居,对萨米的自然环境和潜在威胁有着充足的知识储备和应对技巧.现应干员麦哲伦邀请与罗德岛进行合作,协助罗德岛在萨米及无尽冰原地区的事务.',
      fulankamrfz: '芙兰卡,黑钢国际生化防护相应人员安全保障专员,在行动护卫、战术突击、战术协同方面拥有丰富经验与强悍战力.</br>现于罗德岛接受矿石病治疗,并作为黑钢行动干员为罗德岛提供专业安保服务.',
      xingjimrfz: '星极,哥伦比亚某神秘学组织的会员,经由合作协议被派驻至莱茵生命,职位为文献学顾问.由于共发性矿石病与妹妹一起来到罗德岛,在进行矿石病治疗期间通过测试成为干员.可使用独特的剑技,对近战目标造成类似法术的攻击效果.',
      xingyuanmrfz: '星源,本名埃琳娜·乌比卡,莱茵生命能量科研究员.在罗德岛驻留期间则使用其原名作为代号以示区分.</br>使用自制法杖以极具特色的源石技艺制衡敌人,但比起前线作战,本人更希望在后方承接专业研究及器械维护方面的工作.',
      weiweiannamrfz: '薇薇安娜·德罗斯特,莱塔尼亚施彤领选帝侯霍赫贝格家族后裔,前卡西米尔人气竞技骑士.经耀骑士临光举荐,在罗德岛登记为合作干员.</br>擅长使用光影类源石技艺,配以华丽的剑术技巧,能在战场上灵活御敌.驻留本舰期间将为罗德岛提供战术与外勤任务支援.',
      zhanchemrfz: '战车,彩虹小队成员之一,强韧、爽朗且冷静,极为擅长阵地战.</br>主要武器为DP-28轻机枪以及SHUMIKHALAUNCHER<喧闹>发射器,他是整个小队的火力中心,毋庸置疑的战场主宰.',
      shanjimrfz: '闪击,彩虹小队的成员之一,为人幽默和蔼,擅长在室内与街巷环境作战.</br>以手枪为主要武器,同时携带经G52型闪光战术护盾,一旦在近战中开启,将能致盲几米内的作战目标,为整个小队提供战术优势.',
      shuanghuamrfz: '霜华,彩虹小队成员之一,坚定、专注、充满活力,擅长在野外环境作战.</br>除了自身携带的枪械外,霜华携带了SterlingMK2机械夹板<迎宾踏垫>,通过精妙布设,对敌方造成阻碍,为整个小队提供战术支持.',
      spxiaoyanmrfz: '艾雅法拉,火山学家,天灾信使.近年参与拍摄多部火山纪录片,并参与撰写出版火山相关书籍.现于罗德岛继续接受治疗,并视需求参与包括天灾研究在内的多项活动.',
      suxinmrfz: '塑心,本名阿尔图罗·吉亚洛,出身于拉特兰、活跃于泰拉大地的著名音乐家.受莱塔尼亚帝国宫廷、拉特兰教皇厅委托,罗德岛与两方签署协议确认,在受相应人员的严格监管下,允许其以干员<塑心>身份暂留罗德岛.',
      bohuimrfz: '柏喙,雷神工业装备设计师之女,遭遇工厂工人暴动而不幸感染矿石病.</br>现作为医疗救助对象加入罗德岛,依照本人的意愿,允许调入作战部门,她的剑术如同她纺线一般优雅而有韵律.',
      baimianxiaomrfz: '......</br>已在20593个搜索结果中,为您选择了相对精准的答案.</br>白面鸮,前莱茵生命公司,数据维护专员.在医疗类源石技艺领域取得不菲成就,于医疗数据维护,常规医疗方案应用,多项目医疗行为等相关领域,拥有丰富经验.</br>现于罗德岛担任医疗干员,亦就职于医疗部门,某临床实验小组,项目领头人:赫默医生.同时,为罗德岛提供若干项医疗项目的相关辅助工作.</br>......',
      hedeleimrfz: '赫德雷,前萨卡兹佣兵头目.早期履历不详,曾作为护卫部队的一员参与了巴别塔的转移,在巴别塔解体后离开.此后曾以整合运动所属萨卡兹雇佣兵的身份与伊内丝、W一起出现在切尔诺伯格,并在切尔诺伯格事件后消失.再次出现时,赫德雷已在伦蒂尼姆的军事委员会中任职.在取得重要情报后,赫德雷离开军事委员会,同罗德岛重新取得联系.在与阿米娅沟通后,赫德雷再次和罗德岛签订了战略合作条款.',
      zhisongmrfz: '止颂,本名莱辛·梅耶尔,莱塔尼亚路德维格大学旁听生,随干员黑键一同来到罗德岛.经过充分沟通,莱辛与罗德岛签订了合作协议,为罗德岛在莱塔尼亚境内的行动提供协助.',
      cimeimrfz: '刺玫,本名玛格达尔·肖,布伦特伍德镇上血魔大君仪式的幸存者,小镇近乎大半被夷为废墟,她所珍爱的家传温室也被彻底摧毁.</br>受伦蒂尼姆市民自救军成员洛洛与费斯特的邀请,玛格达尔加入自救军,以后勤人员的身份提供帮助,后加入罗德岛.伦蒂尼姆事件结束之后,玛格达尔主动申请回到维多利亚重建家乡,并担任当地罗德岛办事处的联络员.',
      hongmrfz: '红,身份不明,履历缺失,由凯尔希医生接收、监护并担保.于机动作战,特种作战与隐秘作战中表现出极高天赋,成绩斐然.</br>现于凯尔希医生的指导下,作为特种干员为罗德岛提供服务.',
      jianmrfz: '锏,前卡西米尔骑士竞赛三届冠军,喀兰贸易总裁恩希欧迪斯的贴身保镖.基于博士与恩希欧迪斯签订的合同,无限期作为干员加入罗德岛.</br>现作为近卫干员活跃于各种任务之中,以其强大无比的战斗力为其他干员开辟道路.</br></br>我收到一些反馈,说大部分任务有她在的话,和野营没什么区别.这确实不怪博士,她主动去的,而且看起来她还挺乐在其中的.呃,那我也没什么理由反对,不是吗？</br>——■■■',
      dekesasimrfz: '德克萨斯,企鹅物流员工,单兵作战能力出类拔萃.</br>于合约期内任企鹅物流驻罗德岛联络人员,同时为罗德岛的多项行动提供协助.',
      baijinmrfz: '白金,卡西米尔无胄盟刺客,其他履历缺失.在机动作战、歼灭战与巷战中皆表现出极高的战斗技巧与特殊的战术素养.</br>现于凯尔希医生的指导下,作为狙击干员为罗德岛提供服务.',
      yintuoluomrfz: '因陀罗,维多利亚格拉斯哥帮武斗派头目.推进之王的下属之一.在罗德岛担任推进之王的直属护卫,偶尔会被邀请参与一些实战指导的工作(其实就是实战训练的对手).',
      laiyimrfz: '莱伊,雷姆必拓人,无稳定职业,较常从事在雷姆必拓被称为<探井人>的矿井安保工作.偶遇故地重游的阿米娅、博士与暴行后,主动申请加入罗德岛.现作为罗德岛驻舰干员参与各类安保、战斗及勘探任务.',
      wenmimrfz: '温米,出生于雷姆必拓的一座矿业小镇,虽年纪尚小,却在烹饪、机械修理等技术领域展露出了出色的天分.经干员暴行推荐,在监护人阿兰娜的陪同下来到罗德岛接受治疗,同时在舰上学习源石技艺基础课程.',
      meiermrfz: '梅尔,哥伦比亚出身,莱茵生命研究室所属成员,线控机械装置<咪波>的创造者.能力出众,科研能力极强,经营着个人工作室<鲁特拉>.现与罗德岛合作,在建筑、设计、开发方面提供援助.',
      lindongmrfz: '凛冬,切尔诺伯格事变前于切城某中学就读,在校期间已表现出对战斗与突击行为的热情.在多项测试中表现出乌萨斯人与生俱来的强健力量和坚实体质.</br>现作为先锋干员担任作战小队队长.',
      yunxingmrfz: '陨星,前<守林人>组织成员,现自由佣兵,此外履历不详.</br>现作为狙击干员为罗德岛服务,使用手中的弩炮发挥出卓越的范围杀伤力.',
      yumaobimrfz: '羽毛笔,真正玻利瓦尔人某中尉之女,父亲死后被父亲战友潘乔收养,成为其养女,而后一同辗转至多索雷斯.</br>多索雷斯事件后,与龙舌兰一同来到罗德岛,由于身份特殊,经过会议审查,最终同意其加入罗德岛.',
      ailisimrfz: '爱丽丝,罗德岛临时干员,为了归还某位干员的寄存物而来到罗德岛的维多利亚术师,在处理完相关事项前,她会暂留罗德岛.</br>使用着特殊的源石技艺,能够引人沉眠并适当操控梦的内容.',
      tianhuomrfz: '天火,隶属民间源石技艺研究会<狐尾>的核心团体<王者之杖>.拥有地质学与源石地质学双学位,维多利亚高等职业术师,在源石技艺及理论研究方面皆有杰出造诣.</br>现任王者之杖驻罗德岛首席术师,与罗德岛签署合作协议,并为罗德岛的源石理论研究,歼灭战作战等多项任务提供协助.',
      linguangmrfz: '临光,前卡西米尔耀骑士,感染者援助团体<使徒>的一员.在掩护己方队员、机动作战、歼灭战与开阔地带作战中体现出极高的战斗技巧和个人军事素养.</br>现于罗德岛作为重装干员行动,并于现场提供战术指挥支援.',
      haimomrfz: '海沫,在某次针对伊比利亚地区的行动中受到波及,作为伤员被带回本舰施行救治.经考察并结合测试结果,批准其成为外勤干员,于伊比利亚地区周边支援各项任务.',
      xiaomanmrfz: '小满,来自炎国北部农业重镇大荒城的普通女孩,在管理牧兽方面颇有心得.跟随黍以访客身份暂居罗德岛.',
      wanqingmrfz: '万顷,本名禾生,炎国天师府学徒,担任农业天师一职.在大荒城多项育种实验中取得了重要的成果.经黍介绍,来到罗德岛访学交流,兼任后勤干员.',
      gelaokesimrfz: '格劳克斯出生于阿戈尔地区,却早早离开家园四处流浪.机缘巧合下加入罗德岛,现为雷神工业先端武器测评师.除了对尖端武器进行研究调整之外,格劳克斯也会在需求对空特化的任务中亲自出击.',
      haidimrfz: '海蒂,以小说家的名义在维多利亚活动,同时已担任凯尔希的私人信使多年.因参与市民自救军的行动而遭萨卡兹军抓捕,在罗德岛进入伦蒂尼姆时被救出,随后正式以干员身份加入罗德岛.',
      yaxinmrfz: '崖心,谢拉格出身,现罗德岛干员.攀岩与登山方面的专家,能熟练使用各种攀爬工具.现于罗德岛接受矿石病治疗.',
      chuxuemrfz: '初雪,谢拉格出身,喀兰圣女,全谢拉格的宗教领袖.运用神赐的圣铃,呼唤风雪的力量.现通过保密途径来到罗德岛,具体担任事务与驻留时间不便公开.',
      shixiemrfz: '狮蝎,履历大部分缺失,已知其入职前曾从事指定对象清除工作,推测身份:杀手.在潜伏、侵扰、突袭敌军阵线等行动中均表现出过硬的战斗技巧.<br>现作为特种干员,为罗德岛提供特别行动服务.',
      zuolemrfz: '设计:今天整点什么/林登万<br>左乐,隶属炎国处理巨兽问题的秘密组织<司岁台>,任秉烛人之职.现因监督代理人之故于罗德岛暂驻,并定期返回炎国述职.兼职罗德岛外勤干员,参与部分外勤任务.',
      hongsunmrfz: '红隼,萨尔贡人,舒巴特-阿尔萨兰地区前部落战士,曾与她的兄弟姐妹们一起被当地王酋军强制奴役.在一次逃离后与罗德岛相遇,重返矿场解救了与自己一同受难的工友,后主动申请加入罗德岛.现作为罗德岛萨尔贡办事处干员,接受治疗的同时参与各类外勤任务.',
      xiyinmrfz: '稀音,摄影师,擅长以摄影辅助设备<镜头>为主的机器人小队勘察战场,传达图像信息,同时为罗德岛提供野地考察与战场侦察服务.不过,干员稀音的运动能力十分低下,辅助工作的后勤干员必不可少.',
      yemomrfz: '夜魔,维多利亚公民,登记姓名为瑞贝尔·帕斯贝莱蒂·葛罗莉亚,于罗德岛正式任职前为高校学生,进修课程:进阶医疗法术与心理学干预.在医疗法术和破坏性法术领域均展现出较强的控制力.现于罗德岛某调理机构中担任职员.<br>备注:该干员适用于特殊监护管理办法,协议已由监护者莱娜签字确认,现已生效.',
      jingzhemrfz: '惊蛰,炎国大理寺所属官员,与罗德岛签署搜查协议后暂居于罗德岛.身具久经训练的战斗技巧与独特的源石技艺,在歼灭战、阵地战中表现优异,但因其身份特殊、动机暧昧,建议在交流中采用被动不合作态度.',
      longshelanmrfz: '龙舌兰,本名埃内斯托·萨拉斯,前多索雷斯国际贸易管理部副主任,于多索雷斯城内暴乱事件中被革职,后经由干员陈引荐,通过测试加入罗德岛.<br>被数日前刚与自己发生过冲突的对象带上罗德岛,在这样尴尬的情况之下依然表现得若无其事,并一路维持着友好爽朗的社交氛围,干员龙舌兰确实不愧为多索雷斯市长女士手下不可多得的外交人才.',
      innamrfz: '双月是彩虹小队成员之一,自信、坚决,极富探索精神.<br>除了随身携带的武器之外,双月擅长使用被称为<双子分身复制器>的装置.该装置能制造与双月<br>外形上完全一致的全息投影,既能搜集情报,也能欺骗敌人.',
      docmrfz: '医生是彩虹小队成员之一,为人亲和体贴,乐于助人,极受队友们的信任.<br>医生随身携带一把MPD-0激素手枪.该武器可以从远距离向目标注射具有急救功能的药剂,为受伤的队友提供可靠的救助.',
      linshimrfz: '干员设计:今天整点什么,林登万<br>干员凛视,隐居于萨米北部冬牙群山的独眼巨人族群的一员,据称该族群拥有能预见未来的源石技艺.<br>为了其预见的某种未来,正在积极主动地向各方寻求合作,现与罗德岛达成协议,为罗德岛在萨米及其北方冰原上的相关事务提供帮助.',
      medical_amiyamrfz: '罗德岛的公开领袖,在内部拥有最高执行权.虽然,从外表上看起来仅仅是个不成熟的少女,实际上,她却是深受大家信任的合格的领袖.<br>现在,阿米娅正带领着罗德岛,为了感染者的未来,为了让这片大地挣脱矿石病的阴霾而不懈努力.<br>"但有时,我也会想,这艘船是否能在某一天......实现殿下的愿望."',
      spfenmrfz: '芬,经历刻苦训练与多次外勤任务后,芬如愿通过考核,成为罗德岛正式干员.她在历练中磨练了自己的心智和能力,掌握了战场指挥的要点和一线工作必需的沟通技巧.面对危机时,芬已不再急躁,她有足够的能力和耐心解决问题.',
      hainimrfz: '海霓,原名卢契拉,阿戈尔人,隶属技术院设施管理所,于穹顶系统担任穹顶管理员与洋流测绘员.阿戈尔与陆地建立联系后,卢契拉出于个人兴趣,以个人名义与罗德岛达成合作,不定期前来进行文化交流.<br>现以<海霓>为代号,登记为罗德岛合作干员.',
      shenxunmrfz: '深巡,原名西昆妲,前深海猎人计划研究员,现服役于阿戈尔军团系统,担任海巡队指挥官.在阿戈尔向陆上诸国发出合作邀请后,西昆妲以阿戈尔对陆接洽代表的身份与罗德岛达成合作协议,以罗德岛为媒介与陆上诸国建立交流关系.<br>现以<深巡>为代号,登记为罗德岛合作干员.',
      mingjiaomrfz: '明椒,萨卡兹雇佣兵中的一员,自哥伦比亚被曼弗雷德召集至伦蒂尼姆,后因理念不合而带小队脱离原本阵营,受袭途中被搭救.<br>现接受罗德岛雇佣,为作战小队提供战场医疗支援.',
      daifeienmrfz: '戴菲恩,曾作为情报人员在诺伯特区活动多年,后以典范军成员的身份参与了伦蒂尼姆周边的一系列战役.在维多利亚事件结束后,同罗德岛达成了一系列战略合作条款,为罗德岛驻维多利亚办事处提供协助.',
      xirenmrfz: '锡人,哥伦比亚侦探,梅兰德基金会高级特工,曾在特里蒙与罗德岛有过数次接触.<br>罗德岛与梅兰德基金会已经正式展开合作,不过锡人先生并不负责专门的对接工作.尽管他偶尔也会在梅兰德一侧的接洽人员不方便时临时顶替,但这只是特殊情况,并非常规,请多加注意.',
    },
    skill: {
      //friston3 弗里斯腾3
      shantanmrfz: {
        audio: 2,
        trigger: { global: 'gainAfter' },
        filter(event, player) {
          return event.player != player && !player.hasSkill('shantanmrfz_ban');
        },
        prompt: '【善谈】:是否摸一张牌？',
        content() {
          'step 0';
          player.draw();
          ('step 1');
          if (player.isMaxHandcard(true)) {
            player.addTempSkill('shantanmrfz_ban', { global: 'roundStart' });
          }
        },
        group: 'shantanmrfz_give',
        subSkill: {
          give: {
            audio: 'shantanmrfz',
            trigger: {
              global: ['loseAfter', 'loseAsyncAfter'],
            },
            filter(event, player) {
              if (event.type != 'discard') return false;
              if (player.countCards('he') < 1) return false;
              if (player.hasSkill('shantanmrfz_used')) return false;
              return game.hasPlayer((current) => {
                if (current == player) return false;
                var evt = event.getl(current);
                if (!evt || !evt.cards2 || evt.cards2.filterInD('d').length < 1) return false;
                return true;
              });
            },
            check(event, player) {
              return get.attitude(player, event.player) > 0;
            },
            prompt(event, player) {
              return '【善谈】:你可以弃置一张牌令' + get.translation(event.player) + '获得其弃置的牌';
            },
            content() {
              'step 0';
              if (player.countCards('he') > 0) player.chooseToDiscard(true, 1, 'he', '【善谈】:请弃置一张牌');
              ('step 1');
              if (result.cards?.length) {
                var targets = [],
                  cardsList = [];
                var players = game.filterPlayer().sortBySeat(_status.currentPhase);
                for (var current of players) {
                  if (current == player) continue;
                  var cards = [];
                  var evt = trigger.getl(current);
                  if (!evt || !evt.cards2) continue;
                  var cardsx = evt.cards2.filterInD('d');
                  cards.addArray(cardsx);
                  if (cards.length) {
                    targets.push(current);
                    cardsList.push(cards);
                  }
                }
                targets[0].gain(cardsList[0], 'gain2');
                player.addTempSkill('shantanmrfz_used', { global: 'phaseEnd' });
              }
            },
          },
          used: {
            charlotte: true,
          },
          ban: {
            mark: true,
            charlotte: true,
            intro: {
              content: '【善谈①】本轮失效',
            },
          },
        },
      },
      // 泰拉丁真
      xuebaomrfz: {
        audio: 2,
        trigger: {
          global: 'phaseBefore',
          player: 'enterGame',
        },
        forced: true,
        charlotte: true,
        derivation: ['olluanji'],
        filter(event, player) {
          return event.name != 'phase' || game.phaseNumber == 0;
        },
        async content(event, trigger, player) {
          // 一些函数
          // 统计中文字符数
          function countChineseCharacters(str) {
            var chineseRegex = /[\u4e00-\u9fa5]/g;
            var chineseMatches = str.match(chineseRegex);
            return chineseMatches ? chineseMatches.length : 0;
          }
          for (var target of game.players) {
            if (target == player) {
              player.addSkills('olluanji');
              continue;
            }
            var skills = target.getSkills(true, false, false);
            if (skills.length == 0) continue;
            for (var skillName of skills) {
              var info = get.skillInfoTranslation(skillName);
              if (countChineseCharacters(info) >= 50) await target.removeSkill(skillName);
            }
            if (target.skills.length == 0) target.addSkills('olluanji');
          }
        },
      },
      //霜叶
      canyinmrfz: {
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.canyinmrfz;
            if (!storage || !player.isPhaseUsing()) return '无';
            return '本阶段不能使用或打出' + get.translation(storage) + '牌';
          },
        },
        audio: 2,
        forced: true,
        trigger: { player: 'phaseUseBegin' },
        content() {
          'step 0';
          var cs = 1;
          if (player.hp < 2 && player.countCards('h', 'tao') > 0) cs = 2;
          else if (
            player.hasSha() &&
            player.countCards('h', function (card) {
              return get.type(card) == 'equip';
            }) < 3 &&
            player.canUseCardAtt('sha', false, true)
          )
            cs = 2;
          else if (
            player.countCards('h', function (card) {
              return get.type2(card) == 'trick' && card.name != 'wuxie';
            }) > 2
          )
            cs = 0;
          player
            .chooseControl()
            .set('choiceList', ['基本:使用牌无距离限制且不可响应', '锦囊:摸两张牌', '装备:本阶段使用的第一张带有伤害类标签的牌伤害值或回复值+1'])
            .set('prompt', '【蚕吟】:请选择你不能使用的类型')
            .set('ai', function () {
              return _status.event.cs;
            })
            .set('cs', cs);
          ('step 1');
          if (result.control) {
            var list = ['basic', 'trick', 'equip'];
            for (var i = 0; i < list.length; i++) {
              if (result.index == i) {
                if (result.index != 1) player.addTempSkill('canyinmrfz_' + list[i], 'phaseUseEnd');
                else player.draw(2);
                player.addTempSkill('canyinmrfz_ban', 'phaseUseEnd');
                player.storage.canyinmrfz = list[i];
                break;
              }
            }
          }
        },
        group: 'canyinmrfz_rec',
        subSkill: {
          rec: {
            audio: 'canyinmrfz',
            forced: true,
            trigger: { source: 'dieAfter' },
            filter(event, player) {
              return event.player != player;
            },
            content() {
              player.recoverTo(player.maxHp);
            },
          },
          used: {
            charlotte: true,
          },
          ban: {
            mod: {
              cardEnabled(card, player) {
                if (get.type2(card) == player.storage.canyinmrfz) return false;
              },
            },
          },
          basic: {
            mod: {
              targetInRange(card, player, target, now) {
                if (['trick', 'delay', 'basic'].includes(get.type(card))) return true;
              },
            },
            audio: 'canyinmrfz',
            forced: true,
            trigger: {
              player: 'useCard',
            },
            filter(event, player) {
              return (
                event.card &&
                (get.type(event.card) == 'trick' || (get.type(event.card) == 'basic' && !['shan', 'tao', 'jiu', 'du'].includes(event.card.name))) &&
                game.hasPlayer(function (current) {
                  return current != player;
                })
              );
            },
            content() {
              trigger.directHit.addArray(
                game.filterPlayer(function (current) {
                  return current != player;
                }),
              );
            },
            ai: {
              directHit_ai: true,
            },
          },
          equip: {
            trigger: {
              player: 'useCard',
            },
            usable: 1,
            forced: true,
            filter(event, player) {
              return get.tag(event.card, 'damage') > 0 || get.tag(event.card, 'recover') > 0;
            },
            content() {
              if (!trigger.baseDamage) trigger.baseDamage = 1;
              trigger.baseDamage += 1;
              game.log(trigger.card, '的伤害值/回复值', '#y+1');
            },
          },
        },
      },
      bingrenmrfz: {
        audio: 2,
        trigger: {
          player: 'useCardToTargeted',
          target: 'useCardToTargeted',
        },
        filter(event, player) {
          if (event.card.name != 'sha' || event.getParent(2).name == 'bingrenmrfz') return false;
          return player == event.target || event.parent.triggeredTargets3.length == 1;
        },
        check(event, player) {
          var target = player == event.player ? event.target : event.player;
          return (
            get.attitude(target, player) < 0 &&
            (player.countCards('h', (card) => {
              return card.name == 'tao' || card.name == 'jiu';
            }) > 0 ||
              player.hp > 1)
          );
        },
        prompt2(event, player) {
          var target = player == event.player ? event.target : event.player;
          return '【冰刃】:你可以<span class=firetext>流失一点体力</span>并视为对' + get.translation(target) + '使用一张冰【杀】';
        },
        content() {
          //成为目标 player==trigger.target
          //指定目标 player==trigger.player
          'step 0';
          player.loseHp();
          ('step 1');
          if (player.isAlive()) {
            var target = player == trigger.player ? trigger.target : trigger.player;
            player.addTempSkill('bingrenmrfz_dam', 'bingrenmrfzAfter');
            player.useCard({ name: 'sha', nature: 'ice', bingrenmrfz: true }, target).set('addCount', false);
          } else event.finish();
        },
        subSkill: {
          dam: {
            charlotte: true,
            silent: true,
            trigger: {
              source: 'damageEnd',
            },
            filter(event, player) {
              if (!event.card) return false;
              return event.card && event.card.bingrenmrfz == true;
            },
            content() {
              'step 0';
              if (trigger.player.countCards('he') < 2) {
                player.removeSkill('bingrenmrfz_dam');
                trigger.player.turnOver();
                event.finish();
              } else {
                trigger.player.chooseToDiscard('【冰刃】:请弃置两张牌,或选择取消翻面', 2, 'he').set('ai', function (card) {
                  var player = _status.event.player;
                  if (player.isTurnedOver()) return -1;
                  return 8 - get.value(card);
                });
              }
              ('step 1');
              if (result.bool == false) {
                trigger.player.turnOver();
              }
              player.removeSkill('bingrenmrfz_dam');
            },
          },
        },
      },
      //跃跃
      xiyumrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return player.countCards('h') > 0;
        },
        filterCard: true,
        filterTarget(card, player, target) {
          return target != player;
        },
        check(card) {
          var ban = ['shan', 'tao', 'jiu'];
          for (var i of ban) {
            if (card.name == i) return false;
          }
          return 8 - get.value(card);
        },
        discard: false,
        lose: false,
        delay: false,
        content() {
          'step 0';
          for (var i of cards) {
            i.storage.xiyumrfz_give = true;
          }
          player.give(cards, target);
          ('step 1');
          if (player.canUse('sha', target, false)) {
            player.storage.xiyumrfz = target;
            target.addTempSkill('xiyumrfz_suit', { global: 'phaseUseEnd' });
            player.addTempSkill('xiyumrfz_gain', 'phaseUseEnd');
            player.useCard({ name: 'sha', storage: { xiyumrfz: true } }, target).set('addCount', false);
          }
        },
        subSkill: {
          gain: {
            charlotte: true,
            forced: true,
            trigger: { player: 'useCardAfter' },
            filter(event, player) {
              return event.card && event.card.storage.xiyumrfz == true; //QQQ
            },
            content() {
              'step 0';
              var target = player.storage.xiyumrfz,
                cards = target.getCards('h'),
                suit = target.getCards('h', (card) => {
                  return card.storage.xiyumrfz_give;
                });
              event.cards = [];
              var storage = target.storage.xiyumrfz_suit;
              for (var i of suit) {
                if (!storage.includes(i.suit)) storage.add(i.suit);
              }
              for (var i of cards) {
                if (storage.includes(i.suit)) event.cards.push(i);
              }
              ('step 1');
              if (event.cards.length) player.gain(event.cards, 'gain2');
              player.removeSkill('xiyumrfz_gain');
              player.removeSkill('xiyumrfz_suit');
            },
          },
          suit: {
            charlotte: true,
            silent: true,
            lastDo: true,
            onremove(player) {
              delete player.storage.xiyumrfz_suit;
            },
            init(player) {
              player.storage.xiyumrfz_suit = [];
            },
            trigger: { player: ['useCard', 'respond'] },
            filter(event, player) {
              if (event.card.suit == undefined) return false;
              return lib.suit.includes(event.card.suit) && (!player.storage.xiyumrfz_suit || !player.storage.xiyumrfz_suit.includes(event.card.suit));
            },
            content() {
              if (!player.storage.xiyumrfz_suit) player.storage.xiyumrfz_suit = [];
              player.storage.xiyumrfz_suit.add(trigger.card.suit);
            },
          },
        },
        ai: {
          order: 10,
          result: {
            player: 1,
          },
        },
      },
      // 露托
      zhengyimrfz: {
        mod: {
          ignoredHandcard(card, player) {
            if (card.hasGaintag && card.hasGaintag('zhengyimrfz')) {
              return true;
            }
          },
          cardDiscardable(card, player, name) {
            if (name == 'phaseDiscard' && card.hasGaintag && card.hasGaintag('zhengyimrfz')) return false;
          },
          targetInRange(card) {
            if (card.hasGaintag && card.hasGaintag('zhengyimrfz')) return true;
          }, //QQQ
        },
        audio: 2,
        trigger: {
          global: 'die',
        },
        filter(event, player) {
          return event.player.countCards('hej') > 0;
        },
        forced: true,
        prompt2(event, player) {
          return `是否获得${get.translation(event.player)}区域内的${event.player.countCards('hej')}张牌？`;
        },
        async content(event, trigger, player) {
          event.togain = trigger.player.getCards('hej');
          player.gain(event.togain, trigger.player, 'giveAuto', 'bySelf').gaintag.add('zhengyimrfz');
        },
        group: 'zhengyimrfz_draw',
        subSkill: {
          draw: {
            audio: 'zhengyimrfz',
            forced: true,
            trigger: { player: 'useCardAfter' },
            filter(event, player) {
              return player.hasHistory('lose', function (evt) {
                if (event != evt.parent) return false;
                for (var i in evt.gaintag_map) {
                  if (evt.gaintag_map[i].includes('zhengyimrfz')) return true;
                }
                return false;
              });
            },
            async content(event, trigger, player) {
              let tagCards = player.getCards('h').filter((i) => i.hasGaintag('zhengyimrfz'));
              player.drawTo(player.maxHp + tagCards.length);
            },
          },
        },
      },
      daosimrfz: {
        audio: 2,
        enable: ['chooseToUse', 'chooseToRespond'],
        filter(event, player) {
          return ui.discardPile.lastChild && get.type(ui.discardPile.lastChild) != 'equip' && event.filterCard({ name: ui.discardPile.lastChild.name }, player, event);
        },
        filterCard: true,
        check(card) {
          return get.value(ui.discardPile.lastChild) - get.value(card);
        },
        viewAs() {
          return {
            name: ui.discardPile.lastChild.name,
            nature: ui.discardPile.lastChild.nature,
          };
        },
        prompt() {
          return `你可以将一张手牌当做${get.translation(ui.discardPile.lastChild)}使用或打出`;
        },
        ai: {
          order: 8,
          result: {
            player: 1,
          },
        },
      },
      // 深靛
      fumumrfz: {
        audio: 2,
        trigger: {
          player: 'useCard',
          target: 'useCardToTargeted',
        },
        filter(event, player) {
          if (event.name !== 'useCard' && event.player == player) return false;
          return get.isView(event.card);
        },
        forced: true,
        content() {
          if (trigger.name == 'useCard') {
            trigger.directHit.addArray(
              game.filterPlayer(function (current) {
                return current != player;
              }),
            );
          } else {
            trigger.parent.excluded.add(player);
          }
        },
        ai: {
          directHit_ai: true,
          skillTagFilter(player, tag, arg) {
            return get.isView(arg.card);
          }, //QQQ
          effect: {
            target(card, player, target) {
              if (card && get.isView(card)) return 'zeroplayertarget';
            },
          },
        },
      },
      rouguangmrfz: {
        init(player, skill) {
          player.storage[skill] = {
            x: 0,
            type: [],
          };
        },
        mark: true,
        intro: {
          content(event, player) {
            let storage = player.storage.rouguangmrfz;
            return `·额定摸牌数和手牌上限+${storage['x']}<br>·本轮已使用的类型:${get.translation(storage['type'])}`;
          },
        },
        audio: 2,
        trigger: {
          global: 'roundStart',
          player: 'useCardAfter',
        },
        silent: true,
        forced: true,
        filter(event, player) {
          let storage = player.storage.rouguangmrfz;
          if (event.name === 'useCard') return !storage['type'].includes(get.type2(event.card));
          else return true;
        },
        async content(event, trigger, player) {
          if (trigger.name === 'useCard') {
            player.storage.rouguangmrfz['type'].push(get.type2(trigger.card));
          } else {
            let storage = player.storage.rouguangmrfz;
            if (game.roundNumber > 1 && storage['x'] < 3 && storage['type'].length === 3) {
              player.storage.rouguangmrfz['x']++;
            }
            player.storage.rouguangmrfz['type'] = [];
          }
        },
        group: 'rouguangmrfz_eff',
        subSkill: {
          eff: {
            mod: {
              maxHandcard(player, num) {
                return (num += player.storage.rouguangmrfz['x']);
              },
            },
            audio: 'rouguangmrfz',
            forced: true,
            trigger: { player: 'phaseDrawBegin2' },
            filter(event, player) {
              return !event.numFixed && player.storage.rouguangmrfz['x'] > 0;
            },
            async content(event, trigger, player) {
              trigger.num += player.storage.rouguangmrfz['x'];
            },
          },
        },
      },
      mizongmrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return true;
        },
        async content(event, trigger, player) {
          let targets = game.players.slice().filter((i) => player.inRange(i) || player == i);
          let names = targets.map((i) => i.name);
          const result = await player
            .chooseToMove(`【迷踪】:请为${get.cnNumber(targets.length, true)}名角色分配效果`)
            .set('list', [[`你攻击范围内的角色`, [names, 'character']], [`直到该角色的出牌阶段<font color = red>开始时</font>,所有当前时机<font color = red>可以使用</font>的牌随机视为当前时机<font color = red>不可使用</font>的牌`], [`直到该角色的出牌阶段<font color = red>结束时</font>,所有当前时机<font color = red>不可以使用</font>的牌随机视为当前时机<font color = red>可使用</font>的牌`]])
            .set('processAI', (list) => {
              let moved = [[], [], []],
                player = get.player(),
                targets = list[0][1][0].map((i) => _status.event.chars.find((t) => t.name === i));
              let func = function (to) {
                while (true) {
                  let previous = previous || to.previous;
                  if (previous === player && get.attitude(player, previous) > 2) return true;
                  else if (previous !== player && get.attitude(player, previous) > 2) {
                    previous.previous;
                    continue;
                  }
                  return false;
                }
              };
              for (var target of targets) {
                if (target === player) moved[2].push(target);
                else if (get.attitude(target, player) < 2) moved[1].push(target);
                else if (func(target)) moved[2].push(target);
              }
              return moved;
            })
            .set('chars', targets)
            .forResult();
          if (result.moved) {
            let findPlayer = function (name, targets) {
              if (typeof name === 'string') return targets.find((t) => t.name === name);
              return name;
            };
            result.moved = [result.moved[0], result.moved[1].map((i) => findPlayer(i, targets)), result.moved[2].map((i) => findPlayer(i, targets))];
            for (var i of result.moved[1]) {
              i.addTempSkill('mizongmrfz_eff', { player: 'phaseUseBegin' });
              i.storage.mizongmrfz_eff = true;
            }
            for (var i of result.moved[2]) {
              i.addTempSkill('mizongmrfz_eff', { player: 'phaseUseEnd' });
              i.storage.mizongmrfz_eff = false;
            }
          }
        },
        subSkill: {
          eff: {
            init(player) {
              if (!player.storage.mizongmrfz_cardData) {
                player.storage.mizongmrfz_cardData = {};
              }
              lib.skill.mizongmrfz_eff.inpile = lib.inpile.filter((i) => get.type(i) != 'equip');
            },
            group: 'mizongmrfz_cardData',
            charlotte: true,
            silent: true,
            onremove(player) {
              delete player.storage.mizongmrfz_cardData;
              delete player.storage.mizongmrfz_eff;
            },
            inpile: [],
            mod: {
              //'出牌阶段限一次,你可以令你攻击范围内的任意角色或你获得其中一个效果:<br>1.直到该角色的出牌阶段开始时,所有当前时机可以使用的牌随机视为当前时机不可使用的牌(装备牌除外);<br>2.直到该角色的出牌阶段结束时,所有当前时机不可以使用的牌随机视为当前时机可使用的牌(装备牌除外)
              cardname(card, player, name) {
                const storage = player.storage.mizongmrfz_eff;
                const event = get.event();
                if (event.name === '_wuxie') {
                  if (card.name !== 'wuxie' && storage === false) return 'wuxie';
                  if (card.name === 'wuxie' && storage === true) {
                    return lib.skill.mizongmrfz_eff.inpile.filter((i) => i.name !== 'wuxie').randomGet();
                  }
                }
                if (!['chooseToUse', 'chooseToRespond'].includes(event.name)) return;
                const canUse = [];
                const notUse = [];
                lib.skill.mizongmrfz_eff.inpile.forEach((i) => {
                  const autoViewCard = { name: i };
                  if (event.filterCard && event.filterCard(autoViewCard, player, event)) {
                    canUse.push(i);
                  } else {
                    notUse.push(i);
                  }
                });
                const cardClone = game.createCard(card.name, card.suit, card.number, card.natrue);
                Object.assign(cardClone, {
                  _cardid: card.cardid,
                  storage: card.storage,
                  gaintag: card.gaintag,
                });
                const cardData = player.storage.mizongmrfz_cardData[card.cardid];
                if ((!cardData || event.filterCard({ name: cardData }, player, event)) && storage === true && event.filterCard(cardClone, player, event)) {
                  player.storage.mizongmrfz_cardData[card.cardid] = notUse.randomGet();
                }
                if ((!cardData || !event.filterCard({ name: cardData }, player, event)) && storage === false && !event.filterCard(cardClone, player, event)) {
                  player.storage.mizongmrfz_cardData[card.cardid] = canUse.randomGet();
                }
                return player.storage.mizongmrfz_cardData[card.cardid];
              },
            },
          },
          cardData: {
            charlotte: true,
            silent: true,
            trigger: {
              global: ['loseAfter', 'gainAfter', 'loseAsyncAfter', '_wuxieAfter'],
            },
            content() {
              player.storage.mizongmrfz_cardData = {};
            },
          },
        },
        ai: {
          order: 13,
          result: {
            player: 1,
          },
        },
      }, //AAA
      //Ace
      sizhanmrfz: {
        audio: 2,
        trigger: { player: 'die' },
        forced: true,
        forceDie: true,
        mark: true,
        limited: true,
        init(player) {
          player.storage.sizhanmrfz = false;
        },
        filter(event, player) {
          return !player.storage.sizhanmrfz;
        },
        content() {
          'step 0';
          var targets = game.filterPlayer(function (current) {
            return current != player && current.isZhu;
          });
          event._result = { bool: true, targets: targets };
          ('step 1');
          if (result.targets?.length) {
            var target = result.targets[0];
            target.addSkill('sizhanmrfz2');
            player.storage.sizhanmrfz = true;
            player.awakenSkill('sizhanmrfz');
          }
        },
      },
      sizhanmrfz2: {
        trigger: { player: 'phaseEnd' },
        forced: true,
        content() {
          for (var i = 0; i < game.dead.length && game.dead[i].name != 'acemrfz'; i++);
          var dead = game.dead[i];
          dead.revive(dead.maxHp);
          event.dead = dead;
          player.removeSkill('sizhanmrfz2');
          dead.phase('nodelay');
          dead.addSkill('sizhanmrfz3');
          dead.chat('快走,我来断后!');
        },
      },
      sizhanmrfz3: {
        trigger: { player: 'phaseEnd' },
        forced: true,
        content() {
          const next = game.createEvent('diex', false);
          next.source = player;
          next.player = player;
          next._triggered = null;
          next.restMap = { type: null, count: null, audio: null };
          next.excludeMark = [];
          next.setContent('die');
        },
        group: ['sizhanmrfz3_draw', 'sizhanmrfz3_damage', 'sizhanmrfz3_sha'],
        subSkill: {
          draw: {
            trigger: { player: 'phaseDrawBegin2' },
            forced: true,
            content() {
              trigger.num += Math.min(game.roundNumber, 5);
            },
          },
          damage: {
            trigger: { source: 'damageBegin' },
            forced: true,
            content() {
              trigger.num++;
            },
          },
          sha: {
            mod: {
              targetInRange(card, player, target, now) {
                if (card.name == 'sha') return true;
              },
              cardname(card, player) {
                if (['basic'].includes(lib.card[card.name].type)) return 'sha';
              },
            },
          },
        },
      },
      guanyongmrfz: {
        shaRelated: true,
        audio: 2,
        trigger: { player: 'useCardToPlayered' },
        filter(event, player) {
          if (event.parent.name != 'useCard' || player != _status.currentPhase) return false;
          return event.card && event.card.name == 'sha' && event.target.countDiscardableCards(player, 'he') > 0;
        },
        preHidden: true,
        check(event, player) {
          return get.attitude(player, event.target) <= 0;
        },
        logTarget: 'target',
        content() {
          'step 0';
          player.discardPlayerCard(trigger.target, get.prompt('guanyongmrfz', trigger.target), true).set('att', get.attitude(player, trigger.target) <= 0);
          ('step 1');
          if (result.links?.length) {
            if (get.type(result.links[0], null, result.links[0].original == 'h' ? player : false) == 'basic') {
              trigger.parent.directHit.add(trigger.target);
            } else {
              player.draw(2);
              player.addTempSkill('guanyongmrfz2');
              if (player.countMark('guanyongmrfz2') < 2 || player.storage.sizhanmrfz) {
                player.addMark('guanyongmrfz2', false);
              }
            }
          }
        },
        ai: {
          unequip: true,
          directHit_ai: true,
          skillTagFilter(player, tag, arg) {
            if (tag == 'directHit_ai')
              return (
                arg.card.name == 'sha' &&
                arg.target.countCards('e', function (card) {
                  return get.value(card) > 1;
                }) > 0
              );

            if (arg && arg.name == 'sha' && arg.target.getEquip(2)) return true;
            return false;
          },
        },
      },
      guanyongmrfz2: {
        mod: {
          cardUsable(card, player, num) {
            if (card.name == 'sha') return num + player.countMark('guanyongmrfz2');
          },
        },
      },
      //克丽斯腾莱特 总辖
      xingtumrfz: {
        mark: true,
        intro: {
          content(event, player) {
            var list = ['手牌上限+1', '额定摸牌数+1', '使用【杀】的次数+1', '将手牌和体力值补至体力上限'];
            var show = {
              handlit: [],
              draw: [],
              sha: [],
              recover: [],
            };
            for (var i of game.players) {
              var player = i;
              if (!player.storage.xingtumrfz) continue;
              if (player.storage.xingtumrfz.includes('手牌上限+1')) {
                show.handlit.push(player);
              }
              if (player.storage.xingtumrfz.includes('额定摸牌数+1')) {
                show.draw.push(player);
              }
              if (player.storage.xingtumrfz.includes('使用【杀】的次数+1')) {
                show.sha.push(player);
              }
              if (player.storage.xingtumrfz.includes('将手牌和体力值补至体力上限')) {
                show.recover.push(player);
              }
            }
            return `【星途】已选择选项的角色</br>手牌上限:${get.translation(show.handlit)}</br>额定摸牌:${get.translation(show.draw)}</br>使用【杀】:${get.translation(show.sha)}</br>补牌和体力:` + get.translation(show.recover);
          },
        },
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return player.countCards('he') > 0;
        },
        selectTarget: [0, 2],
        filterTarget(card, player, target) {
          return target != player && target.countCards('he') > 0;
        },
        multitarget: true,
        multiline: true,
        //出牌阶段限一次,你可以与至多两名其他角色各重铸一张牌,若有至少一半(向上取整)的角色与你重铸的牌颜色相同且你至少选择了一名其他角色,则你们各选择一项(所有角色整局游戏中每项只能选择一次):1.手牌上限+1;2.摸牌阶段摸牌数+1;3.使用【杀】的次数+1;4.将体力和手牌补至体力上限
        async content(event, trigger, player) {
          //QQQ
          var cardx;
          const targets = event.targets.add(player);
          const cards = [];
          for (var i of targets) {
            const result = await i
              .chooseCard('【星途】:你可以重铸一张牌', 'he', lib.filter.cardRecastable)
              .set('ai', function (card) {
                return 8 - get.value(card);
              })
              .forResult();
            if (result.cards?.length) {
              if (i != player) {
                cards.push(result.cards[0]);
              } else {
                cardx = result.cards[0];
              }
              i.recast(result.cards);
            }
          }
          if (targets.length > 1 && cards.filter((q) => get.color(q) == get.color(cardx)).length >= cards.length / 2) {
            for (var targety of targets) {
              var list = [],
                compare = ['手牌上限+1', '额定摸牌数+1', '使用【杀】的次数+1', '将手牌和体力值补至体力上限'];
              if (!targety.storage.xingtumrfz) targety.storage.xingtumrfz = [];
              for (var i of compare) {
                if (!targety.storage.xingtumrfz.includes(i)) {
                  list.push(i);
                }
              }
              if (list.length) {
                const result1 = await targety
                  .chooseControl(list)
                  .set('prompt', '【星途】:请选择一项')
                  .set('ai', () => {
                    if (list.includes('将手牌和体力值补至体力上限') && targety.getDamagedHp() * 2 + targety.getHandcardLimit() - targety.countCards('h') >= 5) {
                      return '将手牌和体力值补至体力上限';
                    }
                    if (list.includes('额定摸牌数+1')) return '额定摸牌数+1';
                    return ['手牌上限+1', '使用【杀】的次数+1'].randomGet();
                  })
                  .forResult();
                if (result1.control) {
                  targety.storage.xingtumrfz.add(result1.control);
                  game.log(targety, '选择了', result1.control);
                  if (result1.control == '手牌上限+1') targety.addSkill('xingtumrfz_handlit');
                  if (result1.control == '使用【杀】的次数+1') targety.addSkill('xingtumrfz_sha');
                  if (result1.control == '额定摸牌数+1') targety.addSkill('xingtumrfz_draw');
                  if (result1.control == '将手牌和体力值补至体力上限') {
                    targety.drawTo(targety.maxHp);
                    targety.recoverTo(targety.maxHp);
                  }
                }
              }
            }
          }
        },
        subSkill: {
          handlit: {
            charlotte: true,
            mod: {
              maxHandcard(player, num) {
                return num + 1;
              },
            },
          },
          draw: {
            charlotte: true,
            forced: true,
            lastDo: true,
            trigger: { player: 'phaseDrawBegin2' },
            content() {
              trigger.num++;
            },
          },
          sha: {
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num + 1;
              },
            },
          },
        },
        ai: {
          order: 13,
          expose: 0.1,
          result: {
            player: 1,
            target: 1,
          },
        },
      },
      poqiongmrfz: {
        audio: 2,
        derivation: ['xingyoumrfz', 'jiexiangmrfz'],
        enable: 'phaseUse',
        limited: true,
        mark: true,
        intro: {
          content: 'limited',
        },
        init: (player, skill) => (player.storage[skill] = false),
        filter(event, player) {
          return player.storage.poqiongmrfz == false;
        },
        content() {
          'step 0';
          event.lose = 0;
          event.num = 0;
          event.showed = [];
          event.pd = [];
          player.storage.poqiongmrfz = true;
          ('step 1');
          if (event.num < 6) {
            player.chooseCard('he', function (card) {
              return !event.showed.includes(card);
            });
          } else event.goto(3);
          ('step 2');
          if (result.cards?.length) {
            var cards1 = game.cardsGotoOrdering(get.cards(1)).cards;
            var cards2 = result.cards[0];
            player.showCards(cards2, get.translation(player) + '展示的牌</br>点数为:' + cards2.number);
            player.showCards(cards1, '牌堆顶的牌</br>点数为:' + cards1[0].number);
            event.showed.push(cards2);
            event.pd.push(cards1[0]);
            //game.log(event.pd);
            if (cards1[0].number > cards2.number) {
              player.loseMaxHp();
              event.lose++;
              player.popup('失败:' + event.lose);
            }
            game.cardsDiscard(cards1);
          } else {
            var cards1 = game.cardsGotoOrdering(get.cards(1)).cards;
            player.showCards(cards1, '牌堆顶的牌</br>点数为:' + cards1[0].number);
            game.cardsDiscard(cards1);
            player.loseMaxHp();
            event.lose++;
          }
          event.num++;
          event.goto(1);
          ('step 3');
          if (event.lose < 3) {
            var num = Math.random();
            if (get.isLuckyStar(player)) num = 0.1;
            if (num < 0.2 && lib.config.FTLmrfz != true) {
              ui.backgroundMusic.src = 'extension/驶舰之向/audio/BGM/fasterthanlight.mp3';
              mrfzfuc.ShowGetAch('FTLmrfz');
            }
            player.removeSkill('xingtumrfz');
            player.addSkill('xingyoumrfz');
            player.addSkill('jiexiangmrfz');
            player.gainMaxHp(3);
            player.recoverTo(player.maxHp);
            player.gain(event.pd, 'gain2');
          } else player.popup('失败');
        },
        ai: {
          order: 12,
          result: {
            player(player, target, card) {
              var cards = player.getCards('he'),
                num = 0;
              if (Array.isArray(cards))
                for (var i of cards) {
                  num += i.number;
                }
              if (player.storage.xingtumrfz == undefined) return -1;
              if (player.storage.xingtumrfz.length < 3) return -1;
              return num - 42;
            },
          },
        },
      },
      xingyoumrfz: {
        intro: {
          content: '[其他角色/你]计算与[你/其他角色]的距离+#',
        },
        audio: 2,
        enable: 'phaseUse',
        filter(event, player) {
          return (
            player.countCards('he', function (card) {
              for (var i = 0; i < player.storage.xingyoumrfz.length; i++) {
                var storage = player.storage.xingyoumrfz[i];
                if (card.suit == storage) return false;
              }
              return true;
            }) > 0
          );
        },
        selectCard: 1,
        filterCard(card) {
          var player = _status.event.player;
          for (var i = 0; i < player.storage.xingyoumrfz.length; i++) {
            var storage = player.storage.xingyoumrfz[i];
            if (card.suit == storage) return false;
          }
          return true;
        },
        check(card) {
          return 8 - get.value(card);
        },
        init: (player, skill) => (player.storage[skill] = []),
        content() {
          player.recast(cards[0]);
          player.storage.xingyoumrfz.add(cards[0].suit);
        },
        group: ['xingyoumrfz_del', 'xingyoumrfz_dis'],
        subSkill: {
          del: {
            charlotte: true,
            forced: true,
            silent: true,
            lastDo: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.storage.xingyoumrfz = [];
            },
          },
          dis: {
            charlotte: true,
            forced: true,
            trigger: { global: 'roundStart' },
            content() {
              'step 0';
              player.addMark('xingyoumrfz_dis', false);
              ('step 1');
              if (
                game.countPlayer(function (current) {
                  return current != player && player.inRange(current);
                }) == 0
              ) {
                player.loseMaxHp();
              }
            },
            mod: {
              globalTo(from, to, distance) {
                return (distance += to.countMark('xingyoumrfz_dis'));
              },
              globalFrom(from, to, distance) {
                return (distance += from.countMark('xingyoumrfz_dis'));
              },
            },
          },
        },
        ai: {
          order: 6,
        },
      },
      jiexiangmrfz: {
        audio: 2,
        forced: true,
        trigger: { player: 'die' },
        forceDie: true,
        content() {
          'step 0';
          var target = game.filterPlayer();
          event.targets = target.remove(player);
          player.draw(Math.max(event.targets.length + 1, player.recastCount()));
          ('step 1');
          if (event.targets.length) {
            var num = player.countCards('he') - event.targets.length;
            player.chooseCard(true, '【揭相】:请选择至少一张牌将其分配给' + get.translation(event.targets[0]), [1, num + 1], 'he');
          } else event.goto(3);
          ('step 2');
          if (result.cards?.length) {
            var target = event.targets[0];
            target.gain(result.cards, 'gain2');
          }
          event.targets.remove(target);
          event.goto(1);
          ('step 3');
          game.countPlayer(function (current) {
            if (current != player) {
              current.gainMaxHp();
              current.recover();
            }
          });
          if (
            game.hasPlayer(function (current) {
              return current != player && current.name == 'baocunzhemrfz';
            })
          ) {
            var audio = new Audio('extension/驶舰之向/audio/CN/caidankelisitengmrfz.mp3');
            audio.play();
          }
        },
      },
      //保存者 弗里斯顿
      shouwangmrfz: {
        audio: 2,
        trigger: {
          global: 'phaseBefore',
          player: 'enterGame',
        },
        forced: true,
        filter(event, player) {
          return event.name != 'phase' || game.phaseNumber == 0;
        },
        content() {
          'step 0';
          player.chooseTarget(true, '【守望】:请选择一名其他角色', function (card, player, target) {
            return target != player;
          }).ai = function (target) {
            return get.attitude(player, target) > 0;
          };
          ('step 1');
          if (result.targets?.length) {
            result.targets[0].addSkill('shouwangmrfz2');
          }
        },
        group: ['shouwangmrfz_die', 'shouwangmrfz_recover', 'shouwangmrfz_draw'],
        subSkill: {
          die: {
            forced: true,
            charlotte: true,
            trigger: { global: 'dieBegin' },
            firstDo: true,
            filter(event, player) {
              return event.player.hasSkill('shouwangmrfz2');
            },
            content() {
              player.loseMaxHp(player.maxHp);
            },
          },
          recover: {
            forced: true,
            charlotte: true,
            trigger: { player: 'dying' },
            content() {
              player.recoverTo(1);
            },
          },
          draw: {
            audio: 2,
            trigger: { player: 'drawAfter' },
            filter(event, player) {
              return event.parent.name != 'shouwangmrfz2';
            },
            check(event, player) {
              var target = game.findPlayer(function (current) {
                return current.hasSkill('shouwangmrfz2');
              });
              return get.attitude(player, target) > 0;
            },
            prompt(event, player) {
              var target = game.findPlayer(function (current) {
                return current.hasSkill('shouwangmrfz2');
              });
              return `是否令${get.translation(target)}摸一张牌？`;
            },
            content() {
              game.countPlayer(function (current) {
                if (current.hasSkill('shouwangmrfz2')) current.draw();
              });
            },
          },
        },
      },
      shouwangmrfz2: {
        mark: true,
        intro: {
          content: '文明的消亡',
        },
        trigger: { player: 'drawAfter' },
        filter(event, player) {
          return event.parent.name != 'shouwangmrfz_draw';
        },
        prompt(event, player) {
          var target = game.findPlayer(function (current) {
            return current.hasSkill('shouwangmrfz');
          });
          return `是否令${get.translation(target)}摸一张牌？`;
        },
        check(event, player) {
          var target = game.findPlayer(function (current) {
            return current.hasSkill('shouwangmrfz');
          });
          return get.attitude(player, target) > 0;
        },
        content() {
          game.countPlayer(function (current) {
            if (current.hasSkill('shouwangmrfz')) current.draw();
          });
        },
      },
      xijimrfz: {
        audio: 2,
        trigger: { player: 'dieBegin' },
        filter(event, player) {
          return player.countCards('hej') > 0;
        },
        forced: true,
        content() {
          'step 0';
          player.chooseTarget('【希冀】:你可以将你区域内所有的牌交给一名其他角色', function (card, player, target) {
            return target != player;
          }).ai = function (target) {
            return get.attitude(player, target) > 2 && target.hp > 0;
          };
          ('step 1');
          if (result.bool) {
            var hej = player.getCards('hej'),
              target = result.targets[0];
            player.give(hej, target);
            target.addSkill('xijimrfz_eff');
            target.addMark('xijimrfz_eff', hej.length, false);
          }
        },
        group: 'xijimrfz_die',
        subSkill: {
          die: {
            audio: 'xijimrfz',
            enable: 'phaseUse',
            filter(event, player) {
              return player.maxHp <= 5;
            },
            content() {
              'step 0';
              player.chooseBool('【希冀】:是否失去所有体力上限？');
              ('step 1');
              if (result.bool) {
                var num = Math.floor(player.maxHp / 2);
                player.draw(Math.min(3, num > 1 ? num : 1));
                player.loseMaxHp(player.maxHp);
              }
            },
          },
          eff: {
            charlotte: true,
            intro: {
              content: '攻击距离、使用【杀】的次数+#',
            },
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num + player.countMark('xijimrfz_eff');
              },
              attackRange(player, num) {
                return num + player.countMark('xijimrfz_eff');
              },
            },
            trigger: { player: 'phaseEnd' },
            silent: true,
            content() {
              player.removeMark('xijimrfz_eff', player.countMark('xijimrfz_eff'), false);
              player.removeSkill('xijimrfz_eff');
            },
          },
        },
      },
      jingmomrfz: {
        audio: 2,
        forced: true,
        trigger: { global: 'roundStart' },
        content() {
          player.loseMaxHp();
        },
        mod: {
          maxHandcardBase(player, num) {
            return 5;
          },
        },
      },
      //伊祖米克 水月
      chanshimrfz: {
        trigger: {
          source: 'damageEnd',
          global: 'roundStart',
        },
        filter(event, player) {
          return !player.hasSkill('chanshimrfz_ban');
        },
        content() {
          'step 0';
          player.addTempSkill('chanshimrfz_ban', 'phaseEnd');
          var list;
          if (_status.characterlist) {
            list = [];
            for (var i = 0; i < _status.characterlist.length; i++) {
              var name = _status.characterlist[i];
              list.push(name);
            }
          } else if (_status.connectMode) {
            list = get.charactersOL();
          } else {
            list = get.gainableCharacters();
          }
          var players = game.players.concat(game.dead);
          for (var i of players) {
            list.remove(i.name);
            list.remove(i.name1);
            list.remove(i.name2);
          }
          list = list.randomGets(2);
          var skills = [];
          for (var i of list) {
            skills.addArray(lib.character[i][3]);
          }
          if (!list.length || !skills.length) {
            event.finish();
            return;
          }
          if (player.isUnderControl()) {
            game.swapPlayerAuto(player);
          }
          var switchToAuto = function () {
            _status.imchoosing = false;
            event._result = {
              bool: true,
              skills: skills.randomGets(1),
            };
            if (event.dialog) event.dialog.close();
            if (event.control) event.control.close();
          };
          var chooseButton = function (list, skills) {
            var event = _status.event;
            if (!event._result) event._result = {};
            event._result.skills = [];
            var rSkill = event._result.skills;
            var dialog = ui.create.dialog('请获得一个技能', [list, 'character'], 'hidden');
            event.dialog = dialog;
            var table = document.createElement('div');
            table.classList.add('add-setting');
            table.style.margin = '0';
            table.style.width = '100%';
            table.style.position = 'relative';
            for (var i = 0; i < skills.length; i++) {
              var td = ui.create.div('.shadowed.reduce_radius.pointerdiv.tdnode');
              td.link = skills[i];
              table.appendChild(td);
              td.innerHTML = `<span>${get.translation(skills[i])}</span>`;
              td.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', function () {
                if (_status.dragged) return;
                if (_status.justdragged) return;
                _status.tempNoButton = true;
                setTimeout(function () {
                  _status.tempNoButton = false;
                }, 500);
                var link = this.link;
                if (!this.classList.contains('bluebg')) {
                  if (rSkill.length >= 1) return;
                  rSkill.add(link);
                  this.classList.add('bluebg');
                } else {
                  this.classList.remove('bluebg');
                  rSkill.remove(link);
                }
              });
            }
            dialog.content.appendChild(table);
            dialog.add('　　');
            dialog.open();
            event.switchToAuto = function () {
              event.dialog.close();
              event.control.close();
              _status.imchoosing = false;
            };
            event.control = ui.create.control('ok', function (link) {
              event.dialog.close();
              event.control.close();
              _status.imchoosing = false;
            });
            for (var i = 0; i < event.dialog.buttons.length; i++) {
              event.dialog.buttons[i].classList.add('selectable');
            }
            game.countChoose();
          };
          if (event.isMine()) {
            chooseButton(list, skills);
          } else if (event.isOnline()) {
            event.player.send(chooseButton, list, skills);
            event.player.wait();
          } else {
            switchToAuto();
          }
          ('step 1');
          var map = event.result || result;
          if (map && map.skills && map.skills.length) {
            for (var i of map.skills) player.addSkillLog(i);
          }
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //霜星
      xuexingmrfz: {
        audio: 2,
        mod: {
          targetEnabled(card) {
            if (card.name == 'sha' && card.nature == 'ice') return false;
          },
        },
        enable: ['chooseToRespond', 'chooseToUse'],
        filterCard(card, player) {
          return get.color(card) == 'black';
        },
        position: 'hes',
        viewAs: {
          name: 'sha',
          nature: 'ice',
        },
        viewAsFilter(player) {
          if (!player.countCards('hes', { color: 'black' })) return false;
        },
        prompt: '将一张黑色牌当冰【杀】使用或打出',
        check(card) {
          var val = get.value(card);
          if (_status.event.name == 'chooseToRespond') return 1 / Math.max(0.1, val);
          return 5 - val;
        },
        ai: {
          skillTagFilter(player) {
            if (get.zhu(player, 'shouyue')) {
              if (!player.countCards('hes')) return false;
            } else {
              if (!player.countCards('hes', { color: 'red' })) return false;
            }
          },
          respondSha: true,
          yingbian(card, player, targets, viewer) {
            if (get.attitude(viewer, player) <= 0) return 0;
            var base = 0,
              hit = false;
            if (get.cardtag(card, 'yingbian_hit')) {
              hit = true;
              if (
                targets.filter(function (target) {
                  return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                })
              )
                base += 5;
            }
            if (get.cardtag(card, 'yingbian_all')) {
              if (
                game.hasPlayer(function (current) {
                  return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                })
              )
                base += 5;
            }
            if (get.cardtag(card, 'yingbian_damage')) {
              if (
                targets.filter(function (target) {
                  return (
                    get.attitude(player, target) < 0 &&
                    (hit ||
                      !target.mayHaveShan() ||
                      player.hasSkillTag(
                        'directHit_ai',
                        true,
                        {
                          target: target,
                          card: card,
                        },
                        true,
                      )) &&
                    !target.hasSkillTag('filterDamage', null, {
                      player: player,
                      card: card,
                      jiu: true,
                    })
                  );
                })
              )
                base += 5;
            }
            return base;
          },
          canLink(player, target, card) {
            if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
            if (
              target.mayHaveShan() &&
              !player.hasSkillTag(
                'directHit_ai',
                true,
                {
                  target: target,
                  card: card,
                },
                true,
              )
            )
              return false;
            if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
            return true;
          },
          basic: {
            useful: [5, 3, 1],
            value: [5, 3, 1],
          },
          order(item, player) {
            if (player.hasSkillTag('presha', true, null, true)) return 10;
            if (game.hasNature(item, 'linked')) {
              if (
                game.hasPlayer(function (current) {
                  return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                }) &&
                game.countPlayer(function (current) {
                  return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                }) > 1
              )
                return 3.1;
              return 3;
            }
            return 3.05;
          },
          result: {
            target(player, target, card, isLink) {
              var eff = (function () {
                if (!isLink && player.hasSkill('jiu')) {
                  if (
                    !target.hasSkillTag('filterDamage', null, {
                      player: player,
                      card: card,
                      jiu: true,
                    })
                  ) {
                    if (get.attitude(player, target) > 0) {
                      return -7;
                    } else {
                      return -4;
                    }
                  }
                  return -0.5;
                }
                return -1.5;
              })();
              if (
                !isLink &&
                target.mayHaveShan() &&
                !player.hasSkillTag(
                  'directHit_ai',
                  true,
                  {
                    target: target,
                    card: card,
                  },
                  true,
                )
              )
                return eff / 1.2;
              return eff;
            },
          },
          tag: {
            respond: 1,
            respondShan: 1,
            damage(card) {
              if (game.hasNature(card, 'poison')) return;
              return 1;
            },
            natureDamage(card) {
              if (game.hasNature(card)) return 1;
            },
            fireDamage(card, nature) {
              if (game.hasNature(card, 'fire')) return 1;
            },
            thunderDamage(card, nature) {
              if (game.hasNature(card, 'thunder')) return 1;
            },
            poisonDamage(card, nature) {
              if (game.hasNature(card, 'poison')) return 1;
            },
          },
        },
        group: 'xuexingmrfz_draw',
        subSkill: {
          draw: {
            audio: 'xuexingmrfz',
            forced: true,
            trigger: { player: 'loseAfter' },
            filter(event, player) {
              return !player.isPhaseUsing() && event.parent.name == 'discard';
            },
            content() {
              player.draw();
            },
          },
        },
      },
      chegumrfz: {
        audio: 2,
        trigger: { player: 'useCardToPlayered' },
        filter(event, player) {
          if (!event.targets || !event.cards) return false;
          if (event.targets.length == 1 && event.targets[0] == player) return false;
          if (event.parent.triggeredTargets3.length > 1) return false;
          return game.hasPlayer(function (current) {
            return current != player && !current.hasSkill('chegumrfz_ban') && event.targets.includes(current);
          });
        },
        check(event, player) {
          return game.hasPlayer(function (current) {
            return current != player && get.attitude(current, player) < 0 && !current.hasSkill('chegumrfz_ban');
          });
        },
        content() {
          'step 0';
          event.targets = trigger.targets.remove(player);
          if (event.targets.length > 1) {
            player.chooseTarget([1, Infinity], true, '【彻骨】:请选择任意名成为目标的其他角色', function (card, player, target) {
              return target != player && event.targets.includes(target) && !target.hasSkill('chegumrfz_ban');
            }).ai = function (target) {
              return get.attitude(player, target) < 0;
            };
          }
          ('step 1');
          var disabledCardSkill = function (target) {
            var card = target.getCards('e', function (card) {
              return get.subtype(card) != 'equip5';
            });
            if (!card) return;
            for (var i = 0; i < card.length; i++) {
              var info = get.info(card[i]);
              var skills = info.skills;
              if (!info.skills) return;
              for (var j = 0; j < skills.length; j++) {
                target.disabledSkills[skills[j]] = true;
              }
            }
          };
          if (result.targets?.length) {
            var targets = result.targets;
            for (var i of targets) {
              i.addSkill('chegumrfz_ban');
              i.markSkill('chegumrfz_ban');
              player.line(i);
              disabledCardSkill(i);
            }
          } else {
            event.targets[0].addSkill('chegumrfz_ban');
            event.targets[0].markSkill('chegumrfz_ban');
            disabledCardSkill(event.targets[0]);
            player.line(event.targets[0]);
          }
        },
        subSkill: {
          ban2: {
            silent: true,
            charlotte: true,
            forced: true,
            trigger: { player: ['loseEnd', 'useCardAfter'] },
            content() {
              var disabledCardSkill = function (player) {
                var card = player.getCards('e', function (card) {
                  return get.subtype(card) != 'equip5';
                });
                if (!card) return;
                for (var i = 0; i < card.length; i++) {
                  var info = get.info(card[i]);
                  var skills = info.skills;
                  if (!info.skills) return;
                  for (var j = 0; j < skills.length; j++) {
                    player.disabledSkills[skills[j]] = true;
                  }
                }
              };
              player.disabledSkills = {};
              disabledCardSkill(player);
            },
          },
          ban: {
            silent: true,
            charlotte: true,
            forced: true,
            init(player, skill) {
              player.addSkillBlocker(skill);
            },
            onremove(player, skill) {
              player.removeSkillBlocker(skill);
            },
            skillBlocker(skill, player) {
              var info = get.skillInfoTranslation(skill, player);
              var name = get.translation(skill);
              return !info.includes('冰') && !name.includes('冰') && skill != 'chegumrfz_ban' && skill != 'chegumrfz_ban2';
            },
            trigger: { player: 'phaseEnd' },
            content() {
              player.disabledSkills = {};
              player.removeSkill('chegumrfz_ban');
              player.unmarkSkill('chegumrfz_ban');
            },
            intro: {
              content(event, player) {
                var cards = player.getCards('e');
                var list = player.getSkills(null, false, false).filter(function (i) {
                  return lib.skill.chegumrfz_ban.skillBlocker(i, player);
                });
                var str = '彻骨极寒令你行动缓慢</br>';
                if (list.length) str = str + `失效的技能:${get.translation(list)}</br>`;
                else str = str + '无失效的技能</br>';
                if (cards.length) str = str + '失效的装备:' + get.translation(cards);
                else str = str + '无失效的装备</br>';
                return str;
              },
            },
            group: 'chegumrfz_ban2',
            ai: {
              igequips: [1, 2, 3, 4, 5],
            },
          },
        },
      },
      newchegumrfz: {
        audio: 'chegumrfz',
        trigger: { player: 'useCardToPlayered' },
        filter(event, player) {
          if (!event.targets || !event.cards) return false;
          if (event.targets.length == 1 && event.targets[0] == player) return false;
          if (event.parent.triggeredTargets3.length > 1) return false;
          var list = [];
          var listm = [];
          var listv = [];
          if (event.player.name1 != undefined) listm = lib.character[event.player.name1][3];
          else listm = lib.character[event.player.name][3];
          if (event.player.name2 != undefined) listv = lib.character[event.player.name2][3];
          listm = listm.concat(listv);
          var func = function (skill) {
            var info = get.info(skill);
            if (!info || info.charlotte) return false;
            return true;
          };
          for (var i = 0; i < listm.length; i++) {
            if (func(listm[i])) list.add(listm[i]);
          }
          return (
            list.length &&
            game.hasPlayer(function (current) {
              return current != player && !current.hasSkill('newchegumrfz_ban') && event.targets.includes(current);
            })
          );
        },
        check(event, player) {
          var enemy = [];
          for (var i of game.players) {
            if (get.attitude(i, player) < 0) enemy.add(i);
          }
          return enemy.some((element) => {
            return event.targets.includes(element);
          });
        },
        content() {
          'step 0';
          event.targets = trigger.targets.remove(player);
          if (event.targets.length > 1) {
            player.chooseTarget([1, Infinity], true, '【彻骨】:请选择任意名成为目标的其他角色', function (card, player, target) {
              return target != player && event.targets.includes(target) && !target.hasSkill('newchegumrfz_ban');
            }).ai = function (target) {
              return get.attitude(player, target) < 0;
            };
          }
          ('step 1');
          var disabledCardSkill = function (target) {
            var card = target.getCards('e', function (card) {
              return get.subtype(card) != 'equip5';
            });
            if (!card) return;
            for (var i = 0; i < card.length; i++) {
              var info = get.info(card[i]);
              var skills = info.skills;
              if (!info.skills) return;
              for (var j = 0; j < skills.length; j++) {
                target.disableSkill('newchegumrfz_ban', skills[j]);
              }
            }
          };
          var func = function (skill, str) {
            var info = get.info(skill);
            var name = get.translation(skill);
            var intro = get.skillInfoTranslation(skill);
            if (name.includes(str) || intro.includes(str)) return false;
            if (!info || info.charlotte) return false;
            return true;
          };
          var func2 = function (player) {
            var list = [];
            var listm = [];
            var listv = [];
            if (player.name1 != undefined) listm = lib.character[player.name1][3];
            else listm = lib.character[player.name][3];
            if (player.name2 != undefined) listv = lib.character[player.name2][3];
            listm = listm.concat(listv);
            for (var i = 0; i < listm.length; i++) {
              if (func(listm[i], '冰')) list.add(listm[i]);
            }
            return list;
          };
          if (result.targets?.length) {
            var targets = result.targets;
            for (var i of targets) {
              var list = func2(i);
              for (j of list) {
                i.addTempSkill('newchegumrfz_ban', { player: 'phaseEnd' });
                i.disableSkill('newchegumrfz_ban', j);
              }
              player.line(i);
              disabledCardSkill(i);
            }
          } else {
            var list = func2(event.targets[0]);
            for (var i of list) {
              event.targets[0].addTempSkill('newchegumrfz_ban', { player: 'phaseEnd' });
              event.targets[0].disableSkill('newchegumrfz_ban', i);
            }
            disabledCardSkill(event.targets[0]);
            player.line(event.targets[0]);
          }
        },
        subSkill: {
          ban: {
            ai: {
              igequips: [1, 2, 3, 4],
            },
            onremove(player, skill) {
              player.enableSkill(skill);
            },
            mark: true,
            charlotte: true,
            intro: {
              content(storage, player, skill) {
                let list = Object.keys(player.disabledSkills);
                var cards = player.getCards('e');
                if (cards.length) {
                  var strC = '失效装备:';
                  if (Array.isArray(cards))
                    for (var i of cards) {
                      strC += get.translation(i) + '、';
                    }
                  strC = strC.slice(0, strC.length - 1);
                }
                if (list.length) {
                  var strS = '失效技能:';
                  for (var i = 0; i < list.length; i++) {
                    if (lib.translate[list[i] + '_info']) strS += get.translation(list[i]) + '、';
                  }
                  strS = strS.slice(0, strS.length - 1);
                }
                if (strC === undefined) strC = '无失效装备';
                if (strS === undefined) strS = '无失效技能';
                var text = '<span style="font-family: yuanli"><font color=#8dc2f6>彻骨极寒令你行动缓慢</font></span></br>';
                return text + strC + '</br>' + strS;
              },
            },
          },
        },
      },
      donghenmrfz: {
        audio: 2,
        derivation: ['ranmingmrfz'],
        trigger: { player: 'dying' },
        filter(event, player) {
          return player.hp <= 0;
        },
        check(event, player) {
          return (
            player.hp +
            player.countCards('h', function (card) {
              return card.name == 'tao' || card.name == 'jiu';
            }) <
            1
          );
        },
        content() {
          player.node.avatar.setBackgroundImage('extension/驶舰之向/image/orther/donghenshuangxingmrfz.jpg');
          player.node.name.innerHTML = get.translation('donghenshuangxingmrfz');
          player.gainMaxHp();
          player.recoverTo(player.maxHp + 1);
          player.addSkill('ranmingmrfz');
          player.removeSkill('xuexingmrfz');
          player.removeSkill('donghenmrfz');
          player.addSkill('donghenmrfz_shacount');
        },
        subSkill: {
          shacount: {
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num + 1;
              },
            },
          },
        },
      },
      ranmingmrfz: {
        audio: 2,
        forced: true,
        trigger: { source: 'damageEnd' },
        filter(event, player) {
          return event.source != undefined;
        },
        content() {
          player.loseHp();
        },
        group: ['ranmingmrfz_draw', 'ranmingmrfz_cancel', 'ranmingmrfz_sha'],
        subSkill: {
          sha: {
            enable: ['chooseToRespond', 'chooseToUse'],
            filterCard: true,
            position: 'hes',
            viewAs: {
              name: 'sha',
              nature: 'ice',
            },
            prompt: '将一张牌当冰【杀】使用或打出',
            check(card) {
              var val = get.value(card);
              if (_status.event.name == 'chooseToRespond') return 1 / Math.max(0.1, val);
              return 5 - val;
            },
            ai: {
              skillTagFilter(player) {
                if (get.zhu(player, 'shouyue')) {
                  if (!player.countCards('hes')) return false;
                } else {
                  if (!player.countCards('hes', { color: 'red' })) return false;
                }
              },
              respondSha: true,
              yingbian(card, player, targets, viewer) {
                if (get.attitude(viewer, player) <= 0) return 0;
                var base = 0,
                  hit = false;
                if (get.cardtag(card, 'yingbian_hit')) {
                  hit = true;
                  if (
                    targets.filter(function (target) {
                      return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                    })
                  )
                    base += 5;
                }
                if (get.cardtag(card, 'yingbian_all')) {
                  if (
                    game.hasPlayer(function (current) {
                      return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                    })
                  )
                    base += 5;
                }
                if (get.cardtag(card, 'yingbian_damage')) {
                  if (
                    targets.filter(function (target) {
                      return (
                        get.attitude(player, target) < 0 &&
                        (hit ||
                          !target.mayHaveShan() ||
                          player.hasSkillTag(
                            'directHit_ai',
                            true,
                            {
                              target: target,
                              card: card,
                            },
                            true,
                          )) &&
                        !target.hasSkillTag('filterDamage', null, {
                          player: player,
                          card: card,
                          jiu: true,
                        })
                      );
                    })
                  )
                    base += 5;
                }
                return base;
              },
              canLink(player, target, card) {
                if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                if (
                  target.mayHaveShan() &&
                  !player.hasSkillTag(
                    'directHit_ai',
                    true,
                    {
                      target: target,
                      card: card,
                    },
                    true,
                  )
                )
                  return false;
                if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                return true;
              },
              basic: {
                useful: [5, 3, 1],
                value: [5, 3, 1],
              },
              order(item, player) {
                if (player.hasSkillTag('presha', true, null, true)) return 10;
                if (game.hasNature(item, 'linked')) {
                  if (
                    game.hasPlayer(function (current) {
                      return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                    }) &&
                    game.countPlayer(function (current) {
                      return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                    }) > 1
                  )
                    return 3.1;
                  return 3;
                }
                return 3.05;
              },
              result: {
                target(player, target, card, isLink) {
                  var eff = (function () {
                    if (!isLink && player.hasSkill('jiu')) {
                      if (
                        !target.hasSkillTag('filterDamage', null, {
                          player: player,
                          card: card,
                          jiu: true,
                        })
                      ) {
                        if (get.attitude(player, target) > 0) {
                          return -7;
                        } else {
                          return -4;
                        }
                      }
                      return -0.5;
                    }
                    return -1.5;
                  })();
                  if (
                    !isLink &&
                    target.mayHaveShan() &&
                    !player.hasSkillTag(
                      'directHit_ai',
                      true,
                      {
                        target: target,
                        card: card,
                      },
                      true,
                    )
                  )
                    return eff / 1.2;
                  return eff;
                },
              },
              tag: {
                respond: 1,
                respondShan: 1,
                damage(card) {
                  if (game.hasNature(card, 'poison')) return;
                  return 1;
                },
                natureDamage(card) {
                  if (game.hasNature(card)) return 1;
                },
                fireDamage(card, nature) {
                  if (game.hasNature(card, 'fire')) return 1;
                },
                thunderDamage(card, nature) {
                  if (game.hasNature(card, 'thunder')) return 1;
                },
                poisonDamage(card, nature) {
                  if (game.hasNature(card, 'poison')) return 1;
                },
              },
            },
          },
          cancel: {
            forced: true,
            trigger: { player: 'recoverBegin' },
            filter(event, player) {
              return event.parent.name != 'donghenmrfz';
            },
            content() {
              trigger.cancel();
              game.log(player, '的体力回复被阻止');
            },
          },
          draw: {
            forced: true,
            trigger: { player: 'loseEnd' },
            filter(event, player) {
              var evt = event.getl(player);
              for (var i of evt.hs) {
                if (get.position(i, true) == 'd') return true;
              }
              return false;
            },
            content() {
              player.draw();
            },
          },
        },
        ai: {
          effect: {
            target(card, player, target, current) {
              if (get.tag(card, 'recover')) return 'zerotarget';
            },
          },
        },
      },
      //爱国者
      junxingmrfz: {
        //audio:2,
        trigger: {
          player: ['phaseZhunbeiEnd', 'phaseJudgeEnd', 'phaseDrawEnd', 'phaseUseEnd', 'phaseDiscardEnd', 'phaseJieshuEnd'],
        },
        lastDo: true,
        derivation: ['tongxie'],
        filter(event, player) {
          var damage = player.getStat().damage;
          var num = player.countMark('junxingmrfz');
          if (damage > num || damage == 0) return false;
          if (
            !game.hasPlayer((current) => {
              return player != current && player.inRangeOf(current) && current.countCards('h') > 0;
            })
          )
            return false;
          if (player.countCards('h') == 0) return false;
          return damage == num;
        },
        check(event, player) {
          return game.hasPlayer((current) => {
            return player != current && player.inRangeOf(current) && current.countCards('h') > 0 && get.attitude(current, player) < 0 && get.effect(current, { name: 'sha' }, player, player) > 0;
          });
        },
        prompt: '【军行】:你可以与一名攻击范围内的其他角色进行拼点',
        content() {
          'step 0';
          player.chooseTarget(true, function (cards, target, player) {
            return target != player && player.inRangeOf(target) && target.countCards('h') > 0;
          }).ai = function (target) {
            return get.effect(target, { name: 'sha' }, player, player) > 0;
          };
          ('step 1');
          if (result.targets?.length) {
            event.target = result.targets[0];
            var target = result.targets[0];
            if (target.countCards('h') > 0) player.chooseToCompare(target);
            else event.finish();
          } else event.finish();
          ('step 2');
          if (result.bool) {
            player.useCard({ name: 'sha' }, true, event.target);
          } else event.target.useCard({ name: 'sha' }, true, player);
        },
        group: ['junxingmrfz_direct', 'junxingmrfz_phase', 'junxingmrfz_sha', 'junxingmrfz_tx'],
        subSkill: {
          tx: {
            trigger: {
              player: ['loseAfter', 'changeHp', 'gainMaxHpAfter', 'loseMaxHpAfter'],
              global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter', 'roundStart'],
            },
            forced: true,
            filter(event, player) {
              return (player.hasSkill('tongxie') && player.getDamagedHp() >= 2) || (!player.hasSkill('tongxie') && player.getDamagedHp() < 2);
            },
            content() {
              if (player.hasSkill('tongxie') && player.getDamagedHp() >= 2) player.removeSkill('tongxie');
              else player.addSkill('tongxie');
            },
          },
          ban: {
            charlotte: true,
          },
          sha: {
            forced: true,
            trigger: { player: 'useCard' },
            filter(event, player) {
              return event.card && event.card.name == 'sha' && !player.hasSkill('junxingmrfz_ban') && player.getDamagedHp() >= 2;
            },
            content() {
              trigger.effectCount++;
              player.addTempSkill('junxingmrfz_ban', 'phaseEnd');
            },
          },
          phase: {
            silent: true,
            charlotte: true,
            firstDo: true,
            trigger: {
              player: ['phaseZhunbeiEnd', 'phaseJudgeEnd', 'phaseDrawEnd', 'phaseUseEnd', 'phaseDiscardEnd', 'phaseJieshuEnd'],
            },
            content() {
              player.addMark('junxingmrfz', 1, false);
            },
            group: 'junxingmrfz_clear',
          },
          clear: {
            silent: true,
            charlotte: true,
            firstDo: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.removeAllmark('junxingmrfz', false);
            },
          },
          direct: {
            //audio:'junxingmrfz',
            forced: true,
            trigger: {
              player: 'useCard',
            },
            filter(event, player) {
              return (
                event.card &&
                (get.type(event.card) == 'trick' || (get.type(event.card) == 'basic' && !['shan', 'tao', 'jiu', 'du'].includes(event.card.name))) &&
                game.hasPlayer(function (current) {
                  return current != player && current.hp <= player.hp;
                })
              );
            },
            content() {
              trigger.directHit.addArray(
                game.filterPlayer(function (current) {
                  return current != player && current.hp <= player.hp;
                }),
              );
            },
            ai: {
              directHit_ai: true,
              skillTagFilter(player, tag, arg) {
                return arg.target.hp < player.hp;
              },
            },
          },
        },
        ai: {
          expose: 0.1,
          effect: {
            target(card, player, target, current) {
              if (get.type(card) == 'delay') return 'zeroplayertarget';
            },
          },
        },
      },
      youjimrfz: {
        //audio:2,
        forced: true,
        init(player) {
          player.storage.youjimrfz = [];
        },
        trigger: {
          player: 'phaseBegin',
        },
        content() {
          'step 0';
          if (player.isUnderControl()) {
            game.swapPlayerAuto(player);
          }
          var chooseButton = function (phases) {
            var event = _status.event;
            if (!event._result) event._result = {};
            event._result.phases = [];
            event._result.phases2 = [];
            var endphases = event._result.phases;
            var rphases = event._result.phases2;
            var dialog = ui.create.dialog('【游击】:你可以掉换执行阶段的顺序</br>执行顺序为由左到右依次执行', 'hidden');
            event.dialog = dialog;
            var table = document.createElement('div');
            table.classList.add('add-setting');
            table.style.margin = '0';
            table.style.width = '100%';
            table.style.position = 'relative';
            var tdList = [];
            var clickHandler = function () {
              if (_status.dragged) return;
              if (_status.justdragged) return;
              _status.tempNoButton = true;
              setTimeout(function () {
                _status.tempNoButton = false;
              }, 500);
              var link = this.link;
              if (!this.classList.contains('bluebg')) {
                if (endphases.length >= 2) return;
                endphases.push(link);
                this.classList.add('bluebg');
              } else {
                this.classList.remove('bluebg');
                endphases.splice(endphases.indexOf(link), 1);
              }
              for (var i = 0; i < tdList.length; i++) {
                if (tdList[i] !== this) {
                  tdList[i].classList.remove('bluebg');
                }
              }
              if (endphases.length == 2) {
                var index1 = phases.indexOf(endphases[0]);
                var index2 = phases.indexOf(endphases[1]);
                if (index1 >= 0 && index2 >= 0 && index1 < tdList.length && index2 < tdList.length) {
                  var tempNode = tdList[index1];
                  var tempNode2 = tdList[index2];
                  var tempLink = tempNode.link;
                  var tempIndex = phases.indexOf(tempNode.link);
                  tempNode.link = tempNode2.link;
                  tempNode.innerHTML = `<span>${get.tranPhase(tempNode2.link)}</span>`;
                  tempNode2.link = tempLink;
                  tempNode2.innerHTML = `<span>${get.tranPhase(tempLink)}</span>`;
                  phases[index1] = tempNode.link;
                  phases[index2] = tempNode2.link;
                  tempNode.classList.remove('bluebg');
                  tempNode2.classList.remove('bluebg');
                  event._result.phases2 = phases;
                  event._result.phases.length = 0;
                }
              }
            };
            for (var i = 0; i < phases.length; i++) {
              var td = ui.create.div('.shadowed.reduce_radius.pointerdiv.tdnode');
              td.link = phases[i];
              table.appendChild(td);
              td.innerHTML = `<span>${get.tranPhase(phases[i])}</span>`;
              tdList.push(td);
              td.addEventListener(lib.config.touchscreen ? 'touchend' : 'click', clickHandler);
            }
            dialog.content.appendChild(table);
            dialog.add('　　');
            dialog.open();
            event.switchToAuto = function () {
              event.dialog.close();
              event.control.close();
              _status.imchoosing = false;
            };
            event.control = ui.create.control('ok', function (link) {
              event.dialog.close();
              event.control.close();
              _status.imchoosing = false;
            }); //QQQ
            for (var i = 0; i < event.dialog.buttons.length; i++) {
              event.dialog.buttons[i].classList.add('selectable');
            }
          };
          var switchToAuto = function () {
            _status.imchoosing = false;
            event._result = {
              bool: true,
              phases2: ['phaseUse', 'phaseDraw', 'phaseDiscard', 'phaseZhunbei', 'phaseJieshu', 'phaseJudge'],
            };
            if (event.dialog) event.dialog.close();
            if (event.control) event.control.close();
          };
          var phase = ['phaseZhunbei', 'phaseJudge', 'phaseDraw', 'phaseUse', 'phaseDiscard', 'phaseJieshu'];
          if (event.isMine()) {
            chooseButton(phase);
          } else if (event.isOnline()) {
            event.player.send(chooseButton, phase);
            event.player.wait();
          } else {
            switchToAuto();
          }
          ('step 1');
          var map = event.result || result;
          player.storage.youjimrfz = map.phases2;
          player.storage.youjimrfz2 = ['phaseZhunbei', 'phaseJudge', 'phaseDraw', 'phaseUse', 'phaseDiscard', 'phaseJieshu'];
        },
        group: 'youjimrfz_phase',
        subSkill: {
          phase: {
            silent: true,
            charlotte: true,
            firstDo: true,
            trigger: {
              player: ['phaseZhunbeiBefore', 'phaseJudgeBefore', 'phaseDrawBefore', 'phaseUseBefore', 'phaseDiscardBefore', 'phaseJieshuBefore'],
            },
            filter(event, player) {
              if (!player.storage.youjimrfz2 || !player.storage.youjimrfz) return false;
              if (!player.isPhase(player.storage.youjimrfz2[0])) return false;
              else player.storage.youjimrfz2.shift();
              return player.storage.youjimrfz.length;
            },
            content() {
              var newPhase = player.storage.youjimrfz[0];
              player.storage.youjimrfz.shift();
              trigger.cancel();
              var next = trigger.player[newPhase]();
              event.next.remove(next);
              trigger.getParent('phase').next.push(next);
            },
          },
        },
      },
      //斗士塔露拉
      juhuomrfz: {
        trigger: { player: 'useCardAfter' },
        filter(event, player) {
          if (player.hasSkill('juhuomrfz_ban')) return false;
          return (
            event.card &&
            get.tag(event.card, 'damage') > 0 &&
            game.hasPlayer2((current) => {
              return current.hasHistory('damage', (evt) => {
                return event.card == evt.card;
              });
            })
          );
        },
        prompt2(event, player) {
          var num = player.getHistory('sourceDamage', function (evt) {
            return evt.card == event.card;
          }).length;
          var num2 = event.card.number;
          return `【聚火】:是否增加${num}点体力上限(此牌点数<span class=firetext>` + (player.hp < num2 ? '大于' : '不大于') + '</span>你的体力值)';
        },
        content() {
          'step 0';
          var num = player.getHistory('sourceDamage', function (evt) {
            return evt.card == trigger.card;
          }).length;
          player.gainMaxHp(num);
          ('step 1');
          var num2 = trigger.card.number;
          if (num2 > player.hp) {
            player.drawTo(player.maxHp);
          } else {
            player.loseMaxHp(player.maxHp - num2);
            player.recoverTo(player.maxHp);
          }
          player.addTempSkill('juhuomrfz_ban', { global: 'phaseEnd' });
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      xuehengmrfz: {
        mode: ['identity'],
        forced: true,
        juexingji: true,
        derivation: ['shihunmrfz', 'hantianmrfz'],
        trigger: { player: 'phaseBegin' },
        filter(event, player) {
          return player.maxHp > game.countPlayer();
        },
        content() {
          'step 0';
          player.awakenSkill('xuehengmrfz');
          player.removeSkill('juhuomrfz');
          ('step 1');
          var hasfriendDeath = function (player, identity) {
            var bool = false;
            if (identity == 'zhu') identity = 'zhong';
            for (var i of game.players) {
              if (!game.dead.includes(i)) continue;
              if (identity == 'zhu' && i.identity == 'zhong') bool = true;
              if (identity == i.identity) bool = true;
            }
            return bool;
          };
          var dead = hasfriendDeath(player, player.identity);
          if (player.countCards('h') > player.hp && dead == false) {
            player.addSkill('hantianmrfz');
          } else {
            player.node.name.innerHTML = '塔露拉？';
            game.broadcastAll(function (player, shown) {
              var identity = player.identity;
              if (identity != 'zhu') {
                player.identity = 'nei';
                if (player == game.me) {
                  player.setIdentity();
                }
              } else {
                for (var i of game.players) {
                  if (player == i) continue;
                  if (i.identity == 'fan') continue;
                  i.identity = 'fan';
                  i.setIdentity();
                }
              }
            }, player);
            player.addSkill('shihunmrfz');
          }
          player.recoverTo(player.maxHp);
        },
      },
      shihunmrfz: {
        mod: {
          cardUsable(card, player, num) {
            return Infinity;
          },
        },
        forced: true,
        trigger: { player: 'phaseZhunbeiBegin' },
        content() {
          for (var i of game.players) {
            player.line(i);
            i.damage(2, 'fire');
          }
        },
        ai: {
          threaten: 3,
        },
        group: ['shihunmrfz_onedamage', 'shihunmrfz_draw'],
        subSkill: {
          draw: {
            forced: true,
            trigger: { player: 'phaseJieshuBegin' },
            filter(event, player) {
              return game.dead.length;
            },
            content() {
              player.draw(game.dead.length);
            },
            ai: {
              threaten() {
                return Math.max(game.dead.length, 1.5);
              },
            },
          },
          onedamage: {
            forced: true,
            trigger: { player: 'damageBegin4' },
            filter(event, player) {
              return event.num > 1;
            },
            content() {
              trigger.num = 1;
            },
          },
        },
      },
      hantianmrfz: {
        marktext: '志城',
        intro: {
          name: '志城',
          content: '众志成城',
        },
        trigger: { player: 'phaseZhunbeiBegin' },
        filter(event, player) {
          return !game.hasPlayer((current) => {
            return current.hasMark('hantianmrfz');
          });
        },
        forced: true,
        content() {
          'step 0';
          for (var i of game.players) {
            if (player.identity == 'nei' && i == player) i.addMark('hantianmrfz');
            if ((player.identity == 'zhu' && i.identity == 'zhong') || (player.identity == 'zhong' && i.identity == 'zhu')) {
              i.addMark('hantianmrfz');
            }
            if (player.identity == i.identity) i.addMark('hantianmrfz');
          }
          ('step 1');
          var targets = game.filterPlayer((current) => {
            return current.hasMark('hantianmrfz');
          });
          var num = 0;
          for (var i = 0; i < targets.length; i++) {
            var maxhp = targets[i].maxHp;
            if (maxhp > num) num = maxhp;
          }
          for (var i of targets) {
            i.gainMaxHp(num - i.maxHp);
          }
          ('step 2');
          var targets = game.filterPlayer((current) => {
            return current.hasMark('hantianmrfz');
          });
          for (var i of targets) {
            i.recoverTo(player.maxHp);
          }
        },
        group: ['hantianmrfz_sha'],
        subSkill: {
          ban: {
            charlotte: true,
          },
          sha: {
            trigger: { global: 'useCardAfter' },
            filter(event, player) {
              if (player.hasSkill('hantianmrfz_ban') || event.card.name != 'sha' || !event.targets.length) return false;
              if (event.getParent(2).name == 'hantianmrfz_sha') return false;
              if (!event.player.hasMark('hantianmrfz')) return false;
              var list = game.filterPlayer((current) => {
                return current.hasMark('hantianmrfz');
              }),
                targets = event.targets;
              for (var i of list) {
                for (var j of targets) {
                  if (i == event.player || !i.isIn()) continue;
                  if (!i.canUse('sha', j, false)) continue;
                  if (_status.connectMode && i.countCards('hs') > 0) return true;
                  if (i.hasSha()) return true;
                }
              }
              return false;
            },
            forced: true,
            popup: false,
            charlotte: true,
            content() {
              'step 0';
              event.sources = game
                .filterPlayer((current) => {
                  return current.hasMark('hantianmrfz') && current != trigger.player;
                })
                .sortBySeat();
              event.targets = trigger.targets;
              ('step 1');
              var current = event.sources.shift();
              var targets = [];
              event.draw = current;
              for (var i of event.targets) {
                if (!i.isIn()) continue;
                if (!current.canUse('sha', i, false)) continue;
                targets.push(i);
              }
              if (current.isIn() && (_status.connectMode || current.hasSha())) {
                current
                  .chooseToUse(
                    function (card, player, event) {
                      if (card.name != 'sha') return false;
                      return lib.filter.filterCard.apply(this, arguments);
                    },
                    `【熯天】:是否对${get.translation(targets)}使用一张杀？`,
                  )
                  .set('targetRequired', true)
                  .set('complexSelect', true)
                  .set('filterTarget', function (card, player, target) {
                    if (!_status.event.sourcex.includes(target)) return false;
                    return lib.filter.targetEnabled.apply(this, arguments);
                  })
                  .set('sourcex', targets)
                  .set('addCount', false);
              }
              ('step 2');
              if (result.bool) event.draw.draw();
              if (event.sources.length) event.goto(1);
            },
          },
        },
      },
      //特蕾西娅
      bojimrfz: {
        init(player, skill) {
          player.storage[skill] = {
            color: null,
            players: [],
          };
        },
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return player.countCards('h') > 0;
        },
        filterTarget(card, player, target) {
          return target.countCards('h') > 0;
        },
        selectTarget: -1,
        multitarget: true,
        multiline: true,
        async content(event, trigger, player) {
          var targets = event.targets.slice(),
            cardsx = [];
          while (targets.length) {
            var prompt = `【博济】:请展示一张手牌
                        ${player == targets[0] && player.storage.bojimrfz.color != null ? '' : `<br>${get.translation(player)}展示的牌的颜色为:` + get.translation(player.storage.bojimrfz.color)}`;
            const cards = await targets[0]
              .chooseCard(true)
              .set('prompt', prompt)
              .set('ai', function (card) {
                var att = get.attitude(_status.event.player, _status.event.targetx),
                  color = _status.event.color;
                if (_status.event.targetx == _status.event.player) return Math.random();
                else if (att > 0) {
                  if (get.color(card) == color) return 10;
                  else return 1;
                } else {
                  if (get.color(card) == color) return 1;
                  else return 10;
                }
              })
              .set('targetx', player)
              .set('color', player.storage.bojimrfz.color)
              .forResult('cards');
            if (!cards) return;
            cardsx.push(cards[0]);
            if (targets[0] == player) {
              player.storage.bojimrfz.color = get.color(cards[0]);
              player.storage.bojimrfz.players.add(player);
            } else if (get.color(cards[0]) == player.storage.bojimrfz.color) {
              player.storage.bojimrfz.players.add(targets[0]);
              targets[0].popup('追随殿下');
            } else targets[0].popup('拒绝殿下');
            game.log(targets[0], '展示了', cards);
            targets.shift();
          }
          event.videoId = lib.status.videoId++;
          game.broadcastAll(
            function (targets, cards, id, player) {
              var dialog = ui.create.dialog(get.translation(player) + `发动了【博济】<br>${get.translation(player)}展示牌的颜色为` + get.translation(player.storage.bojimrfz.color), cards);
              dialog.videoId = id;
              var getName = function (target) {
                if (target._tempTranslate) return target._tempTranslate;
                var name = target.name;
                if (lib.translate[`${name}_ab`]) return lib.translate[`${name}_ab`];
                return get.translation(name);
              };
              for (var i = 0; i < targets.length; i++) {
                var showstr = getName(targets[i]),
                  color = get.color(i);
                switch (color) {
                  case 'red':
                    showstr = `<font color=#FF0000>${showstr}</font>`;
                    break;
                  case 'black':
                    showstr = `<font color=#000000>${showstr}</font>`;
                    break;
                  default:
                    showstr = `<font color=#FFFAFA>${showstr}</font>`;
                    break;
                }
                if (color == player.storage.bojimrfz.color) showstr = showstr + '<font color=#00FF00>√</font>';
                else showstr = showstr + '×';
                dialog.buttons[i].querySelector('.info').innerHTML = showstr;
              }
            },
            event.targets,
            cardsx,
            event.videoId,
            player,
          );
          for (var i of player.storage.bojimrfz.players) {
            i.addSkill(['bojimrfz_mark', 'bojimrfz_eff1']);
            i.storage.bojimrfz_mark = player;
          }
          player.addTempSkill('bojimrfz_eff2', { player: 'phaseUseBegin' });
          let { promise, resolve } = Promise.withResolvers();
          setTimeout(() => {
            game.broadcastAll('closeDialog', event.videoId);
            resolve();
          }, 3000);
          await promise;
        },
        ai: {
          order: 13,
          threaten: 2.3,
          result: {
            player: 1,
          },
        },
        group: ['bojimrfz_clear'],
        subSkill: {
          mark: {
            mark: true,
            intro: {
              content(event, player) {
                var target = game.findPlayer((current) => {
                  return current == player.storage.bojimrfz_mark;
                });
                var storage = target.storage.bojimrfz.players.slice();
                storage.remove(target);
                if (storage.length == 0) return `<font color=#FFD700>${get.translation(target)}</font>孤身一人`;
                return `<font color=#FFD700>${get.translation(storage)}</font>追随着<font color=#FFD700>${get.translation(target)}</font>殿下`;
              },
            },
            charlotte: true,
            silent: true,
            firstDo: true,
            forceDie: true,
            trigger: {
              player: 'die',
            },
            content() {
              var target = game.findPlayer((current) => {
                return current == player.storage.bojimrfz_mark;
              });
              if (!target) return;
              target.storage.bojimrfz.players.remove(trigger.player);
              player.removeSkill('bojimrfz_mark');
            },
          },
          clear: {
            charlotte: true,
            silent: true,
            trigger: { player: ['phaseUseBegin', 'die'] },
            forceDie: true,
            filter(event, player) {
              return player.storage.bojimrfz.players.length;
            },
            content() {
              for (var i of player.storage.bojimrfz.players) {
                i.removeSkill('bojimrfz_eff1');
                i.removeSkill('bojimrfz_group');
                i.removeSkill('bojimrfz_mark');
              }
              player.storage.bojimrfz = {
                color: null,
                players: [],
              };
            },
          },
          eff1: {
            silent: true,
            charlotte: true,
            trigger: {
              global: ['loseEnd', 'equipEnd', 'addJudgeEnd', 'gainEnd', 'loseAsyncEnd', 'addToExpansionEnd', 'bojimrfzAfter'],
            },
            filter(event, player) {
              return player.hasSkill('bojimrfz_mark') ^ player.hasSkill('bojimrfz_group');
            },
            async content(event, trigger, player) {
              if (player.hasSkill('bojimrfz_mark')) {
                var cards = [],
                  target = game.findPlayer((current) => {
                    return current == player.storage.bojimrfz_mark;
                  });
                for (var i of target.storage.bojimrfz.players) {
                  if (i.countCards('h') == 0) continue;
                  if (i == player) continue;
                  for (var j of i.getCards('h')) cards.push(j);
                }
                var cardsx = cards.map((card) => {
                  var cardx = ui.create.card();
                  cardx.init(get.cardInfo(card));
                  cardx._cardid = card.cardid;
                  return cardx;
                });
                player.directgains(cardsx, null, 'bojimrfz');
                player.addSkill('bojimrfz_group');
              } else player.removeSkill('bojimrfz_group');
            },
          },
          group: {
            charlotte: true,
            group: ['bojimrfz_eff_use', 'bojimrfz_eff_lose'],
            trigger: {
              global: ['addJudgeAfter', 'gainAfter', 'loseAfter', 'loseAsyncAfter', 'cardsDiscardAfter', 'equipAfter'],
            },
            forced: true,
            silent: true,
            filter(event, player) {
              if (event.name == 'gain') return event.cards && event.cards.length;
              var cards = event.getd();
              return cards.length;
            },
            onremove(player) {
              var cards2 = player.getCards('s', (card) => {
                return card.hasGaintag('bojimrfz');
              });
              if (player.isOnline2()) {
                player.send(
                  function (cards, player) {
                    cards.forEach((i) => i.delete());
                    if (player == game.me) ui.updatehl();
                  },
                  cards2,
                  player,
                );
              }
              cards2.forEach((i) => i.delete());
              if (player == game.me) ui.updatehl();
            },
            content() {
              var cards = [];
              var idList = player.getCards('s', (card) => card.hasGaintag('bojimrfz')).map((i) => i._cardid);
              var target = game.findPlayer((current) => {
                return current == player.storage.bojimrfz_mark;
              });
              for (var i of target.storage.bojimrfz.players) {
                if (i.countCards('h') == 0) continue;
                if (i == player) continue;
                for (var j of i.getCards('h')) {
                  if (idList.includes(j.cardid)) continue;
                  cards.push(j);
                }
              }
              var cards2 = cards.map((card) => {
                var cardx = ui.create.card();
                cardx.init(get.cardInfo(card));
                cardx._cardid = card.cardid;
                return cardx;
              });
              player.directgains(cards2, null, 'bojimrfz');
            },
          },
          eff_use: {
            trigger: {
              player: ['useCardBefore', 'respondBefore'],
            },
            charlotte: true,
            forced: true,
            popup: false,
            firstDo: true,
            filter(event, player) {
              var cards = player.getCards('s', (card) => card.hasGaintag('bojimrfz') && card._cardid);
              return (
                event.cards &&
                event.cards.some((card) => {
                  return cards.includes(card);
                })
              );
            },
            content() {
              var idList = player.getCards('s', (card) => card.hasGaintag('bojimrfz')).map((i) => i._cardid);
              var cards = [];
              var target = game.findPlayer((current) => {
                return current == player.storage.bojimrfz_mark;
              });
              for (var i of target.storage.bojimrfz.players) {
                if (i.countCards('h') == 0) continue;
                if (i == player) continue;
                for (var j of i.getCards('h')) {
                  if (!idList.includes(j.cardid)) continue;
                  cards.push(j);
                }
              }
              var cards2 = [];
              for (var card of trigger.cards) {
                var cardx = cards.find((cardx) => cardx.cardid == card._cardid);
                if (cardx) cards2.push(cardx);
              }
              var cards3 = trigger.cards.slice();
              trigger.cards = cards2;
              trigger.card.cards = cards2;
              if (player.isOnline2()) {
                player.send(
                  function (cards, player) {
                    cards.forEach((i) => i.delete());
                    if (player == game.me) ui.updatehl();
                  },
                  cards3,
                  player,
                );
              }
              cards3.forEach((i) => i.delete());
              if (player == game.me) ui.updatehl();
            },
          },
          eff_lose: {
            trigger: {
              global: ['loseEnd', 'equipEnd', 'addJudgeEnd', 'gainEnd', 'loseAsyncEnd', 'addToExpansionEnd', 'cardsGotoOrderingBegin'],
            },
            charlotte: true,
            forced: true,
            popup: false,
            firstDo: true,
            filter(event, player) {
              var idList = player.getCards('s', (card) => card.hasGaintag('bojimrfz')).map((i) => i._cardid);
              return (
                event.cards &&
                event.cards.some((card) => {
                  return idList.includes(card.cardid);
                })
              );
            },
            content() {
              var cards2;
              var idList = [];
              var target = game.findPlayer((current) => {
                return current == player.storage.bojimrfz_mark;
              });
              for (var i of target.storage.bojimrfz.players) {
                if (i.countCards('h') == 0) continue;
                if (i == player) continue;
                for (var j of i.getCards('h')) {
                  idList.add(j.cardid);
                }
              }
              cards2 = player.getCards('s', (card) => {
                return card.hasGaintag('bojimrfz') && !idList.includes(card._cardid);
              });
              if (player.isOnline2()) {
                player.send(
                  function (cards, player) {
                    cards.forEach((i) => i.delete());
                    if (player == game.me) ui.updatehl();
                  },
                  cards2,
                  player,
                );
              }
              cards2.forEach((i) => i.delete());
              if (player == game.me) ui.updatehl();
            },
          },
          eff2: {
            audio: 'bojimrfz',
            trigger: {
              player: ['loseAfter', 'changeHp', 'gainMaxHpAfter', 'loseMaxHpAfter', 'bojimrfzAfter'],
              global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
            },
            charlotte: true,
            forced: true,
            filter(event, player) {
              if (event.getl && !event.getl(player)) return false;
              return player.countCards('h') < player.storage.bojimrfz.players.length;
            },
            content() {
              player.draw(player.storage.bojimrfz.players.length - player.countCards('h'));
            },
            ai: {
              noh: true,
              skillTagFilter(player, tag) {
                if (tag == 'noh' && player.maxHp - player.hp < player.storage.bojimrfz.players.length) {
                  return false;
                }
              },
            },
          },
        },
      },
      caijianmrfz: {
        audio: 2,
        forbid: ['boss'],
        trigger: {
          player: 'die',
        },
        forced: true,
        forceDie: true,
        filter(event, player) {
          return event.source && event.source.isIn();
        },
        async content(event, trigger, player) {
          // 删库
          var doc = trigger.source;
          doc.clearSkills();
          doc.discard(doc.getCards('hej'));
          doc.link(false);
          doc.turnOver(false);
          doc.draw(3);
          // 获得技能
          var skillsList = [];
          for (var i of game.players) {
            if (i == player) continue;
            if (!lib.character[i.name][3]) continue;
            for (var j of lib.character[i.name][3]) skillsList.push(j);
          }
          if (skillsList.length == 0) return;
          doc.addSkill(skillsList.randomGets(Math.min(2, skillsList.length)));
        },
        ai: {
          maixie_defend: true,
          threaten(player, target) {
            if (target.hp == 1) return 0.5;
            return 1.5;
          },
          effect: {
            target(card, player, target, current) {
              if (!target.hasFriend()) return;
              if (target.hp <= 1 && get.tag(card, 'damage')) {
                if (player.hasSkillTag('jueqing', false, target)) return 3;
                return [1, 0, 0, -3 * get.threaten(player)];
              }
            },
          },
        },
      },
      // 桥夹克里夫
      chongxiemrfz: {
        marktext: '弹药',
        intro: {
          name: '弹药',
          content: '共有#枚弹药',
        },
        trigger: {
          player: 'useCardToPlayered',
        },
        filter(event, player) {
          if (event.parent.triggeredTargets3.length > 1) return false;
          if (event.card.name == 'sha') return true;
          return false;
        },
        forced: true,
        async content(event, trigger, player) {
          const targets = await player
            .chooseTarget(get.prompt('chongxiemrfz'), '你可以弃置其中一名角色的手牌', function (card, player, target) {
              return (_status.event.targets.includes(target) || target == player) && target.countDiscardableCards(player, 'h');
            })
            .set('ai', function (target) {
              var player = _status.event.player;
              if (
                player.countCards('h', (card) => {
                  return get.value(card) < 6;
                }) &&
                player == target
              )
                return 999;
              return 2 - get.attitude(_status.event.player, target);
            })
            .set('targets', trigger.targets)
            .forResult('targets');
          if (!targets) return;
          var target = targets[0];
          const links = await player.discardPlayerCard('h', target, true).set('target', target).set('complexSelect', false).set('ai', lib.card.guohe.ai.button).forResult('links');
          if (!links) return;
          if (player == target) player.draw();
          if (get.color(links[0]) == 'black') {
            if (trigger.addCount !== false) {
              trigger.addCount = false;
              trigger.player.getStat().card.sha--;
            }
          } else if (get.color(links[0]) == 'red') {
            player.addMark('chongxiemrfz', 1, false);
          } else return;
        },
      },
      qj_chongjimrfz: {
        enable: 'chooseToUse',
        filter(event, player) {
          if (player.countMark('chongxiemrfz') < 1 || !player.isPhaseUsing()) return false;
          return event.filterCard({ name: 'sha' }, player, event);
        },
        async content(event, trigger, player) {
          await player.chooseUseTarget({ name: 'sha', nature: 'thunder' }, true, 'nodistance');
          player.removeMark('chongxiemrfz', 1, false);
        },
        ai: {
          order: 2.95,
          respondSha: true,
          skillTagFilter(player, tag, arg) {
            if (player.countMark('chongxiemrfz') < 1 || !player.isPhaseUsing()) return false;
          },
        },
      },
      leitingmrfz: {
        init(player) {
          player.storage.leitingmrfz = false;
        },
        limited: true,
        trigger: {
          player: 'phaseUseBegin',
        },
        filter(event, player) {
          return player.countMark('chongxiemrfz') > 5 && !player.storage.leitingmrfz;
        },
        check(event, player) {
          if (player.hasUnknown()) return false;
          return true;
        },
        async content(event, trigger, player) {
          player.removeMark('chongxiemrfz', 6, false);
          const targets = await player
            .chooseTarget(true, '【雷霆】:请选择一个其他角色,对其使用6张雷【杀】')
            .set('filterTarget', (card, player, target) => {
              return player.canUse({ name: 'sha', nature: 'thunder' }, target, false) && player != target;
            })
            .set('ai', (target) => {
              return get.attitude(_status.event.player, target) < 0;
            })
            .forResult('targets');
          if (!targets) return;
          let num = 6;
          while (num > 0) {
            if (!targets[0].isIn()) break;
            if (player.canUse({ name: 'sha', nature: 'thunder' }, targets[0], false)) {
              await player.useCard({ name: 'sha', nature: 'thunder' }, targets[0]);
            }
            num--;
          }
          player.storage.leitingmrfz = true;
          _status.SJZX_tmpleitingmrfz = targets[0];
          player
            .when({
              player: 'phaseEnd',
              global: 'dieAfter',
            })
            .filter((event, player) => {
              var target = _status.SJZX_tmpleitingmrfz;
              if (event.name == 'phase') return true;
              else return event.player == target;
            })
            .then(() => {
              var target = _status.SJZX_tmpleitingmrfz;
              if (trigger.name == 'die') {
                player.storage.leitingmrfz = false;
              }
              delete _status.SJZX_tmpleitingmrfz;
            });
        },
      },
      // 特雷西斯
      yuanfumrfz: {
        init(player, skill) {
          player.storage[skill] = [];
        },
        audio: 2,
        trigger: {
          player: 'phaseDrawEnd',
        },
        forced: true,
        filter(event, player) {
          return player.countCards('h') > 0;
        },
        async content(event, trigger, player) {
          const cards = await player
            .chooseCard(true)
            .set('prompt', '【怨府】:请展示一张手牌')
            .set('ai', (card) => {
              var storage = player.storage.yuanfumrfz;
              if (storage.length > 1) return Math.random();
              if (storage.includes(get.color(card))) return -999;
              return get.color(card) == 'red' ? 10 : 0 - get.value(card);
            })
            .set('storage', player.storage.yuanfumrfz)
            .forResult('cards');
          if (!cards) return;
          player.showCards(cards, `${get.translation(player)}因【怨府】而展示的牌`);
          for (var i of game.players) {
            if (i == player) continue;
            i.addTempSkill('yuanfumrfz_eff', { global: 'phaseAfter' });
            if (!i.storage.yuanfumrfz_eff) i.storage.yuanfumrfz_eff = [];
            i.storage.yuanfumrfz_eff.add(get.color(cards[0]));
          }
          player.storage.yuanfumrfz.add(get.color(cards[0]));
          player.addTempSkill('yuanfumrfz_clear', { global: 'phaseBegin' });
        },
        subSkill: {
          clear: {
            silent: true,
            charlotte: true,
            lastDo: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.storage.yuanfumrfz = [];
              player.loseHp();
              var num = player.getStat('damage');
              if (num && num > 0) player.draw(Math.min(5, num));
            },
          },
          eff: {
            mark: true,
            intro: {
              content(event, player) {
                return `无法使用或打出手牌中${get.translation(player.storage.yuanfumrfz_eff)}的牌`;
              },
            },
            mod: {
              cardEnabled(card, player) {
                var colors = player.storage.yuanfumrfz_eff;
                if (colors && colors.includes(get.color(card)) && get.position(card) == 'h' && !player.isDying()) return false;
              },
              cardSavable(card, player) {
                var colors = player.storage.yuanfumrfz_eff;
                if (colors && colors.includes(get.color(card)) && get.position(card) == 'h' && !player.isDying()) return false;
              },
              cardEnabled2(card, player) {
                var colors = player.storage.yuanfumrfz_eff;
                if (colors && colors.includes(get.color(card)) && get.position(card) == 'h' && !player.isDying()) return false;
              },
            },
            silent: true,
            charlotte: true,
            lastDo: true,
            trigger: { player: 'phaseEnd' },
            content() {
              delete player.storage.yuanfumrfz;
            },
            ai: {
              effect: {
                target(card, player, target) {
                  var colors = target.storage.yuanfumrfz_eff;
                  if (get.tag(card, 'damage') && colors && colors.includes(get.color(card))) return [0, -999];
                },
              },
            },
          },
        },
      },
      fenzhoumrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return player.hasEnabledSlot(1) || player.hasEnabledSlot(2) || player.hasEnabledSlot(5) || player.hasEnabledSlot('horse');
        },
        async content(event, trigger, player) {
          var control = await player
            .chooseToDisable(true)
            .set('ai', function (event, player, list) {
              if (list.includes('equip5')) return 'equip5';
              else if (list.includes('equip2')) return 'equip2';
              else if (list.includes('horse')) return 'horse';
              return 'equip1';
            })
            .forResult('control');
          if (!control) return;
          let targets = game.players.slice().remove(player);
          var getChooseList = function (event, player, target) {
            let list = [];
            let chooseList = [`弃置一张牌,本回合你下次受到的伤害+1`, `交给${get.translation(player)}一张牌,本回合${get.translation(player)}使用【杀】的次数+1`, `令${get.translation(player)}摸一张牌,本回合${get.translation(player)}下次造成的伤害+1`];
            if (target.countCards('h') > 0) {
              list.push('选项一');
              list.push('选项二');
            } else {
              chooseList[0] = `<span style='opacity:0.5; '>${chooseList[0]}(你没有牌)</span>`;
              chooseList[1] = `<span style='opacity:0.5; '>${chooseList[1]}(你没有牌)</span>`;
            }
            list.push('选项三');
            return {
              list: list,
              chooseList: chooseList,
            };
          };
          while (targets.length) {
            var target = targets[0];
            if (!target.isIn()) {
              targets.shift();
              continue;
            }
            if (!player.isIn()) {
              break;
            }
            var list = getChooseList(event, player, target).list,
              chooseList = getChooseList(event, player, target).chooseList;
            var control = await target
              .chooseControl(list)
              .set('choiceList', chooseList)
              .set('prompt', '请选择一项')
              .set('ai', () => {
                var list = _status.event.list,
                  player = _status.event.player,
                  target = _status.event.target;
                if (get.attitude(player, target) > 0) {
                  if (list.includes('选项二')) return ['选项二', '选项三'].randomGet();
                  return '选项三';
                } else {
                  if (list.includes('选项二') && player.getCards('h').filter((card) => get.value(card) < 6)) return '选项二';
                  if (list.includes('选项一')) return '选项一';
                }
                return list.randomGet();
              })
              .set('list', list)
              .set('target', player)
              .forResult('control');
            if (!control) {
              targets.shift();
              continue;
            }
            switch (control) {
              case '选项一':
                target.chooseToDiscard(true, '【焚舟】:请弃置一张手牌', 'h');
                target.addMark('fenzhoumrfz_eff1', 1, false);
                target.addTempSkill('fenzhoumrfz_eff1', { player: ['damageEnd', 'phaseEnd'] });
                break;
              case '选项二':
                var cards = await target
                  .chooseCard('h', `【焚舟】:请交给${get.translation(player)}一张手牌`, true)
                  .set('ai', (card) => {
                    var player = _status.event.player,
                      target = _status.event.target;
                    var num = get.value(card),
                      att = get.attitude(player, target);
                    if (get.tag(card, 'damage')) num += (att > 0 ? 1 : -1) * get.value(card);
                    return (att > 0 ? 1 : -1) * get.value(card);
                  })
                  .set('target', player)
                  .forResult('cards');
                if (cards) {
                  target.give(cards, player);
                }
                player.addMark('fenzhoumrfz_eff2', 1, false);
                player.addTempSkill('fenzhoumrfz_eff2', { player: 'phaseEnd' });
                break;
              case '选项三':
                player.draw();
                player.addMark('fenzhoumrfz_eff3', 1, false);
                player.addTempSkill('fenzhoumrfz_eff3', {
                  player: 'phaseEnd',
                  source: 'damageEnd',
                });
                break;
            }
            targets.shift();
          }
        },
        subSkill: {
          eff1: {
            mark: true,
            intro: {
              content: '本回合下次受到的伤害+#',
            },
            charlotte: true,
            forced: true,
            trigger: { player: 'damageBegin2' },
            filter(event, player) {
              return player.countMark('fenzhoumrfz_eff1') > 0;
            },
            content() {
              trigger.num += player.countMark('fenzhoumrfz_eff1');
            },
          },
          eff2: {
            mark: true,
            intro: {
              content: '本回合使用【杀】的次数+#',
            },
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num + player.countMark('fenzhoumrfz_eff2');
              },
            },
          },
          eff3: {
            mark: true,
            intro: {
              content: '本回合下次造成的伤害+#',
            },
            charlotte: true,
            forced: true,
            trigger: { source: 'damageBegin2' },
            filter(event, player) {
              return player.countMark('fenzhoumrfz_eff3') > 0;
            },
            content() {
              trigger.num += player.countMark('fenzhoumrfz_eff3');
            },
          },
        },
        ai: {
          order: 10,
          result: {
            player: 1,
          },
        },
      },
      // 普瑞赛斯
      // TODO 等剧情更新后在重新设计
      bianyimrfz: {
        audio: 2,
        trigger: {
          global: 'roundStart',
          source: 'damageEnd',
        },
        GetAllSkills(player) {
          var list = {};
          var ownSkills = get.translation(player.getSkills(true, false, false));
          for (var key in lib.character) {
            if (!lib.character[key][3]) continue;
            var skills = lib.character[key][3];
            for (var i of skills) {
              if (!lib.translate[i]) continue;
              if (ownSkills.includes(lib.translate[i])) continue;
              list[i] = lib.translate[i];
            }
          }
          return list;
        },
        async content(event, trigger, player) {
          // 一些函数
          // 随机获取任意个键值
          function getRandomKeys(obj, num) {
            var keys = Object.keys(obj);
            var selectedKeys = [];
            var i;
            for (var i = 0; i < num; i++) {
              var randomIndex = Math.floor(Math.random() * keys.length);
              selectedKeys.push(keys[randomIndex]);
              keys.splice(randomIndex, 1);
            }
            return selectedKeys;
          }
          // 获取不重复的中文字符
          function extractChineseCharacters(arr) {
            var chineseRegex = /[\u4e00-\u9fa5]/g;
            var chineseSet = new Set();
            arr.forEach(function (str) {
              var chineseChars = str.match(chineseRegex);
              if (chineseChars) {
                chineseChars.forEach(function (char) {
                  chineseSet.add(char);
                });
              }
            });
            return Array.from(chineseSet);
          }
          // 随机从数组中获取元素
          function getRandomElements(arr, num) {
            var result = [];
            var len = arr.length;
            var indices = [];
            for (var i = 0; i < len; i++) {
              indices.push(i);
            }
            for (var j = 0; j < num; j++) {
              var randomIndex = Math.floor(Math.random() * indices.length);
              var index = indices[randomIndex];
              result.push(arr[index]);
              indices.splice(randomIndex, 1);
            }
            return result;
          }
          // 检查存在的技能
          function findWordCombinations(arrA, arrB) {
            var combinations = [];
            for (var i = 0; i < arrB.length - 1; i++) {
              for (var j = i + 1; j < arrB.length; j++) {
                var word1 = arrB[i] + arrB[j];
                var word2 = arrB[j] + arrB[i];
                if (arrA.includes(word1)) {
                  combinations.push(word1);
                }
                if (arrA.includes(word2)) {
                  combinations.push(word2);
                }
              }
            }
            return combinations;
          }
          // 通过值找键
          function findKeysByValue(obj, value) {
            var keys = [];
            for (var key in obj) {
              if (Object.hasOwn(obj, key) && obj[key] === value) {
                keys.push(key);
              }
            }
            if (keys.length == 0) return null;
            return keys;
          }
          // ai自动选择
          function autoChoose(list, findWord) {
            var index = [];
            var list = list.map((i) => i[1]);
            var findWord = findWord.randomGet();
            for (var i of findWord) {
              for (var j = 0; j < list.length; j++) {
                if (i != list[j]) continue;
                index.push(j);
              }
            }
            return index;
          }
          // 获取完全没法组成技能的汉字
          function getCannotCharacters(arr, skills) {
            var index = [];
            var list = arr.map((i) => i[1]);
            for (var name of skills) {
              for (var j of name) {
                for (var k = 0; k < list.length; k++) {
                  if (j != list[k]) continue;
                  index.push(k);
                }
              }
            }
            return index;
          }
          //技能部分
          var allCNSkills = [],
            ENSkills = lib.skill.bianyimrfz.GetAllSkills(player);
          for (var key in ENSkills) {
            allCNSkills.push(ENSkills[key]);
          }
          // 性能挑战(划掉)
          while (true) {
            var skillsList = getRandomKeys(lib.skill.bianyimrfz.GetAllSkills(player), 100);
            var CNSkills = [];
            for (var i of skillsList) {
              CNSkills.add(get.translation(i));
            }
            var CNCharacters = extractChineseCharacters(CNSkills);
            var randomCN = getRandomElements(CNCharacters, Math.min(CNCharacters.length, 50));
            var findWord = findWordCombinations(allCNSkills, randomCN);
            // 保底技能数 默认15
            var num = lib.config.minSkillsNumbers_PRTS === undefined ? 15 : lib.config.minSkillsNumbers_PRTS;
            if (findWord.length > num) break;
          }
          var list = [];
          for (var i = 0; i < randomCN.length; i++) {
            list[i] = [i, randomCN[i]];
          }
          if (list.length == 0) {
            player.popup('纳尼？没有技能了？!');
            return;
          }
          var fun1 = (list) => {
            var per = (lib.config.filterSkillsPercentage_PRTS === undefined ? 75 : lib.config.filterSkillsPercentage_PRTS) * 0.01;
            if (per == 0) return [];
            var filterEnd = getRandomElements(list, Math.floor(list.length * per));
            return filterEnd;
          };
          game.broadcastAll(function (player) {
            player.forceCountChoose = { chooseButton: 30 };
          }, player);
          var buttonList = [`编译:请选择至少两个汉字(推荐选两个汉字)`];
          var count = 0;
          for (var i = 0; i < Math.ceil(list.length / 10); i++) {
            buttonList.push([list.slice(count, count + 10 >= list.length ? list.length : count + 10), 'tdnodes']);
            count += 10;
          }
          buttonList.push(`存在有${findWord.length}个技能`);
          const links =
            event.isMine() == false
              ? autoChoose(list, findWord)
              : await player
                .chooseButton(buttonList)
                .set('forced', true)
                .set('selectButton', [2, Infinity])
                .set('filterButton', function (button) {
                  var list = _status.event.cannot;
                  if (list.length == 0) return true;
                  if (list.includes(button.link)) return true;
                  return false;
                })
                .set('ai', () => {
                  _status.tmp_PRTS_endTime = true;
                })
                .set('cannot', fun1(getCannotCharacters(list, findWord)))
                .forResult('links');
          game.broadcastAll(function (player) {
            delete player.forceCountChoose;
          }, player);
          var fun2 = (player, end = false) => {
            if (!end) player.popup(`没有${CsSkill}`);
            else player.popup(`时间耗尽`);
            game.log(`可组成的技能有:${findWord}`);
          };
          if (!links || _status.tmp_PRTS_endTime) {
            fun2(player, true);
            delete _status.tmp_PRTS_endTime;
            return;
          }
          var CsSkill = '';
          for (var i of links) {
            CsSkill = CsSkill + list[i][1];
          }
          var findkey = findKeysByValue(ENSkills, CsSkill);
          if (findkey != null) {
            var introSkills = [];
            for (var i of findkey) {
              introSkills.push(get.skillInfoTranslation(i));
            }
            const index =
              findkey.length == 1
                ? 0
                : await player
                  .chooseControl()
                  .set('choiceList', introSkills)
                  .set('prompt', `请选择一个版本的【${get.translation(findkey[0])}】`)
                  .set('ai', () => get.rand(0, findkey.length - 1))
                  .forResult('index');
            if (!index && index != 0) return;
            player.addSkill(findkey[index]);
          } else {
            fun2(player);
          }
        },
      },
      // 新 斗士塔露拉
      talula_shixinmrfz: {
        audio: 2,
        trigger: {
          source: 'damageEnd',
        },
        filter(event, player) {
          return event.player && event.player.isIn() && event.player.countGainableCards(player, 'hes');
        },
        async content(event, trigger, player) {
          var pos = [];
          for (var i of trigger.player.getCards('hes')) {
            pos.add(get.position(i));
          }
          var cards = await player
            .choosePlayerCard('hes', trigger.player, true)
            .set('prompt', `【拾薪】:请选择其各区域内的一张牌`)
            .set('selectButton', pos.length)
            .set('filterButton', (button) => {
              let cards = ui.selected.cards;
              let pos = cards.slice().map((card) => get.position(card));
              return !pos.includes(get.position(button));
            })
            .set('complexSelect', true)
            .set('ai', lib.card.shunshou.ai.button)
            .forResult('cards');
          if (!cards) return;
          if (_status.connectMode)
            game.broadcastAll(function () {
              _status.noclearcountdown = true;
            });
          event.given_map = {};
          while (cards.length) {
            var links =
              cards.length == 1
                ? cards
                : await player
                  .chooseCardButton('【拾薪】:请选择要分配的牌', true, cards, [1, cards.length])
                  .set('ai', () => {
                    if (ui.selected.buttons.length == 0) return 1;
                    return 0;
                  })
                  .forResult('links');
            if (!links) continue;
            event.togive = links.slice();
            cards.removeArray(links);
            const { targets } = await player
              .chooseTarget('选择一名角色获得' + get.translation(event.togive), true)
              .set('ai', (target) => {
                const att = get.attitude(_status.event.player, target);
                if (_status.event.enemy) {
                  return -att;
                } else if (att > 0) {
                  return att / (1 + target.countCards('h'));
                } else {
                  return att / 100;
                }
              })
              .set('enemy', get.value(event.togive[0], player, 'raw') < 0)
              .forResult();
            if (targets.length) {
              const id = targets[0].playerid,
                map = event.given_map;
              if (!map[id]) map[id] = [];
              map[id].addArray(event.togive);
            }
          }
          if (_status.connectMode) {
            game.broadcastAll(function () {
              delete _status.noclearcountdown;
              game.stopCountChoose();
            });
          }
          const list = [];
          for (var i in event.given_map) {
            const source = (_status.connectMode ? lib.playerOL : game.playerMap)[i];
            player.line(source, 'green');
            if (player !== source && (get.mode() !== 'identity' || player.identity !== 'nei')) player.addExpose(0.2);
            list.push([source, event.given_map[i]]);
          }
          game.loseAsync({
            gain_list: list,
            giver: player,
            animate: 'draw',
          }).setContent('gaincardMultiple');
        },
      },
      zhuoximrfz: {
        init(player, skill) {
          player.storage[skill] = [];
        },
        audio: 2,
        trigger: {
          player: 'useCard',
        },
        filter(event, player) {
          if (!event.card) return false;
          return (
            !player.storage.zhuoximrfz.includes(get.type2(event.card)) &&
            game.hasPlayer((current) => {
              return get.distance(current, player) == player.hp && current != player;
            })
          );
        },
        async cost(event, trigger, player) {
          const result = await player
            .chooseTarget(`【灼息】:你可以对一名与你距离为${player.hp}的角色造成一点火焰伤害`)
            .set('filterTarget', (card, player, target) => {
              return get.distance(target, player) == player.hp && target != player;
            })
            .set('ai', (target) => {
              var player = get.event('player');
              return get.damageEffect(target, player, player, 'fire') > 0;
            })
            .forResult();
          if (!result) return;
          event.result = result;
        },
        async content(event, trigger, player) {
          let target = event.targets[0];
          target.damage('fire');
          player.line(target);
          if (!player.storage.zhuoximrfz) player.storage.zhuoximrfz = [];
          player.storage.zhuoximrfz.add(get.type2(trigger.card));
        },
        group: 'zhuoximrfz_clear',
        subSkill: {
          clear: {
            silent: true,
            charlotte: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.storage.zhuoximrfz = [];
            },
          },
        },
      },
      //剑兔 近卫阿米娅
      amy_qingyanmrfz: {
        audio: 2,
        trigger: { player: 'phaseUseEnd' },
        intro: {
          content(event, player) {
            var str = '';
            var list = [player.hasSkill('amy_qingyanmrfz_damage'), player.hasSkill('amy_qingyanmrfz_time'), player.hasSkill('amy_qingyanmrfz_direct')];
            var text = ['·你每回合使用的第一张【杀】的伤害基数+1</br>', '·你使用【杀】的次数+1</br>', '·你使用的【杀】需要两张【闪】才可抵消</br>'];
            for (var i = 0; i < list.length; i++) {
              if (list[i]) str = str + text[i];
            }
            return str;
          },
        },
        filter(event, player) {
          return !player.storage.amy_qingyanmrfz_time || !player.storage.amy_qingyanmrfz_damage || !player.storage.amy_qingyanmrfz_direct;
        },
        check(event, player) {
          return game.hasPlayer(function (current) {
            return current != player && get.attitude(current, player) > 2;
          });
        },
        content() {
          'step 0';
          player
            .chooseTarget('【青焱】:请选择一名其他角色', true, function (card, player, target) {
              return target != player;
            })
            .set('ai', function (target) {
              var player = _status.event.player;
              var att = get.attitude(_status.event.player, target);
              //if(game.hasPlayer(current=>{current!=player&&current.hasSkill('shengcaimrfz')&&get.attitude(player,current)>2})) return game.findPlayer(current=>{current!=player&&current.hasSkill('shengcaimrfz')});
              return att > 2;
            });
          ('step 1');
          if (result.targets?.length) {
            var target = result.targets[0],
              list = [];
            event.target = target;
            if (!player.storage.amy_qingyanmrfz_time) list.push('你使用【杀】的次数+1');
            if (!player.storage.amy_qingyanmrfz_damage) list.push('你每回合使用的第一张【杀】的伤害基数+1');
            if (!player.storage.amy_qingyanmrfz_direct) list.push('你使用的【杀】需要两张【闪】才可抵消');
            if (list.length == 1) {
              if (!player.storage.amy_qingyanmrfz_time) {
                player.storage.amy_qingyanmrfz_time = true;
                target.addSkill('amy_qingyanmrfz_time');
              }
              if (!player.storage.amy_qingyanmrfz_damage) {
                player.storage.amy_qingyanmrfz_damage = true;
                target.addSkill('amy_qingyanmrfz_damage', false);
                target.addMark('amy_qingyanmrfz');
              }
              if (!player.storage.amy_qingyanmrfz_direct) {
                player.storage.amy_qingyanmrfz_direct = true;
                target.addSkill('amy_qingyanmrfz_direct', false);
                target.addMark('amy_qingyanmrfz');
              }
              event.finish();
            } else {
              player
                .chooseControl(list)
                .set('prompt', `请选择删除一句话并令${get.translation(target)}获得该效果`)
                .set('ai', function () {
                  return [0, 1, 2].randomGet();
                });
            }
          } else event.finish();
          ('step 2');
          if (result.control == '你使用【杀】的次数+1') {
            event.target.addMark('amy_qingyanmrfz', false);
            player.storage.amy_qingyanmrfz_time = true;
            event.target.addSkill('amy_qingyanmrfz_time');
          }
          if (result.control == '你每回合使用的第一张【杀】的伤害基数+1') {
            event.target.addMark('amy_qingyanmrfz', false);
            player.storage.amy_qingyanmrfz_damage = true;
            event.target.addSkill('amy_qingyanmrfz_damage');
          }
          if (result.control == '你使用的【杀】需要两张【闪】才可抵消') {
            event.target.addMark('amy_qingyanmrfz', false);
            player.storage.amy_qingyanmrfz_direct = true;
            event.target.addSkill('amy_qingyanmrfz_direct');
          }
        },
        ai: {
          expose: 0.1,
          threaten: 1.1,
        },
        group: ['amy_qingyanmrfz_damage', 'amy_qingyanmrfz_time', 'amy_qingyanmrfz_direct'],
        subSkill: {
          direct: {
            audio: 'amy_qingyanmrfz',
            trigger: {
              player: 'useCardToPlayered',
            },
            forced: true,
            filter(event, player) {
              if (player.storage.amy_qingyanmrfz_direct == true && player.hasSkill('amy_qingyanmrfz_mark')) return false;
              return event.card && event.card.name == 'sha' && !event.parent.directHit.includes(event.target) && get.distance(player, event.target) <= 1;
            },
            logTarget: 'target',
            content() {
              var id = trigger.target.playerid;
              var map = trigger.parent.customArgs;
              if (!map[id]) map[id] = {};
              if (typeof map[id].shanRequired == 'number') {
                map[id].shanRequired++;
              } else {
                map[id].shanRequired = 2;
              }
            },
            ai: {
              directHit_ai: true,
              skillTagFilter(player, tag, arg) {
                if ((arg && arg.card.name != 'sha') || arg.target.countCards('h', 'shan') > 1 || get.distance(player, arg.target) > 1) return false;
              },
            },
            group: 'amy_qingyanmrfz_remove2',
          },
          remove2: {
            silent: true,
            charlotte: true,
            trigger: { player: 'phaseEnd' },
            filter(event, player) {
              return !player.hasSkill('amy_qingyanmrfz');
            },
            content() {
              player.removeSkill('amy_qingyanmrfz_direct');
              player.removeMark('amy_qingyanmrfz', false);
              game.countPlayer(function (current) {
                if (current.hasSkill('amy_qingyanmrfz')) current.storage.amy_qingyanmrfz_direct = false;
              });
            },
          },
          time: {
            silent: true,
            charlotte: true,
            trigger: { player: 'phaseEnd' },
            filter(event, player) {
              return !player.hasSkill('amy_qingyanmrfz');
            },
            content() {
              player.removeMark('amy_qingyanmrfz', false);
              player.removeSkill('amy_qingyanmrfz_time');
              game.countPlayer(function (current) {
                if (current.hasSkill('amy_qingyanmrfz')) current.storage.amy_qingyanmrfz_time = false;
              });
            },
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha' && (!player.storage.amy_qingyanmrfz || player.hasMark('amy_qingyanmrfz'))) return num + 1;
              },
            },
          },
          damage: {
            audio: 'amy_qingyanmrfz',
            forced: true,
            charlotte: true,
            trigger: { player: 'useCard' },
            filter(event, player) {
              if (player.storage.amy_qingyanmrfz_damage && player.hasSkill('amy_qingyanmrfz_mark')) return false;
              if (player.hasSkill('amy_qingyanmrfz_mark')) return false;
              return event.card && event.card.name == 'sha';
            },
            content() {
              if (!trigger.baseDamage) trigger.baseDamage = 1;
              trigger.baseDamage++;
              player.addTempSkill('amy_qingyanmrfz_mark', 'phaseEnd');
            },
            ai: {
              damageBonus: true,
            },
            group: 'amy_qingyanmrfz_remove1',
          },
          remove1: {
            silent: true,
            charlotte: true,
            trigger: { player: 'phaseEnd' },
            filter(event, player) {
              return !player.hasSkill('amy_qingyanmrfz');
            },
            content() {
              player.removeSkill('amy_qingyanmrfz_damage');
              player.removeMark('amy_qingyanmrfz', false);
              game.countPlayer(function (current) {
                if (current.hasSkill('amy_qingyanmrfz')) current.storage.amy_qingyanmrfz_damage = false;
              });
            },
          },
          mark: {
            silent: true,
            charlotte: true,
          },
        },
      },
      yingxiaomrfz: {
        audio: 4,
        intro: {
          content(event, player) {
            if (player.storage.yingxiaomrfz) return '已发动';
            if (!player.storage.yingxiaomrfz) {
              if (player.countMark('yingxiaomrfz_mark') < 5) return `未发动(不满足发动条件)</br>已累计使用${player.countMark('yingxiaomrfz_mark')}张【杀】`;
              else return '未发动(已满足发动条件)';
            }
          },
        },
        mark: true,
        limited: true,
        trigger: { player: 'phaseZhunbeiBegin' },
        check(event, player) {
          return game.hasPlayer(function (current) {
            return current != player && get.attitude(current, player) < 0 && player.inRange(current);
          });
        },
        init(player) {
          player.storage.yingxiaomrfz = false;
        },
        filter(event, player) {
          return !player.storage.yingxiaomrfz && player.countMark('yingxiaomrfz_mark') >= 5;
        },
        content() {
          'step 0';
          player.storage.yingxiaomrfz = true;
          event.num = 0;
          ('step 1');
          if (event.num < 3) {
            if (event.num == 2) {
              player.addTempSkill('yingxiaomrfz_damage', 'useCardAfter');
              player.addTempSkill('yingxiaomrfz_wushi', 'useCardAfter');
              player.addTempSkill('yingxiaomrfz_total', 'useCardAfter');
              player.chooseUseTarget(
                {
                  name: 'sha',
                },
                '请选择【杀】的目标',
                false,
              );
            } else {
              player.addTempSkill('yingxiaomrfz_total', 'useCardAfter');
              player.chooseUseTarget(
                {
                  name: 'sha',
                  nature: event.num == 0 ? 'thunder' : 'fire',
                },
                '请选择' + (event.num == 0 ? '雷【杀】' : '火【杀】') + '的目标(下一张使用的牌为:' + (event.num == 0 ? '火【杀】' : '伤害基数为翻倍且无视防具的【杀】') + ')',
                false,
              );
            }
            event.num++;
            if (event.num < 3) event.redo();
          }
          ('step 2');
          player.draw(player.countMark('yingxiaomrfz_total'));
          player.addSkill('yingxiaomrfz_handlit');
          player.addSkill('yingxiaomrfz_round2');
        },
        group: 'yingxiaomrfz_time',
        subSkill: {
          mark: {
            charlotte: true,
          },
          time: {
            silent: true,
            charlotte: true,
            trigger: { player: 'useCard' },
            filter(event, player) {
              return event.card && event.card.name == 'sha' && player.countMark('yingxiaomrfz_mark') < 5;
            },
            content() {
              player.addMark('yingxiaomrfz_mark', false);
            },
          },
          damage: {
            forced: true,
            charlotte: true,
            trigger: { player: 'useCard2' },
            filter(event, player) {
              return event.card && event.card.name == 'sha';
            },
            content() {
              if (!trigger.baseDamage) trigger.baseDamage = 1;
              trigger.baseDamage += 2;
            },
            ai: {
              damageBonus: true,
            },
          },
          wushi: {
            trigger: {
              player: 'useCardToPlayered',
            },
            filter(event, player) {
              return event.card && event.card.name == 'sha';
            },
            silent: true,
            logTarget: 'target',
            content() {
              trigger.target.addTempSkill('qinggang2');
              trigger.target.storage.qinggang2.add(trigger.card);
              trigger.target.markSkill('qinggang2');
            },
            ai: {
              unequip: true,
              skillTagFilter(player, tag, arg) {
                if (arg && arg.name == 'sha') return true;
                return false;
              },
            },
          },
          total: {
            silent: true,
            charlotte: true,
            trigger: { source: 'damageEnd' },
            filter(event, player) {
              return event.card && event.card.name == 'sha';
            },
            content() {
              player.addMark('yingxiaomrfz_total', trigger.num, false);
            },
          },
          handlit: {
            silent: true,
            charlotte: true,
            mod: {
              maxHandcard(player, num) {
                return num + player.countMark('yingxiaomrfz_total');
              },
            },
          },
          round1: {
            silent: true,
            charlotte: true,
            trigger: {
              global: 'roundStart',
            },
            content() {
              player.addMark('yingxiaomrfz_round1', false);
              if (player.countMark('yingxiaomrfz_round1') > 2) {
                player.removeSkill('yingxiaomrfz_round2');
                player.removeAllmark('yingxiaomrfz_round1', false);
              }
            },
          },
          round2: {
            audio: 'yingxiaomrfz',
            trigger: { source: 'damageBefore' },
            forced: true,
            charlotte: true,
            mark: true,
            intro: {
              content(event, player) {
                return '你造成的伤害均视为体力流失</br>效果剩余时间:' + (2 - player.countMark('yingxiaomrfz_round1')) + '轮';
              },
            },
            check() {
              return false;
            },
            content() {
              trigger.cancel();
              trigger.player.loseHp(trigger.num);
            },
            ai: {
              jueqing: true,
            },
            group: 'yingxiaomrfz_round1',
          },
        },
      },
      //芙兰卡
      jifengmrfz: {
        audio: 2,
        trigger: {
          player: 'useCard2',
        },
        filter(event, player) {
          if (event.targets && event.targets.length > 1) return false;
          return event.cards && event.card.name == 'sha';
        },
        check(event, player) {
          return get.attitude(player, event.targets[0]) < 0;
        },
        prompt(event, player) {
          var target = event.targets[0],
            list = [];
          if (!target.hasEmptySlot(2)) list.push('无视防具');
          if (target.countCards('h') > 0) list.push('此【杀】需要两张闪才可抵消');
          if (target.hujia > 0) list.push('无视护甲');
          return `【极锋】:是否对${get.translation(target)}发动‘极锋’？(${list})`;
        },
        content() {
          var target = trigger.targets[0],
            num = 0;
          if (!target.hasEmptySlot(2)) {
            num++;
            target.addTempSkill('qinggang2');
            target.storage.qinggang2.add(trigger.card);
            target.markSkill('qinggang2');
          }
          if (target.countCards('h') > 0) {
            num++;
            player.addTempSkill('jifengmrfz_sha');
            player.storage.jifengmrfz = {
              card: trigger.card,
            };
          }
          if (target.hujia > 0) {
            target.addTempSkill('jifengmrfz_ighujia');
            target.storage.jifengmrfz_ighujia.add(trigger.card);
            target.markSkill('jifengmrfz_ighujia');
            num++;
          }
          if (!player.hasSkill('jifengmrfz_used')) {
            player.addTempSkill('jifengmrfz_used', 'phaseEnd');
            player.draw(3 - num);
          }
        },
        subSkill: {
          sha: {
            trigger: {
              player: 'useCardToPlayered',
            },
            forced: true,
            silent: true,
            filter(event, player) {
              var info = player.storage.jifengmrfz;
              if (!event.card || event.card != info.card) return false;
              return event.card && event.card.name == 'sha' && !event.parent.directHit.includes(event.target);
            },
            logTarget: 'target',
            content() {
              var id = trigger.target.playerid;
              var map = trigger.parent.customArgs;
              if (!map[id]) map[id] = {};
              if (typeof map[id].shanRequired == 'number') {
                map[id].shanRequired++;
              } else {
                map[id].shanRequired = 2;
              }
              delete player.storage.jifengmrfz;
              player.removeSkill('jifengmrfz_sha');
            },
            ai: {
              directHit_ai: true,
              skillTagFilter(player, tag, arg) {
                if ((arg && arg.card.name != 'sha') || arg.target.countCards('h', 'shan') > 1 || get.distance(player, arg.target) > 1) return false;
              },
            },
          },
          used: {
            charlotte: true,
          },
          ighujia: {
            ai: {
              nohujia: true,
            },
            init(player, skill) {
              if (!player.storage[skill]) player.storage[skill] = [];
            },
            trigger: {
              player: ['damage', 'damageCancelled', 'damageZero'],
              source: ['damage', 'damageCancelled', 'damageZero'],
              target: ['shaMiss', 'useCardToExcluded', 'useCardToEnd', 'eventNeutralized'],
              global: ['useCardEnd'],
            },
            charlotte: true,
            firstDo: true,
            filter(event, player) {
              return player.storage.jifengmrfz_ighujia && event.card && player.storage.jifengmrfz_ighujia.includes(event.card) && (event.name != 'damage' || event.notLink());
            },
            silent: true,
            forced: true,
            popup: false,
            _priority: 12,
            content() {
              player.storage.jifengmrfz_ighujia.remove(trigger.card);
              if (!player.storage.jifengmrfz_ighujia.length) player.removeSkill('jifengmrfz_ighujia');
            },
            marktext: '✘',
            intro: {
              name: '✘',
              content: '当前护甲已失效',
            },
          },
        },
        ai: {
          threaten: 1.2,
        },
      },
      xiqiaomrfz: {
        audio: 2,
        trigger: {
          player: ['chooseToRespondBegin', 'chooseToUseBegin'],
        },
        filter(event, player) {
          if (player.hasSkill('xiqiaomrfz_used')) return false;
          if (event.responded) return false;
          if (!event.filterCard || !event.filterCard({ name: 'shan' }, player, event)) return false;
          if (event.name == 'chooseToRespond' && !lib.filter.cardRespondable({ name: 'shan' }, player, event)) return false;
          return true;
        },
        check: () => 1,
        content() {
          'step 0';
          player.addTempSkill('xiqiaomrfz_used', 'phaseEnd');
          var next = player.chooseToDiscard('he', true);
          next.set('prompt', '【细巧】:你可以弃置一张牌,摸一张牌并展示之,若类型不同,视为使用或打出一张【闪】');
          ('step 1');
          if (result.cards?.length) {
            event.card = result.cards[0];
            player.draw('visible');
          } else event.finish();
          ('step 2');
          var card = result.cards[0];
          var cardl = event.card;
          if (get.type2(card) != get.type2(cardl)) {
            trigger.untrigger();
            trigger.set('responded', true);
            trigger.result = { bool: true, card: { name: 'shan' } };
          }
        },
        subSkill: {
          used: {
            charlotte: true,
          },
        },
        ai: {
          respondShan: true,
          threaten: 0.8,
        },
      },
      //D32 星极
      tianyimrfz: {
        audio: 2,
        mark: true,
        zhuanhuanji: true,
        marktext: '☯',
        init(player, skill) {
          player.storage[skill] = true;
        },
        intro: {
          content(storage, player, skill) {
            if (player.storage.tianyimrfz == true) return '观看牌堆顶两张牌,并将其置于牌堆顶或牌堆底'; //阳
            return '进行一次判定,并获得判定牌,本回合此牌视为【闪】,若判定结果为♣️️,你本局游戏使用【杀】的次数+1(至多+3)'; //阴
          },
        },
        trigger: { global: 'phaseJudgeBegin' },
        prompt(event, player) {
          if (player.storage.tianyimrfz == true)
            var str = '观看牌堆顶两张牌,并将其置于牌堆顶或牌堆底'; //阳
          else var str = '进行一次判定,并获得判定牌,本回合此牌视为【闪】,若判定结果为♣️️,你本局游戏使用【杀】的次数+1(至多+3)'; //阴
          return '【天仪】:你可以' + str;
        },
        callback() {
          if (event.judgeResult.suit == 'club') {
            if (player.countMark('tianyimrfz_shacount') < 3) player.addMark('tianyimrfz_shacount', false);
          }
          player.gain(card, 'gain2').gaintag.add('tianyimrfz');
          player.addTempSkill('tianyimrfz_remove', 'phaseEnd');
        },
        content() {
          if (player.storage.tianyimrfz) player.chooseToGuanxing(2);
          else
            player
              .judge(function (card) {
                if (card.suit == 'club') return 0;
                return -4;
              })
              .set('callback', lib.skill.tianyimrfz.callback);
          player.changeZhuanhuanji('tianyimrfz');
        },
        mod: {
          cardUsable(card, player, num) {
            if (card.name == 'sha') return num + player.countMark('tianyimrfz_shacount');
          },
        },
        subSkill: {
          shacount: {
            charlotte: true,
            intro: {
              content: '使用【杀】的次数+#',
            },
          },
          remove: {
            onremove(player) {
              player.removeGaintag('tianyimrfz');
            },
            charlotte: true,
            mod: {
              cardname(card, player, name) {
                if (card.hasGaintag('tianyimrfz')) return 'shan';
              },
            },
          },
        },
      },
      huijianmrfz: {
        audio: 2,
        trigger: { player: 'useCard2' },
        filter(event, player) {
          if (!event.targets || event.targets.length > 1) return false;
          if (!player.canUseToAnyone(event.card, true, false)) return false;
          if (!player.isPhaseUsing()) return false;
          if (player.getCardUsable('sha') < 1) return false;
          return get.type(event.card) == 'trick' || get.type(event.card) == 'basic';
        },
        usable: 1,
        forced: true,
        content() {
          'step 0';
          player
            .chooseTarget([1, player.getCardUsable('sha')], get.prompt('huijianmrfz'), `为${get.translation(trigger.card)}增加至多` + player.getCardUsable('sha') + '个目标', function (card, player, target) {
              return !_status.event.sourcex.includes(target) && player.canUse(_status.event.card, target);
            })
            .set('sourcex', trigger.targets)
            .set('ai', function (target) {
              var player = _status.event.player;
              return get.effect(target, _status.event.card, player, player);
            })
            .set('card', trigger.card)
            .setHiddenSkill(event.name);
          ('step 1');
          if (result.targets?.length) {
            for (var i = 0; i < result.targets.length; i++) {
              trigger.targets.push(result.targets[i]);
              player.line(result.targets[i]);
            }
            player.addMark('huijianmrfz_minus', result.targets.length, false);
            player.addTempSkill('huijianmrfz_minus', 'phaseUseAfter');
          } else {
            player.getStat('triggerSkill').huijianmrfz--;
          }
        },
        subSkill: {
          minus: {
            onremove(player) {
              player.removeAllmark('huijuanmrfz_minus', false);
            },
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num - player.countMark('huijianmrfz_minus');
              },
            },
          },
        },
      },
      bingmingmrfz: {
        audio: 2,
        trigger: { global: 'roundStart' },
        filter(event, player) {
          if (
            !game.findPlayer(function (current) {
              current.name == 'xingyuanmrfz';
            })
          )
            return false;
          return game.roundNumber == 2;
        },
        forced: true,
        content() {
          var target = game.findPlayer(function (current) {
            current.name == 'xingyuanmrfz';
          });
          var num1 = player.countCards('h') - target.countCards('h');
          var num2 = player.getHandcardLimit() - target.getHandcardLimit();
          if (num1 > 0) {
            player.chooseToDiscard(true, '【病鸣】:请将手牌调整至' + num1, num1);
          } else if (num1 < 0) player.drawTo(-num1);
          if (num2 != 0) {
            player.addMark('bingmingmrfz', false, Math.abs(num2));
          }
        },
        mod: {
          maxHandcard(player, num) {
            return num + player.countMark('bingmingmrfz');
          },
        },
      },
      //星源
      daoliumrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 2,
        filter(event, player) {
          return player.countCards('he') > 0;
        },
        check(card) {
          return 6 - get.value(card);
        },
        filterCard: true,
        selectCard: 1,
        filterTarget(card, player, target) {
          return target != player;
        },
        selectTarget: 1,
        lose: false,
        discard: false,
        content() {
          'step 0';
          event.targetx = target;
          event.target = [];
          event.discard = [];
          event.discard.push(target);
          event.target.push(target.next);
          event.target.push(target.previous);
          if (event.target.includes(player)) event.target.remove(player);
          player.give(cards, target);
          ('step 1');
          if (event.target.length && event.targetx.countCards('he') > 0) {
            event.targetx.chooseCard(true, `【导流】:请交给${get.translation(event.target[0])}一张牌`, 'he');
          } else event.goto(3);
          ('step 2');
          if (result.cards?.length) {
            var card = result.cards[0];
            event.targetx.give(card, event.target[0]);
            event.discard.push(event.target[0]);
          }
          event.target.remove(event.target[0]);
          event.goto(1);
          ('step 3');
          if (event.discard.length) {
            if (event.discard[0].countCards('he') > 0) event.discard[0].chooseToDiscard(true, 'he', '【导流】:请弃置一张牌');
            event.discard.remove(event.discard[0]);
            event.redo();
          }
        },
        ai: {
          order: 4,
          expose: 0.1,
          result: {
            target(player, target) {
              var pre = target.previous,
                net = target.next,
                num = 0;
              if (game.countPlayer() == 2) return 0;
              if (get.attitude(pre, player) > 2 && get.attitude(net, player) > 2) return 0;
              return -1;
            },
          },
        },
      },
      gewumrfz: {
        audio: 2,
        trigger: {
          global: 'gainEnd',
        },
        filter(event, player) {
          return event.source && event.source.isIn() && event.source == player && event.cards.length >= 1;
        },
        forced: true,
        logTarget: 'source',
        content() {
          if (player.countMark('gewumrfz') < 5) {
            player.addMark('gewumrfz', false);
          }
          if (Array.isArray(trigger.cards))
            for (var i of trigger.cards) {
              if (!player.getStorage('gewumrfz_mark').includes(i.name)) {
                player.markAuto('gewumrfz_mark', [i.name]);
                if (player.storage.gewumrfz_mark.length % 2 == 0) {
                  player.draw();
                }
                if (player.storage.gewumrfz_mark.length % 4 == 0) {
                  player.addMark('gewumrfz_draw', false);
                }
              }
            }
        },
        mod: {
          maxHandcard(player, num) {
            return num + player.countMark('gewumrfz');
          },
        },
        group: ['gewumrfz_mark', 'gewumrfz_draw'],
        subSkill: {
          mark: {
            intro: {
              content(event, player) {
                return `记录的牌名:${get.translation(player.storage.gewumrfz_mark)}</br>` + (player.countMark('gewumrfz_draw') > 0 ? '额定摸牌数+' + player.countMark('gewumrfz_draw') : '');
              },
            },
            charlotte: true,
          },
          draw: {
            audio: 'gewumrfz',
            forced: true,
            charlotte: true,
            trigger: { player: 'phaseDrawBegin2' },
            filter(event, player) {
              return player.countMark('gewumrfz_draw') > 0;
            },
            content() {
              trigger.num += player.countMark('gewumrfz_draw');
            },
          },
        },
      },
      //战车
      jiqiangmrfz: {
        audio: 2,
        derivation: ['DP27mrfz'],
        trigger: { global: 'roundStart' },
        forced: true,
        filter(event, player) {
          return !player.isDisabled(1) && (event.name != 'phase' || game.phaseNumber == 0);
        },
        content() {
          var card = game.createCard('DP27mrfz', 'diamond', 13);
          player.$gain2(card);
          player.equip(card);
        },
        group: 'jiqiangmrfz_get',
        subSkill: {
          get: {
            audio: 'jiqiangmrfz',
            forced: true,
            trigger: { player: 'phaseZhunbeiBegin' },
            filter(event, player) {
              return (
                !player.isDisabled(1) &&
                player.getCards('e', function (card) {
                  return card.name == 'DP27mrfz';
                }).length == 0
              );
            },
            content() {
              var card = game.createCard('DP27mrfz', 'diamond', 13);
              player.$gain2(card);
              player.equip(card);
            },
          },
        },
      },
      qingxiemrfz: {
        audio: 2,
        trigger: { player: 'phaseDrawEnd' },
        firstDo: true,
        filter(event, player) {
          if (player.skipList.includes('phaseUse')) return false;
          return (
            game.countPlayer(function (current) {
              return player.inRangeOf(current) && current != player;
            }) > 0
          );
        },
        check(event, player) {
          if (get.value(player.getCards('h')) >= 10) return false;
          if (
            game.countPlayer(function (current) {
              return player.inRangeOf(current) && current != player && get.attitude(player, current) < 0;
            }) < 1
          )
            return false;
          return true;
        },
        content() {
          'step 0';
          var next = player.chooseTarget('【倾泻】:请选择一名攻击范围内的其他角色', true, function (card, target, player) {
            return target != player && player.inRangeOf(target);
          });
          next.ai = function (target) {
            return get.effect(target, { name: 'sha' }, _status.event.player);
          };
          event.num = 0;
          event.skip = 0;
          ('step 1');
          if (result.targets?.length) {
            event.target = result.targets[0];
          } else event.finish();
          ('step 2');
          if (!event.target.isAlive()) {
            event.goto(4);
          } else
            player.judge(function (card) {
              var color = get.color(card);
              if (color == 'red') return 4;
              return -4;
            });
          ('step 3');
          if (result.color == 'red') {
            player.useCard({ name: 'sha' }, false, event.target);
            event.skip++;
          }
          event.num++;
          if (event.num < 3) event.goto(2);
          ('step 4');
          if (event.skip > 1) {
            player.skip('phaseUse');
          }
        },
      },
      //闪盾 闪击
      shandunmrfz: {
        mod: {
          globalFrom(from, to, distance) {
            if (from.isAction()) return distance - 1;
            return distance + 1;
          },
          globalTo(from, to, distance) {
            if (!to.isAction()) return distance + 1;
            return distance - 1;
          },
        },
      },
      xuanmumrfz: {
        audio: 2,
        trigger: { player: 'useCard2' },
        filter(event, player) {
          if (player.storage.xuanmumrfz_roundcount >= 4) return false;
          if (!event.targets || event.targets.length > 1) return false;
          if (get.distance(player, event.targets[0]) > 1) return false;
          if (event.targets[0].countCards('h') < 1) return false;
          var type = get.type(event.card);
          return event.targets[0] != player && (type == 'basic' || type == 'trick');
        },
        check(event, player) {
          return get.attitude(event.targets[0], player) < 0;
        },
        content() {
          'step 0';
          if (!player.storage.xuanmumrfz_roundcount) player.storage.xuanmumrfz_roundcount = 0;
          player.storage.xuanmumrfz_roundcount++;
          player.choosePlayerCard(trigger.targets[0], true, 'h');
          ('step 1');
          if (result.cards?.length) {
            var card = result.cards[0];
            event.card = result.cards[0];
            player.showCards(card, get.translation(player) + `对${get.translation(trigger.target)}发动了【炫目】`);
          }
          ('step 2');
          if (!mrfzfuc.canRespond(trigger.card, event.card)) {
            trigger.directHit.addArray(
              game.filterPlayer(function (current) {
                return current != player && current == trigger.targets[0];
              }),
            );
            if (trigger.targets[0].countGainableCards(player, 'h')) {
              player.gainPlayerCard('h', trigger.targets[0], true);
            }
            if (Math.random() < 0.25) trigger.targets[0].chat('有闪盾!');
          }
        },
        group: 'xuanmumrfz_roundcount',
        subSkill: {
          roundcount: {
            mark: true,
            init(player) {
              player.storage.xuanmumrfz_roundcount = 0;
              player.markSkill('xuanmumrfz_roundcount');
            },
            intro: {
              content(event, player) {
                return player.storage.xuanmumrfz_roundcount + '/4';
              },
              markcount(event, player) {
                if (!player.storage.xuanmumrfz_roundcount) return 4;
                return 4 - player.storage.xuanmumrfz_roundcount;
              },
            },
            trigger: {
              global: 'roundStart',
            },
            forced: true,
            popup: false,
            silent: true,
            content() {
              player.storage.xuanmumrfz_roundcount = 0;
            },
          },
        },
      },
      chuandunmrfz: {
        audio: 2,
        forced: true,
        trigger: { player: 'damageEnd' },
        content() {
          'step 0';
          player.draw('visible');
          ('step 1');
          if (result) {
            var card = result.cards[0];
            if ((card.suit == 'heart' || card.suit == 'spade') && card.number == 6) {
              player.loseHp(player.hp);
            }
          }
        },
      },
      //霜华 夹子妹
      tadianmrfz: {
        markimage: 'extension/驶舰之向/image/orther/shuanghuajiazimrfz.png',
        intro: {
          markcount: 'expansion',
          mark(dialog, content, player) {
            var content = player.getExpansions('tadianmrfz');
            if (content && content.length) {
              if (player == game.me || player.isUnderControl()) {
                dialog.addAuto(content);
              } else {
                return `共有${get.cnNumber(content.length)}张踏垫`;
              }
            }
          },
          content(content, player) {
            var content = player.getExpansions('tadianmrfz');
            if (content && content.length) {
              if (player == game.me || player.isUnderControl()) {
                return get.translation(content);
              }
              return `共有${get.cnNumber(content.length)}张踏垫`;
            }
          },
        },
        onremove(player, skill) {
          var cards = player.getExpansions(skill);
          if (cards.length) player.loseToDiscardpile(cards);
        },
        audio: 2,
        trigger: { global: 'roundStart' },
        forced: true,
        content() {
          'step 0';
          if (player.getExpansions('tadianmrfz').length) {
            player.gain(player.getExpansions('tadianmrfz'), 'gain2');
          }
          ('step 1');
          player.draw(3);
          player.chooseCard(true, 3, '【踏垫】:请选择将三张手牌置于你武将牌上').set('ai', function (card) {
            return 8 - get.value(card);
          });
          ('step 2');
          if (result.cards?.length) {
            player.addToExpansion(result.cards, player, 'giveAuto').gaintag.add('tadianmrfz');
          }
        },
        group: 'tadianmrfz_tri',
        subSkill: {
          rec: {
            trigger: { player: 'dyingAfter' },
            silent: true,
            charlotte: true,
            content() {
              player.recover();
              player.removeSkill('tadianmrfz_rec');
            },
          },
          tri: {
            audio: 'tadianmrfz',
            trigger: {
              target: 'useCardToTargeted',
            },
            filter(event, player) {
              if (!event.card || player.getExpansions('tadianmrfz').length < 1) return false;
              return player.getExpansions('tadianmrfz').filter(function (magic) {
                return magic.name == event.card.name;
              }).length;
            },
            check(event, player) {
              return get.attitude(player, event.player) < 0;
            },
            prompt(event, player) {
              return `【踏垫】:是否弃置一张‘踏垫’,令${get.translation(event.player)}流失所有体力？`;
            },
            content() {
              'step 0';
              var cards = player.getExpansions('tadianmrfz').filter(function (magic) {
                return magic.name == trigger.card.name;
              });
              if (cards.length) player.chooseButton(['你可以选择移去一张与其使用的牌的牌名相同的<踏垫>,令其流失所有体力', cards]);
              else event.finish();
              ('step 1');
              if (result.links?.length) {
                player.loseToDiscardpile(result.links);
                player.draw(3);
                trigger.player.loseHp(trigger.player.hp);
                trigger.player.addSkill('tadianmrfz_rec');
              }
            },
          },
        },
      },
      xinjimrfz: {
        audio: 2,
        trigger: {
          player: 'phaseZhunbeiBegin',
        },
        forced: true,
        filter(event, player) {
          return player.getExpansions('tadianmrfz').length && player.countCards('h') > 0;
        },
        content() {
          'step 0';
          var cards = player.getExpansions('tadianmrfz');
          if (!cards.length || !player.countCards('h')) {
            event.finish();
            return;
          }
          var next = player.chooseToMove('【踏垫】:是否交换<踏垫>和手牌？');
          next.set('list', [
            [get.translation(player) + '(你)的‘踏垫’', cards],
            ['手牌区', player.getCards('h')],
          ]);
          next.set('filterMove', function (from, to) {
            return typeof to != 'number';
          });
          next.set('processAI', function (list) {
            var player = _status.event.player,
              cards = list[0][1].concat(list[1][1]).sort(function (a, b) {
                return get.value(a) - get.value(b);
              }),
              cards2 = cards.splice(0, player.getExpansions('tadianmrfz').length);
            return [cards2, cards];
          });
          ('step 1');
          if (result.bool) {
            var pushs = result.moved[0],
              gains = result.moved[1];
            pushs.removeArray(player.getExpansions('tadianmrfz'));
            gains.removeArray(player.getCards('h'));
            if (!pushs.length || pushs.length != gains.length) return;
            player.addToExpansion(pushs, player, 'giveAuto').gaintag.add('tadianmrfz');
            game.log(player, '交换了手牌区与‘踏垫’的牌');
            player.gain(gains, 'draw');
          }
        },
      },
      //柏喙
      yirenmrfz: {
        audio: 4,
        chargeGet: 1,
        chargeSkill: true,
        forced: true,
        trigger: {
          player: 'phaseJieshuBegin',
        },
        filter(event, player) {
          var num = 0;
          var history = player.getHistory('useCard');
          for (var i = 0; i < history.length; i++) {
            if (history[i].card.name == 'sha' && history[i].isPhaseUsing()) {
              num++;
            }
          }
          if (player.countMark('charge') + player.getCardUsable('sha') - num >= 15) return false;
          return player.getCardUsable('sha') - num > 0;
        },
        content() {
          var num = 0;
          var history = player.getHistory('useCard');
          for (var i = 0; i < history.length; i++) {
            if (history[i].card.name == 'sha' && history[i].isPhaseUsing()) {
              num++;
            }
          }
          num = player.getCardUsable('sha') - num;
          num = Math.min(num, 15 - player.countMark('charge'));
          player.addMark('charge', num);
        },
        group: 'yirenmrfz_use',
        subSkill: {
          lim: {
            silent: true,
            charlotte: true,
            intro: {
              content: '下回合使用【杀】的次数-#',
            },
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num - player.countMark('yirenmrfz_lim');
              },
            },
          },
          use: {
            init: (player, skill) => (player.storage[skill] = 1),
            audio: 'yirenmrfz',
            enable: 'phaseUse',
            filter(event, player) {
              if (player.countMark('charge') < player.storage.yirenmrfz_use) return false;
              if (player.countCards('h') < 2) return false;
              return game.hasPlayer(function (current) {
                return current != player && player.canUse('sha', current);
              });
            },
            selectCard: 2,
            position: 'h',
            filterCard: true,
            selectTarget: [1, 2],
            filterTarget(card, player, target) {
              return player.canUse('sha', target) && target != player;
            },
            multitarget: true,
            multiline: true,
            check(card) {
              return 8 - get.value(card);
            },
            prompt: '【异刃】:请弃置两张手牌并选择至多两名角色',
            content() {
              for (var i of targets) {
                if (player.canUse('sha', i)) player.useCard({ name: 'sha' }, i, false);
                i.addTempSkill('yirenmrfz_lim', { player: 'phaseEnd' });
                i.addMark('yirenmrfz_lim', false);
              }
              player.removeMark('charge', player.storage.yirenmrfz_use);
              player.storage.yirenmrfz_use++;
            },
            ai: {
              order(item, player) {
                if (player.hasSkillTag('presha', true, null, true)) return 10;
                if (game.hasNature(item, 'linked')) {
                  if (
                    game.hasPlayer(function (current) {
                      return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                    }) &&
                    game.countPlayer(function (current) {
                      return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                    }) > 1
                  )
                    return 3.1;
                  return 3;
                }
                return 3.05;
              },
              result: {
                target(player, target) {
                  var enemyIR = game.filterPlayer(function (current) {
                    return current != player && get.attitude(player, current) < 0 && player.canUse('sha', current);
                  });
                  if (enemyIR.length < 1) return 0;
                  else if (enemyIR.length == 1) {
                    if (target.hp <= 2) return -4;
                  }
                  return -1;
                },
              },
            },
          },
        },
      },
      shehunmrfz: {
        trigger: {
          source: 'damageEnd',
        },
        intro: {
          content: '使用【杀】的次数+#',
        },
        forced: true,
        popup: false,
        filter(event, player) {
          return player.countMark('shehunmrfz') < 5;
        },
        content() {
          var mark = player.countMark('shehunmrfz');
          var num = trigger.num;
          if (mark + num > 5) var add = 5 - mark;
          else var add = num;
          player.addMark('shehunmrfz', add, false);
        },
        mod: {
          cardUsable(card, player, num) {
            if (card.name == 'sha') return num + player.countMark('shehunmrfz');
          },
        },
      },
      //白面鸮
      jinaomrfz: {
        audio: 2,
        mark: true,
        marktext: '机脑',
        intro: {
          content(event, player) {
            var storage = player.storage.jinaomrfz;
            if (storage == true) return '递增';
            if (storage == false) return '递减';
            return '无限制';
          },
        },
        trigger: { player: 'useCardAfter' },
        filter(event, player) {
          var history = player.getHistory('useCard');
          if (history.indexOf(event) != 1) return false;
          return history[0].card.number != undefined && history[1].card.number != undefined;
        },
        forced: true,
        content() {
          var history = player.getHistory('useCard');
          if (history[0].card.number < history[1].card.number) {
            player.storage.jinaomrfz = true;
            player.marks.jinaomrfz.innerText = '递增';
          } else {
            player.storage.jinaomrfz = false;
            player.marks.jinaomrfz.innerText = '递减'; //QQQ
          }
          player.storage.jinaomrfz_lim = history[1].card.number;
          player.addTempSkill('jinaomrfz_lim', 'phaseEnd');
        },
        group: ['jinaomrfz_draw'],
        subSkill: {
          handlit: {
            charlotte: true,
            intro: {
              content: '手牌上限+#',
            },
            mod: {
              maxHandcard(player, num) {
                return num + player.countMark('jinaomrfz_handlit');
              },
            },
          },
          draw: {
            trigger: { player: 'useCardAfter' },
            lastDo: true,
            forced: true,
            audio: 'jinaomrfz',
            filter(event, player) {
              var history = player.getHistory('useCard');
              if (history.length < 2) return false;
              if (!get.color(history[history.length - 2].card) || get.color(event.card) == 'none') return false;
              return get.color(history[history.length - 2].card) == get.color(event.card);
            },
            content() {
              var color = get.color(trigger.card);
              if (color == 'red') player.draw(2);
              else {
                player.addTempSkill('jinaomrfz_handlit', 'phaseEnd');
                player.addMark('jinaomrfz_handlit', false);
              }
            },
          },
          lim: {
            onremove(player) {
              player.marks.jinaomrfz.innerText = '机脑';
              delete player.storage.jinaomrfz;
              delete player.storage.jinaomrfz_lim;
            },
            forced: true,
            charlotte: true,
            trigger: { player: 'useCardAfter' },
            firstDo: true,
            filter(event, player) {
              if (!event.card.number) return false;
              return true;
            },
            content() {
              player.storage.jinaomrfz_lim = trigger.card.number;
              var cards = player.getCards('h');
              var max, min;
              if (Array.isArray(cards))
                for (var i of cards) {
                  var num = i.number;
                  if (i == 0) {
                    max = num;
                    min = num;
                    continue;
                  }
                  if (num > max) max = num;
                  if (min > num) min = num;
                }
              if (trigger.card.number >= max) {
                player.storage.jinaomrfz = false;
                player.marks.jinaomrfz.innerText = '递减';
                player.draw();
              }
              if (trigger.card.number <= min) {
                player.storage.jinaomrfz = true;
                player.marks.jinaomrfz.innerText = '递增';
                player.draw();
              }
            },
            mod: {
              cardEnabled2(card, player) {
                if (player.storage.jinaomrfz == true) {
                  if (card.number && card.number <= player.storage.jinaomrfz_lim) return false;
                } else {
                  if (card.number && card.number >= player.storage.jinaomrfz_lim) return false;
                }
              },
            },
          },
        },
      },
      wutaimrfz: {
        audio: 2,
        trigger: { player: 'phaseEnd' },
        forced: true,
        filter(event, player) {
          var cards = player.getCards('h');
          if (cards.length < 2) return false;
          if (Array.isArray(cards))
            for (var i of cards) {
              if (i == 0) {
                var tmp_cards = i;
                continue;
              }
              if (get.type2(tmp_cards) != get.type2(i)) return true;
              if (get.color(tmp_cards) != get.color(i)) return true;
              tmp_cards = i;
            }
          return false;
        },
        content() {
          'step 0';
          player
            .chooseToDiscard(2, 'h', false, '【五肽】:你可以弃置两张类型或颜色不相同的手牌并选择一名角色,直到你的下个回合开始,其每回合第一次受到的伤害-1', function (card) {
              if (ui.selected.cards.length == 0) return true;
              if (ui.selected.cards.length) {
                return get.type2(card, player) != get.type2(ui.selected.cards[0], player) || get.color(card, player) != get.color(ui.selected.cards[0], player);
              }
              return false;
            })
            .set('complexCard', true)
            .set('ai', function (card) {
              return 10 - get.value(card);
            });
          ('step 1');
          if (result.bool) {
            player.chooseTarget('【五肽】:请选择一名角色', true, function (card, player, target) {
              return !target.hasSkill('wutaimrfz_eff');
            }).ai = function (target) {
              var att = get.attitude(player, target);
              if (target.hp < 3) att /= 1.5;
              return att;
            };
          } else event.finish();
          ('step 2');
          if (result.targets?.length) {
            player.addTempSkill('wutaimrfz_eff', { player: 'phaseBegin' });
            player.storage.wutaimrfz_eff = result.targets[0];
          }
        },
        subSkill: {
          mark: {
            charlotte: true,
          },
          eff: {
            audio: 'wutaimrfz',
            mark: true,
            intro: {
              content(event, player) {
                var char = get.translation(player.storage.wutaimrfz_eff);
                if (player.hasSkill('wutaimrfz_mark')) return `本回合${char}已触发过此效果`;
                return char + '受到的伤害-1';
              },
            },
            trigger: {
              global: 'damageBegin',
            },
            forced: true,
            charlotte: true,
            logTarget: 'player',
            filter(event, player) {
              if (player.hasSkill('wutaimrfz_mark')) return false;
              return event.player == player.storage.wutaimrfz_eff;
            },
            content() {
              player.addTempSkill('wutaimrfz_mark', 'phaseEnd');
              trigger.num--;
            },
          },
        },
      },
      //刺玫
      huabumrfz: {
        audio: 2,
        global: 'huabumrfz_eff',
        subSkill: {
          eff: {
            enable: 'phaseUse',
            usable: 1,
            filter(event, player) {
              return (
                !player.hasSkill('huabumrfz') &&
                game.hasPlayer((current) => {
                  return current.hasSkill('huabumrfz');
                })
              );
            },
            content() {
              'step 0';
              var targets = game.filterPlayer((current) => {
                return current.hasSkill('huabumrfz');
              });
              if (targets.length == 1) {
                event.targets = targets[0];
                event.goto(2);
              } else if (targets.length > 1) {
                player
                  .chooseTarget(true, '选择【花卜】的目标', function (card, player, target) {
                    return _status.event.list.includes(target);
                  })
                  .set('list', targets)
                  .set('ai', function (target) {
                    var player = _status.event.player;
                    return get.attitude(player, target);
                  });
              } else event.finish();
              ('step 1');
              if (result.targets?.length) {
                event.targets = result.targets[0];
              } else event.finish();
              ('step 2');
              if (event.targets) {
                event.targets.draw();
              } else event.finish();
              ('step 3');
              if (result) {
                var card = result.cards[0];
                var cards = player.getCards('h');
                var bool = false;
                for (var i of cards) {
                  if (get.type2(i) == get.type2(card)) {
                    bool = true;
                    break;
                  }
                }
                event.is = bool;
                event.targets
                  .chooseControl('有', '没有')
                  .set('prompt', `【花卜】:${get.translation(player)}手牌中是否有与${get.translation(card)}(${get.translation(get.type2(card))})类型相同的牌？`)
                  .set('ai', function () {
                    var player = _status.event.player,
                      is = _status.event.is,
                      target = _status.event.target;
                    is = is === true ? '有' : '没有';
                    if (get.attitude(player, target) > 0 && target.hasSkill('shixinmrfz')) return is;
                    else if (target.hasSkill('shixinmrfz')) return !is;
                    return ['有', '没有'].randomGet();
                  })
                  .set('is', event.is)
                  .set('target', event.targets);
              } else event.finish();
              ('step 4');
              if (result.control) {
                var bool = result.control == '有' ? true : false;
                if (event.is == bool) {
                  player.draw();
                  event.targets.draw();
                } else {
                  event.targets.chooseToDiscard(true, '【花卜】:请选择弃置一张牌');
                }
              }
            },
            ai: {
              order: 13,
              threaten: 1.5,
              result: {
                player(player, target) {
                  var target = game.findPlayer(function (current) {
                    return current.hasSkill('huabumrfz');
                  });
                  if (target) {
                    return get.attitude(player, target);
                  }
                },
              },
            },
          },
        },
      },
      shixinmrfz: {
        audio: 2,
        trigger: { player: 'gainAfter' },
        filter(event, player) {
          if (!_status.currentPhase) return false;
          if (player.hasSkill('shixinmrfz_ban')) return false;
          if (_status.currentPhase.countCards('h') == 0) return false;
          return _status.currentPhase != player;
        },
        prompt: '【识心】:是否观看当前回合角色的手牌？',
        content() {
          player.viewHandcards(_status.currentPhase);
          player.addTempSkill('shixinmrfz_ban', 'phaseEnd');
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //红
      qunlangmrfz: {
        audio: 2,
        trigger: {
          player: 'showCharacterAfter',
        },
        hiddenSkill: true,
        filter(event, player) {
          if (!event.toShow || !event.toShow.includes('hongmrfz')) return false;
          return game.hasPlayer((current) => {
            return current != player && player.inRangeOf(current);
          });
        },
        check(event, player) {
          return game.hasPlayer((current) => {
            return current != player && player.inRangeOf(current) && get.attitude(current, player) < 0;
          });
        },
        prompt: '【群狼】:你可以对你攻击范围内的一名其他角色造成一点伤害',
        content() {
          'step 0';
          player
            .chooseTarget(true, '【群狼】:请选择一名其他角色并对其造成一点伤害', function (card, player, target) {
              return target != player && player.inRangeOf(target);
            })
            .set('ai', function (target) {
              var player = _status.event.player;
              return get.damageEffect(target, player, player);
            });
          ('step 1');
          if (result.targets?.length) {
            var target = result.targets[0];
            target.damage('player');
          }
        },
      },
      cigumrfz: {
        mod: {
          cardnature(card, player) {
            if (!card.nature && card.name == 'sha') return 'stab';
          },
        },
        audio: 2,
        trigger: {
          global: ['respond', 'useCard'],
        },
        forced: true,
        filter(event, player) {
          if (!event.respondTo) return false;
          if (event.player == player) return false;
          if (player != event.respondTo[0]) return false;
          else return event.cards && event.cards.filterInD('od').length;
        },
        prompt(event, player) {
          var cards = event.cards.filterInD('od');
          return `【刺骨】:是否获得${get.translation(cards)}?`;
        },
        content() {
          var cards = trigger.cards.filterInD('od');
          player.gain(cards, 'log', 'gain2');
        },
      },
      qingchumrfz: {
        group: ['qingchumrfz_sha', 'qingchumrfz_shan'],
        audio: 2,
        trigger: { player: ['useCard', 'respond'] },
        filter(event, player) {
          var target = _status.currentPhase;
          if (!target || target.countCards('he') == 0) return false;
          return event.card && event.card.name == 'sha' && target != player;
        },
        check(event, player) {
          var target = _status.currentPhase;
          return get.attitude(target, player) < 0;
        },
        prompt(event, player) {
          var target = _status.currentPhase;
          return `【清处】:是否弃置当前回合角色(${get.translation(target)})一张牌？`;
        },
        content() {
          'step 0';
          var target = _status.currentPhase;
          if (!target || target.countCards('he') == 0) event.finish();
          else player.discardPlayerCard(target, 'he', true);
          ('step 1');
          if (result.cards?.length) {
            if (result.cards[0].suit == trigger.card.suit) {
              event.goto(0);
            }
          }
        },
        subSkill: {
          shan: {
            audio: 'qingchumrfz',
            enable: ['chooseToRespond', 'chooseToUse'],
            filter(event, player) {
              return _status.currentPhase != player;
            },
            filterCard: {
              name: 'sha',
            },
            viewAs: {
              name: 'shan',
            },
            prompt: '将一张杀当闪使用或打出',
            check() {
              return 1;
            },
            position: 'hs',
            viewAsFilter(player) {
              if (!player.countCards('hs', 'sha')) return false;
            },
            ai: {
              respondShan: true,
              skillTagFilter(player) {
                if (!player.countCards('hs', 'sha') || _status.currentPhase != player) return false;
              },
              effect: {
                target(card, player, target, current) {
                  if (get.tag(card, 'respondShan') && current < 0) return 0.6;
                },
              },
              order: 4,
              useful: -1,
              value: -1,
              basic: {
                useful: [7, 5.1, 2],
                value: [7, 5.1, 2],
              },
              result: {
                player: 1,
              },
            },
          },
          sha: {
            audio: 'qingchumrfz',
            enable: ['chooseToUse', 'chooseToRespond'],
            filter(event, player) {
              return _status.currentPhase != player;
            },
            filterCard: {
              name: 'shan',
            },
            viewAs: {
              name: 'sha',
            },
            viewAsFilter(player) {
              if (!player.countCards('hs', 'shan')) return false;
            },
            position: 'hs',
            prompt: '将一张闪当杀使用或打出',
            check() {
              return 1;
            },
            ai: {
              effect: {
                target(card, player, target, current) {
                  if (get.tag(card, 'respondSha') && current < 0) return 0.6;
                },
              },
              respondSha: true,
              skillTagFilter(player) {
                if (!player.countCards('hs', 'shan') || _status.currentPhase != player) return false;
              },
              order() {
                return get.order({ name: 'sha' }) + 0.1;
              },
              useful: -1,
              value: -1,
              yingbian(card, player, targets, viewer) {
                if (get.attitude(viewer, player) <= 0) return 0;
                var base = 0,
                  hit = false;
                if (get.cardtag(card, 'yingbian_hit')) {
                  hit = true;
                  if (
                    targets.filter(function (target) {
                      return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                    })
                  )
                    base += 5;
                }
                if (get.cardtag(card, 'yingbian_all')) {
                  if (
                    game.hasPlayer(function (current) {
                      return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                    })
                  )
                    base += 5;
                }
                if (get.cardtag(card, 'yingbian_damage')) {
                  if (
                    targets.filter(function (target) {
                      return (
                        get.attitude(player, target) < 0 &&
                        (hit ||
                          !target.mayHaveShan() ||
                          player.hasSkillTag(
                            'directHit_ai',
                            true,
                            {
                              target: target,
                              card: card,
                            },
                            true,
                          )) &&
                        !target.hasSkillTag('filterDamage', null, {
                          player: player,
                          card: card,
                          jiu: true,
                        })
                      );
                    })
                  )
                    base += 5;
                }
                return base;
              },
              canLink(player, target, card) {
                if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                if (
                  target.mayHaveShan() &&
                  !player.hasSkillTag(
                    'directHit_ai',
                    true,
                    {
                      target: target,
                      card: card,
                    },
                    true,
                  )
                )
                  return false;
                if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                return true;
              },
              basic: {
                useful: [5, 3, 1],
                value: [5, 3, 1],
              },
              result: {
                target(player, target, card, isLink) {
                  var eff = (function () {
                    if (!isLink && player.hasSkill('jiu')) {
                      if (
                        !target.hasSkillTag('filterDamage', null, {
                          player: player,
                          card: card,
                          jiu: true,
                        })
                      ) {
                        if (get.attitude(player, target) > 0) {
                          return -7;
                        } else {
                          return -4;
                        }
                      }
                      return -0.5;
                    }
                    return -1.5;
                  })();
                  if (
                    !isLink &&
                    target.mayHaveShan() &&
                    !player.hasSkillTag(
                      'directHit_ai',
                      true,
                      {
                        target: target,
                        card: card,
                      },
                      true,
                    )
                  )
                    return eff / 1.2;
                  return eff;
                },
              },
              tag: {
                respond: 1,
                respondShan: 1,
                damage(card) {
                  if (game.hasNature(card, 'poison')) return;
                  return 1;
                },
                natureDamage(card) {
                  if (game.hasNature(card)) return 1;
                },
                fireDamage(card, nature) {
                  if (game.hasNature(card, 'fire')) return 1;
                },
                thunderDamage(card, nature) {
                  if (game.hasNature(card, 'thunder')) return 1;
                },
                poisonDamage(card, nature) {
                  if (game.hasNature(card, 'poison')) return 1;
                },
              },
            },
          },
        },
      },
      //德克萨斯
      jianyumrfz: {
        audio: 2,
        usable: 1,
        enable: 'phaseUse',
        content() {
          'step 0';
          var cards = get.cards(4);
          game.cardsGotoOrdering(cards);
          player.showCards(cards, '剑雨');
          var suit = [];
          if (Array.isArray(cards))
            for (var i of cards) {
              var suitcard = i.suit;
              if (suit.includes(suitcard)) continue;
              suit.add(suitcard);
            }
          var num = suit.length;
          if (player.countCards('he') >= suit.length)
            player.chooseCard('he', true, `【剑雨】:将至少${num}张牌当作【万箭齐发】对你选择牌的等量名其他角色使用`, [num, Infinity]).set('ai', function (card) {
              return get.value(card) <= 6;
            });
          else event.finish();
          ('step 1');
          if (result.cards?.length) {
            var cards = result.cards;
            player.addTempSkill('jianyumrfz_dam', 'jianyumrfzAfter');
            player.chooseUseTarget({ name: 'wanjian' }, cards, true, false).set('selectTarget', function (card, player, target) {
              var num = cards.length;
              return [1, num];
            }).viewAs = true;
          }
        },
        subSkill: {
          dam: {
            silent: true,
            charlotte: true,
            trigger: { source: 'damageEnd' },
            filter(event, player) {
              return event.player.isAlive() && event.cards && event.card.name == 'wanjian' && !event.player.hasSkill('jianyumrfz_debuff');
            },
            content() {
              trigger.player.addTempSkill('jianyumrfz_debuff', { player: 'phaseEnd' });
            },
          },
          debuff: {
            mark: true,
            intro: {
              content: '使用【杀】的次数-1',
            },
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num - 1;
              },
            },
          },
        },
        ai: {
          order: 2.95,
          result: {
            player: 1,
          },
        },
      },
      sudimrfz: {
        audio: 2,
        trigger: { global: 'roundStart' },
        forced: true,
        content() {
          //抄的郭嘉
          'step 0';
          event.count = 1; //唯一有实质性改动的地方
          ('step 1');
          event.count--;
          event.cards = game.cardsGotoOrdering(get.cards(2)).cards;
          if (_status.connectMode)
            game.broadcastAll(function () {
              _status.noclearcountdown = true;
            });
          event.given_map = {};
          ('step 2');
          if (event.cards.length > 1) {
            player.chooseCardButton('【速递】:请选择要分配的牌', true, event.cards, [1, event.cards.length]).set('ai', function (button) {
              if (ui.selected.buttons.length == 0) return 1;
              return 0;
            });
          } else if (event.cards.length == 1) {
            event._result = { links: event.cards.slice(0), bool: true };
          } else {
            event.finish();
          }
          ('step 3');
          if (result.links?.length) {
            event.cards.removeArray(result.links);
            event.togive = result.links.slice(0);
            player
              .chooseTarget('选择一名角色获得' + get.translation(result.links), true)
              .set('ai', function (target) {
                var att = get.attitude(_status.event.player, target);
                if (_status.event.enemy) {
                  return -att;
                } else if (att > 0) {
                  return att / (1 + target.countCards('h'));
                } else {
                  return att / 100;
                }
              })
              .set('enemy', get.value(event.togive[0], player, 'raw') < 0);
          }
          ('step 4');
          if (result.targets.length) {
            var id = result.targets[0].playerid,
              map = event.given_map;
            if (!map[id]) map[id] = [];
            map[id].addArray(event.togive);
          }
          if (cards.length) event.goto(2);
          ('step 5');
          if (_status.connectMode) {
            game.broadcastAll(function () {
              delete _status.noclearcountdown;
              game.stopCountChoose();
            });
          }
          var list = [];
          for (var i in event.given_map) {
            var source = (_status.connectMode ? lib.playerOL : game.playerMap)[i];
            player.line(source, 'green');
            list.push([source, event.given_map[i]]);
          }
          game.loseAsync({
            gain_list: list,
            giver: player,
            animate: 'draw',
          }).setContent('gaincardMultiple');
          ('step 6');
          if (event.count > 0 && player.hasSkill(event.name) && !get.is.blocked(event.name, player)) {
            player.chooseBool(get.prompt2(event.name)).set('frequentSkill', event.name);
          } else event.finish();
          ('step 7');
          if (result.bool) {
            event.goto(1);
          }
        },
        ai: {
          expose: 0.1,
          threaten: 1.1,
        },
      },
      //白金
      xujimrfz: {
        init(player) {
          player.storage.xujimrfz = {
            damage: 0,
            maxhand: 0,
          };
        },
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.xujimrfz;
            var str;
            if (storage.damage > 0) str = `下次使用【杀】的伤害基数+${storage.damage}</br>`;
            if (storage.maxhand > 0) str = str + '手牌上限+' + storage.maxhand;
            if (!str) return '没有效果';
            return str;
          },
        },
        audio: 3,
        trigger: { player: 'phaseDiscardBegin' },
        forced: true,
        filter(event, player) {
          return (
            player.getHistory('useCard', function (evt) {
              if (evt.targets && evt.targets.length && evt.isPhaseUsing()) {
                var targets = evt.targets.slice(0);
                while (targets.includes(player)) targets.remove(player);
                return targets.length;
              }
              return false;
            }).length == 0
          );
        },
        content() {
          'step 0';
          player.storage.xujimrfz.damage += 1;
          if (player.canUseToAnyone('sha', false) && player.hasSha()) player.chooseControl('摸牌', '出杀').set('prompt', '【蓄击】:请选择一项');
          else {
            var num = 2 + player.storage.shiyumrfz_buff;
            player.draw(num || 2);
            player.storage.xujimrfz.maxhand += 5;
            event.finish();
          }
          ('step 1');
          if (result.index == 0) {
            var num = 2 + player.storage.shiyumrfz_buff;
            player.draw(num || 2);
            player.storage.xujimrfz.maxhand += 5;
          } else {
            player.addTempSkill('xujimrfz_sha', 'xujimrfzAfter');
            player
              .chooseToUse(function (card, player, event) {
                if (card.name != 'sha') return false;
                return lib.filter.filterCard.apply(this, arguments);
              }, '【蓄击】:请你使用一张【杀】')
              .set('complexSelect', true);
          }
        },
        group: ['xujimrfz_clear', 'xujimrfz_dam'],
        subSkill: {
          sha: {
            silent: true,
            charlotte: true,
            trigger: {
              player: 'useCardToPlayered',
            },
            filter(event, player) {
              return event.card && event.card.name == 'sha' && !event.parent.directHit.includes(event.target);
            },
            logTarget: 'target',
            content() {
              var storage = player.storage.shiyumrfz_buff;
              if (!storage) storage = 0;
              var id = trigger.target.playerid;
              var map = trigger.parent.customArgs;
              if (!map[id]) map[id] = {};
              if (typeof map[id].shanRequired == 'number') {
                map[id].shanRequired++;
              } else {
                map[id].shanRequired = 2 + storage;
              }
              player.removeSkill('xujimrfz_sha');
            },
          },
          clear: {
            silent: true,
            charlotte: true,
            firstDo: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.storage.xujimrfz.maxhand = 0;
            },
            mod: {
              maxHandcard(player, num) {
                return num + (player.storage.xujimrfz.maxhand || 0);
              },
            },
          },
          dam: {
            charlotte: true,
            forced: true,
            trigger: { player: 'useCard' },
            filter(event, player) {
              if (player.storage.xujimrfz.damage < 1) return false;
              return event.card && event.card.name == 'sha';
            },
            content() {
              var storage = player.storage.xujimrfz.damage;
              if (!trigger.baseDamage) trigger.baseDamage = 1;
              trigger.baseDamage += storage;
              player.storage.xujimrfz.damage = 0;
            },
          },
        },
      },
      shiyumrfz: {
        audio: 2,
        juexingji: true,
        forced: true,
        trigger: { source: 'damageEnd' },
        filter(event, player) {
          return event.num >= 1;
        },
        content() {
          player.storage.shiyumrfz = true;
          player.awakenSkill('shiyumrfz');
          player.addSkill('shiyumrfz_buff');
          if (!player.storage.shiyumrfz_buff) player.storage.shiyumrfz_buff = 0;
          player.storage.shiyumrfz_buff += 1;
          for (var i of game.players) {
            if (i == player) continue;
            i.addSkill('shiyumrfz_seecard');
          }
        },
        subSkill: {
          seecard: {
            silent: true,
            charlotte: true,
            mark: true,
            markimage: 'extension/驶舰之向/image/orther/shiyumrfz.png',
            intro: {
              markcount: 'expansion',
              mark(dialog, storage, player) {
                var cards = player.getCards('h');
                var target = game.findPlayer(function (current) {
                  return current.hasSkill('shiyumrfz_buff');
                });
                if (game.me == target && target.inRange(player)) dialog.addAuto(cards);
                else if (cards) return `有${get.cnNumber(cards.length)}张手牌`;
                return '没有手牌';
              },
            },
            trigger: { global: 'die' },
            lastDo: true,
            filter(event, player) {
              return (
                event.player.hasSkill('shiyumrfz_buff') &&
                !game.hasPlayer(function (current) {
                  return event.player != current && current.hasSkill('shiyumrfz_buff');
                })
              );
            },
            content() {
              player.removeSkill('shiyumrfz_seecard');
            },
          },
          buff: {
            charlotte: true,
            mod: {
              attackRange(player, num) {
                return (num += 1);
              },
            },
          },
        },
      },
      //因陀罗
      suijiamrfz: {
        init(player) {
          player.storage.suijiamrfz = {
            del: false,
            damage: 0,
          };
        },
        audio: 2,
        trigger: { source: 'damageBegin' },
        filter(event, player) {
          var isdel = player.storage.suijiamrfz.del;
          return (isdel == false && event.player.hujia > 0) || isdel == true;
        },
        forced: true,
        content() {
          trigger.num += 1 + player.storage.suijiamrfz.damage || 1;
        },
        group: 'suijiamrfz_clear',
        subSkill: {
          clear: {
            charlotte: true,
            silent: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.storage.suijiamrfz = {
                del: false,
                damage: 0,
              };
            },
          },
        },
      },
      huquanmrfz: {
        audio: 2,
        enable: ['chooseToRespond', 'chooseToUse'],
        hiddenCard(player, name) {
          if (player.countCards('h') < 1 || player.hasSkill('huquanmrfz_ban')) return false;
          if (name != 'shan' && name != 'wuxie') return false;
          return true;
        },
        filter(event, player) {
          if (player.hasSkill('huquanmrfz_ban') || player.countCards('h') < 1) return false;
          for (var name of ['wuxie', 'shan']) {
            if (event.filterCard && event.filterCard({ name: name }, player, event)) return true;
          }
          return false;
        },
        chooseButton: {
          dialog(event, player) {
            var vcards = [];
            for (var name of ['wuxie', 'shan']) {
              var card = { name: name };
              if (event.filterCard && event.filterCard(card, player, event)) {
                if (name == 'shan') vcards.push(['基本', '', name]);
                if (name == 'wuxie') vcards.push(['锦囊', '', name]);
              } //QQQ
            }
            var dialog = ui.create.dialog('虎拳', [vcards, 'vcard'], 'hidden');
            dialog.direct = true;
            return dialog;
          },
          backup(links, player) {
            return {
              filterCard(card) {
                return card.number > 5;
              },
              selectCard: 1,
              viewAs: {
                name: links[0][2],
              },
              popname: true,
              precontent() {
                'step 0';
                var list = ['【碎甲】中{ }内的数字+1直到你下个回合结束'];
                if (!player.storage.suijiamrfz)
                  player.storage.suijiamrfz = {
                    del: false,
                    damage: 0,
                  };
                if (player.storage.suijiamrfz.del == false) list.push('删除【碎甲】中[ ]内的描述直到你下个回合结束');
                if (list.length > 1)
                  player
                    .chooseControl()
                    .set('choiceList', list)
                    .set('ai', function () {
                      return 1;
                    })
                    .set('prompt', '【虎拳】:请选择一项');
                else {
                  player.storage.suijiamrfz.damage = +1;
                  player.addTempSkill('huquanmrfz_ban', { global: 'phaseEnd' });
                  event.finish();
                }
                ('step 1');
                if (result.index == 0) {
                  player.storage.suijiamrfz.damage = +1;
                } else player.storage.suijiamrfz.del = true;
                player.addTempSkill('huquanmrfz_ban', { global: 'phaseEnd' });
              },
            };
          },
          prompt(links, player) {
            return `【虎拳】:视为使用一张【${get.translation(links[0][2])}】`;
          },
        },
        ai: {
          respondShan: true,
          order: 10,
          skillTagFilter(player, tag, arg) {
            return (
              player.countCards('h', function (card) {
                return card.number > 5;
              }) > 0 && !player.hasSkill('huquanmrfz_ban')
            );
          },
          result: { player: 1 },
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //温米
      baiweimrfz: {
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.baiweimrfz,
              text;
            if (Object.keys(player.storage.baiweimrfz).length < 1) return '没有记录的牌';
            for (var key in storage) {
              text = (text === undefined ? '' : text) + get.translation(key) + `:${storage[key]}</br>`;
            }
            return text;
          },
        },
        audio: 4,
        init(player) {
          player.storage.baiweimrfz = {};
        },
        enable: ['chooseToUse', 'chooseToRespond'],
        filter(event, player) {
          if (player.countCards('h') < 1 || Object.keys(player.storage.baiweimrfz).length < 1) return false;
          for (var i of lib.inpile) {
            var type = get.type(i);
            if ((type == 'basic' || type == 'trick') && event.filterCard({ name: i }, player, event) && Object.hasOwn(player.storage.baiweimrfz, i)) return true;
          }
          return false;
        },
        chooseButton: {
          dialog(event, player) {
            var number = {};
            for (var i = 1; i <= mrfzfuc.getCardNumUniqueLengths(lib.inpile, true).length; i++) {
              number[i] = [];
            }
            for (var i = 1; i <= mrfzfuc.getCardNumUniqueLengths(lib.inpile, true).length; i++) {
              for (var name of lib.inpile) {
                if (get.type(name) == 'delay' || get.type(name) == 'equip') continue;
                if (event.filterCard && event.filterCard({ name: name }, player, event)) {
                  if (!Object.hasOwn(player.storage.baiweimrfz, name)) continue;
                  if (get.cardNameLength(name) == i) {
                    if (name == 'sha') {
                      number[i].push(['基本', '', 'sha']);
                      for (var k of ['fire', 'thunder', 'ice', 'stab']) {
                        number[i].push(['基本', '', 'sha', k]);
                      }
                    } else if (get.type(name) == 'trick') {
                      number[i].push(['锦囊', '', name]);
                    } else if (get.type(name) == 'basic') {
                      number[i].push(['基本', '', name]);
                    }
                  }
                }
              }
            }
            var dialog = ui.create.dialog;
            dialog = ['百味:请选择一张牌'];
            for (var i = 1; i < Object.keys(number).length; i++) {
              if (!number[i].length) continue;
              dialog.push(`<div class="text center">${get.cnNumber(i)}字</div>`);
              dialog.push([number[i], 'vcard']);
            }
            return dialog;
          },
          backup(links, player) {
            return {
              filterCard(card) {
                var selected = ui.selected.cards,
                  num = get.cardNameLength(links[0][2]);
                if (selected.length) {
                  var num2 = 0;
                  for (var i = 0; i < selected.length; i++) {
                    num2 += get.cardNameLength(selected[i]);
                  }
                  num -= num2;
                  return get.cardNameLength(card) <= num;
                } else return get.cardNameLength(card) <= num;
                return false;
              },
              selectCard() {
                var num = Infinity,
                  selected = ui.selected.cards,
                  num2 = get.cardNameLength(links[0][2]);
                if (selected.length) {
                  var num3 = 0;
                  for (var i = 0; i < selected.length; i++) {
                    num3 += get.cardNameLength(selected[i]);
                  }
                  if ((num = Infinity)) num = 1;
                  if (num3 != num2) num = num + selected.length;
                }
                return num;
              },
              audio: 'baiweimrfz',
              popname: true,
              check(card) {
                return 8 - get.value(card);
              },
              position: 'h',
              viewAs: { name: links[0][2], nature: links[0][3] },
              precontent() {
                var name = lib.skill.baiweimrfz_backup.viewAs.name;
                player.storage.baiweimrfz[name]--;
                if (player.storage.baiweimrfz[name] == 0) delete player.storage.baiweimrfz[name];
              },
            };
          },
          prompt(links, player) {
            return `将任意张字数之和为${get.cnNumber(links[0][2])}的牌为当做` + (get.translation(links[0][3]) || '') + get.translation(links[0][2]) + '使用';
          },
        },
        hiddenCard(player, name) {
          if (!lib.inpile.includes(name)) return false;
          var type = get.type(name);
          return (type == 'basic' || type == 'trick') && Object.hasOwn(player.storage.baiweimrfz, name) && player.countCards('h') > 0;
        },
        ai: {
          fireAttack: true,
          respondShan: true,
          respondSha: true,
          skillTagFilter(player) {
            if (!player.countCards('h') || player.hasSkill('baiweimrfz_ban')) return false;
          },
          order: 1,
          result: {
            player(player) {
              if (_status.event.dying) return get.attitude(player, _status.event.dying);
              return 1;
            },
          },
        },
        group: 'baiweimrfz_use',
        subSkill: {
          ban: {
            charlotte: true,
          },
          use: {
            silent: true,
            trigger: { global: 'useCard' },
            filter(event, player) {
              if (!event.card || player.hasSkill('baiweimrfz_ban')) return false;
              return get.type(event.card) == 'trick' || get.type(event.card) == 'basic';
            },
            content() {
              var name = trigger.card.name;
              if (!player.storage.baiweimrfz) player.storage.baiweimrfz = {};
              if (Object.hasOwn(player.storage.baiweimrfz, name)) {
                player.storage.baiweimrfz[name]++;
              } else {
                player.storage.baiweimrfz[name] = 1;
              }
              if (trigger.player != player && _status.currentPhase != player) player.addTempSkill('baiweimrfz_ban', { global: 'phaseEnd' });
            },
          },
        },
      },
      nuanxiangmrfz: {
        audio: 2,
        trigger: { player: 'useCardAfter' },
        filter(event, player) {
          if (player.hasSkill('nuanxiangmrfz_ban')) return false;
          return event.card && event.card.cards;
        },
        prompt(event, player) {
          return `【暖香】:是否令至多${get.cnNumber(event.card.cards.length)}名角色摸一张牌？`;
        },
        content() {
          'step 0';
          var num = trigger.card.cards.length;
          player.addTempSkill('nuanxiangmrfz_ban', { global: 'phaseEnd' });
          player.chooseTarget(true, [1, num], `【暖香】:请选择至多${get.cnNumber(num)}名角色`).ai = function (target) {
            return get.attitude(player, target) > 0;
          };
          ('step 1');
          if (result.targets?.length) {
            for (var i of result.targets) {
              player.line(i);
              i.draw();
            }
          }
        },
        ai: {
          expose: 0.1,
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //梅尔
      shuitamrfz: {
        intro: {
          content: 'expansion',
          markcount: 'expansion',
        },
        onremove(player, skill) {
          var cards = player.getExpansions(skill);
          if (cards.length) player.loseToDiscardpile(cards);
        },
        mod: {
          ignoredHandcard(card, player) {
            if (card.hasGaintag('shuitamrfzx')) {
              return true;
            }
          },
          cardDiscardable(card, player, name) {
            if (name == 'phaseDiscard' && card.hasGaintag('shuitamrfzx')) return false;
          },
        },
        audio: 2,
        derivation: ['baopomrfz', 'mihuomrfz'],
        trigger: {
          global: 'phaseBefore',
          player: 'enterGame',
        },
        forced: true,
        filter(event, player) {
          return (event.name != 'phase' || game.phaseNumber == 0) && player.countCards('h') > 0;
        },
        content() {
          'step 0';
          player.chooseCard(true, '【水獭】:请选择至多三张牌并标记为‘咪啵’', [1, 3]).set('ai', function (card) {
            return get.type(card) != 'equip' && get.type(card) != 'delay';
          });
          ('step 1');
          if (result.cards?.length) {
            player.addGaintag(result.cards, 'shuitamrfzx');
            for (var i of result.cards) {
              i.storage.shuitamrfzx = true;
            }
          }
          ('step 2');
          player
            .chooseControl('爆破', '迷惑')
            .set('prompt', '【水獭】:请选择获得一个技能')
            .set('ai', function () {
              return [0, 1].randomGet();
            });
          ('step 3');
          if (result.index == 0) {
            player.addSkill('baopomrfz');
          } else if (result.index == 1) {
            player.addSkill('mihuomrfz');
          }
        },
        group: ['shuitamrfz_reget', 'shuitamrfz_end'],
        subSkill: {
          end: {
            forced: true,
            trigger: { global: 'phaseEnd' },
            filter(event, player) {
              return player.getExpansions('shuitamrfz').length;
            },
            content() {
              'step 0';
              var cards = player.getExpansions('shuitamrfz');
              if (cards.length == 1) {
                for (var i of cards) {
                  i.storage.shuitamrfzx = true;
                }
                player.gain(cards, 'gain2').gaintag = ['shuitamrfzx'];
                game.log(player, '收回了' + get.translation(cards));
                event.finish();
              } else {
                player.chooseButton(['【水獭】:请选择获得其中一张牌', cards]).ai = function (button) {
                  return get.value(button.link);
                };
              }
              ('step 1');
              if (result.links?.length) {
                for (var i of result.links) {
                  i.storage.shuitamrfzx = true;
                }
                player.gain(result.links, 'gain2').gaintag = ['shuitamrfzx'];
                game.log(player, '收回了' + get.translation(result.links));
              }
            },
          },
          reget: {
            forced: true,
            trigger: {
              player: 'loseAfter',
            },
            filter(event, player) {
              var evt = event.getl(player);
              if (!evt || !evt.hs || !evt.hs.length) return false;
              if (event.name == 'lose') {
                for (var i in event.gaintag_map) {
                  if (event.gaintag_map[i].includes('shuitamrfzx')) return true;
                }
                return false;
              }
              return player.hasHistory('lose', function (evt) {
                if (event != evt.parent) return false;
                for (var i in evt.gaintag_map) {
                  if (evt.gaintag_map[i].includes('shuitamrfzx')) return true;
                }
                return false;
              });
            },
            async content(event, trigger, player) {
              var cards = [];
              for (var i = 0; i < trigger.cards2.length; i++) {
                var card = trigger.cards2[i];
                if (card.storage.shuitamrfzx) {
                  cards.push(card);
                  clearTimeout(card.timeout);
                  card.classList.remove('removing');
                }
              }
              if (cards.length) {
                player.addToExpansion(cards, player, 'giveAuto').gaintag.add('shuitamrfz');
              }
            },
          },
        },
      },
      baopomrfz: {
        init(player) {
          player.storage.baopomrfz = false;
        },
        audio: 2,
        limited: true,
        charlotte: true,
        trigger: { player: 'phaseZhunbeiBegin' },
        filter(event, player) {
          return (
            !player.storage.baopomrfz &&
            player.countCards('h', function (card) {
              return card.storage.shuitamrfzx;
            }) > 0
          );
        },
        check(event, player) {
          if (player.hasUnknown()) return false;
          return true;
        },
        content() {
          'step 0';
          player.storage.baopomrfz = true;
          player.removeGaintag('shuitamrfzx');
          for (var i of player.getCards('h')) {
            delete i.storage.shuitamrfzx;
          }
          player.addTempSkill('baopomrfz_tmp', { player: 'baopomrfzAfter' });
          player.chooseTarget(true, '【爆破】:请选择至多三名其他角色', [1, 3], function (card, player, target) {
            return target != player;
          }).ai = function (target) {
            return get.damageEffect(target, player) && !target.hasSkillTag('nofire');
          };
          ('step 1');
          if (result.targets?.length) {
            event.targets = result.targets;
            event.cards = [];
          } else event.finish();
          ('step 2');
          if (event.targets.length) {
            event.targets[0].judge(function (card) {
              if (get.color(card) == 'red') return -4;
              return 0;
            }).judge2 = function (result) {
              return result.bool == false ? true : false;
            };
          } else event.goto(4);
          ('step 3');
          if (result.bool == false) {
            event.targets[0].damage(2, 'fire');
          }
          event.cards.push(result.card);
          event.targets.shift();
          if (event.targets.length) event.goto(2);
          ('step 4');
          if (event.cards) {
            var cards = [];
            if (Array.isArray(event.cards))
              for (var i of event.cards) {
                var card = i;
                if (get.position(card, true) == 'd') cards.push(card);
              }
            for (var i of cards) {
              i.storage.shuitamrfzx = true;
            }
            player.gain(cards, 'gain2').gaintag.add('shuitamrfzx');
          }
        },
        subSkill: {
          tmp: {
            charlotte: true,
          },
        },
      },
      mihuomrfz: {
        audio: 2,
        trigger: { player: 'damageBegin' },
        filter(event, player) {
          if (event.source == undefined) return false;
          return player.countCards('h') > 0;
        },
        prompt(event, player) {
          return `【迷惑】:你可以令${get.translation(event.source)}展示你的一张手牌,若为‘咪啵’则此伤害-1`;
        },
        check(event, player) {
          for (var i of player.getCards('h')) {
            if (i.storage.shuitamrfzx) return true;
          }
          return false;
        },
        content() {
          'step 0';
          trigger.source.choosePlayerCard(player, 'h', true);
          ('step 1');
          player.showCards(result.cards, get.translation(trigger.source) + `展示了${get.translation(player)}一张牌</br>此牌` + (result.cards[0].storage.shuitamrfzx ? '<font color=#FF0000>有</font>' : '<font color=#00FF1A>无</font>') + '‘咪啵’标记');
          if (result.cards[0].storage.shuitamrfzx) {
            player.discard(result.cards[0]);
            trigger.num--;
          }
        },
      },
      //凛冬
      dongjiangmrfz: {
        audio: 2,
        trigger: { player: 'phaseZhunbeiBegin' },
        filter(event, player) {
          return player.countCards('h') > 0;
        },
        check(event, player) {
          return game.hasPlayer((current) => {
            return current != player && get.attitude(current, player) > 0;
          });
        },
        content() {
          'step 0';
          player.chooseCard('【冬将】:请选择你要分配的牌', true, [1, Infinity]);
          ('step 1');
          event.cards = result.cards;
          player.chooseTarget(`【冬将】:请选择你要分配的角色(${get.translation(event.cards)})`, true, function (card, player, target) {
            return target != player;
          }).ai = function (target) {
            return get.attitude(target, player) > 0;
          };
          ('step 2');
          player.give(event.cards, result.targets[0]);
          ('step 3');
          if (player.countCards('h') > 0) event.goto(0);
          ('step 4');
          if (player.canUseToAnyone('sha')) {
            player.addTempSkill('dongjiangmrfz_dam', 'useCardAfter');
            player
              .chooseUseTarget(
                {
                  name: 'sha',
                },
                '请选择【杀】的目标',
              )
              .set('forced', true)
              .set('addCount', false);
          } else event.finish();
        },
        subSkill: {
          dam: {
            forced: true,
            trigger: { source: 'damageEnd' },
            filter(event, player) {
              return event.card && event.card.name == 'sha' && event.card.cards.length == 0;
            },
            content() {
              player.drawTo(3);
              player.removeSkill('dongjiangmrfz_dam');
            },
          },
        },
      },
      xianlingmrfz: {
        audio: 2,
        trigger: { global: 'roundStart' },
        content() {
          'step 0';
          var cards = player.getCards('h');
          if (player.countCards('h') < 1) event.goto(1);
          for (var i of cards) {
            if (player.canUseToAnyone(i, false)) {
              event.goto(2);
              break;
            }
          }
          ('step 1');
          player.draw();
          event.goto(0);
          ('step 2');
          player
            .chooseToUse('【先领】:请使用一张牌', true)
            .set('complexSelect', true)
            .set('filterTarget', function (card, player, target) {
              return player.canUse(card, target, false);
            })
            .set('addCount', false)
            .set('forced', true);
          ('step 3');
          if (game.roundNumber != 1) {
            player.chooseTarget('【先领】:你可以令一名其他角色执行一次相同的流程', function (card, player, target) {
              return target != player;
            }).ai = function (target) {
              return get.attitude(target, player) > 0;
            };
          } else event.finish();
          ('step 4');
          if (result.targets?.length) {
            event.target = result.targets[0];
          } else event.finish();
          ('step 5');
          var cards = event.target.getCards('h');
          if (event.target.countCards('h') < 1) event.goto(6);
          for (var i of cards) {
            if (event.target.canUseToAnyone(i, false)) {
              event.goto(7);
              break;
            }
          }
          ('step 6');
          event.target.draw();
          event.goto(5);
          ('step 7');
          event.target
            .chooseToUse('【先领】:请使用一张牌')
            .set('complexSelect', true)
            .set('filterTarget', function (card, player, target) {
              return event.target.canUse(card, target, false);
            })
            .set('addCount', false)
            .set('forced', true);
        },
      },
      //陨星
      dingyuanmrfz: {
        derivation: 'zhimingmrfz',
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.yxliumingmrfz_count;
            if (player.awakenedSkills && player.awakenedSkills.includes('dingyuanmrfz')) {
              return '置于过武将牌上的牌:' + get.translation(storage.card);
            }
            return `已置于过武将牌上${storage.count}张牌</br>置于过武将牌上的牌(装备牌和延时锦囊除外):` + get.translation(storage.card);
          },
        },
        audio: 2,
        forced: true,
        juexingji: true,
        trigger: {
          player: 'phaseZhunbeiBegin',
        },
        filter(event, player) {
          return player.storage.yxliumingmrfz_count.count >= 3;
        },
        content() {
          player.awakenSkill('dingyuanmrfz');
          player.loseMaxHp();
          player.addSkill('zhimingmrfz');
        },
      },
      yxliumingmrfz: {
        audio: 2,
        forced: true,
        trigger: {
          global: 'phaseBegin',
        },
        marktext: '铭',
        intro: {
          content: 'expansion',
          markcount: 'expansion',
        },
        onremove(player, skill) {
          var cards = player.getExpansions(skill);
          if (cards.length) player.loseToDiscardpile(cards);
        },
        filter(event, player) {
          return player.getExpansions('yxliumingmrfz').length < 1;
        },
        content() {
          var cards = game.cardsGotoOrdering(get.cards(1)).cards[0];
          player.addToExpansion(cards, player, 'giveAuto').gaintag.add('yxliumingmrfz');
        },
        group: ['yxliumingmrfz_target', 'yxliumingmrfz_use', 'yxliumingmrfz_count'],
        subSkill: {
          count: {
            init(player) {
              player.storage.yxliumingmrfz_count = {
                count: 0,
                card: [],
              };
            },
            onremove(player) {
              delete player.storage.yxliumingmrfz_count;
            },
            silent: true,
            charlotte: true,
            trigger: {
              player: 'addToExpansionAfter',
            },
            filter(event, player) {
              return event.parent.name == 'yxliumingmrfz';
            },
            content() {
              if (!player.storage.yxliumingmrfz_count)
                player.storage.yxliumingmrfz_count = {
                  count: 0,
                  card: [],
                };
              if (!player.awakenedSkills || !player.awakenedSkills.includes('dingyuanmrfz')) player.storage.yxliumingmrfz_count.count++;
              if (trigger.cards) {
                for (var i of trigger.cards) {
                  if (get.type(i) == 'equip' || get.type(i) == 'delay') continue;
                  if (player.storage.yxliumingmrfz_count.card.includes(i.name)) continue;
                  player.storage.yxliumingmrfz_count.card.add(i.name);
                }
              }
            },
          },
          ban: {
            charlotte: true,
          },
          use: {
            enable: 'chooseToUse',
            hiddenCard(player, name) {
              if (player.getExpansions('yxliumingmrfz').length < 1) return false;
              return name == player.getExpansions('yxliumingmrfz')[0].name;
            },
            filter(event, player) {
              if (player.getExpansions('yxliumingmrfz').length < 1) return false;
              return event.filterCard({ name: player.getExpansions('yxliumingmrfz')[0].name }, player, event);
            },
            chooseButton: {
              dialog(event, player) {
                var vcards = [];
                var card = player.getExpansions('yxliumingmrfz')[0].name;
                var type = get.translation(get.type2(card));
                if (event.filterCard && event.filterCard({ name: card }, player, event)) {
                  vcards.push([type, '', card]);
                }
                var dialog = ui.create.dialog('流铭', [vcards, 'vcard'], 'hidden');
                dialog.direct = true;
                return dialog;
              },
              backup(links, player) {
                return {
                  filterCard(card) {
                    var player = _status.event.player;
                    return player.getExpansions('yxliumingmrfz')[0];
                  },
                  selectCard: -1,
                  position: 'x',
                  viewAs: {
                    name: links[0][2],
                    nature: links[0][3],
                  },
                  precontent() { },
                };
              },
              prompt(links, player) {
                return '【流铭】:使用一张' + (links[0][3] ? get.translation(links[0][3]) : '') + `【${get.translation(links[0][2])}】`;
              },
            },
            ai: {
              order() {
                var player = _status.event.player;
                var card = player.getExpansions('yxliumingmrfz')[0];
                return get.order(card) + 0.1;
              },
              result: {
                player: 1,
              },
            },
          },
          target: {
            trigger: {
              target: 'useCardToPlayered',
            },
            filter(event, player) {
              if (event.player == player) return false;
              if (player.getExpansions('yxliumingmrfz').length == 0 || !event.card) return false;
              var suit = event.card.suit;
              return player.getExpansions('yxliumingmrfz').filter(function (magic) {
                return magic.suit == suit || magic.number != event.card.number;
              }).length;
            },
            forced: true,
            content() {
              'step 0';
              var card = player.getExpansions('yxliumingmrfz')[0];
              var num1 = card.number,
                num2 = trigger.card.number;
              if (num1 != num2) {
                ('step 0');
                var type = get.type2(card);
                var eff = get.effect(player, trigger.card, trigger.player, trigger.player);
                trigger.player
                  .chooseToDiscard(`【流铭】:请弃置一张${get.translation(get.type(card))}牌,否则此牌对${get.translation(player)}无效`)
                  .set('filterCard', function (card) {
                    return get.type2(card) == _status.event.type;
                  })
                  .set('ai', function (card) {
                    if (_status.event.eff > 0) {
                      return 10 - get.value(card);
                    }
                    return 0;
                  })
                  .set('eff', eff)
                  .set('type', type);
                ('step 1');
                if (result.bool == false) {
                  trigger.targets.remove(player);
                  trigger.parent.triggeredTargets2.remove(player);
                  trigger.untrigger();
                  player.removeSkill('yxliumingmrfz_target');
                  player.addTempSkill('yxliumingmrfz_reget', { global: 'phaseBegin' });
                  player.addTempSkill('yxliumingmrfz_ban', { global: 'phaseEnd' });
                }
              }
              ('step 1');
              var card = player.getExpansions('yxliumingmrfz')[0];
              if (card.suit == trigger.card.suit) {
                player.gain(card, 'gain2');
              }
            },
          },
          reget: {
            silent: true,
            trigger: { global: 'phaseEnd' },
            content() {
              player.addSkill('yxliumingmrfz_target');
            },
          },
        },
      },
      zhimingmrfz: {
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.yxliumingmrfz_count;
            if (player.awakenedSkills && player.awakenedSkills.includes('dingyuanmrfz')) {
              return '置于过武将牌上的牌(装备牌和延时锦囊除外):' + get.translation(storage.card);
            }
            return `已置于过武将牌上${storage.count}张牌</br>置于过武将牌上的牌(装备牌和延时锦囊除外):` + get.translation(storage.card);
          },
        },
        audio: 2,
        enable: ['chooseToUse', 'chooseToRespond'],
        hiddenCard(player, name) {
          var cards = player.storage.yxliumingmrfz_count.card;
          if (player.countCards('he') < 1 || !cards || player.hasSkill('zhimingmrfz_ban')) return false;
          for (var i of cards) {
            if (name == i) return true;
          }
          return false;
        },
        filter(event, player) {
          var cards = player.storage.yxliumingmrfz_count.card;
          if (player.countCards('he') < 1 || !cards || player.hasSkill('zhimingmrfz_ban')) return false;
          for (var i of cards) {
            if (event.filterCard && event.filterCard({ name: i }, player, event)) return true;
          }
          return false;
        },
        chooseButton: {
          dialog(event, player) {
            var vcards = [];
            var list = player.storage.yxliumingmrfz_count.card;
            for (var name of list) {
              var card = { name: name };
              var type = get.type(name);
              if (event.filterCard && event.filterCard(card, player, event)) {
                vcards.push([type, '', name]);
              }
            }
            var dialog = ui.create.dialog('祗铭', [vcards, 'vcard'], 'hidden');
            dialog.direct = true;
            return dialog;
          },
          backup(links, player) {
            return {
              filterCard: () => true,
              selectCard: 1,
              viewAs: {
                name: links[0][2],
              },
              position: 'he',
              precontent() {
                player.addTempSkill('zhimingmrfz_ban', { global: 'phaseEnd' });
              },
            };
          },
          prompt(links, player) {
            return `【祗铭】:将一张牌当作【${get.translation(links[0][2])}】使用或打出`;
          },
        },
        ai: {
          order: 1,
          result: {
            player: 1,
          },
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //羽毛笔
      tiaojiumrfz: {
        audio: 2,
        audioname: ['longshelanmrfz'],
        derivation: ['jiu'],
        audio: 2,
        enable: 'chooseToUse',
        filterCard(card, player) {
          if (ui.selected.cards.length) {
            return get.color(card) != get.color(ui.selected.cards[0]);
          }
          return true;
        },
        complexCard: true,
        selectCard: 2,
        viewAs: {
          name: 'jiu',
        },
        position: 'hs',
        viewAsFilter(player) {
          var hs = player.getCards('hs');
          if (hs.length < 2) return false;
          var bool = false,
            map = {};
          for (var card of hs) {
            var color = get.color(card);
            if (!map[color]) map[color] = true;
            else {
              bool = true;
              break;
            }
          }
          if (!bool) return false;
          return true;
        },
        prompt: '【调酒】:将两张不同颜色的手牌当酒使用',
        check(card) {
          return 10 - get.value(card);
        },
        ai: {
          threaten: 1.5,
          order() {
            let player = _status.event.player;
            if (_status.event.dying) return 9;
            let cards = player.getCards('h', (card) => {
              return get.type(card) != 'equip' && get.type(card) != 'delay';
            });
            if (cards.length) return 13;
            return 0;
          },
          result: {
            target: 1,
          },
          tag: {
            save: 1,
            recover: 0.1,
          },
        },
      },
      rujingmrfz: {
        audio: 2,
        forced: true,
        lastDo: true,
        mark: true,
        intro: {
          content(event, player) {
            var storage = player.storage.rujingmrfz;
            storage.number.sort(function (a, b) {
              return a - b;
            });
            var str1 = '',
              str2 = '';
            if (storage.number.length) str1 = str1 + storage.number;
            else str1 = '无';
            if (storage.suit.length) str2 = str2 + get.translation(storage.suit);
            else str2 = '无';
            return `记录的数字:${str1}</br>记录的花色:` + str2;
          },
        },
        init(player) {
          player.storage.rujingmrfz = {
            suit: [],
            number: [],
            ban: [],
            card: [],
          };
        },
        onremove(player) {
          delete player.storage.rujingmrfz;
        },
        trigger: { player: 'useCardAfter' },
        filter(event, player) {
          return event.card && (event.card.number || event.card.suit);
        },
        content() {
          if (!player.storage.rujingmrfz)
            player.storage.rujingmrfz = {
              suit: [],
              number: [],
              ban: [],
              card: [],
            };
          var card = trigger.card,
            storage = player.storage.rujingmrfz;
          if (!storage.card.includes(trigger.card)) {
            if (card.number && !storage.number.includes(card.number)) {
              player.storage.rujingmrfz.number.add(card.number);
            }
            if (card.suit && !storage.suit.includes(card.suit) && card.suit != 'none') {
              player.storage.rujingmrfz.suit.add(card.suit);
            }
          } else player.storage.rujingmrfz.card.remove(trigger.card);
        },
        group: ['rujingmrfz_addcount', 'rujingmrfz_clear'],
        subSkill: {
          clear: {
            charlotte: true,
            silent: true,
            lastDo: true,
            trigger: { player: 'phaseUseEnd' },
            filter(event, player) {
              return player.storage.rujingmrfz;
            },
            content() {
              player.storage.rujingmrfz.ban = [];
            },
          },
          addcount: {
            audio: 'rujingmrfz',
            trigger: { player: 'useCard' },
            forced: true,
            filter(event, player) {
              var storage = player.storage.rujingmrfz;
              if (!event.card || !(event.card.number && event.card.suit)) return false;
              var cardNumber = event.card.number;
              var cardSuit = event.card.suit;
              if (!storage.number.includes(cardNumber) && !storage.suit.includes(cardSuit)) return false;
              if (get.type(event.card) == 'equip' || get.type(event.card) == 'delay') return false;
              if (['shan', 'wuxie'].includes(event.card.name)) return false;
              return (storage.number.includes(cardNumber) && !storage.ban.includes('number')) || (storage.suit.includes(cardSuit) && !storage.ban.includes('suit'));
            },
            content() {
              'step 0';
              var storage = player.storage.rujingmrfz,
                number = trigger.card.number,
                suit = trigger.card.suit;
              var list = [];
              if (storage.number.includes(number) && !storage.ban.includes('number')) list.add('number');
              if (storage.suit.includes(suit) && !storage.ban.includes('suit')) list.add('suit');
              event.list = list;
              if (list.length == 1) {
                var goon = true;
                if (trigger.card.name == 'du') goon = false;
                if (trigger.card.name == 'jiedao') goon = false;
                if (trigger.card.name == 'tao' && player.getDamagedHp() == 1) goon = false;
                if (list.includes('suit')) {
                  player
                    .chooseBool('【入境】:是否令此牌额外结算一次？(同花色)')
                    .set('ai', function () {
                      return _status.event.goon;
                    })
                    .set('goon', goon);
                } else {
                  player
                    .chooseBool('【入境】:是否令此牌额外结算一次？(同点数)')
                    .set('ai', function () {
                      return _status.event.goon;
                    })
                    .set('goon', goon);
                }
              } else {
                player
                  .chooseControl('点数', '花色', '全部', 'cancel2')
                  .set('prompt', '【入境】:请选择一项')
                  .set('prompt2', '选择‘点数’或者‘花色’为额外结算一次,选择‘全部’为额外结算两次,选择‘取消’为不发动此技能')
                  .set('ai', function () {
                    var player = _status.event.player,
                      card = _status.event.card;
                    if (card.name == 'du' || card.name == 'jiedao') return 'cancel2';
                    if (card.name == 'tao') {
                      var hp = player.getDamagedHp();
                      switch (hp) {
                        case 0:
                          return 'cancel2';
                        case 1:
                          return ['点数', '花色'].randomGet();
                        default:
                          return '全部';
                      }
                    }
                    return '全部';
                  })
                  .set('card', trigger.card);
              }
              ('step 1');
              var storage = player.storage.rujingmrfz,
                number = trigger.card.number,
                suit = trigger.card.suit;
              if (result.bool) {
                player.storage.rujingmrfz.card.add(trigger.card);
                if (event.list.includes('suit')) {
                  trigger.effectCount++;
                  player.storage.rujingmrfz.ban.add('suit');
                  player.storage.rujingmrfz.suit.remove(suit);
                } else {
                  trigger.effectCount++;
                  player.storage.rujingmrfz.ban.add('number');
                  player.storage.rujingmrfz.number.remove(number);
                }
              } else if (result.control != 'cancel2' && result.bool != false) {
                player.storage.rujingmrfz.card.add(trigger.card);
                if (result.control == '点数') {
                  trigger.effectCount++;
                  player.storage.rujingmrfz.ban.add('number');
                  player.storage.rujingmrfz.number.remove(number);
                } else if (result.control == '花色') {
                  trigger.effectCount++;
                  player.storage.rujingmrfz.ban.add('suit');
                  player.storage.rujingmrfz.suit.remove(suit);
                } else {
                  trigger.effectCount += 2;
                  player.storage.rujingmrfz.ban.add('suit');
                  player.storage.rujingmrfz.suit.remove(suit);
                  player.storage.rujingmrfz.ban.add('number');
                  player.storage.rujingmrfz.number.remove(number);
                }
              }
            },
          },
        },
      },
      //爱丽丝
      alsmengxiangmrfz: {
        audio: 2,
        forced: true,
        trigger: { global: 'phaseUseBegin' },
        filter(event, player) {
          return event.player.storage.phaseHistory && Object.hasOwn(event.player.storage.phaseHistory, 'phaseUse');
        }, //QQQ
        prompt(event, player) {
          return `是否对${get.translation(event.player)}发动【梦乡】？`;
        },
        content() {
          'step 0';
          event.list = [];
          for (var name of lib.inpile) {
            if (get.type(name) == 'delay' || get.type(name) == 'equip') continue;
            if (get.tag({ name: name }, 'damage')) continue;
            event.list.push([get.type(name), '', name]);
          }
          var dialog = [`为${get.translation(trigger.player)}选择至多三个牌名`];
          if (event.list.length) {
            dialog.push([event.list, 'vcard']);
          }
          if (!event.list.length) event.finish();
          else {
            player
              .chooseButton(dialog, [1, 3])
              .set('ai', function (button) {
                let name = button.link[2],
                  list = _status.event.list.map((i) => i[2]),
                  player = _status.event.player,
                  trigger = _status.event.getTrigger(),
                  target = trigger.player,
                  getv = (name, player) => {
                    let v = trigger.getTempCache('alsmengxiangmrfz', player.id + name);
                    if (typeof v === 'number') return v;
                    v = player.getUseValue({ name: name });
                    trigger.putTempCache('alsmengxiangmrfz', player.id + name, v);
                    return v;
                  };
                if (get.attitude(player, target) < 0) {
                  if (!list.includes(name)) return 0;
                  let val = 0;
                  if (target.getDamagedHp() == 0 && name == 'tao') val += 25;
                  else if (name === 'wuxie') val += 20;
                  else if (name === 'shan') val += 15;
                  else if (name === 'jiu') val += 6;
                  return -getv(name, target) + val;
                } else {
                  if (!list.includes(name)) return 0;
                  let val = getv(name, target),
                    base = 5;
                  val = Math.min(15, val - base);
                  if (name === 'wuzhong' || name === 'dongzhuxianji') val += 20;
                  else if (name === 'tao' && player.getDamagedHp() > 0) val += 15;
                  else if (name === 'shunshou') val += 6;
                  return val;
                }
              })
              .set('list', event.list);
          }
          ('step 1');
          if (result.links?.length) {
            var names = result.links.map((i) => i[2]),
              target = trigger.player;
            if (!target.storage.alsmengxiangmrfz_eff) target.storage.alsmengxiangmrfz_eff = [];
            target.storage.alsmengxiangmrfz_eff = target.storage.alsmengxiangmrfz_eff.concat(names);
            game.log(player, '为', target, '选择了', '#y' + get.translation(names));
            target.addTempSkill('alsmengxiangmrfz_eff', { player: 'phaseUseAfter' });
            target.markSkill('alsmengxiangmrfz_eff');
          }
        },
        subSkill: {
          eff: {
            intro: {
              mark(dialog, storage, player) {
                if (!storage || !storage.length) return '当前无可用牌';
                dialog.add([[storage[0]], 'vcard']);
                if (storage.length > 1) dialog.addSmall([storage.slice(1), 'vcard']);
              },
              content: '$',
            },
            mod: {
              hiddenCard(player, name) {
                var storage = player.getStorage('alsmengxiangmrfz_eff');
                if (storage.length) return name == storage[0];
              },
              cardname(card, player) {
                if (_status.event.name != 'chooseToUse' || _status.event.skill) return;
                var storage = player.getStorage('alsmengxiangmrfz_eff');
                if (storage.length) return storage[0];
              },
              cardnature(card, player) {
                if (_status.event.name != 'chooseToUse' || _status.event.skill) return;
                var storage = player.getStorage('alsmengxiangmrfz_eff');
                if (storage.length) return false;
              },
            },
            trigger: {
              player: ['useCard', 'respond'],
            },
            forced: true,
            charlotte: true,
            filter(event, player) {
              return event.cards && event.cards.length && player.getStorage('alsmengxiangmrfz_eff').length;
            },
            content() {
              player.unmarkAuto('alsmengxiangmrfz_eff', [player.getStorage('alsmengxiangmrfz_eff')[0]]);
            },
          },
        },
        ai: {
          threaten: 1.5,
        },
      },
      rumianmrfz: {
        markimage: 'extension/驶舰之向/image/orther/rumianmrfz.png',
        intro: {
          content: '下个结束阶段开始额外执行#个出牌阶段',
        },
        audio: 2,
        trigger: {
          player: ['phaseDiscardAfter', 'damageEnd'],
        },
        content() {
          'step 0';
          player.chooseTarget(true, '【入眠】:请选择一名角色,令其于下个结束阶段开始时额外执行一个出牌阶段').ai = function (target) {
            if (get.attitude(player, target) > 4) {
              return get.threaten(target) / Math.sqrt(target.hp + 1) / Math.sqrt(target.countCards('h') + 1);
            }
            return get.attitude(player, target) > 0;
          };
          ('step 1');
          if (result.targets?.length) {
            var target = result.targets[0];
            target.addMark('rumianmrfz', false);
            target.when({ player: 'phaseJieshuBegin' }).then(() => {
              var next = trigger.player.phaseUse();
              event.next.remove(next);
              trigger.getParent('phase').next.push(next);
              player.removeMark('rumianmrfz', false);
              game.log(player, '执行了一个额外的出牌阶段');
            });
            // .emb({ firstDo: true });
            player.line(target);
          }
        },
        ai: {
          //expose: 0.1,
          threaten: 0.7,
          maixie: true,
          maixie_hp: true,
        },
      },
      //天火
      zhuihuomrfz: {
        init(player, skill) {
          player.storage[skill] = [];
        },
        audio: 2,
        enable: 'phaseUse',
        filter(event, player) {
          return (
            player.countCards('hs', (card) => {
              return (card.name == 'sha' && get.nature(card) == 'fire') || card.name == 'huogong';
            }) > 0
          );
        },
        filterCard(card) {
          return (card.name == 'sha' && get.nature(card) == 'fire') || card.name == 'huogong';
        },
        filterTarget(card, player, target) {
          return target != player && !player.storage.zhuihuomrfz.includes(target);
        },
        discard: false,
        lose: false,
        delay: false,
        content() {
          player.storage.zhuihuomrfz.add(target);
          target.addJudge({ name: 'sjzx_zhuihuomrfz' }, cards);
        },
        ai: {
          order: 5,
          result: {
            player: 1,
            target(player, target) {
              if (
                get.attitude(player, target) < 0 &&
                target.getCards('j', function (card) {
                  return card.name == 'sjzx_zhuihuomrfz';
                }).length < target.hp
              ) {
                if (target.countCards('he') < 2 && target.hp < 2) return -3;
                if (target.countCards('he') < 2) return -2;
              }
              return -1;
            },
          },
        },
        group: ['zhuihuomrfz_clear'],
        subSkill: {
          clear: {
            charlotte: true,
            silent: true,
            trigger: { player: 'phaseUseEnd' },
            content() {
              player.storage.zhuihuomrfz = [];
            },
          },
        },
      },
      yihuomrfz: {
        mod: {
          cardname(card, player) {
            if (card.storage && card.storage.yihuomrfz == true) return 'sha';
          },
          cardnature(card, player) {
            if (card.storage && card.storage.yihuomrfz == true) return 'fire';
          }, //QQQ
        },
        audio: 2,
        trigger: {
          global: 'damageEnd',
        },
        usable: 2,
        filter(event, player) {
          return event.nature == 'fire';
        },
        forced: true,
        content() {
          player.draw(2);
        },
        ai: {
          effect: {
            target(card, player, target, current) {
              if (get.tag(card, 'respondSha') && current < 0) return 0.6;
            },
          },
          respondSha: true,
        },
        group: ['yihuomrfz_gain', 'yihuomrfz_cancel'],
        subSkill: {
          cancel: {
            forced: true,
            trigger: { player: 'damageBegin4' },
            filter(event, player) {
              return event.nature == 'fire';
            },
            content() {
              trigger.cancel();
              player.draw(3);
            },
            ai: {
              effect: {
                target(card, player, target) {
                  if (get.tag(card, 'fireDamage')) return [0, 1];
                },
              },
            },
          },
          gain: {
            forced: true,
            trigger: { player: 'gainAfter' },
            filter(event, player) {
              if (!event.cards || event.cards.length < 2) return false;
              return event.cards && event.cards.some((element) => player.getCards('h').includes(element));
            },
            content() {
              'step 0';
              player
                .chooseCard(true, '【溢火】:请选择一张牌,令此牌视为火【杀】', function (card) {
                  return trigger.cards.includes(card);
                })
                .set('ai', function (card) {
                  return -get.value(card);
                });
              ('step 1');
              if (result.cards?.length) {
                result.cards[0].storage.yihuomrfz = true;
              }
              var color,
                bool = true;
              for (var i of trigger.cards) {
                if (typeof color !== 'string') color = get.color(i, player);
                if (get.color(i, player) != color) {
                  bool = false;
                  break;
                }
              }
              if (bool == true) player.draw();
            },
          },
        },
      },
      //临光
      anranmrfz: {
        audio: 2,
        trigger: {
          global: 'phaseBefore',
          player: 'enterGame',
        },
        forced: true,
        filter(event, player) {
          return event.name != 'phase' || game.phaseNumber == 0;
        },
        content() {
          var cards = player.getCards('h');
          player.discard(cards);
        },
        group: ['anranmrfz_draw'],
        subSkill: {
          draw: {
            audio: 'anranmrfz',
            trigger: { player: 'phaseBegin' },
            init(player) {
              player.storage.anranmrfz_draw = false;
            },
            filter(event, player) {
              return !player.storage.anranmrfz_draw;
            },
            forced: true,
            content() {
              var num = player.hujia + player.hp;
              player.storage.anranmrfz_draw = true;
              player.draw(2 * num);
              player.changeHujia(-player.hujia);
              player.recover();
              player.when('phaseDiscardBefore').then(() => {
                trigger.cancel();
              });
              // .emb({ firstDo: true });
            },
          },
        },
      },
      huchimrfz: {
        audio: 2,
        usable: 1,
        enable: 'phaseUse',
        filter(event, player) {
          return player.countCards('he') > 0;
        },
        filterTarget(card, player, target) {
          return target != player;
        },
        filterCard: true,
        position: 'he',
        check(card) {
          return 6 - get.value(card);
        },
        lose: false,
        discard: false,
        delay: false,
        content() {
          'step 0';
          player.give(cards, target, 'give');
          for (var i of cards) {
            i.storage.huchimrfz = true;
          }
          ('step 1');
          var view = { name: 'sha' };
          target
            .chooseTarget('【互持】:请选择使用【杀】的目标', function (card, player, target) {
              var view = _status.event.view;
              var playerx = _status.event.playerx;
              return target != playerx && playerx.canUse(view, target);
            })
            .set('view', view)
            .set('playerx', target).ai = function (target) {
              var view = _status.event.view;
              var player = _status.event.playerx;
              return get.effect(target, view, player, player);
            };
          ('step 2');
          if (result.targets?.length) {
            var card = { name: 'sha' };
            if (
              target.hasCard((card) => {
                return card == cards[0];
              }, 'h')
            )
              target.useCard(result.targets[0], card, cards);
          }
        },
        ai: {
          order: 4,
          result: {
            target(player, target) {
              if (get.attitude(player, target) > 2) {
                if (
                  game.hasPlayer((current) => {
                    return target.canUse('sha', current) && get.attitude(player, target);
                  })
                )
                  return 2;
              }
              return 1;
            },
          },
        },
        group: ['huchimrfz_recover', 'huchimrfz_gain'],
        subSkill: {
          recover: {
            trigger: {
              player: 'recoverEnd',
              global: 'recoverEnd',
            },
            usable: 1,
            filter(event, player) {
              if (!event.source.isIn() || !event.player.isIn() || event.source === undefined || !event.player) return false;
              if (event.source == player && event.player == player) return false;
              if (event.source != player && event.player != player) return false;
              return true;
            },
            forced: true,
            content() {
              'step 0';
              trigger.player
                .chooseCardTarget({
                  prompt: '【互持】:你可以将一张牌交给回复来源',
                  filterCard: true,
                  position: 'he',
                  filterTarget(card, player, target) {
                    var source = _status.event.source;
                    return target != player && target == source;
                  },
                  ai1(card) {
                    return 8 - get.value(card);
                  },
                  ai2(target) {
                    var playerx = _status.event.playerx;
                    return get.attitude(playerx, target) > 0;
                  },
                })
                .set('source', trigger.source)
                .set('playerx', trigger.player);
              ('step 1');
              if (result.targets?.length) {
                trigger.player.give(result.cards, result.targets[0]);
                trigger.player.draw();
                trigger.source.draw();
              } else player.getStat('triggerSkill').huchimrfz_recover--;
            },
          },
          gain: {
            forced: true,
            trigger: {
              player: 'gainEnd',
              global: 'gainEnd',
            },
            filter(event, player) {
              if (event.source == undefined || event.player == undefined) return false;
              if (!event.source.isIn() || !event.player.isIn()) return false;
              if (event.source == player && event.player == player) return false;
              if (event.source != player && event.player != player) return false;
              return true;
            },
            usable: 1,
            content() {
              'step 0';
              trigger.player
                .chooseCardTarget({
                  prompt: '【互持】:你可以将一张牌交给给予来源',
                  filterCard: true,
                  position: 'he',
                  filterTarget(card, player, target) {
                    var source = _status.event.source;
                    return target != player && target == source;
                  },
                  ai1(card) {
                    if (card.storage.huchimrfz) return 0;
                    return 8 - get.value(card);
                  },
                  ai2(target) {
                    var playerx = _status.event.playerx;
                    return get.attitude(playerx, target) > 0;
                  },
                })
                .set('source', trigger.source)
                .set('playerx', trigger.player);
              ('step 1');
              if (result.targets?.length) {
                trigger.player.give(result.cards, result.targets[0]);
                trigger.player.draw();
                trigger.source.draw();
              } else player.getStat('triggerSkill').huchimrfz_gain--;
            },
          },
        },
      },
      chongyaomrfz: {
        audio: 2,
        mark: true,
        intro: {
          content(event, player) {
            return `${player.storage.chongyaomrfz_mark.count}/5`;
          },
        },
        derivation: ['zhuguangmrfz'],
        group: 'chongyaomrfz_mark',
        init(player) {
          player.storage.chongyaomrfz = false;
        },
        trigger: {
          player: ['huchimrfzAfter', 'huchimrfz_gainAfter', 'huchimrfz_recoverAfter'],
          global: ['huchimrfzAfter', 'huchimrfz_gainAfter', 'huchimrfz_recoverAfter'],
        },
        filter(event, player) {
          return player.storage.chongyaomrfz_mark.count >= 5 && !player.storage.chongyaomrfz;
        },
        juexingji: true,
        forced: true,
        content() {
          player.loseMaxHp();
          player.addSkill('zhuguangmrfz');
          player.awakenSkill('chongyaomrfz');
          game.log(player, '获得了技能', '#g【逐光】');
          player.storage.chongyaomrfz = true;
          delete player.storage.chongyaomrfz_mark;
          player.unmarkAuto(player.storage.chongyaomrfz);
          player.removeSkill('chongyaomrfz_mark');
        },
        group: ['chongyaomrfz_mark', 'chongyaomrfz_clear'],
        subSkill: {
          clear: {
            silent: true,
            firstDo: true,
            charlotte: true,
            trigger: {
              global: 'phaseBegin',
            },
            content() {
              player.storage.chongyaomrfz_mark.skill = [];
            },
          },
          mark: {
            init(player) {
              player.storage.chongyaomrfz_mark = {
                count: 0,
                skill: [],
              };
            },
            onremove(player) {
              delete player.storage.chongyaomrfz_mark;
            },
            silent: true,
            charlotte: true,
            firstDo: true,
            trigger: {
              player: ['huchimrfzAfter', 'huchimrfz_gainAfter', 'huchimrfz_recoverAfter'],
              global: ['huchimrfzAfter', 'huchimrfz_gainAfter', 'huchimrfz_recoverAfter'],
            },
            content() {
              if (!player.storage.chongyaomrfz_mark) player.storage.chongyaomrfz_mark = 0;
              for (var i of ['huchimrfz', 'huchimrfz_gain', 'huchimrfz_recover']) {
                if (!Object.hasOwn(player.getStat('triggerSkill'), trigger.name) && i != 'huchimrfz') continue;
                if (player.storage.chongyaomrfz_mark.skill.includes(trigger.name)) continue;
                if (i == 'huchimrfz' && trigger.name == 'huchimrfz') {
                  player.storage.chongyaomrfz_mark.count++;
                  player.storage.chongyaomrfz_mark.skill.add(trigger.name);
                  break;
                }
                if (player.getStat('triggerSkill')[trigger.name] > 0) {
                  player.storage.chongyaomrfz_mark.count++;
                  player.storage.chongyaomrfz_mark.skill.add(trigger.name);
                  break;
                }
              }
            },
          },
        },
      },
      //海沫
      xunchaomrfz: {
        intro: {
          content: '下次造成的伤害+#',
        },
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          if (player.countCards('h') < 1) return false;
          return game.hasPlayer((current) => {
            return current != player && (current.hp > player.hp || current.countCards('h') > player.countCards('h') || current.countCards('e') > player.countCards('e'));
          });
        },
        complexCard: true,
        filterCard(card, player) {
          var selected = ui.selected.cards;
          if (!selected.length) return true;
          for (var i = 0; i < selected.length; i++) {
            if (get.type2(card) == get.type2(selected[i])) return false;
          }
          return true;
        },
        filterTarget(card, player, target) {
          return target != player && (target.hp > player.hp || target.countCards('h') > player.countCards('h') || target.countCards('e') > player.countCards('e'));
        },
        selectCard: [1, Infinity],
        check(card) {
          return 10 - get.value(card);
        },
        discard: false,
        lose: false,
        delay: false,
        content() {
          'step 0';
          player.give(cards, target);
          ('step 1');
          var num = cards.length;
          if (num >= 1) {
            player.recover();
          }
          if (num >= 2) {
            player.adjustHandCardTo(target.countCards('h'));
          }
          if (num >= 3) {
            player.addMark('xunchaomrfz', 1, false);
            player.when({ source: 'damageBegin1' }).then(() => {
              player.removeMark('xunchaomrfz', 1, false);
              trigger.num++;
            });
            // .emb({ firstDo: true });
          }
        },
        ai: {
          expose: 0.1,
          order: 3,
          result: {
            target(player, target) {
              if (get.attitude(target, player) > 0) {
                return 1 + target.countCards('h') * 0.1;
              }
            },
          },
        },
      },
      paoyingmrfz: {
        audio: 2,
        forced: true,
        trigger: { player: 'phaseZhunbeiBegin' },
        filter(event, player) {
          return player.countCards('h') > player.hp && player.getDamagedHp() > 0;
        },
        content() {
          'step 0';
          player.adjustHandCardTo(player.hp);
          ('step 1');
          if (result.cards?.length) {
            player.recover(Math.min(result.cards.length, 2));
          }
        },
      },
      //小满
      mushoumrfz: {
        audio: 2,
        trigger: { global: 'phaseEnd' },
        forced: true,
        getCanUseCard(event, player) {
          var history = event.player.getHistory('lose', function (evt) {
            return evt && evt.type == 'discard';
          }),
            cards = [];
          if (history.length == 0) return cards;
          for (var i = 0; i < history.length; i++) {
            var cardsList = history[i].cards;
            for (var j = 0; j < cardsList.length; j++) {
              if (!player.canUseToAnyone(cardsList[j])) continue;
              if (get.position(cardsList[j], true) != 'd') continue;
              cards.push(cardsList[j]);
            }
          }
          return cards;
        },
        filter(event, player) {
          var cards = lib.skill.mushoumrfz.getCanUseCard(event, player);
          return cards.length && event.player != player;
        },
        async content(event, trigger, player) {
          let cards = lib.skill.mushoumrfz.getCanUseCard(trigger, player);
          while (true) {
            const { bool, links } = await player
              .chooseButton(['【牧兽】:是否使用这些牌？', cards])
              .set('filterButton', (button) => {
                return _status.event.player.canUseToAnyone(button.link);
              })
              .set('ai', (button) => {
                return _status.event.player.getUseValue(button.link);
              })
              .forResult();
            if (!bool) return;
            cards.remove(links[0]);
            player.$gain2(links[0], false);
            player.chooseUseTarget(links[0], true);
            cards = cards.filter((card) => {
              return get.position(card, true) == 'd' && player.canUseToAnyone(card);
            });
            if (cards.length == 0) return;
          }
        },
      },
      //万顷
      guantianmrfz: {
        audio: 2,
        forced: true,
        trigger: { global: 'drawBegin' },
        filter(event, player) {
          return _status.currentPhase == player && event.getParent(1).name != 'guantianmrfz';
        },
        async content(event, trigger, player) {
          trigger.cancel();
          trigger.player.chooseToGuanxing(trigger.num);
          trigger.player.draw(trigger.num);
        },
      },
      yingfengmrfz: {
        audio: 2,
        trigger: { player: 'phaseBeginStart' },
        forced: true,
        async content(event, trigger, player) {
          var list = Array.from({ length: lib.phaseName.length }, (_, index) => (index + 1).toString());
          const index = await player
            .chooseControl(list)
            .set('prompt', '【万顷】:请选择你要跳过的阶段数')
            .set('ai', function () {
              var player = _status.event.player;
              var friend = game.filterPlayer((current) => {
                return get.attitude(current, player) > 0;
              });
              var list = _status.event.list;
              if (friend.length > 3 && player.getSkillsList().length > 1) return list.length - 1;
              if (player.countCards('h') <= player.getHandcardLimit() && friend.length > 2) return 3;
              return 1;
            })
            .set('list', list)
            .forResult('index');
          if (!index) return;
          let phase = [],
            num = index + 1;
          for (var i = 0; i < num; i++) {
            player.skip(lib.phaseName[i]);
            phase.push(lib.phaseName[i]);
          }
          game.log(player, '跳过了', `#y${get.tranPhase(phase)}`);
          player
            .when('phaseEnd')
            .then(() => {
              player.chooseTarget(true, `【应风】:请选择至多${get.cnNumber(index)}名角色,令其摸${get.cnNumber(Math.floor(index / 2))}张牌`, [1, index]).ai = function (target) {
                return get.attitude(player, target) > 0;
              };
            })
            .then(() => {
              if (result.targets?.length) {
                game.asyncDraw(result.targets, Math.floor(index / 2));
              } else event.finish();
            })
            .then(() => {
              var list = player.getSkillsList();
              if (index > 4 && list.length) {
                if (list.length == 1) {
                  player.removeSkill(list[0]);
                  event.finish();
                } else
                  player
                    .chooseControl(list)
                    .set('prompt', '【应风】:请选择失去一个技能')
                    .set('ai', function () {
                      var list = _status.event.list;
                      if (list.includes('yingfengmrfz') && list.length > 1) list.remove('yingfengmrfz');
                      return list.randomGet();
                    })
                    .set('list', list);
              }
            })
            .then(() => {
              if (result.control) {
                player.removeSkill(result.control);
                game.log(player, `失去了技能<span class="yellowtext">【${get.translation(result.control)}】</span>`);
              }
            })
            .vars({ index: num });
        },
        ai: {
          effect: {
            target(card, player, target, current) {
              if (get.type(card) == 'delay') return 'zeroplayertarget';
            },
          },
        },
      },
      //格劳克斯
      cichongmrfz: {
        audio: 2,
        init(player, skill) {
          player.storage.cichongmrfz = [];
        },
        intro: {
          content(event, player, storage) {
            return `已经弃置过的类型:${get.translation(player.storage[storage])}`;
          },
        },
        enable: 'phaseUse',
        filter(event, player) {
          var hs = player.countCards('he', function (card) {
            return !player.storage.cichongmrfz.includes(get.type2(card));
          }),
            bool = false;
          for (var i of game.players) {
            if (player.canUse('sha', i) || i != player) continue;
            bool = true;
            break;
          }
          return hs > 0 && bool;
        },
        filterCard(card) {
          var storage = _status.event.player.storage.cichongmrfz;
          return !storage.includes(get.type2(card));
        },
        filterTarget: lib.filter.notMe,
        position: 'he',
        async content(event, trigger, player) {
          player.markSkill('cichongmrfz');
          const target = event.targets[0],
            card = event.cards[0];
          player.storage.cichongmrfz.add(get.type2(card));
          const bool = await target
            .chooseToDiscard()
            .set('prompt', `【磁冲】:请弃置一张【闪】或防具牌,否则受到来自${get.translation(player)}的一点伤害`)
            .set('filterCard', (card) => card.name == 'shan' || get.subtype(card) == 'equip2')
            .set('ai', (card) => get.value(card) < 8)
            .forResult('bool');
          if (bool) return;
          target.damage();
        },
        ai: {
          order: 4,
          result: {
            target(player, target) {
              if (get.attitude(player, target) < 0) {
                return -(1 + target.countCards('h') * 0.1 + target.hp * 0.5);
              }
            },
          },
        },
        group: ['cichongmrfz_add', 'cichongmrfz_clear'],
        subSkill: {
          clear: {
            silent: true,
            charlotte: true,
            trigger: { player: 'phaseEnd' },
            content() {
              player.unmarkSkill('cichongmrfz');
              player.storage.cichongmrfz = [];
            },
          },
          add: {
            forced: true,
            firstDo: true,
            trigger: { source: 'damageBegin3' },
            filter(event, player) {
              return !player.canUse('sha', event.player) && event.player.isIn();
            },
            async content(event, trigger, player) {
              trigger.num++;
            },
          },
        },
      },
      ganraomrfz: {
        audio: 2,
        init(player, skill) {
          player.storage[skill] = [];
        },
        trigger: { source: 'damageBegin3' },
        filter(event, player) {
          var storage = player.storage.ganraomrfz;
          return !storage.includes(event.player) && event.player.isIn();
        },
        check(event, player) {
          return get.attitude(player, event.player) < 0;
        },
        async content(event, trigger, player) {
          let dialog = ['【干扰】:请选择一张牌'],
            list = [];
          for (var i = 0; i < lib.inpile.length; i++) {
            var name = lib.inpile[i];
            if (get.type(name) == 'equip') list.push(['装备', '', name]);
            else if (get.type2(name) == 'trick') list.push(['锦囊', '', name]);
            else if (get.type(name) == 'basic') list.push(['基本', '', name]);
          }
          dialog.push([list, 'vcard']);
          const links = await player
            .chooseButton(1, true)
            .set('createDialog', dialog)
            .set('ai', (button) => {
              var target = _status.event.target;
              if (target.hp < 2) return ['tao', 'jiu'].randomGet();
              return ['shan', 'wuxie', 'tao'].randomGet();
            })
            .set('target', trigger.player)
            .forResult('links');
          if (!links) return;
          if (!trigger.player.storage.ganraomrfz_ban) trigger.player.storage.ganraomrfz_ban = [];
          trigger.player.storage.ganraomrfz_ban.add(links[0][2]);
          trigger.player.addTempSkill('ganraomrfz_ban', { global: 'phaseEnd' });
          player.storage.ganraomrfz.add(trigger.player);
        },
        group: ['ganraomrfz_clear'],
        subSkill: {
          ban: {
            mod: {
              cardEnabled2(card, player) {
                if (player.storage.ganraomrfz_ban.includes(card.name)) return false;
              },
            },
            charlotte: true,
            silent: true,
            onremove(player, skill) {
              delete player.storage[skill];
            },
            mark: true,
            intro: {
              content(event, player, storage) {
                return `不能使用或打出${get.translation(player.storage[storage])}`;
              },
            },
          },
          clear: {
            charlotte: true,
            silent: true,
            trigger: { global: 'phaseEnd' },
            content() {
              player.storage.ganraomrfz = [];
            },
          },
        },
      },
      //海蒂
      anxinmrfz: {
        audio: 2,
        trigger: { global: 'gainEnd' },
        filter(event, player) {
          if (event.source === undefined || !event.source.isIn()) return false;
          if (event.source != player || !event.cards) return false;
          return event.cards && event.cards.length;
        },
        async content(event, trigger, player) {
          let num = trigger.cards.length,
            dialog = ['【暗信】:请选择一张牌'],
            list = [],
            count = 0;
          for (var i = 0; i < lib.inpile.length; i++) {
            var name = lib.inpile[i];
            if (get.type(name) == 'delay' || get.type(name) == 'equip') continue;
            if (name == 'sha') {
              list.push(['基本', '', 'sha']);
              for (var j of lib.inpile_nature) {
                list.push(['基本', '', 'sha', j]);
              }
            } else if (get.type2(name) == 'trick') list.push(['锦囊', '', name]);
            else if (get.type(name) == 'basic') list.push(['基本', '', name]);
          }
          dialog.push([list, 'vcard']);
          while (num-- > 0) {
            var links = await player
              .chooseButton(1, true)
              .set('createDialog', dialog)
              .set('ai', (button) => {
                var card = {
                  name: button.link[2],
                  nature: button.link[3],
                },
                  player = _status.event.player,
                  target = _status.event.target,
                  att = _status.event.att,
                  num = target.getUseValue(card, null, true);
                if (card.name == 'jiedao' && att < 0) num -= 10;
                if ((card.name == 'tao' || card.name == 'shan') && att < 0) num -= 5;
                return num * att;
              })
              .set('target', trigger.player)
              .set('att', get.attitude(trigger.player, player) > 0 ? 1 : -1)
              .forResult('links');
            if (!links) continue;
            let viewCards = {
              name: links[0][2],
              nature: links[0][3],
            };
            var gaincards = trigger.cards.filter((card) => {
              return !card.hasGaintag('anxinmrfz') && get.position(card) == 'h';
            }),
              tmpnum = gaincards.length;
            if (gaincards.length == 0) return;
            var links =
              gaincards.length == 1
                ? gaincards
                : await player
                  .chooseCardButton(`【暗信】:请你选择视为${viewCards.nature === undefined ? '' : get.translation(viewCards.nature)}${get.translation(viewCards.name)}的牌`, true, gaincards, [1, tmpnum])
                  .set('ai', () => {
                    if (ui.selected.buttons.length == 0) return 1;
                    return 0;
                  })
                  .forResult('links');
            if (!links) continue;
            for (var i = 0; i < links.length; i++) {
              links[i].gaintag.add('anxinmrfz');
              links[i].storage.anxinmrfz = viewCards;
            }
            var gaincards = trigger.cards.filter((card) => {
              return !card.hasGaintag('anxinmrfz') && get.position(card) == 'h';
            });
            if (gaincards.length == 0) return;
          }
        },
        global: 'anxinmrfz_views',
        group: ['anxinmrfz_use'],
        subSkill: {
          use: {
            charlotte: true,
            forced: true,
            trigger: { global: 'useCardAfter' },
            filter(event, player) {
              return event.player.hasHistory('lose', function (evt) {
                if (evt.parent != event) return false;
                for (var i in evt.gaintag_map) {
                  if (evt.gaintag_map[i].includes('anxinmrfz')) return true;
                }
                return false;
              });
            },
            content() {
              player.draw();
            },
          },
          views: {
            charlotte: true,
            mod: {
              aiOrder(player, card, num) {
                if (get.itemtype(card) == 'card' && card.hasGaintag('anxinmrfz')) return num + 1;
              },
              cardname(card, player) {
                var viewsCard = card.storage.anxinmrfz;
                if (get.itemtype(card) == 'card' && card.hasGaintag('anxinmrfz')) return viewsCard.name;
              },
              cardnature(card, player) {
                var viewsCard = card.storage.anxinmrfz;
                if (get.itemtype(card) == 'card' && card.hasGaintag('anxinmrfz')) return viewsCard.nature;
              },
            },
          },
        },
      },
      gongchoumrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return game.hasPlayer((current) => {
            return current != player && current.countCards('h') > 0;
          });
        },
        filterTarget(card, player, target) {
          return target != player && target.countCards('h') > 0;
        },
        selectTarget: -1,
        multitarget: true,
        multiline: true,
        async content(event, trigger, player) {
          let targets = event.targets,
            list = [];
          while (true) {
            if (targets[0].countCards('h') == 0) {
              targets.shift();
              continue;
            }
            var cards = await targets[0]
              .chooseCard(true)
              .set('prompt', `【觥筹】:请选择一张牌交给${get.translation(player)}`)
              .set('ai', function (card) {
                return get.value(card) < 6;
              })
              .forResult('cards');
            if (!cards) {
              targets.shift();
              continue;
            }
            targets[0].give(cards, player);
            list.add(targets[0]);
            targets.shift();
            if (targets.length == 0) break;
          }
          if (list.length == 0) return;
          while (true) {
            if (player.countCards('he') == 0) return;
            var cards = await player
              .chooseCard(true, 'he')
              .set('prompt', `【觥筹】:请选择一张牌交给${get.translation(list[0])}`)
              .set('ai', function (card) {
                return get.value(card) < 6;
              })
              .forResult('cards');
            if (!cards) {
              list.shift();
              continue;
            }
            player.give(cards, list[0]);
            list.shift();
            if (list.length == 0) break;
          }
        },
        ai: {
          order: 13,
          result: {
            player: 1,
          },
        },
      },
      yinshimrfz: {
        mod: {
          targetEnabled(card, player, target) {
            var num = 0,
              list = ['h', 'j', 'e'];
            for (var i = 0; i < list.length; i++) {
              if (target.countCards(list[i]) == 0) continue;
              num++;
            }
            if (player.getHistory('useCard').length < num && _status.currentPhase != target) return false;
          },
        },
        audio: 2,
        trigger: {
          global: 'useCard',
        },
        forced: true,
        filter(event, player) {
          var num = 0,
            list = ['h', 'j', 'e'];
          for (var i = 0; i < list.length; i++) {
            if (player.countCards(list[i]) == 0) continue;
            num++;
          }
          return event.player.getHistory('useCard').length < num && _status.currentPhase != player && ((event.card.name == 'nanman' && player != event.player) || (event.card.name == 'wanjian' && player != event.player) || (event.card.name == 'taoyuan' && player.hp < player.maxHp) || event.card.name == 'wugu');
        },
        content() { },
      },
      //崖心
      lingdingmrfz: {
        init(player, skill) {
          /*
          [记录的牌的数量,[]中的数字]
          */
          player.storage[skill] = [0, 1];
        },
        mark: true,
        intro: {
          markcount: '',
          content(event, player, storage) {
            return `${player.storage[storage][0]}/${player.storage[storage][1]}`;
          },
        },
        audio: 2,
        forced: true,
        trigger: {
          player: ['respond', 'useCard'],
        },
        async content(event, trigger, player) {
          player.storage.lingdingmrfz[0]++;
          let usenum = player.storage.lingdingmrfz[0],
            num = player.storage.lingdingmrfz[1];
          if (usenum < num) return;
          const bool = await player
            .chooseBool(`【凌顶】:你可以摸${num}张牌`)
            .set('frequentSkill', 'lingdingmrfz')
            .set('prompt2', get.prompt2('lingdingmrfz').substring(get.prompt2('lingdingmrfz').indexOf('###', get.prompt2('lingdingmrfz').indexOf('###') + 3) + 3))
            .forResult('bool');
          if (!bool) return;
          player.storage.lingdingmrfz[0] = 0;
          if (player.storage.lingdingmrfz[1] < player.maxHp) player.storage.lingdingmrfz[1]++;
          player.draw(num);
        },
      },
      yabengmrfz: {
        audio: 2,
        trigger: { player: 'dying' },
        forced: true,
        content() {
          player.draw(Math.min(2, player.storage.lingdingmrfz[0]));
          player.storage.lingdingmrfz = [0, 0];
        },
      },
      //初雪
      shengnvmrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return (
            game.countPlayer((current) => {
              return current != player;
            }) > 1
          );
        },
        selectTarget: 2,
        filterTarget: lib.filter.notMe,
        multitarget: true,
        multiline: true,
        async content(event, trigger, player) {
          let targets = event.targets,
            targets2 = [],
            // [<第二名角色的选项>,<第一名角色的选项>]
            csn = [undefined, undefined];
          while (targets.length) {
            var target = targets[0],
              list = [],
              csList = ['收回所有装备区的牌', '将一张手牌当【乐不思蜀】置于你的判定区', '不能响应下一张指定你为目标的基本牌或普通锦囊牌'];
            if (target.countCards('e') > 0) {
              list.push('选项一');
            } else csList[0] = `<span style="opacity:0.5; ">${csList[0]}(不可选:装备区没有牌)</span>`;
            for (var i of target.getCards('h')) {
              if (!target.canAddJudge({ name: 'lebu', cards: [i] })) continue;
              list.push('选项二');
              break;
            }
            if (!list.includes('选项二')) csList[1] = `<span style="opacity:0.5; ">${csList[1]}(不可选:无法对自己使用【乐不思蜀】)</span>`;
            list.push('选项三');
            if (list.length == 0) continue;
            const { control } = await target
              .chooseControl(list)
              .set('choiceList', csList)
              .set('ai', function () {
                var list = _status.event.list;
                if (list.includes('选项二')) list.remove('选项二');
                return list.randomGet();
              })
              .set('target', target)
              .set('list', list)
              .forResult();

            if (!control) continue;
            csn[targets.length - 1] = control;
            targets2.add(target);
            switch (control) {
              case '选项一':
                target.gain(target.getCards('e'), 'gain2');
                break;
              case '选项二':
                const cards = await target
                  .chooseCard(true)
                  .set('prompt', '【圣女】:请选择一张手牌当【乐不思蜀】置于你的判定区')
                  .set('filterCard', (card) => {
                    return target.canAddJudge({ name: 'lebu', cards: [card] });
                  })
                  .set('ai', (card) => {
                    return 6 - get.value(card);
                  })
                  .forResult('cards');
                if (!cards) break;
                target.useCard({ name: 'lebu' }, cards, target);
                break;
              case '选项三':
                target.addMark('shengnvmrfz_direct', 1, false);
                break;
            }
            targets.shift();
          }
          if (csn[0] != csn[1]) {
            for (var i of targets2) {
              if (!i.countGainableCards(player, 'he')) continue;
              player.gainPlayerCard('he', i, true).set('ai', lib.card.shunshou.ai.button);
            }
          } else player.draw(2);
        },
        ai: {
          order: 13,
          result: {
            target: -1,
          },
        },
        global: 'shengnvmrfz_direct',
        subSkill: {
          direct: {
            charlotte: true,
            forced: true,
            intro: {
              content: '不能响应下#张指定你为目标的基本牌或普通锦囊牌',
            },
            trigger: {
              target: 'useCardToPlayered',
            },
            filter(event, player) {
              return player.countMark('shengnvmrfz_direct') > 0 && (get.type(event.card) == 'basic' || get.type(event.card) == 'trick');
            },
            content() {
              player.removeMark('shengnvmrfz_direct', 1, false);
              trigger.directHit.add(player);
            },
          },
        },
      },
      shenshemrfz: {
        audio: 2,
        forced: true,
        trigger: { target: 'useCardToTargeted' },
        filter(event, player) {
          if (player.countCards('h', (card) => get.is.shownCard(card)) < 1) return false;
          var max = 0,
            shown = player.getCards('h', (card) => get.is.shownCard(card));
          for (var i of shown) {
            if (i.number > max) max = i.number;
          }
          var number = event.card.number;
          if (number != null && number > max) return false;
          return event.player.countCards('he') > 0 && event.player != player && get.tag(event.card, 'damage') > 0;
        },
        async content(event, trigger, player) {
          let list = [],
            source = trigger.player,
            tranTmp = function (str) {
              var list = ['e', 'h'];
              var cn = ['装备', '手牌'];
              for (var i = 0; i < list.length; i++) {
                if (str == list[i]) return cn[i];
              }
            };
          if (source.countCards('h') > 0) list.push('h');
          if (source.countCards('e') > 0) list.push('e');
          let num = list.length;
          if (num == 0) return;
          source
            .chooseToDiscard(true)
            .set('position', 'he')
            .set('prompt', `【神慑】:请弃置${list.length > 1 ? tranTmp(list[0]) + '和' + tranTmp(list[1]) : tranTmp(list[0])}区的一张牌`)
            .set('selectCard', num)
            .set('filterCard', (card) => {
              if (ui.selected.cards.length == 0) return true;
              if (get.position(ui.selected.cards[0]) == 'h') return get.position(card) == 'e';
              return get.position(card) == 'h';
            })
            .set('complexCard', true)
            .set('ai', (card) => {
              return 8 - get.value(card);
            });
        },
        ai: {
          threaten: 0.6,
        },
        group: 'shenshemrfz_show',
        subSkill: {
          show: {
            audio: 'shenshemrfz',
            forced: true,
            trigger: { player: 'phaseJieshuBegin' },
            filter(event, player) {
              return player.countCards('h', (card) => !get.is.shownCard(card)) > 0 && player.countCards('h', (card) => get.is.shownCard(card)) == 0;
            },
            async content(trigger, event, player) {
              let hs = player.getCards('h', (card) => !get.is.shownCard(card));
              if (hs.length == 0) return;
              player.addShownCards(hs, 'visible_shenshemrfz');
            },
          },
        },
      },
      //狮蝎
      qianzongmrfz: {
        audio: 2,
        trigger: {
          player: 'showCharacterAfter',
        },
        forced: true,
        hiddenSkill: true,
        filter(event, player) {
          return event.toShow.includes('shixiemrfz');
        },
        async content(event, trigger, player) {
          if (player == _status.currentPhase) {
            let list = ['摸一张牌'];
            if (player.getDamagedHp() > 0) list.push('回复体力');
            list.push('cancel2');
            const { control } = await player
              .chooseControl(list)
              .set('prompt', '【潜踪】:你可以回复一点体力或摸一张牌')
              .set('ai', function () {
                var player = _status.event.player;
                if (player.hp < 3) return '回复体力';
                return '摸一张牌';
              })
              .forResult();

            if (!control || control == 'cancel2') return;
            switch (control) {
              case '摸一张牌':
                player.draw();
                break;
              case '回复体力':
                player.recover();
            }
          } else {
            const targets = await player
              .chooseTarget()
              .set('prompt', '【潜踪】:你可以对一名其他角色造成一点伤害')
              .set('filterTarget', lib.filter.notMe)
              .set('ai', function (target) {
                var player = _status.event.player;
                return get.attitude(target, player) < 0;
              })
              .forResult('targets');
            if (!targets) return;
            targets[0].damage();
          }
        },
        group: 'qianzongmrfz_rehidden',
        subSkill: {
          rehidden: {
            forced: true,
            trigger: { player: 'phaseEnd' },
            filter(event, player) {
              return (
                player.getHistory('lose', function (evt) {
                  return evt.type == 'discard';
                }).length == 0 && !player.isUnseen()
              );
            },
            async content(trigger, event, player) {
              const bool = await player.chooseBool().set('prompt', '【潜踪】:是否进入隐匿状态？').forResult('bool');
              if (bool != true) return;
              player.reUnseen();
            },
          },
        },
      },
      xiedumrfz: {
        mod: {
          cardname(card, player) {
            if (card.name == 'du') return 'sha';
          },
        },
        audio: 2,
        trigger: { source: 'damageSource' },
        filter(event, player) {
          return event.player.isIn() && event.player.countCards('he') > 0 && (player != _status.currentPhase || (event.card && event.card.name == 'sha'));
        },
        async content(trigger, event, player) {
          var target = event.player;
          const cards = await player
            .choosePlayerCard(target, 'he', true, 1, '【蝎毒】:请选择一张牌')
            .set('ai', (button) => {
              return get.value(button.link);
            })
            .forResult('cards');
          if (!cards) return;
          for (var i of cards) {
            if (get.position(i) == 'e') {
              target.discard(i);
              continue;
            }
            i.init([i.suit, i.number, 'du']);
          }
        },
      },
      lijimrfz: {
        audio: 2,
        trigger: {
          player: 'useCardToPlayered',
        },
        mark: true,
        intro: {
          markcount(storage, player) {
            let list = [];
            player.getHistory('useCard', function (evt) {
              list.add(evt.card.suit);
            });
            return `${list.length}`;
          },
          content(event, player, skill) {
            let list = [];
            player.getHistory('useCard', function (evt) {
              list.add(evt.card.suit);
            });
            return `你使用的【杀】需要${list.length}张【闪】才可抵消<br>已经使用的花色:${get.translation(list)}`;
          },
        },
        forced: true,
        filter(event, player) {
          return event.card && event.card.name == 'sha' && !event.parent.directHit.includes(event.target);
        },
        logTarget: 'target',
        async content(event, trigger, player) {
          let list = [];
          await player.getHistory('useCard', function (evt) {
            list.add(evt.card.suit);
          });
          const needNum = list.length;
          const id = trigger.target.playerid;
          const map = trigger.parent.customArgs;
          if (!map[id]) map[id] = {};
          if (typeof map[id].shanRequired == 'number') {
            map[id].shanRequired = needNum;
          } else {
            map[id].shanRequired = needNum;
          }
        },
        ai: {
          directHit_ai: true,
          skillTagFilter(player, tag, arg) {
            let list = [];
            player.getHistory('useCard', function (evt) {
              list.add(evt.card.suit);
            });
            if ((arg && arg.card.name != 'sha') || arg.target.countCards('h', 'shan') > list.length) return false;
          },
        },
      },
      //红隼
      chihenmrfz: {
        marktext: '护',
        intro: {
          name: '护',
          content: '你有#个‘护’标记',
        },
        audio: 2,
        trigger: { player: 'phaseDiscardBegin' },
        forced: true,
        filter(event, player) {
          return !player.hasEmptySlot(2);
        },
        async content(event, trigger, player) {
          let num = player.countCards('e');
          const targets = await player
            .chooseTarget(`【齿痕】:请选择至多${get.cnNumber(num)}角色,令这些角色获得一个‘护’`)
            .set('selectTarget', function () {
              var num = _status.event.num;
              return [0, num];
            })
            .set('ai', (target) => {
              var player = _status.event.player;
              return get.attitude(target, player) > 0;
            })
            .set('num', num)
            .forResult('targets');
          if (!targets) return;
          for (var i of targets) {
            i.addMark('chihenmrfz');
          }
        },
        global: 'chihenmrfz_eff1',
        group: ['chihenmrfz_eff2'],
        subSkill: {
          eff1: {
            charlotte: true,
            mod: {
              maxHandcard(player, num) {
                return (num += player.countMark('chihenmrfz'));
              },
            },
          },
          eff2: {
            audio: 'chihenmrfz',
            forced: true,
            trigger: { global: 'useCardToTargeted' },
            filter(event, player) {
              /*
              event.player 使用者
              event.targets 目标角色
              */
              if (!get.tag(event.card, 'damage') || !event.targets) return false;
              if (player.hp < event.player.hp) return false;
              return event.target.hasMark('chihenmrfz');
            },
            async content(event, trigger, player) {
              let target = trigger.target,
                eff = get.effect(target, trigger.card, trigger.player, trigger.player);
              const bool = await trigger.player
                .chooseToDiscard(`【齿痕】:你须弃置一张牌,否则此牌(${get.translation(trigger.card)})对${get.translation(target)}无效`)
                .set('ai', function (card) {
                  if (_status.event.eff > 0) return 10 - get.value(card);
                  return 0;
                })
                .set('eff', eff)
                .forResult('bool');
              if (bool) {
                target.removeMark('chihenmrfz');
                return;
              }
              trigger.parent.excluded.add(target);
              target.removeMark('chihenmrfz');
            },
          },
        },
      },
      haomingmrfz: {
        audio: 2,
        forced: true,
        trigger: { source: 'damageSource' },
        usable: 1,
        async content(event, trigger, player) {
          const control = await player
            .chooseControl('basic', 'trick', 'equip', 'cancel2')
            .set('prompt', '【号鸣】:请选择你要获得的牌的类型')
            .set('ai', function () {
              var player = _status.event.player;
              if (player.hp < 3) return 'basic';
              if (player.countCards('e') >= 3) return ['equip', 'trick', 'trick', 'trick', 'basic'].randomGet();
              return ['basic', 'trick', 'trick', 'equip', 'equip'].randomGet();
            })
            .forResult('control');
          if (!control || control == 'cancel2') {
            player.getStat('triggerSkill').haomingmrfz--;
            return;
          }
          var card = get.cardPile2(function (card) {
            return get.type(card, 'trick') == control;
          });
          if (card) player.gain(card, 'gain2', 'log');
          else player.chat(`牌堆中没有${get.translation(control)}牌了!`);
        },
        group: ['haomingmrfz_jd', 'haomingmrfz_find'],
        subSkill: {
          ban: {
            charlotte: true,
            mark: true,
            intro: {
              content: '使用牌不能指定有‘护’标记的牌的角色',
            },
            mod: {
              playerEnabled(card, player, target) {
                if (target.hasMark('chihenmrfz')) return false;
              },
            },
          },
          jd: {
            trigger: { player: 'phaseJieshuBegin' },
            forced: true,
            filter(event, player) {
              return player.canUseToAnyone('juedou');
            },
            async content(event, trigger, player) {
              const targets = await player
                .chooseTarget('【号鸣】:你可以选择一名其他角色,视为对其使用一张【决斗】')
                .set('filterTarget', (card, player, target) => {
                  return player.canUse('juedou', target);
                })
                .set('ai', (target) => {
                  var player = _status.event.player,
                    eff = get.effect(target, { name: 'juedou' }, player, player);
                  if (eff < 0) return 0;
                  return eff;
                })
                .forResult('targets');
              if (!targets) return;
              player
                .when({ global: ['damageEnd', 'phaseJieshuAfter'] })
                .filter((event, player) => {
                  if (event.name == 'phaseJieshu') return true;
                  return event.card && event.card.storage.haomingmrfz == true;
                })
                .then(() => {
                  if (trigger.name == 'phaseJieshu') return;
                  var target = trigger.player,
                    num = Math.ceil(target.countCards('h') / 2);
                  if (num > 0) target.chooseToDiscard(true, num, `【号鸣】:请弃置${get.translation(num)}张手牌`);
                  target.addTempSkill('haomingmrfz_ban', { player: 'phaseEnd' });
                });
              player.useCard({ name: 'juedou', storage: { haomingmrfz: true } }, targets[0]);
            },
          },
          find: {
            audio: 'haomingmrfz',
            enable: 'phaseUse',
            usable: 1,
            filter(event, player) {
              return player.countCards('h') > 0;
            },
            prompt: '【号鸣】:你可以弃置任意张手牌,从牌堆中获得一张与弃置的牌字数相同的牌',
            filterCard: true,
            selectCard: [1, Infinity],
            check(card) {
              var player = _status.event.player;
              if (player.hp < 3) {
                if (ui.selected.cards.length == 0) return 6 - get.value(card);
                return 0;
              }
              if (!player.hasEmptySlot(2)) {
                if (ui.selected.cards.length < 2) return 6 - get.value(card);
                return 0;
              }
              if (ui.selected.cards.length < 3) return 6 - get.value(card);
              return 0;
            },
            async content(event, trigger, player) {
              let cards = event.cards,
                num = cards.length,
                list = [];
              for (var i of ui.cardPile.childNodes) {
                if (get.cardNameLength(i) != num) continue;
                list.push(i);
              }
              if (list.length == 0) {
                player.chat(`牌堆中没有字数为${get.cnNumber(num)}的牌!`);
                return;
              }
              const links =
                list.length == 1
                  ? list[0]
                  : await player
                    .chooseCardButton('【号鸣】:请选择你要获得的牌', true, list)
                    .set('ai', function (button) {
                      var name = button.name,
                        player = _status.event.player;
                      if (player.hp < 3 && name == 'tao') return 10;
                      return get.value(button);
                    })
                    .forResult('links');
              if (!links) return;
              var card = get.cardPile2(function (card) {
                return card == links[0];
              });
              if (card) player.gain(card, 'gain2', 'log');
              else player.chat(`牌堆中没有${get.translation(links)}了!`);
            },
            ai: {
              order: 5,
              result: {
                player: 1,
              },
            },
          },
        },
      },
      //稀音
      sheyingmrfz: {
        mod: {
          maxHandcard(player, num) {
            var bool = false;
            for (var i of game.players) {
              for (var j of [1, 2, 3, 4, 5]) {
                if (i.hasCard(`jingtouE${j}mrfz`, 'e')) {
                  bool = true;
                  break;
                }
              }
            }
            if (bool) return num + 2;
          },
          globalTo(from, to, distance) {
            var bool = false;
            for (var i of game.players) {
              for (var j of [1, 2, 3, 4, 5]) {
                if (i.hasCard(`jingtouE${j}mrfz`, 'e')) {
                  bool = true;
                  break;
                }
              }
            }
            if (bool) return distance + 1;
          },
        },
        audio: 2,
        derivation: ['jingtoumrfz_show'],
        enable: 'phaseUse',
        filter(event, player) {
          var num = 0;
          for (var i of game.players) {
            for (var j of [1, 2, 3, 4, 5]) {
              if (i.hasCard(`jingtouE${j}mrfz`, 'e')) num++;
            }
          }
          return player.countCards('h') > 0 && num < 4;
        },
        usable: 2,
        position: 'he',
        filterCard: true,
        filterTarget: lib.filter.notMe,
        check(card) {
          return 6 - get.value(card);
        },
        async content(event, trigger, player) {
          let targets = event.targets,
            list1 = [],
            list2 = [];
          for (var i of [1, 2, 3, 4, 5]) list1.push(`jingtouE${i}mrfz`);
          for (var i of list1) {
            list2.push(['装备', '', i]);
          }
          const links = await player
            .chooseButton(['稀音', [list2, 'vcard']], true)
            .set('ai', function (button) {
              var target = _status.event.target,
                list = _status.event.list,
                card = { name: button.link[2] },
                equip = [];
              for (var i of target.getCards('e')) equip.push(i.name);
              if (equip.includes(card.name)) return 0;
              if (get.subtype(card) == 'equip2') return 5;
              if (get.subtype(card) == 'equip1') return 4;
              if (get.subtype(card) == 'equip5') return 3;
              if (get.subtype(card) == 'equip3' || get.subtype(card) == 'equip3') return 2;
              return 1;
            })
            .set('target', targets[0])
            .set('list', list1)
            .forResult('links');
          if (!links) return;
          var suit,
            list3 = ['heart', 'club', 'spade', 'spade', 'diamond'];
          for (var i = 0; i < list1.length; i++) {
            if (links[0][2] == list1[i]) suit = list3[i];
          }
          var card = game.createCard(links[0][2], suit, 7);
          targets[0].$gain2(card);
          targets[0].equip(card);
        },
        ai: {
          order: 13,
          result: {
            target: -1,
          },
        },
      },
      chaozaimrfz: {
        mod: {
          cardnumber(card) {
            if (card.storage.chaozaimrfz == true) return 7;
          },
          ignoredHandcard(card, player) {
            if (card.storage.chaozaimrfz == true) {
              return true;
            }
          },
          cardDiscardable(card, player, name) {
            if (name == 'phaseDiscard' && card.storage.chaozaimrfz == true) return false;
          },
        },
        onremove(player) {
          for (var i of game.players) {
            i.removeSkill('chaozaimrfz_eff1');
          }
        },
        audio: 2,
        trigger: { player: 'phaseZhunbeiBegin' },
        filter(event, player) {
          for (var i of game.players) {
            for (var j of [1, 2, 3, 4, 5]) {
              if (i.hasCard(`jingtouE${j}mrfz`, 'e')) return true;
            }
          }
          return false;
        },
        async content(event, trigger, player) {
          for (var i of game.players) {
            i.addSkill('chaozaimrfz_eff1');
          }
          player.addTempSkill('chaozaimrfz_clear', { player: 'phaseBegin' });
        },
        subSkill: {
          eff1: {
            audio: 'chaozaimrfz',
            trigger: { player: 'useCardToTargeted' },
            forced: true,
            filter(event, player) {
              if (event.target == player) return false;
              if (!event.card || (!event.card.suit && !event.card.number)) return false;
              for (var i of [1, 2, 3, 4, 5]) {
                if (event.target.hasCard(`jingtouE${i}mrfz`, 'e')) return true;
              }
              return false;
            },
            async content(event, trigger, player) {
              var number = trigger.card.number,
                suit = trigger.card.suit;
              if (number >= 7) {
                trigger.directHit.addArray(
                  game.filterPlayer(function (current) {
                    return current != player && current == trigger.target;
                  }),
                );
              }
              if (number <= 7) {
                var map = trigger.customArgs;
                var id = trigger.target.playerid;
                if (!map[id]) map[id] = {};
                if (typeof map[id].extraDamage != 'number') map[id].extraDamage = 0;
                map[id].extraDamage += 1;
              }
              var cards = trigger.target.getCards('e').filter((i) => {
                for (var j of [1, 2, 3, 4, 5]) {
                  if (i.name == `jingtouE${j}mrfz`) return true;
                }
                return false;
              });
              if (cards.length == 0) return;
              for (var i of cards) {
                if (i.suit == trigger.card.suit) {
                  //_status.tmpCard_chaozai = trigger.card;
                  player
                    .when({ player: 'useCardAfter', global: 'phaseEnd' })
                    .filter((event, player) => {
                      if (event.name == 'phase') return true;
                      return event.card == trigger.card;
                    })
                    .then(() => {
                      if (trigger.name != 'phase') player.useCard({ name: card.name, suit: card.suit, number: card.number }, target).set('addCount', false);
                      //delete _status.tmpCard_chaozai;
                    })
                    .vars({ target: trigger.target, card: trigger.card });
                  break;
                }
              }
            },
          },
          clear: {
            audio: 'chaozaimrfz',
            charlotte: true,
            forced: true,
            trigger: { player: 'phaseBeginStart' },
            async content(event, trigger, player) {
              let num = 0;
              for (var i of game.players) {
                i.removeSkill('chaozaimrfz_eff1');
                for (var j of [1, 2, 3, 4, 5]) {
                  if (i.hasCard(`jingtouE${j}mrfz`, 'e')) {
                    i.discard(i.getCards('e', `jingtouE${j}mrfz`));
                    num++;
                  }
                }
              }
              if (num == 0) return;
              const { cards } = await player.draw(num).forResult();
              for (var i of cards) {
                i.addGaintag('chaozaimrfz');
                i.storage.chaozaimrfz = true;
              }
            },
          },
        },
      },
      //夜魔
      biaolimrfz: {
        mod: {
          aiOrder(player, card, num) {
            if (get.itemtype(card) == 'card' && card.storage && card.storage.biaolimrfz == true) return num + 1;
          },
          cardname(card, player, name) {
            var storage = player.storage.biaolimrfz == 'red' ? 'tao' : 'sha';
            if (card.storage && card.storage.biaolimrfz == true) return storage;
          },
          targetInRange(card, player, target) {
            if (card.storage && card.storage.biaolimrfz == true && card.name == 'sha' && target.hp >= player.hp) return true;
          },
        },
        audio: 2,
        forced: true,
        trigger: { player: 'phaseUseBegin' },
        async content(event, trigger, player) {
          const { cards } = await player.draw(3).forResult();
          if (!cards) return;
          var red = 0;
          for (var i of cards) {
            if (get.color(i) == 'red') red++;
            i.storage.biaolimrfz = true;
            i.addGaintag('biaolimrfz');
          }
          if (red > 1) player.storage.biaolimrfz = 'red';
          else player.storage.biaolimrfz = 'black';
        },
        group: ['biaolimrfz_nocount', 'biaolimrfz_set'],
        subSkill: {
          set: {
            charlotte: true,
            silent: true,
            trigger: {
              global: 'phaseBefore',
              player: 'enterGame',
            },
            filter(event, player) {
              return event.name != 'phase' || game.phaseNumber == 0;
            },
            content() {
              var enable = lib.card.tao.enable;
              lib.card.tao.enable = function (card, player) {
                if (player.storage.biaolimrfz && player.storage.biaolimrfz == 'red' && player.isPhaseUsing()) {
                  if (card.storage.biaolimrfz) return true;
                  return player.hp < player.maxHp;
                }
                return enable(card, player);
              };
              var selectTarget = lib.card.tao.selectTarget;
              lib.card.tao.selectTarget = function () {
                var player = _status.event.player;
                if (player.storage.biaolimrfz && player.storage.biaolimrfz == 'red' && player.isPhaseUsing()) {
                  return [1, 1]; //QQQ
                }
                return selectTarget;
              };
              var filterTarget = lib.card.tao.filterTarget;
              lib.card.tao.filterTarget = function (card, player, target) {
                if (player.storage.biaolimrfz && player.storage.biaolimrfz == 'red' && player.isPhaseUsing()) {
                  if (card.storage.biaolimrfz) return target.hp < target.maxHp;
                  return target.hp < target.maxHp && target == player;
                }
                return filterTarget(card, player, target);
              };
            },
          },
          nocount: {
            silent: true,
            trigger: { player: 'useCard2' },
            filter(event, player) {
              if (!event.card) return false;
              if (event.card.storage.biaolimrfz != true || event.card.name != 'sha') return false;
              for (var i of event.targets) {
                if (player.hp <= i.hp) return true;
              }
              return false;
            },
            content() {
              if (trigger.addCount !== false) {
                trigger.addCount = false;
                trigger.player.getStat().card.sha--;
              }
            },
          },
        },
      },
      ymkongwomrfz: {
        audio: 2,
        forced: true,
        trigger: { player: 'phaseDrawEnd' },
        filter(event, player) {
          return player.countCards('he') > 0;
        },
        async content(event, trigger, player) {
          const bool = await player
            .chooseToDiscard()
            .set('position', 'he')
            .set('prompt', '【控我】:你可以弃置一张牌,观看牌堆顶两张牌,并以任意顺序将其置于牌堆顶或牌堆底')
            .set('ai', function (card) {
              var player = _status.event.player;
              if (player.skipList.includes('phaseUse')) return 0;
              if (card.storage.biaolimrfz == true) return 10 - get.value(card);
              return 6 - get.value(card);
            })
            .forResult('bool');
          if (!bool) return;
          var cards = get.cards(2);
          game.cardsGotoOrdering(cards);
          const moved = await player
            .chooseToMove()
            .set('list', [['牌堆顶', cards], ['牌堆底']])
            .set('prompt', '点击将牌移动到牌堆顶或牌堆底')
            .set('processAI', function (list) {
              var cards = list[0][1],
                player = _status.event.player;
              const target = player.next;
              const att = get.attitude(player, target);
              const top = [],
                bottom = cards;
              for (const i of target.getCards('j')) {
                const judge = get.judge(i);
                bottom.sort((a, b) => (judge(b) - judge(a)) * att); //态度大于0价值高的牌放前面
                if (bottom.length) {
                  top.push(bottom.shift());
                }
              }
              bottom.sort((a, b) => (get.value(b) - get.value(a)) * att); //态度大于0价值高的牌放前面
              while (bottom.length) {
                top.push(bottom.shift());
              }
              return [top, bottom];
            })
            .forResult('moved');
          if (!moved) return;
          var top = moved[0];
          var bottom = moved[1];
          top.reverse();
          for (var i = 0; i < top.length; i++) {
            ui.cardPile.insertBefore(top[i], ui.cardPile.firstChild);
          }
          for (var i = 0; i < bottom.length; i++) {
            ui.cardPile.appendChild(bottom[i]);
          }
          game.addCardKnower(top, player);
          game.addCardKnower(bottom, player);
          player.popup(get.cnNumber(top.length) + `上${get.cnNumber(bottom.length)}下`);
          game.log(player, `将${get.cnNumber(top.length)}张牌置于牌堆顶`);
          game.updateRoundNumber();
          let { promise, resolve } = Promise.withResolvers();
          setTimeout(() => {
            resolve();
          }, 500);
          await promise;
        },
      },
      //惊蛰
      chunleimrfz: {
        audio: 2,
        trigger: { global: 'phaseZhunbeiBegin' },
        forced: true,
        filter(event, player) {
          return player.countCards('he', { color: 'black' }) > 0;
        },
        async content(event, trigger, player) {
          const cards = await player
            .chooseCard()
            .set('prompt', `【春雷】:你可以弃置一张黑色的牌,对${get.translation(trigger.player)}造成一点雷属性的伤害`)
            .set('filterCard', (card) => get.color(card) == 'black')
            .set('position', 'he')
            .set('ai', (card) => {
              var player = _status.event.player;
              if (get.damageEffect(_status.event.target, player, player, 'thunder') > 0) return 6 - get.value(card);
              return 0;
            })
            .set('target', trigger.player)
            .forResult('cards');
          if (!cards) return;
          player.discard(cards);
          trigger.player.damage('thunder');
        },
        ai: {
          expose: 0.1,
          threaten: 1.3,
        },
      },
      zheqimrfz: {
        audio: 2,
        forced: true,
        trigger: { global: 'damageEnd' },
        usable: 1,
        filter(event, player) {
          return event.nature && event.nature == 'thunder';
        },
        async content(event, trigger, player) {
          var target = _status.currentPhase;
          if (target) {
            //QQQ
            target.addTempSkill('zheqimrfz_eff1');
          }
          player.addTempSkill('zheqimrfz_eff2', { global: 'phaseBegin' });
        },
        subSkill: {
          eff1: {
            mark: true,
            intro: {
              content: '<i>正月启蛰,言发蛰也.万物出乎震,震为雷,故曰惊蛰.是蛰虫惊而出走矣.<br>————<大戴礼记·夏小正></i>',
            },
            mod: {
              cardUsable(card) {
                if (get.itemtype(card) == 'card') return Infinity;
              },
            },
            forced: true,
            charlotte: true,
            trigger: { player: 'useCard' },
            filter(event, player) {
              return event.card && get.type(event.card) != 'equip' && player.countCards('h') > 0;
            },
            async content(event, trigger, player) {
              player.chooseToDiscard(true, '【蛰起】:请选择弃置一张手牌').set('ai', (card) => 6 - get.value(card));
            },
          },
          eff2: {
            audio: 'zheqimrfz',
            forced: true,
            charlotte: true,
            trigger: { global: 'phaseEnd' },
            getDiscard(event, player) {
              var history = event.player.getHistory('lose', function (evt) {
                return evt && evt.type == 'discard';
              }),
                cards = [];
              if (history.length == 0) return cards;
              for (var i = 0; i < history.length; i++) {
                var cardsList = history[i].cards;
                for (var j = 0; j < cardsList.length; j++) {
                  if (get.position(cardsList[j], true) != 'd') continue;
                  cards.push(cardsList[j]);
                }
              }
              return cards;
            },
            filter(event, player) {
              var cards = lib.skill.zheqimrfz_eff2.getDiscard(event, player);
              return cards.length;
            },
            async content(event, trigger, player) {
              let cards = lib.skill.zheqimrfz_eff2.getDiscard(trigger, player);
              const links = await player
                .chooseButton(['【蛰起】:请选择你要获得的牌', cards])
                .set('forced', true)
                .set('filterButton', (button) => {
                  var player = _status.event.player;
                  return !ui.selected.buttons.some((i) => get.type2(i, player) == get.type2(button, player));
                })
                .set('selectButton', [1, Infinity])
                .set('ai', (button) => {
                  return _status.event.player.getUseValue(button.link);
                })
                .forResult('links');
              if (!links) return;
              player.gain(links, 'gain2');
            },
          },
        },
        ai: {
          threaten: 1.3,
        },
      },
      //龙舌兰
      pianfengmrfz: {
        audio: 2,
        trigger: { source: 'damageSource' },
        filter(event, player) {
          return event.player && event.player.isIn() && event.cards.filterInD().length && event.player.countCards('h') > 0;
        },
        prompt(event, player) {
          var num =
            event.player.getHistory('damage', (evt) => {
              return evt.card && evt.card.name == event.card.name;
            }).length + 1;
          return `【偏锋】:是否令${get.translation(event.player)}回复一点体力并展示其${get.cnNumber(num)}张手牌`;
        },
        check(event, player) {
          var num = event.player.getHistory('damage', (evt) => {
            return evt.card && evt.card.name == event.card.name;
          }).length,
            att = get.attitude(event.player.player);
          /*
          if(num<2&&att>0) return true; 
          return num>1&&att<0&&event.player.countCards('h')>=num;
          */
          return att < 0 && event.player.countCards('h') >= num;
        },
        async content(event, trigger, player) {
          let num =
            trigger.player.getHistory('damage', (evt) => {
              return evt.card && evt.card.name == trigger.card.name;
            }).length + 1,
            target = trigger.player;
          target.recover();
          const cards = await player
            .choosePlayerCard()
            .set('selectButton', num)
            .set('forced', true)
            .set('position', 'h')
            .set('target', target)
            .set('prompt', `【偏锋】:请选择展示${get.translation(target)}的${get.cnNumber(num)}张牌`)
            .forResult('cards');
          if (!cards) return;
          player.showCards(cards, `${get.translation(player)}展示了${get.translation(target)}的${get.cnNumber(num)}张牌`);
          let bool = false;
          for (var i of cards) {
            if (get.type2(i) != get.type2(trigger.card)) continue;
            bool = true;
          }
          if (!bool) {
            player.draw(num);
            return;
          }
          target.discard(cards);
          target.loseHp(num);
        },
        ai: {
          threaten: 1.5,
        },
      },
      //阿米娅
      tongganmrfz: {
        audio: 2,
        trigger: {
          global: 'drawAfter',
        },
        usable: 3,
        forced: true,
        filter(event, player) {
          return event.player !== player;
        },
        content() {
          player.draw();
        },
        group: 'tonggan_discardmrfz',
        ai: {
          threaten: 2,
        },
      },
      tonggan_discardmrfz: {
        audio: 2,
        trigger: {
          global: 'loseAfter',
        },
        usable: 3,
        filter(event, player) {
          if (event.type != 'discard') return false;
          return event.player !== player;
        },
        forced: true,
        content() {
          player.chooseToDiscard('he', true, 1);
        },
      },
      qinghemrfz: {
        audio: 2,
        zhuSkill: true,
        trigger: {
          player: 'loseAfter',
          global: 'loseAsyncAfter',
        },
        filter(event, player) {
          if (player == _status.currentPhase) return false;
          return event.type == 'discard' && event.getl(player).cards2.length && !player.hasSkill('qinghemrfz_ban');
        },
        forced: true,
        content() {
          'step 0';
          var target = _status.currentPhase;
          if (!target) return;
          target
            .chooseBool(`【亲和】:是否让${get.translation(player)}其弃置的牌中的一张牌？`)
            .set('ai', () => {
              return get.attitude(_status.currentPhase, _status.event.targetx) > 0;
            })
            .set('targetx', player);
          ('step 1');
          if (result.bool) {
            var target = _status.currentPhase;
            player.addTempSkill('qinghemrfz_ban', 'phaseEnd');
            if (trigger.cards.length == 1) {
              player.gain(trigger.cards, 'gain2');
              event.finish();
            }
            if (trigger.cards.length > 1) {
              target.chooseButton(['选择获得令其获得其中的一张牌', trigger.cards.slice(0)], true).ai = function (button) {
                return get.value(button.link);
              };
            }
          } else event.finish();
          ('step 2');
          if (result.links?.length) {
            player.gain(result.links, 'gain2');
          }
        },
        subSkill: {
          ban: {
            charlotte: true,
          },
        },
      },
      //doc 医生
      yizhemrfz: {
        mod: {
          ignoredHandcard(card, player) {
            if (card.name == 'tao') {
              return true;
            }
          },
          cardDiscardable(card, player, name) {
            if (name == 'phaseDiscard' && card.name == 'tao') return false;
          },
        },
        init() {
          var enable = lib.card.tao.enable;
          lib.card.tao.enable = function (card, player) {
            if (player.hasSkill('yizhemrfz')) {
              return true;
            }
            return enable(card, player);
          };
          var selectTarget = lib.card.tao.selectTarget;
          lib.card.tao.selectTarget = function () {
            var player = _status.event.player;
            if (player.hasSkill('yizhemrfz')) {
              return [1, 1]; //QQQ
            }
            return selectTarget;
          };
          var filterTarget = lib.card.tao.filterTarget;
          lib.card.tao.filterTarget = function (card, player, target) {
            if (player.hasSkill('yizhemrfz')) {
              return target.hp < target.maxHp && (player.inRange(target) || player == target);
            }
            return filterTarget(card, player, target);
          };
          lib.card.tao.content = function () {
            if (player.hasSkill('yizhemrfz')) {
              var num = target.getDamagedHp();
              target.recover(5);
              if (5 - num > 0) {
                target.addSkill('yizhemrfz_eff');
                target.storage.yizhemrfz_eff = 5 - num;
                target.changeHujia(5 - num);
              }
            } else target.recover();
          };
        },
        audio: 2,
        trigger: {
          global: 'phaseBefore',
          player: 'enterGame',
        },
        filter(event, player) {
          return event.name != 'phase' || game.phaseNumber == 0;
        },
        forced: true,
        content() {
          var cards = [];
          if (ui.cardPile.childNodes.length < 1) return;
          for (var i of ui.cardPile.childNodes) {
            if (cards.length > 2) break;
            if (i.name == 'tao') cards.push(i);
          }
          if (cards.length) player.gain(cards, 'gain2');
          else player.chat('byd怎么开局牌堆中的桃就没了？');
        },
        subSkill: {
          eff: {
            mark: true,
            intro: {
              content(event, player) {
                return `你因【桃】而获得的护甲数:${player.storage.yizhemrfz_eff}`;
              },
            },
            charlotte: true,
            silent: true,
            trigger: { global: 'roundStart' },
            async content(event, trigger, player) {
              if (!player.hujia) return;
              if (player.storage.yizhemrfz_eff && player.storage.yizhemrfz_eff > 0) {
                player.storage.yizhemrfz_eff--;
                player.changeHujia(-1);
                player.popup('失去护甲');
                game.log(player, '失去了一点因【桃】而获得的护甲值');
              }
              if (player.storage.yizhemrfz_eff && player.storage.yizhemrfz_eff == 0) {
                player.removeSkill('yizhemrfz_eff');
                delete player.storage.yizhemrfz_eff;
                player.unmarkSkill('yizhemrfz_eff');
              }
            },
            group: 'yizhemrfz_lose',
          },
          lose: {
            trigger: { player: 'damageEnd' },
            filter(event, player) {
              return event.hujia;
            },
            charlotte: true,
            silent: true,
            async content(event, trigger, player) {
              if (player.storage.yizhemrfz_eff && player.storage.yizhemrfz_eff > 0) {
                player.storage.yizhemrfz_eff--;
              }
              if (player.storage.yizhemrfz_eff && player.storage.yizhemrfz_eff == 0) {
                player.removeSkill('yizhemrfz_eff');
                delete player.storage.yizhemrfz_eff;
                player.unmarkSkill('yizhemrfz_eff');
              }
            },
          },
        },
      },
      zhulimrfz: {
        mod: {
          cardname(card, player, name) {
            if (card.hasGaintag('zhulimrfz')) return 'tao';
          },
        },
        audio: 2,
        trigger: { player: 'phaseJieshuBegin' },
        forced: true,
        async content(event, trigger, player) {
          if (player.getStat('damage') != undefined) {
            if (player.countCards('he') > 0) player.chooseToDiscard('he', true, `【医者】:请选择弃置一张牌`);
          } else {
            const { cards } = await player.draw(2).forResult();
            for (var i of cards) {
              var num = i.number;
              if (i.suit == 'heart' && num >= 2 && num <= 9) {
                i.addGaintag('zhulimrfz');
              }
            }
          }
        },
      },
      //inna 双月
      shuangzimrfz: {
        audio: 2,
        group: ['shuangzimrfz_eff1', 'shuangzimrfz_eff2'],
        subSkill: {
          eff1: {
            forced: true,
            trigger: { player: 'useCardBegin' },
            async content(event, trigger, player) {
              //复制卡牌、对应元素
              let cardcopy = { ...trigger.card },
                evt = event.getParent(3);
              var num = get.randomNumberSJZX();
              cardcopy.idSJZX = num;
              cardcopy.evtP = evt.orderingCards;
              trigger.card.idSJZX = num;
              if (!player.storage.shuangzimrfz) player.storage.shuangzimrfz = [];
              player.storage.shuangzimrfz.push(cardcopy);
              //删除对应元素
              trigger.card.cards = [];
              delete trigger.card.number;
              delete trigger.card.suit;
              evt.orderingCards = undefined;
              evt.cards = [];
            },
          },
          eff2: {
            forced: true,
            trigger: {
              source: ['damageBegin'],
              player: ['cardsDiscardAfter'],
            },
            filter(event, player) {
              if (event.name == 'damage') {
                var storage = player.storage.shuangzimrfz;
                if (!event.card) return false;
                for (var i of storage) {
                  if (event.card.idSJZX != i.idSJZX) continue;
                  return true;
                }
                return false;
              } else {
                var evt = event.parent;
                var storage = player.storage.shuangzimrfz;
                if (evt.name != 'orderingDiscard') return false;
                for (var i of storage) {
                  for (var j in event.cards) {
                    if (j.idSJZX != i.idSJZX) continue;
                    return event.cards && event.cards.filterInD('d').length;
                  }
                }
                return false;
              }
            },
            async content(event, trigger, player) {
              let evt = event.getParent(3),
                storage = player.storage.shuangzimrfz;
              //重置
              for (var i of storage) {
                if (i.idSJZX == trigger.card.idSJZX) {
                  evt.cards = i.cards;
                  trigger.card.cards = i.cards;
                  trigger.card.number = i.number;
                  trigger.card.suit = i.suit;
                  trigger.card.color = i.color;
                  delete player.storage.shuangzimrfz[i];
                }
              }
            },
          },
        },
      },
      //凛视
      jiangtumrfz: {
        mark: true,
        intro: {
          mark(dialog, content, player) {
            var cards = _status.currentPhase.getCards('h');
            if (_status.currentPhase == player) {
              dialog.addText(`byd自己的手牌都不知道是吧？`);
            } else if (cards) {
              dialog.addText(`${get.translation(_status.currentPhase)}的手牌`);
              dialog.addSmall(cards);
            } else dialog.addText(`${get.translation(_status.currentPhase)}没有手牌!`);
          },
        },
        audio: 2,
        forced: true,
        trigger: { player: ['gainPlayerCardBegin', 'discardPlayerCardBegin', 'choosePlayerCardBegin'] },
        filter(event, player) {
          return _status.currentPhase == event.target;
        },
        content() {
          trigger.visible = true;
        },
        ai: {
          threaten: 1.1,
        },
      },
      jieshimrfz: {
        mod: {
          aiOrder(player, card, num) {
            var list = player.storage.jieshimrfz;
            if (typeof card == 'object' && player.isPhaseUsing() && list && list.length) {
              if (get.type2(card) == list[0]) return num + 10;
            }
          },
        },
        audio: 3,
        trigger: { global: 'phaseUseBegin' },
        filter(event, player) {
          return player.countCards('he') > 0;
        },
        forced: true,
        async content(event, trigger, player) {
          const cards = await player
            .chooseToDiscard('he')
            .set('prompt', `【揭示】:你可以弃置一张牌,猜测${trigger.player == player ? '你' : get.translation(trigger.player)}本阶段前三张牌分别使用的类型(对${trigger.player == player ? '你' : get.translation(trigger.player)}不可见).`)
            .set('ai', function (card) {
              return 8 - get.value(card);
            })
            .forResult('cards');
          if (!cards) return;
          var list = [
            ['待选择的牌的类型', [['basic', 'basic', 'basic', 'trick', 'trick', 'trick', 'equip', 'equip', 'equip'], 'vcard']],
            ['请调整顺序<br>从左到右:第一、二、三张牌', []],
          ];

          const moved = await player
            .chooseToMove(`【揭示】:请猜测${trigger.player == player ? '你' : get.translation(trigger.player)}本阶段前三张牌分别使用的类型`)
            .set('list', list)
            .set('filterMove', function (from, to, moved) {
              return (to == 1 && moved[1].length < 3) || to == 0 || typeof to !== 'number';
            })
            .set('processAI', () => {
              var moved = [[999], []],
                cards = _status.currentPhase.getCards('h'),
                order = [
                  [0, 0],
                  [0, 0],
                  [0, 0],
                ];

              for (var i of cards) {
                for (var j = 0; j < order.length; j++) {
                  if (get.order(i) > order[j][1]) {
                    order[j] = [i, get.order(i)];
                    break;
                  }
                }
              }
              for (var i of order) {
                moved[1].push(['ByTheLeaderOne', '作者:林登万', get.type2(i[0])]);
              }
              return moved;
            })
            .forResult('moved');
          if (!moved) return;
          var list = moved[1].map((i) => i[2]);
          trigger.player.addTempSkill('jieshimrfz_eff', { player: 'phaseUseEnd' });
          trigger.player.storage.jieshimrfz = list;
          trigger.player.storage.jieshimrfz_eff = player;
          _status.tmpTotal_jieshimrfz = 0;
        },
        subSkill: {
          eff: {
            onremove(player) {
              delete player.storage.jieshimrfz;
              delete player.storage.jieshimrfz_eff;
              delete _status.tmpTotal_jieshimrfz;
            },
            forced: true,
            charlotte: true,
            mark: true,
            intro: {
              content(event, player) {
                var storage = player.storage.jieshimrfz;
                if (game.me == player && storage != 'error' && storage.length) return `剩余${storage.length}张`;
                if (storage.length == 0) return '全部已猜测完毕';
                return get.translation(storage);
              },
            },
            trigger: { player: 'useCardAfter' },
            filter(event, player) {
              if (!player.storage.jieshimrfz_eff.isIn()) return false;
              return player.storage.jieshimrfz && player.storage.jieshimrfz.length;
            },
            async content(event, trigger, player) {
              if (!_status.tmpTotal_jieshimrfz) _status.tmpTotal_jieshimrfz = 0;
              var target = player.storage.jieshimrfz_eff;
              if (get.type2(trigger.card) == player.storage.jieshimrfz[0]) {
                _status.tmpTotal_jieshimrfz++;
                if (_status.tmpTotal_jieshimrfz == 3 && target != player) player.chat('被看穿了吗？');
                else if (_status.tmpTotal_jieshimrfz == 3) player.chat('我猜的真准!');
                target.popup('猜测正确');
                target.draw(_status.tmpTotal_jieshimrfz);
                if (_status.tmpTotal_jieshimrfz > 1) {
                  var num = Math.min(_status.tmpTotal_jieshimrfz - 1, 1);
                  const bool = await target
                    .chooseBool(`【揭示】:是否对${get.translation(player)}造成${get.cnNumber(num)}点伤害？`)
                    .set('ai', () => get.damageEffect(target, player) > 0)
                    .forResult('bool');
                  if (bool) player.damage(num, target);
                }
              } else {
                if (target == player) player.chat(`<img style='width:100px;height:100px' src=extension/驶舰之向/image/orther/jieshiError.png></img>`);
                target.popup('猜测错误');
              }
              player.storage.jieshimrfz.shift();
            },
          },
        },
      },
      //医疗阿米娅
      tongqingmrfz: {
        init(player, skill) {
          player.storage[skill] = [];
        },
        onremove(player, skill) {
          var cards = player.getCards('s', function (card) {
            return card.hasGaintag('tongqingmrfzx');
          });
          if (cards.length) {
            player.lose(cards, ui.discardPile);
            player.$throw(cards, 1000);
            game.log(cards, '进入了弃牌堆');
          }
        },
        marktext: '情绪',
        intro: {
          name: '情绪',
          mark(dialog, content, player) {
            var cards = player.getCards('s', function (card) {
              return card.hasGaintag('tongqingmrfzx');
            });
            if (!cards || cards.length < 1) {
              dialog.addText(`没有‘情绪’`);
            } else {
              dialog.addText(`共有${cards.length}张‘情绪’`);
              dialog.addSmall(cards);
            }
          },
        },
        audio: 2,
        trigger: { global: 'phaseJieshuBegin' },
        getDiscard(event, player) {
          let cards = [];
          for (var character of game.players) {
            var history = character.getHistory('lose', function (evt) {
              return evt && evt.type == 'discard';
            });
            if (history.length == 0) continue;
            for (var i = 0; i < history.length; i++) {
              var cardsList = history[i].cards;
              for (var j = 0; j < cardsList.length; j++) {
                if (get.position(cardsList[j], true) != 'd') continue;
                cards.push(cardsList[j]);
              }
            }
          }
          return cards;
        },
        filter(event, player) {
          let cardsList = lib.skill.tongqingmrfz.getDiscard(event, player);
          return cardsList && cardsList.length;
        },
        prompt2(event, player) {
          let cardsList = lib.skill.tongqingmrfz.getDiscard(event, player),
            cards = player.getCards('s', function (card) {
              return card.hasGaintag('tongqingmrfzx');
            });
          return `【恸请】:你可以将所有的‘情绪’(${cards.length ? `共有${cards.length}张‘情绪’` : '没有‘情绪’'})置入弃牌堆,将${get.translation(cardsList)}置于你的武将牌上,称之为‘情绪’`;
        },
        check(event, player) {
          let cardsList = lib.skill.tongqingmrfz.getDiscard(event, player),
            cards = player.getCards('s', function (card) {
              return card.hasGaintag('tongqingmrfzx');
            });
          if (cards.length < 1) return true;
          return get.value(cardsList) - get.value(cards) > 0;
        },
        async content(event, trigger, player) {
          var cards = player.getCards('s', function (card) {
            return card.hasGaintag('tongqingmrfzx');
          });
          if (cards?.length) {
            await player.loseToDiscardpile(cards);
          }
          let cardsList = lib.skill.tongqingmrfz.getDiscard(trigger, player);
          game.log(player, '将', cardsList.length, '张牌置于在武将牌上');
          player.loseToSpecial(cardsList, 'tongqingmrfzx');
          player.markSkill('tongqingmrfz');
        },
      },
      cibeimrfz: {
        audio: 2,
        trigger: { player: 'loseAfter' },
        filter(event, player) {
          var position = event.cards.map((i) => i.original);
          return position.every((item) => item != 'h');
        },
        forced: true,
        async content(event, trigger, player) {
          const targets = await player
            .chooseTarget()
            .set('prompt', `【慈悲】:你可以令你攻击范围内的一名角色或你回复一点体力或摸一张牌`)
            .set('filterTarget', (card, player, target) => {
              return player.inRange(target) || target == player;
            })
            .set('ai', (target) => get.attitude(_status.event.player, target) > 0)
            .forResult('targets');
          if (!targets) return;
          let target = targets[0];
          if (target.getDamagedHp() < 1) {
            target.draw();
            return;
          }
          const control = await player
            .chooseControl('回复体力', '摸一张牌')
            .set('prompt', `【慈悲】:请选择一项`)
            .set('ai', () => 0)
            .forResult('control');
          if (!control) return;
          if (control == '回复体力') {
            target.recover();
          } else target.draw();
        },
      },
      // 异格芬 历战锐枪芬
      xiaozhimrfz: {
        audio: 2,
        trigger: {
          player: 'useCardToPlayered',
        },
        check(event, player) {
          return get.attitude(player, event.target) < 0;
        },
        filter(event, player) {
          return event.card && event.card.name == 'sha' && player.canCompare(event.target);
        },
        logTarget: 'target',
        async content(event, trigger, player) {
          var result = await player.chooseToCompare(trigger.target);
          if (!result) return;
          result = result.result;
          if (result.winner != player) player.draw(2);
          if (result.winner != trigger.target) {
            var cards = [result.player, result.target];
            cards = cards.filter((card) => player.hasUseTarget(card) && !get.owner(card));
            if (cards.length) {
              var links = await player
                .chooseButton(['是否使用其中的牌？', cards])
                .set('ai', (button) => _status.event.player.getUseValue(button.link))
                .forResult('links');
              if (links) {
                var card = links[0];
                player.$gain2(card, false);
                player.chooseUseTarget(true, card, false);
              }
            }
            trigger.parent.directHit.add(trigger.target);
          }
        },
      },
      zhishoumrfz: {
        audio: 2,
        enable: 'chooseToUse',
        filterCard(card) {
          return get.itemtype(card) == 'card' && card.hasGaintag('zhishoumrfz');
        },
        subfrequent: ['addcount'],
        position: 'h',
        viewAs(cards, player) {
          if (cards.length) {
            if (_status.currentPhase == player) return { name: 'sha' };
            return { name: 'shan' };
          }
          return null;
        },
        viewAsFilter(player) {
          if (!player.countCards('h', (card) => card.hasGaintag('zhishoumrfz'))) return false;
        },
        prompt(event, player) {
          return `【执守】:将本轮出牌阶段内获得的牌当作${_status.currentPhase == player ? '【闪】' : '【杀】'}使用`;
        },
        check(card) {
          return 7 - get.value(card);
        },
        onremove(player) {
          player.removeGaintag('zhishoumrfz');
        },
        ai: {
          order: 2,
          respondShan: true,
          respondSha: true,
          skillTagFilter(player, tag, arg) {
            if (arg == 'respond' || !player.countCards('h', (card) => _status.connectMode || card.hasGaintag('zhishoumrfz'))) return false;
          },
          result: {
            player: 1,
          },
        },
        group: ['zhishoumrfz_mark', 'zhishoumrfz_addcount'],
        subSkill: {
          addcount: {
            audio: 'zhishoumrfz',
            trigger: { player: 'gainAfter' },
            lastDo: true,
            forced: true,
            filter(event, player) {
              var evt = event.getParent('phaseDraw');
              if (player.hasSkill('zhishoumrfz_eff')) return false;
              if (evt && evt.player == player) return false;
              return event.getg(player).length;
            },
            prompt: '【执守】:是否令本轮使用【杀】的次数+1？',
            check() {
              return true;
            },
            content() {
              player.addTempSkill('zhishoumrfz_eff', { global: 'roundStart' });
            },
          },
          eff: {
            mark: true,
            intro: {
              content: '使用【杀】的次数+1',
            },
            charlotte: true,
            mod: {
              cardUsable(card, player, num) {
                if (card.name == 'sha') return num + 1;
              },
            },
          },
          mark: {
            silent: true,
            charlotte: true,
            trigger: {
              global: 'roundStart',
              player: 'gainBegin',
            },
            filter(event, player) {
              if (event.name == 'gain') return player.isPhaseUsing();
              else return game.roundNumber > 1;
            },
            content() {
              if (trigger.name == 'gain') trigger.gaintag.add('zhishoumrfz');
              else player.removeGaintag('zhishoumrfz');
            },
          },
        },
      },
      // 海霓
      jingchaomrfz: {
        audio: 2,
        trigger: { player: 'damageEnd' },
        filter(event, player) {
          return player.countCards('he') > 1;
        },
        check(event, player) {
          if (player.getDamagedHp() < 1) return false;
          return 3 - player.getDamagedHp() + player.getCards('he', (card) => get.value(card) < 7).length;
        },
        async cost(event, trigger, player) {
          const result = await player
            .chooseToDiscard(2, 'he')
            .set('prompt2', `你可以弃置两张牌并回复${trigger.num}点体力,若你弃置的牌类别不同,你将手牌补至5张`)
            .set('ai', (card) => {
              var player = get.event('player'),
                selected = ui.selected.cards,
                num = get.value(card);
              for (var i of selected) {
                if (get.type2(i) == get.type2(card)) num - 3;
                else num + 2;
              }
              return 7 - num + player.getDamagedHp();
            })
            .forResult();
          event.result = result;
        },
        async content(event, trigger, player) {
          let cards = event.cards;
          player.recover(trigger.num);
          if (cards.length != 2) return;
          if (get.type2(cards[0]) != get.type2(cards[1])) {
            player.drawTo(5);
            player.tempBanSkill('jingchaomrfz', 'phaseEnd', false);
            game.log(this, '的技能', `#g【静潮】`, `本回合失效了`);
          }
        },
        ai: {
          maixie_hp: true,
          threaten: 0.8,
        },
      },
      cehuimrfz: {
        init(player, skill) {
          player.storage[skill] = 0;
        },
        audio: 2,
        mark: true,
        intro: {
          content: '本回合开始时手牌数为:#',
        },
        trigger: {
          global: 'phaseJieshuBegin',
        },
        getDiscardCards(event) {
          let cards = [];
          for (var i of game.players) {
            var history = i.getHistory('lose', function (evt) {
              return evt && evt.type == 'discard';
            });
            if (history.length == 0) continue;
            for (var k of history) {
              if (k.cards.length == 0) continue;
              for (var j of k.cards) {
                if (get.position(j) != 'd') continue;
                cards.push(j);
              }
            }
          }
          return cards;
        },
        filter(event, player) {
          var cards = lib.skill.cehuimrfz.getDiscardCards(event);
          if (!game.hasPlayer((current) => current != player && player.canCompare(current, true, false))) return false;
          return player.countCards('h') != player.storage.cehuimrfz && cards.length;
        },
        async cost(event, trigger, player) {
          var cards = lib.skill.cehuimrfz.getDiscardCards(trigger);
          const result = await player
            .chooseCardButton(cards)
            .set('prompt2', `你可以选择一张牌并与一名其他角色进行拼点,若你赢,你使用牌堆顶3张牌`)
            .set('ai', (link) => link.number)
            .forResult();
          result.cost_data = result.links;
          event.result = result;
        },
        async content(event, trigger, player) {
          let card = event.cost_data[0];
          var targets = await player
            .chooseTarget(true)
            .set('prompt', `【测绘】:请选择一名其他角色进行拼点`)
            .set('filterTarget', (card, player, target) => target != player && player.canCompare(target, true, false))
            .set('ai', (target) => {
              var player = get.event('player');
              return get.attitude(player, target) < 0;
            })
            .forResult('targets');
          if (!targets) return;
          var tmpfuc = async function () {
            let next = player.chooseToCompare(targets[0]);
            if (!next.fixedResult) next.fixedResult = {};
            next.fixedResult[player.playerid] = card;
            return next;
          };
          var next = await tmpfuc();
          if (next.result.bool) {
            var cards = game.cardsGotoOrdering(get.cards(3)).cards;
            player.showCards(cards, `${get.translation(player)}展示了牌堆顶三张牌`);
            let canUse = cards.filter((i) => player.hasUseTarget(i, false));
            if (canUse.length == 0) return;
            while (canUse.length) {
              const links =
                canUse.length == 1
                  ? canUse
                  : await player
                    .chooseCardButton(canUse, true)
                    .set('prompt', `【测绘】:请选择你要使用的牌`)
                    .set('ai', (link) => link.number)
                    .forResult('links');
              if (!links) continue;
              await player
                .chooseUseTarget(links[0])
                .set('nodistance', true)
                .set('prompt', `请选择${get.translation(links[0])}的目标`);
              canUse.remove(links[0]);
            }
          }
        },
        group: ['cehuimrfz_record'],
        subSkill: {
          record: {
            silent: true,
            charlotte: true,
            trigger: {
              global: 'phaseBegin',
            },
            content() {
              if (typeof player.storage.cehuimrfz !== 'number') player.storage.cehuimrfz = 0;
              player.storage.cehuimrfz = player.countCards('h');
            },
          },
        },
      },
      // 深巡
      yuchaomrfz: {
        audio: 2,
        enable: 'phaseUse',
        usable: 1,
        filter(event, player) {
          return game.hasPlayer((current) => current != player && player.canCompare(current, true, false)) && player.countCards('hej') > 0;
        },
        filterTarget(card, player, target) {
          return player.canCompare(target, true, false) && target != player;
        },
        selectTarget: [1, 2],
        multitarget: true,
        multiline: true,
        async content(event, trigger, player) {
          let targets = event.targets;
          const links = await player
            .choosePlayerCard(player, 'hej', true)
            .set('prompt', `【御潮】:请选择你的拼点牌`)
            .set('ai', (link) => {
              var player = get.event('player'),
                num = 0;
              if (get.position(link) == 'j') num += 3 + get.value(link) / 2;
              if (get.position(link) == 'e') num -= 2;
              return link.number + num - get.value(link) / 2;
            })
            .forResult('links');
          let next = player.chooseToCompare(targets);
          if (!next.fixedResult) next.fixedResult = {};
          next.fixedResult[player.playerid] = links[0];
          next.callback = lib.skill.yuchaomrfz.callback;
        },
        async callback(event, trigger, player) {
          if (event.num1 < event.num2) player.link(true);
          else if (event.num1 > event.num2) {
            event.target.link(true);
            player.addTempSkill('yuchaomrfz_eff', 'phaseEnd');
          } else {
            event.target.link(true);
            player.link(true);
          }
        },
        subSkill: {
          eff: {
            charlotte: true,
            mod: {
              cardUsableTarget(card, player, target) {
                if (target.isLinked()) return true;
              },
            },
          },
        },
        ai: {
          order: 8,
          result: {
            target: -1,
            player: 1,
          },
        },
      },
      yanhuimrfz: {
        audio: 2,
        derivation: ['binglinchengxia'],
        trigger: { player: 'phaseUseBegin' },
        forced: true,
        filter(event, player) {
          var card = { name: 'binglinchengxia' };
          return player.canAddJudge(card);
        },
        async content(event, trigger, player) {
          await player.addJudge({ name: 'binglinchengxia' }, [_status.pileTop]);
          player.draw(Math.min(player.hp, 20));
          player.loseHp();
        },
      },
      // 明椒
      suozemrfz: {
        mark: true,
        intro: {
          content(event, player) {
            return `记录的牌名:${player.storage.suozemrfz.length ? get.translation(player.storage.suozemrfz) : '无'}`;
          },
        },
        audio: 2,
        init(player, skill) {
          player.storage[skill] = [];
        },
        trigger: {
          player: ['useCardEnd', 'respondEnd'],
        },
        filter(event, player) {
          if (event.cards.length < 1) return false;
          return !player.storage.suozemrfz.includes(event.card.name) && (get.type2(event.card) == 'basic' || get.type(event.card) == 'trick');
        },
        prompt2(event, player) {
          return `是否记录${get.translation(event.card)},观看牌堆顶${player.maxHp}张牌,并用等量手牌交换其中至多${player.storage.suozemrfz.length + 1}张牌？`;
        },
        async content(event, trigger, player) {
          player.storage.suozemrfz.add(trigger.card.name);
          game.log(player, `的`, `#g【索赜】`, `记录了`, trigger.card.name);
          var cards = get.cards(player.maxHp);
          let cardsc = cards.slice(0);
          const moved = await player
            .chooseToMove(`【索赜】:请选择你要交换的牌(至多交换${player.storage.suozemrfz.length}张牌)`)
            .set('filterMove', (from, to) => {
              return typeof to !== 'number';
            })
            .set('list', [
              ['牌堆顶', cardsc],
              ['你的手牌', player.getCards('h')],
            ])
            .set('filterOk', (moved) => {
              let h = get.event('cardsh');
              return h.filter((i) => moved[0].includes(i)).length <= get.event('num');
            })
            .set('processAI', (list) => {
              var player = get.event('player');
              let cards1 = list[0][1].slice(),
                cards2 = player.getCards('h');
              if (cards2.length === 0) {
                return [cards1, []];
              }
              let maxC = Math.max(...cards1.map((i) => get.value(i)));
              let minH = Math.min(...cards2.map((i) => get.value(i)));
              let count = 0,
                num = get.event('num');
              while (minH < maxC && count < num) {
                count++;
                let maxCIndex = cards1.map((i) => get.value(i)).indexOf(maxC);
                let minHIndex = cards2.map((i) => get.value(i)).indexOf(minH);
                [cards1[maxCIndex], cards2[minHIndex]] = [cards2[minHIndex], cards1[maxCIndex]];
                maxC = Math.max(...cards1.map((i) => get.value(i)));
                minH = Math.min(...cards2.map((i) => get.value(i)));
              }
              return [cards1, cards2];
            })
            .set('num', player.storage.suozemrfz.length)
            .set('cardsh', player.getCards('h'))
            .forResult('moved');
          const puts = player.getCards('h', (i) => moved[0].includes(i));
          const gains = cardsc.filter((i) => moved[1].includes(i));
          if (puts.length && gains.length) {
            player.$throw(puts.length, 1000);
            await player.lose(puts, ui.special);
            await player.gain(gains, 'giveAuto');
          }
          cardsc = moved[0].slice();
          if (cardsc.length) {
            await game.cardsGotoOrdering(cardsc);
            for (var i = cardsc.length - 1; i >= 0; i--) {
              ui.cardPile.insertBefore(cardsc[i], ui.cardPile.firstChild);
            }
            game.log(get.cnNumber(cardsc.length, true), '张牌被放回了牌堆顶');
            game.updateRoundNumber();
          }
        },
      },
      youyimrfz: {
        audio: 2,
        forced: true,
        trigger: { player: 'phaseJieshuBegin' },
        filter(event, player) {
          return player.storage.suozemrfz.length;
        },
        async content(event, trigger, player) {
          var list = [];
          for (var i = 0; i < lib.inpile.length; i++) {
            var name = lib.inpile[i];
            if (!player.storage.suozemrfz.includes(name)) continue;
            if (get.type(name) == 'basic') list.push(['基本', '', name]);
            else if (get.type(name) == 'trick') list.push(['锦囊', '', name]);
          }
          let links = await player
            .chooseButton([`游移:请移除${Math.ceil(list.length / 2)}张牌`, [list, 'vcard']], true)
            .set('selectButton', Math.ceil(list.length / 2))
            .set('ai', (button) => {
              return _status.event.player.getUseValue({ name: button.link[2] }, null, true);
            })
            .forResult('links');
          if (!links) return;
          player.storage.suozemrfz.removeArray(links.map((i) => i[2]));
          let names = links.filter((i) => player.hasUseTarget(i[2])).map((i) => [get.translation(get.type(i[2])), '', i[2]]);
          if (names.length < 1) return;
          let links2 =
            names.length == 1
              ? names
              : await player
                .chooseButton(['游移:请选择一张你要使用的牌', [names, 'vcard']], true)
                .set('ai', (button) => {
                  return _status.event.player.getUseValue({ name: button.link[2] }, null, true);
                }) //QQQ
                .forResult('links');
          player.chooseUseTarget({ name: links2[0][2] }, true);
        },
      },
      // 戴菲恩
      zhuofengmrfz: {
        audio: 2,
        usable: 1,
        enable: 'phaseUse',
        filter(event, player) {
          return player.countCards('h') > 0;
        },
        async content(event, trigger, player) {
          let list = [];
          if (player.getCards('h', { color: 'red' }).length) list.push('red');
          if (player.getCards('h', { color: 'black' }).length) list.push('black');
          list.push('cancel2');
          const control = await player
            .chooseControl(list)
            .set('prompt', `是否发动【濯锋】？`)
            .set('prompt2', `你可以重铸手牌中一种颜色的所有牌,若你重铸了不少于2张牌,你摸一张牌,你视为本回合没有使用过【杀】.`)
            .set('ai', () => {
              let player = get.player(),
                list = get.event('list');
              let value = get.value(player.getCards('h', { color: 'red' })) - get.value(player.getCards('h', { color: 'black' }));
              if (list.length > 2) {
                if (value > 0) return 'red';
                return 'black';
              } else {
                if (get.value(player.getCards('h')) < 20) return list[0];
                return 'cancel2';
              }
            })
            .set('list', list)
            .forResult('control');
          if (control === 'cancel2') {
            delete player.getStat('skill').zhuofengmrfz;
            return;
          }
          let cards = player.getCards('h').filter((i) => get.color(i) == control && player.canRecast(i));
          if (!cards) return;
          player.recast(cards);
          if (cards.length >= 2) player.draw();
          if (player.getStat('card').sha) {
            delete player.getStat('card').sha;
          }
        },
        ai: {
          order: 3,
          result: {
            player: 1,
          },
        },
      },
      qianggongmrfz: {
        mod: {
          targetInRange(card, player, target, now) {
            let mark = player.getStat('card').sha;
            if (card.name == 'sha' && (!mark || mark == 0)) return true;
          },
        },
        audio: 2,
        trigger: {
          player: 'useCard',
          source: 'damageEnd',
        },
        filter(event, player) {
          let mark = player.getStat('card').sha,
            storage = player.storage.qianggongmrfz;
          if (event.parent.name == '_lianhuan' || event.parent.name == '_lianhuan2') return false;
          if (mark && mark > 1) return false;
          return event.card && event.card.name == 'sha' && (!storage || event.card == storage);
        },
        forced: true,
        async content(event, trigger, player) {
          if (!player.storage.qianggongmrfz) {
            player.storage.qianggongmrfz = trigger.card;
            player
              .when({
                global: 'phaseBegin',
                player: 'useCardAfter',
              })
              .filter((event, player) => {
                let storage = player.storage.qianggongmrfz;
                if (event.name == 'phase') return true;
                return event.card && storage && event.card == storage;
              })
              .then(() => {
                delete player.storage.qianggongmrfz;
              });
          }
          if (trigger.name == 'useCard') {
            if (typeof trigger.baseDamage != 'number') trigger.baseDamage = 1;
            trigger.baseDamage++;
          } else {
            delete player.storage.qianggongmrfz;
            let skills = player.getStockSkills(true, true);
            const control = await player
              .chooseControl(skills)
              .set('prompt', '【抢攻】:请选择你要重置的技能')
              .set('ai', () => {
                let list = get.event('list'),
                  suffixs = ['used', 'round', 'block', 'blocker'],
                  skills = [];
                if (list.includes('zhuofengmrfz')) return 'zhuofengmrfz';
                for (let skill of list) {
                  let info = get.info(skill);
                  for (let key of suffixs) {
                    if (info[key]) skills.push(skill);
                  }
                }
                if (skills.length == 0) skills.push(list[0]);
                return skills.randomGet();
              })
              .set('list', skills)
              .forResult('control');
            if (!control) return;
            let skillx = [control];
            game.expandSkills(skillx);
            var resetSkills = [];
            var suffixs = ['used', 'round', 'block', 'blocker'];
            for (var skill of skillx) {
              var info = get.info(skill);
              if (typeof info.usable == 'number') {
                if (player.getStat('triggerSkill')[skill] && player.getStat('triggerSkill')[skill] >= 1) {
                  delete player.getStat('triggerSkill')[skill];
                  resetSkills.add(skill);
                }
                if (typeof get.skillCount(skill) == 'number' && get.skillCount(skill) >= 1) {
                  delete player.getStat('skill')[skill];
                  resetSkills.add(skill);
                }
              }
              if (info.round && player.storage[`${skill}_roundcount`]) {
                delete player.storage[`${skill}_roundcount`];
                resetSkills.add(skill);
              }
              if (player.storage[`temp_ban_${skill}`]) {
                delete player.storage[`temp_ban_${skill}`];
              }
              if (player.awakenedSkills.includes(skill)) {
                player.restoreSkill(skill);
                resetSkills.add(skill);
              }
              for (var suffix of suffixs) {
                if (player.hasSkill(skill + '_' + suffix)) {
                  player.removeSkill(skill + '_' + suffix);
                  resetSkills.add(skill);
                }
              }
            }
            if (resetSkills.length) {
              var str = '';
              for (var i of resetSkills) {
                str += `【${get.translation(i)}】、`;
              }
              game.log(player, '重置了技能', '#g' + str.slice(0, -1));
            }
          }
        },
      },
      // 锡人
      suximrfz: {
        audio: 2,
        trigger: { player: 'useCardAfter' },
        filter(event, player) {
          let cards = event.card.cards.filter((i) => player.hasUseTarget(i, false, false) && get.position(i) == 'd');
          return !event.card.cards.length && cards.length;
        },
        forced: true,
        async content(event, trigger, player) {
          let cards = trigger.card.cards.filter((i) => player.hasUseTarget(i, false, false) && get.position(i) == 'd');
          while (cards.length) {
            const links =
              cards.length == 1
                ? cards
                : await player
                  .chooseCardButton('【宿锡】:请选择你要使用的牌', cards)
                  .set('ai', (button) => get.player().getUseValue(button, null, true))
                  .forResult('links');
            if (!links) return;
            await player.chooseUseTarget(links[0]).set('nodistance', true).set('addCount', false);
            cards.remove(links[0]);
          }
        },
      },
      sanzhongmrfz: {
        init(player, skill) {
          player.storage[skill] = {
            basic: false,
            trick: false,
            equip: false,
          };
        },
        maps: {
          basic: 'tao',
          trick: 'shunshou',
          equip: 'wuzhong',
        },
        audio: 2,
        enable: 'chooseToUse',
        hiddenCard(player, name) {
          const maps = lib.skill.sanzhongmrfz.maps;
          if (!Object.values(maps).includes(name)) return false;
          for (let key in maps) {
            if (name == maps[key] && player.countCards('hes', { type: key }) > 0) return true;
          }
        },
        filter(event, player) {
          const types = Object.entries(player.storage.sanzhongmrfz)
            .filter(([key, value]) => value === false)
            .map(([key, value]) => key);
          const maps = lib.skill.sanzhongmrfz.maps;
          if (types.length < 1) return false;
          for (let type of types) {
            if (player.countCards('hes', { type: type }) < 1 || !event.filterCard({ name: maps[type] }, player, event)) continue;
            return true;
          }
        },
        chooseButton: {
          dialog(event, player) {
            const maps = lib.skill.sanzhongmrfz.maps;
            const swapped = {};
            Object.keys(maps).forEach((key) => {
              swapped[maps[key]] = key;
            });
            let list = [];
            for (let name of Object.values(maps)) {
              if (event.filterCard && event.filterCard({ name: name }, player, event)) {
                if (player.storage.sanzhongmrfz[swapped[name]] != false) continue;
                if (player.countCards('hes', { type: swapped[name] }) < 1) continue;
                if (get.type2(name) == 'trick') {
                  list.push(['锦囊', '', name]);
                } else if (get.type(name) == 'basic') {
                  list.push(['基本', '', name]);
                }
              }
            } //QQQ
            return ui.create.dialog('三众', [list, 'vcard']);
          },
          check(button) {
            if (_status.event.parent.type != 'phase') return 1;
            var player = _status.event.player;
            return player.getUseValue({
              name: button.link[2],
            });
          },
          backup(links, player) {
            return {
              filterCard(card) {
                const player = get.player();
                const maps = lib.skill.sanzhongmrfz.maps;
                const swapped = {};
                Object.keys(maps).forEach((key) => {
                  swapped[maps[key]] = key;
                });
                const name = lib.skill.sanzhongmrfz_backup.card;
                return get.type2(card) == swapped[name];
              },
              audio: 'sanzhongmrfz',
              popname: true,
              check(card) {
                return 8 - get.value(card);
              },
              position: 'hes',
              viewAs: { name: links[0][2] },
              card: links[0][2],
              precontent() {
                const maps = lib.skill.sanzhongmrfz.maps;
                const swapped = {};
                Object.keys(maps).forEach((key) => {
                  swapped[maps[key]] = key;
                });
                const name = lib.skill.sanzhongmrfz_backup.card;
                let type = swapped[name];
                player.storage.sanzhongmrfz[type] = true;
              },
            };
          },
          prompt(links, player) {
            const swapped = {};
            const maps = lib.skill.sanzhongmrfz.maps;
            const name = links[0][2];
            Object.keys(maps).forEach((key) => {
              swapped[maps[key]] = key;
            });
            return `将一张${get.translation(swapped[name])}牌当做${get.translation(name)}使用`;
          },
        },
        group: 'sanzhongmrfz_clear',
        subSkill: {
          clear: {
            charlotte: true,
            silent: true,
            forced: true,
            trigger: { global: 'phaseBegin' },
            content() {
              lib.skill.sanzhongmrfz.init(player, 'sanzhongmrfz');
            },
          },
        },
        ai: {
          order: 1,
          result: {
            player(player) {
              if (_status.event.dying) return get.attitude(player, _status.event.dying);
              return 1;
            },
          },
        },
      },
    },
    translate: {
      // 武将名
      friston3mrfz: '弗里斯腾',
      // 技能翻译
      shantanmrfz: '善谈',
      shantanmrfz_info: '①当有其他角色获得牌后,你可以摸一张牌,若你手牌是全场唯一最多的,本轮【善谈①】失效.</br>②每回合限一次,当其他角色有牌因弃置进入弃牌堆时,你可以弃置一张牌,令其获得其弃置的牌.',
      // 武将名
      talaidingzhenmrfz: '泰拉丁真',
      // 技能翻译
      xuebaomrfz: '学爆',
      xuebaomrfz_info: '锁定技,游戏开始时,你令其他所有角色失去技能描述大于50个字的技能,所有没有技能的角色和你获得【乱击】.',
      // 武将名
      shuangyemrfz: '霜叶',
      yueyuemrfz: '跃跃',
      lutuomrfz: '露托',
      shendianmrfz: '深靛',
      // 技能翻译
      canyinmrfz: '蚕吟',
      canyinmrfz_info: '①锁定技,出牌阶段开始时,你选择一种类型的牌,你本阶段不能使用该种类型的牌,若你选择的类型是:</br>1.基本:本阶段使用牌无距离限制且不可响应;</br>2.锦囊:摸两张牌;</br>3.装备:本阶段使用的第一张带有伤害类或回复类标签的牌伤害值或回复值+1.</br>②锁定技,当你击杀一名其他角色后,你将体力值调整至体力上限.',
      bingrenmrfz: '冰刃',
      bingrenmrfz_info: '当你[不因此技能而使用【杀】选择目标后/成为【杀】的目标后],你可以流失一点体力,你视为对[目标角色/杀的使用者]使用一张冰【杀】(不计入次数限制),若此杀造成伤害,[目标角色/杀的使用者]须弃置两张牌或翻面.',
      xiyumrfz: '嬉娱',
      xiyumrfz_info: '出牌阶段限一次,你可以将一张手牌交给一名其他角色,你对其视为使用一张【杀】(不计入次数限制),于此杀结算完毕后,你获得其手牌中与你交给其的牌花色相同的牌和与此杀结算过程中其使用或打出过的牌花色相同的牌.',
      zhengyimrfz: '整遗',
      zhengyimrfz_info: '当一名其他角色死亡后,你可以获得其区域内所有牌,因此获得的牌不计入手牌上限且当你使用此牌后,你将手牌补至X张.(X = 你的体力上限 + 你手牌中因<整遗>而获得的牌的数量)',
      daosimrfz: '悼思',
      daosimrfz_info: '若弃牌堆顶的牌不为装备牌,你可以将一张牌当做与弃牌堆顶牌同名的牌使用或打出.',
      fumumrfz: '缚目',
      fumumrfz_info: '锁定技,你使用的转化牌不可被响应;当你成为其他角色使用的转化牌或虚拟牌的目标时,取消之.',
      rouguangmrfz: '柔光',
      rouguangmrfz_info: '锁定技,你的手牌上限和额定摸牌数+X(至多为3);每轮开始时,若你于上一轮使用过三种类型的牌,X+1.',
      mizongmrfz: '迷踪',
      mizongmrfz_info: '出牌阶段限一次,你可以令你攻击范围内的任意角色或你获得其中一个效果:<br>1.直到该角色的出牌阶段开始时,所有当前时机可以使用的牌随机视为当前时机不可使用的牌(装备牌除外);<br>2.直到该角色的出牌阶段结束时,所有当前时机不可以使用的牌随机视为当前时机可使用的牌(装备牌除外).',
      //武将名
      acemrfz: 'Ace',
      baocunzhemrfz: '保存者',
      yizumikemrfz: '伊祖米克',
      kelisitengmrfz: '克丽斯腾',
      shuangxingmrfz: '霜星',
      donghenshuangxingmrfz: '<font color=#8dc2f6><b>冬痕</b></font>霜星',
      aiguozhemrfz: '爱国者',
      doushitalulamrfz_prefix: '斗士',
      doushitalulamrfz: '斗士塔露拉',
      aibulanamrfz: '爱布拉娜',
      teleixiyamrfz: '特蕾西娅',
      teleixisimrfz: '特雷西斯',
      qiaojiakelifumrfz: '桥夹克里夫',
      puruisaisimrfz: '普瑞赛斯',
      //技能翻译
      xingtumrfz: '星途',
      xingtumrfz_info: '出牌阶段限一次,你可以与至多两名其他角色各重铸一张牌,若有至少一半(向上取整)的角色与你重铸的牌颜色相同且你至少选择了一名其他角色,则你们各选择一项(所有角色整局游戏中每项只能选择一次):1.手牌上限+1;2.摸牌阶段摸牌数+1;3.使用【杀】的次数+1;4.将体力和手牌补至体力上限.',
      jiexiangmrfz: '揭相',
      jiexiangmrfz_info: '锁定技,当你死亡后,你摸X张牌并将你的牌依次分配给其他角色(每名角色至少分配一张牌),全场体力上限+1并回复一点体力.(X=你本局游戏因重铸获得的牌,X至少为存活角色数)',
      poqiongmrfz: '破穹',
      poqiongmrfz_info: '限定技,出牌阶段,你可以展示自己未以此法展示过的牌和弃置并展示牌堆顶的一张牌,若你展示的牌的点数更小,则你失去一点体力上限,你循环6次这个流程,若你展示的牌的点数大的次数多于牌堆展示牌的次数,你获得所有以此法展示的牌、增加3点体力上限、失去【星途】、获得【揭相】和【星游】.',
      poqiongmrfz_append: '<span style="font-family: yuanli">"如若此后百年千年,来人漫步于繁星身侧,人们便要称颂她的名."</span>',
      xingyoumrfz: '星游',
      xingyoumrfz_info: '①锁定技,每轮开始时,[其他角色/你]计算与[你/其他角色]的距离+1,若你不在任何一个其他角色的攻击范围内,你失去一点体力上限.②出牌阶段每种花色的牌限一次,你可以重铸一张牌.',
      shouwangmrfz: '守望',
      shouwangmrfz2: '保存',
      shouwangmrfz_info: '①锁定技,游戏开始时,你选择一名其他角色,其获得一个‘保存’标记;当你进入濒死状态时,你将体力回复至一点;当有‘保存’标记的角色死亡时,你失去所有的体力上限.②当你不因【守望②】摸牌时,你可以令拥有‘保存’标记的角色摸一张牌;当拥有‘保存’标记的角色不因【守望②】摸牌的时,其可以令你摸一张牌.',
      jingmomrfz: '静默',
      jingmomrfz_info: '锁定技,你的手牌上限视为5;每轮开始时,你失去一点体力上限.',
      xijimrfz: '希冀',
      xijimrfz_info: '①出牌阶段,若你的体力上限不大于5,你可以失去所有体力上限并摸X张牌(X=你的体力上限的一半,向下取整,X∈[1,3]).②当你死亡时,你可以将你区域内所有的牌交给一名其他角色,你每交给其一张牌,其下个回合使用【杀】的次数和攻击距离便+1.',
      sizhanmrfz: '死战',
      sizhanmrfz_info: '限定技,锁定技,当你死亡时,你于主公回合结束时复活且插入一个回合且此回合你获得如下效果:①你的伤害基数改为2;②摸牌阶段,你额外摸X张牌;③你的基本牌均视为【杀】且使用杀无距离限制;④回合结束,你立刻死亡.(X=当前轮次数,X至多为5)',
      guanyongmrfz: '冠勇',
      guanyongmrfz_info: '出牌阶段,当你使用的【杀】指定目标时,你弃置其一张牌,若此牌为基本牌,则此【杀】不可被【闪】响应,否则,你摸两张牌,本回合使用杀的次数+1(若不处于因【死战】而获得的回合,则至多+2).',
      chanshimrfz: '阐释',
      chanshimrfz_info: '每回合限一次,每轮开始时或你造成伤害后,你可以从两张武将牌中选择并获得其中一个技能.',
      xuexingmrfz: '雪行',
      xuexingmrfz_info: '①锁定技,你不能成为冰【杀】的目标;当你于出牌阶段外因弃置而失去手牌后,你摸一张牌.②你可以将黑色牌当作冰【杀】使用或打出.',
      chegumrfz: '彻骨',
      chegumrfz_info: '当你使用牌指定一名其他角色为目标后,你可以令其[装备区/武将牌上的技能]中所有[牌名/技能名]且描述中没有<冰>的[牌/技能]失效(宝物栏的牌除外)直到其下个回合结束.',
      newchegumrfz: '彻骨',
      newchegumrfz_info: '当你使用牌指定一名其他角色为目标后,你可以令其[装备区/武将牌上的技能]中所有[牌名/技能名]且描述中没有<冰>的[牌/技能]失效(宝物栏的牌除外)直到其下个回合结束.',
      donghenmrfz: '冬痕',
      donghenmrfz_info: '当你进入濒死状态时,你可以增加一点体力上限并将体力调整至体力上限,你失去【冬痕】和【雪行】,获得【燃命】且使用【杀】的次数+1.',
      ranmingmrfz: '燃命',
      ranmingmrfz_info: '①锁定技,当你造成伤害后,你失去一点体力值;当你失去手牌时,你摸一张牌;当你回复体力值时,取消之.②你可以将一张牌当作冰【杀】使用或打出.',
      junxingmrfz: '军行',
      junxingmrfz_info: '①你每回合的第X个阶段结束时,你可以与你一名攻击范围内的其他角色进行拼点,若你赢,你视为对其使用一张【杀】,反之,其视为对你使用一张【杀】.(X=你本回合造成的伤害数)</br>②锁定技,体力值不大于你的其他角色不能响应你使用的牌.</br>③锁定技,当你已损失体力值小于2时,你获得【同协】,反之你每回合的第一张【杀】额外结算一次.',
      youjimrfz: '游击',
      youjimrfz_info: '锁定技,回合开始时,你选择以任意顺序执行本回合的所有阶段.',
      juhuomrfz: '聚火',
      juhuomrfz_info: '每回合限一次,当你使用带有伤害类标签的牌结算完毕后,若此牌造成过伤害,你可以增加X点体力上限,若此牌的点数大于你的体力值,你将手牌补至体力上限,反之你将体力上限调整至与该牌点数相同并将体力值回复至体力上限.(X=此牌造成的伤害数)',
      xuehengmrfz: '血恨',
      xuehengmrfz_info: '觉醒技,回合开始时,若你体力上限不少于存活角色数,你失去【聚火】且:若你的手牌数大于你的体力值且没有与你胜利条件一致的角色死亡,获得【熯天】,反之你将身份牌变为内奸(如果你是主公则改为将其余角色的身份牌均变为反贼),获得【失魂】.你将体力值调整至体力上限',
      hantianmrfz: '熯天',
      hantianmrfz_info: '①锁定技,准备阶段,若场上没有角色有‘志城’标记,你令与你胜利条件相同的其他角色和你获得‘志城’标记,所有拥有‘志城’标记的角色将体力上限和体力值调整至所有有‘志城’标记的角色中的体力上限的最大值.②当拥有‘志城’标记的角色使用的【杀】结算完毕后,其他有‘志城’标记的角色可以对此杀的目标使用一张【杀】并摸一张牌.',
      shihunmrfz: '失魂',
      shihunmrfz_info: '锁定技,准备阶段,你对所有角色造成两点火属性伤害;当你受到大于1点的伤害时,你将伤害值调整至1点;你使用牌无次数限制;结束阶段,你摸X张牌.(X=已死亡的角色数)',
      budaomrfz: '布道',
      budaomrfz_info: '①出牌阶段,你可以将一张黑色牌置于你攻击范围内的一名其他角色的判定区.②锁定技,摸牌阶段你额外摸X张牌(X=场上判定区内牌的数量).',
      zhuranmrfz: '逐燃',
      zhuranmrfz_info: '锁定技,其他角色的回合开始阶段,',
      bojimrfz: '博济',
      bojimrfz_info: '出牌阶段限一次,你可以展示一张手牌,其他角色依次展示一张手牌,与你展示的牌颜色相同的角色和你被称为<博济角色>,直到你的下个出牌阶段开始时,所有<博济角色>可以将其他<博济角色>的手牌如手牌般使用或打出且当你的手牌小于X时,你将手牌补至X张(X = <博济角色>数).<br><span style="font-family: yuanli">"如有博施于民,而能济众,何如？可谓仁乎？"</span>',
      caijianmrfz: '裁剪',
      caijianmrfz_info: '锁定技,当你死亡时,击杀你的角色弃置区域内所有牌、失去武将牌上的所有技能并且复原武将牌,其随机获得场上角色武将牌上的两个技能并摸3张牌.<br><span style="font-family: yuanli">"你葬送我的未来,我剪断你的过去."</span>',
      yuanfumrfz: '怨府',
      yuanfumrfz_info: '锁定技,摸牌阶段结束时,你展示一张手牌,其他角色不能在非濒死状态下使用或打出与你展示的牌相同的手牌且你于本回合结束时失去一点体力并摸X张牌.(X = 你本回合造成的伤害,X至多为5)<br><span style="font-family: yuanli">"皇太子副主,望其所爱,硕帝之宠臣,而子违之,所谓三怨成府者也."</span>',
      fenzhoumrfz: '焚舟',
      fenzhoumrfz_info: '出牌阶段限一次,你可以废除你的一个装备栏,所有其他角色选择一项:1.弃置一张牌,本回合其下次受到的伤害+1;2.交给你一张牌,本回合你使用【杀】的次数+1;3.令你摸一张牌,本回合你下次造成的伤害+1.<br><span style="font-family: yuanli">"秦伯伐晋,济河焚舟."</span>',
      jujumrfz: '踽踽',
      jujumrfz_info: '锁定技,准备阶段,若你有被废弃的装备栏且你击杀过一名其他角色,你选择流失一点体力或失去一点体力上限,你回复一个装备栏.<br><span style="font-family: yuanli">"有杕之杜,其叶湑湑,独行踽踽."</span>',
      chongxiemrfz: '统械',
      chongxiemrfz_info: '当你使用杀指定目标后,你可以弃置你或其中一名目标角色一张手牌,如果弃置的是你的牌,你摸一张牌.若弃置的牌为:黑色,此杀不计入次数限制;红色,你获得一个<弹药>',
      qj_chongjimrfz: '铳击',
      qj_chongjimrfz_info: '出牌阶段,你可以消耗一枚<弹药>,视为使用一张雷【杀】(无距离限制)',
      leitingmrfz: '雷霆',
      leitingmrfz_info: '限定技,出牌阶段开始时,你可以消耗6枚<弹药>,选择一名角色,视为对其使用6张雷杀,若其本回合死亡,你重置此技能.',
      bianyimrfz: '编译',
      bianyimrfz_info: '每轮开始时或你造成伤害后,你可以随机抽取100个技能名,从这100个技能名随机抽取50个汉字,你在30秒内从这些汉字中选择两个汉字,使其组成一个技能名,若此技能名存在于技能库中,你获得此技能.',
      talula_shixinmrfz: '拾薪',
      talula_shixinmrfz_info: '当你造成伤害后,你可以选择其各区域内的一张牌,将这些牌任意分配给任意角色.',
      zhuoximrfz: '灼息',
      zhuoximrfz_info: '每回合每种类型的牌各限一次,当你使用一张牌后,你可以对一名与你距离为X的其他角色造成1点火焰伤害(X=你的体力值).',
      //————武将分组————//
      yibiliyamrfz: '伊比利亚',
      luodedaomrfz: '罗德岛',
      luodedaojymrfz: '罗德岛精英干员',
      laitaniyamrfz: '莱塔尼亚',
      xielagemrfz: '谢拉格',
      xulagumrfz: '叙拉古',
      babietamrfz: '巴别塔',
      haisimrfz: '海嗣',
      shenhailierenmrfz: '深海猎人',
      qiewuliumrfz: '企鹅物流',
      kaximiermrfz: '卡西米尔',
      gelunbiyamrfz: '哥伦比亚',
      heigangguojimrfz: '哥伦比亚-黑钢国际',
      longmenmrfz: '龙门警卫司',
      weiduoliyamrfz: '维多利亚',
      latelanmrfz: '拉特兰',
      shitumrfz: '使徒', //摩托车三人组
      wusasimrfz: '乌萨斯',
      saergongmrfz: '萨尔贡',
      liandongmrfz: '联动干员',
      yansuimrfz: '炎-岁兽',
      lishimrfz: '鲤氏侦探事务所',
      xisitamrfz: '汐斯塔',
      hongsongqstmrfz: '红松骑士团',
      dongguomrfz: '东',
      yanguomrfz: '炎',
      laiyinmrfz: '莱茵生命',
      shenchimrfz: '深池',
      qianwenmingmrfz: '前文明',
      minuosimrfz: '米诺斯',
      samigroupmrfz: '萨米',
      SWEEPmrfz: 'S.W.E.E.P',
      zhengheyundongmrfz: '整合运动',
      leimubituomrfz: '雷姆必拓',
      boliwaermrfz: '玻利瓦尔',
      //————干员翻译————//
      amiyamrfz: '阿米娅',
      spamiyamrfz: '近卫阿米娅',
      spamiyamrfz_prefix: '近卫',
      fulankamrfz: '芙兰卡',
      xingjimrfz: '星极',
      xingyuanmrfz: '星源',
      zhanchemrfz: '战车',
      shanjimrfz: '闪击',
      shuanghuamrfz: '霜华',
      bohuimrfz: '柏喙',
      baimianxiaomrfz: '白面鸮',
      cimeimrfz: '刺玫',
      hongmrfz: '红',
      dekesasimrfz: '德克萨斯',
      baijinmrfz: '白金',
      yintuoluomrfz: '因陀罗',
      wenmimrfz: '温米',
      meiermrfz: '梅尔',
      lindongmrfz: '凛冬',
      yunxingmrfz: '陨星',
      yumaobimrfz: '羽毛笔',
      ailisimrfz: '爱丽丝',
      tianhuomrfz: '天火',
      linguangmrfz: '临光',
      haimomrfz: '海沫',
      xiaomanmrfz: '小满',
      wanqingmrfz: '万顷',
      gelaokesimrfz: '格劳克斯',
      haidimrfz: '海蒂',
      yaxinmrfz: '崖心',
      chuxuemrfz: '初雪',
      shixiemrfz: '狮蝎',
      hongsunmrfz: '红隼',
      xiyinmrfz: '稀音',
      yemomrfz: '夜魔',
      jingzhemrfz: '惊蛰',
      longshelanmrfz: '龙舌兰',
      docmrfz: '医生',
      innamrfz: '双月',
      linshimrfz: '凛视',
      medical_amiyamrfz: '医疗阿米娅',
      medical_amiyamrfz_prefix: '医疗',
      spfenmrfz: '历阵锐枪芬',
      spfenmrfz_prefix: '历阵锐枪',
      hainimrfz: '海霓',
      shenxunmrfz: '深巡',
      mingjiaomrfz: '明椒',
      daifeienmrfz: '戴菲恩',
      xirenmrfz: '锡人',
      //————杂七杂八————//
      visible_shenshemrfz: '明置',
      //————技能翻译————//
      amy_qingyanmrfz: '青焱',
      amy_qingyanmrfz_info: '①锁定技,[你使用【杀】的次数+1],{你每回合使用的第一张【杀】的伤害基数+1},(你使用的【杀】需要两张【闪】才可抵消).</br>②出牌阶段结束时,你可以删除【青焱①】中[]、{}或()的内容直到本轮结束,令一名其他角色获得你删除的内容的效果直到其回合结束.',
      yingxiaomrfz: '影霄',
      yingxiaomrfz_info: '限定技,准备阶段,若你已经使用了至少5张【杀】,你可以依次使用1张雷【杀】、1张火【杀】和1张伤害基数+2且无视防具的【杀】(目标必须合法),结算完成后,你摸X张牌、手牌上限+X且接下来两轮内,你造成的伤害均为体力流失.(X=你因此技能使用的【杀】造成的伤害数)',
      jifengmrfz: '极锋',
      jifengmrfz_info: '当你使用【杀】选择唯一目标后,你可以执行所有符合条件的选项:1.若其防具栏不为空,你无视其防具;2.若其有护甲值,你无视此护甲;3.若其有手牌,此【杀】须要两张【闪】才可抵消,若你本回没有使用过此技能,你摸X张牌.(X=未执行的选项数)',
      xiqiaomrfz: '细巧',
      xiqiaomrfz_info: '每回合限一次,当你需要使用或打出【闪】时,你可以弃置一张牌,摸一张牌并展示之,若与你弃置的牌类别不同,视为你使用或打出了一张【闪】.',
      tianyimrfz: '天仪',
      tianyimrfz_info: '转换技,一名角色的判定阶段,你可以,阳:观看牌堆顶两张牌,并将其置于牌堆顶或牌堆底;阴:进行一次判定,并获得判定牌,本回合此牌视为【闪】,若判定结果为♣️️,你本局游戏使用【杀】的次数+1(至多+3).',
      huijianmrfz: '辉剑',
      huijianmrfz_info: '出牌阶段限一次,当你使用单一目标的基本和普通锦囊牌选择目标后,若【天仪】状态为阴,你可以令此牌额外指定任意名(至多为你本回合剩余使用【杀】的次数)其他角色为目标(目标必须合法),你本阶段减少等量使用【杀】的次数.',
      bingmingmrfz: '病鸣',
      bingmingmrfz_info: '锁定技,第二轮开始时,若场上有星源,你将手牌和手牌上限调整至与其一致.',
      daoliumrfz: '导流',
      daoliumrfz_info: '出牌阶段限两次,你可以选择一名其他角色并交给其一张牌,其须分别交给其上家和下家(你除外)各一张牌,因此获得牌的角色均须弃置一张牌.',
      gewumrfz: '格物',
      gewumrfz_info: '锁定技,每当其他角色获得你的牌后,你的手牌上限+1(至多为5),你记录此牌的牌名(每种牌名的牌仅记录一次);每当你【格物】记录的牌名的牌的数量是[2/4]的整数倍时,[你摸一张牌/你的摸牌阶段额定摸牌数+1].',
      jiqiangmrfz: '机枪',
      jiqiangmrfz_info: '锁定技,游戏开始时,你将【DP27】置入你的装备区;准备阶段,若你装备区没有【DP27】,你将【DP27】置入你的装备区',
      qingxiemrfz: '倾泻',
      qingxiemrfz_info: '摸牌阶段结束后,若你的出牌阶段将不会被跳过,你可以选择攻击范围内的一名其他角色,你进行三次判定,你对其使用等同于判定结果为红色的次数张【杀】(不计入次数限制),若你因此使用了至少两张【杀】,你跳过出牌阶段.',
      shandunmrfz: '闪盾',
      shandunmrfz_info: '锁定技,若你于本轮[有/没有]执行过回合,其他角色与你和你与其他角色计算的距离[-1/+1].',
      xuanmumrfz: '炫目',
      xuanmumrfz_info: '每轮限四次,当你使用单一目标的基本牌或普通锦囊牌选择了其他角色为目标后,且你与其的距离不大于1,你可以展示其一张手牌,若其展示的牌不能响应你对其使用的牌,则其不能响应此牌且你获得其一张手牌.',
      chuandunmrfz: '穿盾',
      chuandunmrfz_info: '锁定技,当你受到伤害后,你摸一张牌并展示之,若此牌的花色和点数为♠️️6或♥️️6,你失去<span style="text-decoration:line-through">999点</span>所有体力.',
      chuandunmrfz_append: 'THX,Ubi',
      tadianmrfz: '踏垫',
      tadianmrfz_info: '①锁定技,每轮开始时,你摸三张牌并获得场上所有的‘踏垫’,将三张手牌置于你的武将牌(其他角色不可见)上,称之为‘踏垫’.②当你成为其他角色使用牌的目标后,你可以弃置一张与其使用的牌的牌名相同的‘踏垫’并摸三张牌,其流失所有体力,其脱离濒死状态后回复一点体力.',
      xinjimrfz: '心机',
      xinjimrfz_info: '准备阶段,你可以用任意数量的手牌交换‘踏垫’.',
      shehunmrfz: '摄魂',
      shehunmrfz_info: '锁定技,你使用【杀】的次数+X.(X=你本局游戏造成伤害的数量,X至多为5)',
      yirenmrfz: '异刃',
      yirenmrfz_info: '蓄力技(1/15).①锁定技,回合结束时,你增加X点蓄力值.(X=本回合出牌阶段剩余使用【杀】的次数)②出牌阶段,你可以消耗[ 1 ]点蓄力值,弃置两张手牌并选择至多两名其他角色,视为你对其各使用一张【杀】(目标必须合法且不计入次数限制)且其下个回合使用【杀】的次数-1,令[ ]中的数字+1(至多为5).',
      jinaomrfz: '机脑',
      jinaomrfz_info: '锁定技.</br>①在一个回合内,当使用第二张牌后,若第二张牌的点数大于第一张牌的点数,则你本回合使用的牌的点数必须为 { 递增 } ,反之为 { 递减 } ,本回合当你使用手牌中点数[最大/最小]或之一的牌后,你调换两处{}内的描述并摸一张牌;每名角色的回合结束时,你将【机脑】的描述回复至游戏开始时的描述.</br>②当你使用一张[黑色/红色]牌后,若此牌与你本回合上一张使用的牌颜色相同,你[本回合手牌上限+1/摸两张牌].',
      wutaimrfz: '五肽',
      wutaimrfz_info: '结束阶段,你可以弃置两张颜色或类型不同的手牌,令一名角色每回合第一次受到的伤害-1直到你的下个回合开始.',
      huabumrfz: '花卜',
      huabumrfz_info: '其他角色出牌阶段限一次,其可以令你摸一张牌,你猜测其手牌中是否有与此牌类型相同的牌,若你猜测正确,你与其各摸一张牌,反之你弃置一张牌.',
      shixinmrfz: '识心',
      shixinmrfz_info: '每回合限一次,当你于回合外获得牌后,你可以观看当前回合角色的手牌.',
      qunlangmrfz: '群狼',
      qunlangmrfz_info: '隐匿技,当你登场时,你可以对你攻击范围内的一名其他角色造成一点伤害.',
      cigumrfz: '刺骨',
      cigumrfz_info: '①锁定技,你的非属性【杀】均视为刺【杀】.</br>②当其他角色响应你使用的牌后,你可以获得其响应的牌.',
      qingchumrfz: '清处',
      qingchumrfz_info: '你的回合外,你获得如下效果:</br>1.你可以将【闪】当【杀】,【杀】当【闪】使用或打出;</br>2.当你使用或打出【杀】后,你可以弃置当前回合角色的一张牌,若此牌与你使用或打出的【杀】花色相同,你重复这个流程.',
      sudimrfz: '速递',
      sudimrfz_info: '每轮开始时,你可以摸两张牌并将这两张牌分配给任意角色.',
      jianyumrfz: '剑雨',
      jianyumrfz_info: '出牌阶段限一次,你可以展示牌堆顶四张牌,你将至少X张牌当作【万箭齐发】对至多等同于你选择牌的数量名其他角色使用,因此受到伤害的角色下个出牌阶段使用【杀】的次数-1(不可叠加).(X=因此展示牌的花色数)',
      xujimrfz: '蓄击',
      xujimrfz_info: '弃牌阶段开始时,若你本回合出牌阶段没有使用牌指定其他角色为目标,你可以令你下一张【杀】的伤害基数+1,你选择一项:1.摸[ 2 ]张牌且本回合手牌上限+5;2.使用一张【杀】且此杀需要[ 2 ]张【闪】才可抵消.',
      shiyumrfz: '视域',
      shiyumrfz_info: '觉醒技,当你一次造成至少两点伤害后,你获得如下效果并令【蓄击】中[ ]内的数字+1:</br>1.攻击距离+1;</br>2.攻击范围内的其他角色的手牌均对你可见.',
      suijiamrfz: '碎甲',
      suijiamrfz_info: '锁定技,当你造成伤害时,[ 若其有护甲 ],则此伤害+{ 1 }.',
      huquanmrfz: '虎拳',
      huquanmrfz_info: '每回合限一次,当你需要使用【闪】或【无懈可击】时,你可以将一张点数不小于6的手牌当作【闪】或【无懈可击】使用或打出,你选择一项:1.删除【碎甲】中[ ]内的描述直到你下个回合结束;2.令【碎甲】中{ }内的数字+1直到你下个回合结束.',
      baiweimrfz: '百味',
      baiweimrfz_info: '①锁定技,当一名角色使用或打出一张普通锦囊或基本牌时,你记录之(可重复记录),若该角色不为你且于你的回合外,此技能本回合失效.②你可以将任意张手牌当作你【百味①】记录过的相同字数的基本或普通锦囊牌使用或打出,你将此牌从【百味①】的记录中移除.',
      nuanxiangmrfz: '暖香',
      nuanxiangmrfz_info: '每回合限一次,当你使用或打出的一张转化牌结算完毕后,你可以令至多X名角色摸一张牌.(X=该牌对应的实体牌数)',
      shuitamrfz: '水獭',
      shuitamrfzx: '咪啵',
      shuitamrfz_info: '锁定技,游戏开始时,你标记你的至多三张手牌为‘咪啵’并选择获得【爆破】和【自毁】中的一个技能;‘咪啵’不占用你的手牌上限;当‘咪啵’进入弃牌堆后,你将其置于你的武将牌上,于一名角色回合结束后获得你以此法置于武将牌上的一张牌.',
      baopomrfz: '爆破',
      baopomrfz_info: '限定技,准备阶段,你可以移除你手牌中所有的‘咪啵’标记,令至多三名其他角色进行判定,若为红,其受到一点火焰伤害并翻面,你获得所有的判定牌并将这些牌标记为‘咪啵’.',
      mihuomrfz: '迷惑',
      mihuomrfz_info: '当你受到伤害时,你可以令伤害来源展示你的一张手牌,若此牌有‘咪啵’标记,弃置之,此伤害-1.',
      xianlingmrfz: '先领',
      xianlingmrfz_info: '每轮开始时,你可以使用一张牌(无距离限制),若你手牌中没有能够使用的牌,你摸一张牌,你重复这个流程直到有能使用的牌.若不为第一轮,你可以令一名其他角色也执行一次此流程.',
      dongjiangmrfz: '冬将',
      dongjiangmrfz_info: '准备阶段,你可以将你的所有手牌分配给任意名其他角色,视为使用一张【杀】,若此牌造成伤害,你将手牌补至3张.',
      zhimingmrfz: '祗铭',
      zhimingmrfz_info: '每回合限一次,你可以将一张牌当作与本局游戏中你获得过的‘铭’的同名牌(装备牌和延时锦囊牌除外)使用或打出.',
      yxliumingmrfz: '流铭',
      yxliumingmrfz_info: '①锁定技,一名角色的回合开始时,若你武将牌上没有‘铭’,你将牌堆顶的一张牌置于你的武将牌上,称之为‘铭’.②锁定技,当你成为其他角色使用的牌的目标后,若此牌[花色/点数]与‘铭’[相同/不同],则[你获得武将牌上的‘铭’/其须弃置一张与‘铭’类型一致的牌,否则此牌对你无效且你失去此技能直到本回合结束].③你可以使用‘铭’.',
      dingyuanmrfz: '定愿',
      dingyuanmrfz_info: '觉醒技,准备阶段,若你于本局游戏中置于武将牌上过至少三张‘铭’,你失去一点体力上限并获得技能【祗铭】.',
      tiaojiumrfz: '调酒',
      tiaojiumrfz_info: '①你可以将两张颜色不同的手牌当作【酒】使用.</br>②锁定技,你使用的【酒】的描述中‘本回合目标角色下一张使用的【杀】的伤害值基数+1’改成‘本回合目标角色下一张使用的基本牌(【酒】除外)和非延时锦囊牌额外结算一次’.',
      rujingmrfz: '入境',
      rujingmrfz_info: '①锁定技,当你使用牌后,你记录此牌的点数和花色.②出牌阶段每项限一次,当你使用牌时,若【入境①】中包含此牌的[①点数/②花色],你可以令此牌额外结算一次,你清除【入境①】中记录的该[①点数/②花色]且此牌的点数和花色不能被【入境①】记录.',
      alsmengxiangmrfz: '梦乡',
      alsmengxiangmrfz_info: '一名角色出牌阶段开始时,若该角色本回合执行过出牌阶段,则你选择至多三张不带有伤害类标签的基本牌或普通锦囊牌,令其记录之,其的手牌于需要使用时均视为记录的牌名中的第一张牌直到此阶段结束,且当其使用或打出有对应实体牌的牌时,移除这些牌中的第一张牌',
      rumianmrfz: '入眠',
      rumianmrfz_info: '当你受到伤害后,或你的弃牌阶段结束时,你可以令一名角色在其结束阶段开始时执行一个出牌阶段.',
      zhuihuomrfz: '坠火',
      zhuihuomrfz_info: '出牌阶段每名角色限一次,你可以将【火攻】或火【杀】置于一名其他角色的判定区,其判定阶段开始时须选择弃置两张牌或受到一点火焰伤害,将因此置于判定区的牌置入弃牌堆.',
      yihuomrfz: '溢火',
      yihuomrfz_info: '锁定技.</br>①每回合限两次,当其他角色受到火焰伤害后,你摸两张牌.</br>②当你于一次获得了至少两张牌后,你选择其中一张牌,你将此牌视为火【杀】,若这些牌颜色全部相同,你摸一张牌.</br>③当你受到火焰伤害时,你摸三张牌并防止此次伤害.',
      anranmrfz: '黯然',
      anranmrfz_info: '锁定技,游戏开始时,你弃置所有手牌,你于你的第一个回合开始时,你摸2X张牌,失去所有护甲,回复一点体力值,且本回合跳过弃牌阶段.(X=你的体力值和护甲值之和)',
      huchimrfz: '互持',
      huchimrfz_info: '每项每回合限一次:</br>①当你[令一名其他角色/其他角色令你]回复一点体力,[其/你]可以交给回复来源一张牌,你与其各摸一张牌.</br>②当[你/其他角色]获得[其他角色/你]的牌后,[你/其]可以交给[其/你]一张牌,你与其各摸一张牌.</br>③出牌阶段,你可以将一张牌交给一名其他角色,其可以将此牌当作【杀】对其攻击范围内的角色使用.',
      chongyaomrfz: '重耀',
      chongyaomrfz_info: '觉醒技,当你发动过至少五次【互持】后,你减少一点体力上限并获得【逐光】.',
      kenyemrfz: '垦野',
      kenyemrfz_info: '当一名角色于本回合第一次使用一种类型的牌时,你可以将此牌置于其武将牌上并取消此牌的所有目标,其回合结束时将武将牌上的每张牌视为【无中生有】或【桃】使用.</br><span style="font-family: yuanli">解民济,饱餐时,良田出国土.<br>荒难生,民改之,万物生如此.</span>',
      xunchaomrfz: '寻潮',
      xunchaomrfz_info: '出牌阶段限一次,你可以将任意张类型不同的手牌交给一名[手牌数/体力值/装备区牌数]大于你的的其他角色,你执行前等同于你交给其的牌数量项:</br>1.回复一点体力;</br>2.将手牌调整至与该角色一致;</br>3.你下次造成的伤害+1.',
      paoyingmrfz: '泡影',
      paoyingmrfz_info: '锁定技,准备阶段,若你的手牌数大于你的体力值且你已受伤,你将你的手牌调整至与你体力值一致,回复等同于你弃置的牌的数量(至多为2)点体力.',
      mushoumrfz: '牧兽',
      mushoumrfz_info: '当一名其他角色回合结束时,你可以使用其本回合因弃置而进入弃牌堆的牌.',
      guantianmrfz: '观天',
      guantianmrfz_info: '锁定技,你的回合内,当有角色不因此技能而从牌堆中获得牌时,改为卜算X.(X=此次摸牌数)',
      yingfengmrfz: '应风',
      yingfengmrfz_info: '回合开始时,你可以选择跳过本回合前任意个阶段,并于回合结束后令至多等量名角色摸等量/2(向下取整)张牌,若选择跳过的阶段大于4,你失去一个技能.',
      cichongmrfz: '磁冲',
      cichongmrfz_info: '①锁定技,你对无法成为你使用的【杀】的目标的角色造成的伤害+1.</br>②出牌阶段,你可以弃置一张本回合未以此法弃置过的类型的牌,选择一名其他角色,其须弃置一张【闪】或防具牌,否则你对其造成一点伤害.',
      ganraomrfz: '干扰',
      ganraomrfz_info: '每名角色每回合限一次,当你对一名其他角色造成伤害时,你可以声明一张牌,其本回合不能使用与你声明的牌相同牌名的牌.',
      anxinmrfz: '暗信',
      anxinmrfz_info: '当其他角色获得你的牌后,你可以声明一张基本牌或普通锦囊牌,该角色将此牌视为你声明的牌,当其使用此牌后,你摸一张牌.',
      gongchoumrfz: '觥筹',
      gongchoumrfz_info: '出牌阶段限一次,你可以令所有其他角色交给你一张手牌,你交给以此法交给你牌的所有角色一张牌.',
      yinshimrfz: '隐市',
      yinshimrfz_info: '锁定技,你的回合外,你不能成为任意角色于本回合使用的前X张牌的目标.(X=你有牌的区域数)',
      lingdingmrfz: '凌顶',
      lingdingmrfz_info: '当你使用或打出牌时,你记录之,若你记录的牌数不小于 [ 1 ],你可以摸 [ 1 ] 张牌,你令 [ ] 中的数字+1(不能超过你的体力上限)并清除此技能你记录的牌',
      yabengmrfz: '崖崩',
      yabengmrfz_info: '锁定技,当你进入濒死状态时,你重置【凌顶】并摸X张牌.(X=【凌顶】记录的牌的数量,X至多为2)',
      shengnvmrfz: '圣女',
      shengnvmrfz_info: '出牌阶段限一次,你可以选择两名其他角色,这两名角色同时选择一项:<br>1.收回所有装备区的牌;<br>2.将一张手牌当作【乐不思蜀】置入其的判定区;<br>3.不能响应下一张指定其为目标的基本牌或普通锦囊牌.<br>若这些角色选择的选项不同,你获得这些角色一张牌,反之你摸两张牌.',
      shenshemrfz: '神慑',
      shenshemrfz_info: '锁定技.<br>①结束阶段,若你没有明置的手牌,你明置你的手牌<br>②当你成为其他角色使用的带有伤害类标签的牌的目标后,若此牌的点数不大于你明置的牌中点数最大的一张牌,则其须弃置手牌区和装备区内各一张牌.',
      xiedumrfz: '蝎毒',
      xiedumrfz_info: '①锁定技,你的【毒】视为【杀】.<br>②当你[使用的【杀】/于回合外]对一名其他角色造成伤害后,你可以选择其一张牌(若为装备区的牌则改为弃置之),其将此牌转化为【毒】.',
      lijimrfz: '力积',
      lijimrfz_info: '锁定技,你使用的【杀】需要X张【闪】才可抵消.(X=本回合你使用的牌的花色数)',
      qianzongmrfz: '潜踪',
      qianzongmrfz_info: '①隐匿技,当你登场后,若当前回合角色不为你,你可以对当前回合角色造成一点伤害,反之,你摸一张牌或回复一点体力.<br>②你的回合结束时,若你本回合没有因弃置而失去牌,你可以进入隐匿状态.',
      chihenmrfz: '齿痕',
      chihenmrfz_info: '锁定技,你的弃牌阶段开始时,若你防具栏有牌,你令至多X名角色获得一个<护>标记;拥有<护>标记的角色手牌上限+X,且成为带有伤害类标签的牌的目标后,若使用者的体力值不大于你的体力值,使用者须弃置一张牌,否则此牌对该角色无效,该角色移除一个<护>标记.(X=该角色‘护’标记的数量)',
      haomingmrfz: '号鸣',
      haomingmrfz_info: '①当你于回合内第一次造成伤害后,你可以从牌堆中获得一张指定类型的牌.<br>②结束阶段,你可以视为一张【决斗】,受到伤害的角色须弃置一半的手牌(向上取整)且其使用牌不能指定有<护>的角色为目标直到其回合结束.<br>③出牌阶段限一次,你可以弃置任意张手牌,从牌堆中获得一张牌名字数等同于弃置的牌数的牌.',
      sheyingmrfz: '摄影',
      sheyingmrfz_info: '①出牌阶段限两次,若场上【镜头】的数量少于4,你可以弃置一张牌,选择将一张【镜头】置入一名其他角色的装备栏.②锁定技,当场上有【镜头】时,你的手牌上限+2,其他角色计算与你的距离+1.',
      jingtoumrfz_show: '镜头',
      jingtoumrfz_show_info: '·武器牌 ♥️️7 攻击距离1<br>·防具牌 ♣️️7<br>·进攻马/防御马 ♠️️7 攻击距离+1/防御距离-1<br>·宝具栏 ♦️️7<br>锁定技,你的手牌始终明置;你始终视为在其他角色的攻击范围内;此牌离开你的装备区时,销毁之.',
      chaozaimrfz: '超载',
      chaozaimrfz_info: '回合开始时,若场上有【镜头】,你可以令所有角色获得如下效果直到你下个回合开始且你下个回合开始时弃置场上所有的【镜头】并摸等量的牌(不计入手牌上限且点数视为7):<br>当你使用牌指定目标后,若该角色装备区内有【镜头】:1.此牌点数[不小于/不大于]【镜头】的点数,则此牌[伤害基数+1/不可响应];2.其装备区内有与此牌花色相同的【镜头】,于此牌结算完成后视为对其使用一张相同的牌(不计入次数限制).',
      biaolimrfz: '表里',
      biaolimrfz_info: '锁定技,出牌阶段开始时,你摸三张牌,若这些牌中[红/黑]色的牌的数量不少于2,则你因此技能而获得的牌视为[【桃】(可以于出牌阶段对任意角色使用)/【杀】(对体力值不小于你的角色无距离限制且不计入使用次数)].',
      ymkongwomrfz: '控我',
      ymkongwomrfz_info: '摸牌阶段结束时,你可以弃置一张牌,观看牌堆顶两张牌,并以任意的顺序将其置于牌堆顶或牌堆底.',
      chunleimrfz: '春雷',
      chunleimrfz_info: '每名角色的准备阶段,你可以弃置一张黑色的牌,你对其造成一点雷电伤害.',
      zheqimrfz: '蛰起',
      zheqimrfz_info: '锁定技,每回合限一次,当有角色受到雷属性伤害后,当前回合角色获得下列效果直到回合结束:1.使用牌无次数限制;2.使用或打出一张非装备牌时,其须弃置一张手牌.此回合结束后,你选择获得其本回合因弃置而进入弃牌堆的牌(每种类型限一张).',
      pianfengmrfz: '偏锋',
      pianfengmrfz_info: '当你对其他角色造成伤害后,若有对应的实体牌,你可以令其回复一点体力,并展示其X张牌,若展示的牌中有与对其造成的伤害的牌类型相同的牌,其弃置展示的牌,其流失X点体力,反之你摸X张牌.(X=其本回合受到对其造成伤害牌的相同牌名的牌的次数+1)',
      zhefumrfz: '蛰伏',
      zhefumrfz_info: '出牌阶段开始时,你可以将手牌中所有带有伤害类标签的牌按照任意顺序置于牌堆底或弃牌堆,你摸等量的牌.',
      yubianmrfz: '狱变',
      yubianmrfz_info: '结束阶段,你可以使用牌堆底的牌(必须合法),若你因此的使用颜色均相同,你重复这个流程.',
      yizhemrfz: '医者',
      yizhemrfz_info: '锁定技,你的【桃】不计入手牌上限;游戏开始时,你从牌堆中获得三张【桃】;你手牌中的【桃】的描述改为"①出牌阶段,对自己或在你攻击范围内的其他角色使用,目标角色回复X点体力,获得5-X点护甲(每轮开始时目标角色会失去一点因此获得的护甲).②当有角色处于濒死状态时,对该角色使用.目标角色回复X点体力,获得5-X点护甲(每轮开始时目标角色会失去一点因此获得的护甲).(X = 目标角色已损失的体力值)"',
      zhulimrfz: '铸犁',
      zhulimrfz_info: '锁定技,结束阶段,若你本回合造成过伤害,你弃置一张牌,反之,你摸两张牌且其中的♡2-9视为【桃】.',
      shuangzimrfz: '双子',
      shuangzimrfz_info: '①锁定技,你使用的牌在进入弃牌堆或造成伤害时之前视为无对应实体牌、无点数和🃏的牌;当你的手牌数少于你的体力上限时,你获得等同于你体力上限与手牌数之差的【影】;当你造成伤害后,若对应的实体牌为【影】,则令其回复等同于此次伤害数的体力,其展示所有手牌且不可响应下一张指定其为目标的【杀】.<br>②每回合限一次,你可以将一张【影】当作任意基本牌和普通锦囊牌使用,你以此法使用的【杀】不计入次数限制.',
      jiangtumrfz: '将途',
      jiangtumrfz_info: '锁定技,当前回合角色的手牌对你可见.',
      jieshimrfz: '揭示',
      jieshimrfz_info: '一名角色的出牌阶段开始时,你可以弃置一张牌,猜测其本阶段前三张牌分别使用的类型(对其不可见),当其本阶段使用的第一、二和三张牌结算完毕后,若你猜测正确,你摸X张牌,你可以对其造成X-1(至多为1)点伤害.(X=你此次猜对的次数)',
      tongqingmrfz: '恸情',
      tongqingmrfzx: '情绪',
      tongqingmrfz_info: '一名角色的结束阶段,若本回合有牌因弃置而进入弃牌堆,你可以将所有的‘情绪’置入弃牌堆,将本回合因弃置而进入弃牌堆的牌置于你的武将牌上,称之为‘情绪’,你可以如手牌般使用‘情绪’.',
      cibeimrfz: '慈悲',
      cibeimrfz_info: '当你失去除手牌区以外的牌后,你可以令一名攻击范围内的角色或你回复一点体力或摸一张牌.',
      xiaozhimrfz: '骁智',
      xiaozhimrfz_info: '当你使用的【杀】指定目标后,你可以与该角色拼点,若你没赢,你摸两张牌,若你没输,你可以使用其中一张拼点牌(无次数距离限制)且此杀不可被响应.',
      zhishoumrfz: '执守',
      zhishoumrfz_info: '你的回合[内/外],你可以将本轮出牌阶段内获得的牌当作[【杀】/【闪】]使用或打出,当你不于摸牌阶段获得牌后,你本轮杀的使用次数+1(不可叠加).',
      jingchaomrfz: '静潮',
      jingchaomrfz_info: '当你受到伤害后,你可以弃置两张不同颜色的牌,并回复等量体力,若弃置的牌类别均不同,你将手牌补至5张且此技能本回合失效.',
      cehuimrfz: '测绘',
      cehuimrfz_info: '一名角色的结束阶段,若你的手牌数与本回合开始时你的手牌数不一样,你可以用本回合因弃置而进入弃牌堆的牌与一名其他角色拼点,若你赢,你展示牌堆顶3张牌并使用之.',
      yuchaomrfz: '御潮',
      yuchaomrfz_info: '出牌阶段限一次,你可以选择区域内的一张牌,用此牌与至多两名角色同时拼点,每次拼点中没赢的角色横置武将牌,若在此次拼点中若你赢过,本回合你对被横置的角色使用牌无次数限制.',
      yanhuimrfz: '延辉',
      yanhuimrfz_info: '锁定技,出牌阶段开始时,你将牌堆顶的一张牌当作【兵临城下】置入你的判定区,你摸X张牌并流失一点体力.(X = 你当前的体力值,X至多为5)',
      suozemrfz: '索赜',
      suozemrfz_info: '当你使用或打出一张基本或普通锦囊牌后,若此牌有对应的实体牌,你可以记录此牌名(不可重复记录),观看牌堆顶X张牌,并用等量手牌交换其中至多Y张牌.(X =你的体力上限,Y =此技能记录的牌数)',
      youyimrfz: '游移',
      youyimrfz_info: '锁定技,结束阶段,你选择移除‘索赜’中一半(向上取整)被记录的牌的名字,你视为使用被移除牌中的一张牌.',
      zhuofengmrfz: '濯锋',
      zhuofengmrfz_info: '出牌阶段限一次,你可以重铸手牌中一种颜色的所有牌,:<br>1.你视为本阶段你没有使用过【杀】;<br>2.若你重铸了至少两张牌,你摸一张牌.',
      qianggongmrfz: '抢攻',
      qianggongmrfz_info: '锁定技,你每阶段使用的第一张【杀】获得如下效果:<br>1.无距离限制;<br>2.伤害基数+1;<br>3.造成伤害后重置你武将牌上的一个技能.',
      suximrfz: '宿锡',
      suximrfz_info: '当你使用的转化牌结算完成后,你可以使用此牌对应的实体牌.',
      sanzhongmrfz: '三众',
      sanzhongmrfz_info: '每回合每项限一次,你可以将一张[基本/锦囊/装备]牌当做[【桃】/【顺手牵羊】/【无中生有】]使用.',
    },
  };
  //——————内容设置——————//
  mrfzfuc.importSJZXCharacterSet(epicSJZX);
  //————图片路径设置————//
  for (var i in epicSJZX.character) {
    epicSJZX.character[i][4].push(`ext:驶舰之向/image/character/${i}.jpg`);
  }
  lib.config.all.characters.add('epicSJZX');
  lib.config.characters.add('epicSJZX');
  lib.translate.epicSJZX_character_config = `<img style='width:90px;height:25px;' src=extension/驶舰之向/image/orther/SJZXStar5.png></img>`;
  return epicSJZX;
});
