import { lib, game, ui, get, ai, _status } from '../../noname.js'
game.import('extension', function (lib, game, ui, get, ai, _status) {
    return {
        name: '汤圆神将包',
        content(config, pack) {
            lib.rank.rarity.junk.addArray(['淫汤树精']);
            lib.rank.rarity.rare.addArray(['ty_liushen', 'ty_zhangchunhua', 'ty_guanqiujian', 'ty_jie_miheng', 'ty_wutugu', 'ty_haozhao', 'ty_sp_zhangxiu', 'ty_jiaxu1', 'ty_jiesunce', 'ty_jiecaochun', 'ty_shenpuyuan', 'ty_pangdegong', 'ty_shensunshangxiang', 'ty_mozhouyv', 'ty_shenzhangliang', 'ty_huaman']);
            lib.rank.rarity.epic.addArray(['ty_shenzhangliao', 'ty_dongbai', 'ty_shen_liubei', 'ty_re_yanwen', 'ty_jiangwei', 'ty_huatuo', 'ty_zhugedan', 'ty_shenmachao', 'ty_jiedabao', 'ty_shenzhangbao', 'ty_jiesimashi', 'ty_zhonghui', 'ty_jiaxu', 'ty_xurong', 'ty_zhangrang', 'ty_shensunquan', 'ty_guosi', 'ty_fanchou', 'ty_shen_zhaoyun', 'ty_shensimayi', 'ty_menghuo']);
            lib.rank.rarity.legend.addArray(['ty_shenlvbu', 'ty_shenzhangjiao', 'ty_shenxizhicai', 'ty_shenzuoci', 'ty_yaozhuge']);
        },
        precontent() {
            game.import('character', function (lib, game, ui, get, ai, _status) {
                const QQQ = {
                    name: '汤圆神将包',
                    connect: true,
                    character: {
                        淫汤树精: ['female', 'wu', '3/3', ['淫汤', '吞精', '淫纹', '笙歌'], ['des:榨精能手,擅口']],
                        ty_shenzhangjiao: ['male', 'shen', '3/3', ['济世', '聚众', '苍天已死,黄天当立!'], ['zhu', 'des:得到太平天书的张角,怀揣着救此乱世兴苍天的理想,四处以太平符术济世,但随着他到过的地方越来越多,他逐渐意识到当今百姓的困难都来自于这腐败的朝廷.(爽就完事了,爱酱张角,真恐惧魔王,觉醒杀全场)']],
                        ty_shenzhangliao: ['male', 'shen', '4/6', ['夺锐', '破釜'], ['des:到了逍遥津,我的BGM响起,丢盔弃甲张八百,照样吊打只有一个技能的孙十万']],
                        ty_jiedabao: ['male', 'wu', '4/4', ['破军', '大宝'], ['des:喝酒,上刀,微笑.没有一个步骤是多余的']],
                        ty_shenmachao: ['male', 'shen', '4/6', ['封异', '天罚', 'spdengli', '神烈'], ['des:马超就是神']],
                        ty_shenxizhicai: ['male', 'shen', '0/3', ['策喻', '残志', 'tiandu', '延魂'], ['des:一碰就碎的屑戏子']],
                        ty_zhugedan: ['male', 'wei', 4, ['ty_zhendong', 'ty_weizhong1', 'ty_sanpan'], ['des:重做后的司马师,寿春拼死到最后一兵一卒(作者爱酱,个人觉得算是模组里强度最平衡设计最好的将)']],
                        ty_shenzhangliang: ['male', 'shen', '4/4', ['聚民', '黄天当立!'], ['des:拥有了计算机成神的张梁,恐怖如斯']],
                        ty_shenzhangbao: ['male', 'shen', '3/3', ['济民', '聚众', '苍天已死!'], ['des:很有精神三兄弟,济世救民好头子,就是判♠️️的时候鞭尸一下,一轮10牌,回10血,绝对没有什么坏心思']],
                        ty_mozhouyv: ['male', 'shen', '3/5', ['ty_shenhuo', 'ty_yuhuo', '业种'], ['des:承我遗琴者,必报此血仇,放完狱炎9点伤害爽完直接变神周瑜,神周瑜浪输的,管我魔嘟嘟啥事？']],
                        ty_shenlvbu: ['male', 'shen', '8/8', ['怒目', '无谋', '无往', '修罗之怒'], ['des:肺疼神将还是便秘神将,客官你来选,我反正选肺疼,不过吕布开大真的爽']],
                        ty_shensunshangxiang: ['female', 'shen', '3/3', ['齐发', '枭射', '结姻', '还乡'], ['des:我能社三发,这动皮这箭真粗,这弓真白']],
                        ty_shenzuoci: ['male', 'shen', '4/4', ['变幻'], ['des:全扩最强方差将,模组作者汤圆亲自推荐,绝对好玩,作者本人因为玩这个武将拖更了好久']],
                        ty_pangdegong: ['male', 'shen', '3/3', ['雾隐', '隐山', '拒表', '云散'], ['des:连夜把水镜先生踢出了好友列表(龙凤印记没法搞啊!!!)']],
                        ty_shenpuyuan: ['male', 'shen', '3/3', ['造刀', '精器', '神匠', '遗库'], ['des:这下真的造棺三千口了,死了送人是吧']],
                        ty_yaozhuge: ['male', 'shen', '3/7', ['看破t', '观星', '知命', '借命'], ['des:神诸葛为了追求极致的智慧祈天而得七星之力,获得了近妖的智慧.妖诸葛初始拥有7点体力上限,合理利用这7星所赐的力量配合逆局创造多个回合,在丞相的七星灯燃尽前力挽狂澜,扭转战局吧.(注意星术的觉醒技有bug,尽量在触发前把体力上限补满,否则会多次觉醒)']],
                        ty_jiecaochun: ['male', 'wei', '3/5', ['缮甲', '凌厉', '精兵'], ['des:十年公主,十年河东十年河西,是时候站起来重振男人雄风了,再见了!公主链接!']],
                        ty_jiesimashi: ['male', 'jin', '4/4', ['ty_chaozhan', 'ty_qibing', 'ty_gongcuan', 'ty_quanbian'], ['zhu', 'des:两次觉醒就能化身一拳超人,还坐拥三千死侍,独眼高冷邻家哥哥还不快快拿捏(前面兵种建议选正兵收益大,后面景略改的点是你只要触发死士牌就能再用一次技能,败移改成一血才能用了)']],
                        ty_jiesunce: ['male', 'wu', '5/5', ['jiang', 'ty_qizao1', 'ty_fubing1', 'ty_lizhan1', 'ty_zhuangzhi1', 'ty_fuwang1'], ['zhu', 'des:5血6技能,此可行也？那个男人真的是太强辣!(注意先觉醒【气躁】,亲测觉醒难度最大)']],
                        ty_zhonghui: ['male', 'wei', 3, ['ty_quanji', 'ty_zhangong', 'ty_zili'], ['des:光jio洗jio,权权暴击.(注意觉醒后【弄权】和【增势】的正负面效果,合理应用,别光想着当个老乌龟)']],
                        ty_shensimayi: ['male', 'jin', 5, ['ty_renjie', 'ty_lianpo', 'ty_cuanwei', 'ty_mieshu', 'ty_wangwu'], ['zhu', 'des:憋死三国神将']],
                        ty_jiaxu: ['male', 'shen', 3, ['ty_sanyi', 'ty_bukui', 'ty_juesha', 'ty_sanluan'], []],
                        ty_jiaxu1: ['male', 'qun', 3, ['ty_sanyi', 'ty_bukui', 'ty_juesha'], []],
                        ty_sp_zhangxiu: ['male', 'wei', 4, ['ty_xiongluan', 'ty_xiaoxiong', 'ty_congjian'], ['des:曹贼,你莫要欺人太甚!!!看我贝蒂汤圆,乱炖不白!!!!']],
                        ty_xurong: ['male', 'qun', 4, ['ty_xionghuo', 'ty_shajue'], ['des:这下真的成神张辽了,全场凶镬神将']],
                        ty_shensunquan: ['male', 'shen', 4, ['ty_zhiheng', 'ty_quanshu', 'rejiuyuan'], ['zhu', 'des:史上最会玩的男人,我大魏吴王孙十万']],
                        ty_guosi: ['male', 'qun', '5/5', ['ty_elue', 'ty_lingruo', 'ty_miegang'], ['des:夫人,你也不想你的财宝被我拿走,对吧？']],
                        ty_fanchou: ['male', 'qun', '4/4', ['ty_pocheng', 'ty_poxian', 'ty_pojian', 'ty_chengpo'], ['des:樊稠人称小李儒(这个将有一个可以装备4件防具的机制借鉴了来自遗迹两阳光模组天牢令中的张济的技能屯军,十分感谢镁铝大佬的帮助)']],
                        ty_shen_zhaoyun: ['male', 'shen', '1/7', ['ty_tuosi', 'ty_zhenlong', 'ty_juejing', '克危'], ['des:七进七出']],
                        ty_wutugu: ['male', 'qun', '8/8', ['ty_haozhan', 'ty_hanyong', 'ty_ranshang'], []],
                        ty_huaman: ['female', 'shu', 4, ['ty_jiaoman', 'ty_xizhan', 'ty_zhanyuan'], []],
                        ty_menghuo: ['male', 'shu', '4/7', ['ty_manlue', 'ty_guishu'], ['des:愣着干啥,快叫爸,还想不限要花鬘了？']],
                        ty_zhurong: ['female', 'shu', 4, ['ty_lieren', 'ty_manshe'], ['des:等等,祝融这个尺寸,比她女儿花鬘小这么多？难道,花鬘是？？？']],
                        ty_liushen: ['male', 'shu', 5, ['ty_wuxiang1', 'ty_zhanjue', 'ty_qingwang'], ['des:很喜欢刘谌说过的一句话:<哥哥,且看我与giao云一战.>']],
                        ty_jie_miheng: ['male', 'qun', 3, ['ty_fenglu', 'ty_kuangcai', 'ty_kuang'], ['des:1.2猴']],
                        ty_zhangchunhua: ['female', 'wei', '1/2/1', ['ty_ningqing', 'ty_huzhong', 'ty_jueqing'], []],
                        ty_chengpu: ['male', 'wu', 5, ['ty_lihuo', 'ty_fenpan', 'ty_chunniang'], []],
                        ty_huatuo: ['male', 'qun', 3, ['ty_qingnang', 'ty_jixing', 'ty_yisheng'], ['des:我华佗游历四方,普及众生,拿你几张牌怎么了？']],
                        ty_re_yanwen: ['male', 'qun', '2/5', ['ty_shuangxiong', 'ty_xiezhan'], ['des:giegie~且看我与giao♂云♂一战♂,且与他战♂个五♂十♂回♂合♂']],
                        ty_dongbai: ['female', 'qun', 3, ['ty_zhulian', 'ty_xiahui'], []],
                        ty_guanqiujian: ['male', 'wei', 5, ['ty_zhengrong', 'ty_weijiang', 'ty_hongju'], []],
                        ty_zhangrang: ['male', 'qun', 3, ['ty_taoluan', 'ty_huogang'], ['des:又一个作者爱酱,公公真的太好玩了,这次的因为借鉴了极略的张让,所以是界,作者本人玩了一下午,有把五谷丰登改成决斗7人,南蛮入侵改成桃园结义,太好玩了,玩起来比脑杀还爽']],
                        ty_jiangwei: ['male', 'shu', '4/4', ['ty_beifa3', 'ty_cuijiao', 'ty_yongge'], []],
                        ty_haozhao: ['male', 'wei', '4/6', ['ty_zhujian', 'ty_zhengu'], []],
                        ty_shen_liubei: ['male', 'shen', 6, ['ty_longnu', 'ty_lianying'], ['des:打不死的小强神刘备,智迟真乃神技也,受伤蹦血神将']],
                    },
                    translate: {
                        淫汤树精: '淫汤树精',
                        ty_shenzhangjiao: '神张角',
                        ty_shenzhangliao: '神张辽',
                        ty_jiedabao: '界大宝',
                        ty_shenmachao: '神马超',
                        ty_shenxizhicai: '神戏志才',
                        ty_zhugedan: '诸葛诞',
                        ty_shenzhangliang: '神张梁',
                        ty_shenzhangbao: '神张宝',
                        ty_mozhouyv: '魔周瑜',
                        ty_shenlvbu: '神吕布',
                        ty_shensunshangxiang: '神孙尚香',
                        ty_shenzuoci: '神左慈',
                        ty_pangdegong: '庞德公',
                        ty_shenpuyuan: '神蒲元',
                        ty_yaozhuge: '妖诸葛',
                        ty_jiecaochun: '界曹纯',
                        ty_jiesimashi: '界司马师',
                        ty_jiesunce: '界那个男人',
                        ty_zhonghui: '钟会',
                        ty_shensimayi: '界神司马懿',
                        ty_jiaxu: '神贾诩',
                        ty_jiaxu1: '贾诩',
                        ty_sp_zhangxiu: '张绣',
                        ty_xurong: '徐荣',
                        ty_shensunquan: '神孙权',
                        ty_guosi: '郭汜',
                        ty_fanchou: '樊稠',
                        ty_shen_zhaoyun: '神赵云',
                        ty_wutugu: '界兀突骨',
                        ty_huaman: '花鬘',
                        ty_menghuo: '孟获',
                        ty_zhurong: '祝融',
                        ty_liushen: '刘谌',
                        ty_jie_miheng: '祢衡',
                        ty_zhangchunhua: '张春华',
                        ty_chengpu: '程普',
                        ty_huatuo: '华佗',
                        ty_re_yanwen: '颜良文丑',
                        ty_dongbai: '董白',
                        ty_guanqiujian: '毌丘俭',
                        ty_zhangrang: '张让',
                        ty_jiangwei: '姜维',
                        ty_haozhao: '郝昭',
                        ty_shen_liubei: '神刘备',
                        1: '1',
                        2: '2',
                        天罚: '天罚',
                        天罚_info: '锁定技,你使用【杀】无距离限制;当你使用【杀】指定目标后,若其不在你的攻击范围内,此【杀】不计入使用次数限制且你判定.若判定结果为武器牌或坐骑牌,此【杀】的伤害基数改为X(X为其体力值)',
                        定夺: '定夺',
                        定夺_info: '当你使用【杀】对一名其他角色造成伤害后,你可以获得其区域内的一张牌.若此牌为装备牌,则视为你对其选择的另一名角色使用一张【决斗】',
                        封异: '封异',
                        封异_info: '当你使用【杀】指定一名角色为目标后,你可以进行一次判定并令该角色的非锁定技失效直到回合结束,除非该角色弃置一张与判定结果花色相同的牌,否则不能使用【闪】抵消此【杀】',
                        神烈: '神烈',
                        神烈_info: '你可将任意张花色各不相同的手牌当做目标数上限为X的【杀】使用(X为此【杀】对应的实体牌数).此【杀】使用结算结束后,若你未造成过渠道为此牌的伤害,则你减1点体力上限',
                        倾力: '倾力',
                        倾力_info: '觉醒技,一名角色的回合结束时,若你的手牌数和体力值相差3或更多,你减1点体力上限并获得技能<背水>',
                        ty_jingming: '尽命',
                        ty_jingming_info: '①当你使用伤害性锦囊或♣️️普通【杀】时,若你已受伤,则你可以令此牌的伤害值基数+1.你失去一点体力以及体力上限.②你进入濒死状态时失去两点体力上限并将体力回复到一点',
                        知命: '知命',
                        知命_info: '当你进入濒死状态后,你失去1点体力上限并回复到3点体力,你失去此技能并获得【奋搏】',
                        星引: '星引',
                        星引_info: '觉醒技,准备阶段或结束阶段,若你没有手牌,你回复1点体力或摸两张牌,减1点体力上限,获得〖观星〗',
                        星谋: '星谋',
                        星谋_info: '每回合限一次.当你于出牌阶段使用的锦囊牌结算结束后,你可以减1点体力上限并获得此牌对应的所有实体牌',
                        拜天: '拜天',
                        拜天_info: '觉醒技,准备阶段若你的装备区的装备牌为两张或更多时,你增加1点体力上限,并获得技能〖野心〗和〖自立〗',
                        逆局: '逆局',
                        逆局_info: '每轮限X次.结束阶段,若本回合内置入弃牌堆的牌中包含至少四种花色,则你可失去一点体力上限,摸一张牌并获得一个额外的回合.(X为存活角色数且至多为3)',
                        心智: '心智',
                        心智_info: '觉醒技.准备阶段或结束阶段开始时,若你的手牌数减体力值大于1,则你减一点体力上限,回复1点体力或摸两张牌,获得技能【攻心】',
                        裂魂: '裂魂',
                        裂魂_info: '①出牌阶段限一次,你可令一名体力上限大于1的其他角色减少1点体力上限并获得<平定>标记,你减少1点体力上限.②你对拥有<平定>标记的角色使用牌没有距离限制',
                        魂存: '魂存',
                        魂存_info: '当你进入濒死状态时,你失去两点体力上限,回复一点体力',
                        ty_lingcun: '灵存',
                        ty_lingcun_info: '当你进入濒死状态后,你失去2点体力上限并回复到1点体力',
                        尽命: '尽命',
                        '尽命._info': '当你使用【南蛮入侵】或【万箭齐发】或【火攻】或普通【杀】时,若你已受伤,则你可以令此牌的伤害值基数+1.若你的体力值小于游戏轮数,则失去一点体力以及体力上限',
                        延命: '延命',
                        延命_info: '锁定技,你的初始体力值为0,当你进入濒死状态后,你失去1点体力上限并回复到1点体力',
                        策喻: '策喻',
                        策喻_info: '当你受到伤害后,你进行判定,根据判定结果执行.♥️️:回复一点体力 ♦️️:摸一张牌 ♣️️:进行一次判定 ♠️️:增加一点体力上限.以上结算完毕后你再摸一张牌',
                        残志: '残志',
                        残志_info: '当一名角色进入濒死状态后,你进行判定.若结果为♥️️则你与其回复一点生命值,你摸一张牌,若不为则你与其各摸一张牌.若为♠️️你额外增加一点体力上限',
                        延魂: '延魂',
                        延魂_info: '当你进入濒死状态后,你失去一点体力上限并判定,若为♥️️你回复一点体力,为♦️️你摸一张牌,为♠️️你获得两点体力上限,为♣️️你进行一次判定',
                        雷公: '雷公',
                        雷公_info: '①当你使用或打出【闪】或【闪电】时,你可以进行判定.②当你的判定的判定牌生效后,若结果为:♠️️,你可对一名其他角色造成2点雷电伤害;♣️️:你回复1点体力并可对一名其他其他角色造成1点雷电伤害',
                        聚民: '聚民',
                        聚民_info: '当你于回合内使用非装备牌或武器牌指定目标后,若你是此牌的目标,你可以进行一次判定.你将判定牌置于自己的武将牌上,称之为「方」,你摸一张牌并获得一点体力上限',
                        济民: '济民',
                        济民_info: '当一名角色进入濒死状态后,你进行判定.根据结果执行,♥️️:你与其各回复一点生命值,你摸一张牌并增加一点体力上限.♦️️:你与其各摸一张牌,增加一点体力上限.♠️️:你回复一点生命以及体力上限,其失去一点体力并摸一张牌.♣️️:你与其各摸2张牌',
                        天旨: '天旨',
                        天旨_info: '当你判定后,你根据结果执行以下效果.♥️️:你回复一点生命值,♦️️:你增加一点最大生命上限,♣️️:你摸一张牌,♠️️:你再进行两次判定',
                        塑影: '塑影',
                        塑影_info: '你每次打出两张不同牌名的牌后你可以亮出牌堆顶的5张牌获得其中点数相同的一张',
                        释魂: '释魂',
                        释魂_info: '锁定技,当一名角色死亡后,你增加两点体力上限,回复一点体力',
                        天指: '天指',
                        天指_info: '摸牌阶段开始时,你展示牌堆顶的三张牌.你可以放弃摸牌.若如此做,你获得其中的基本牌、武器牌和【决斗】,且直到你的下回合开始,你使用的【杀】或【决斗】造成伤害时,此伤害+1.否则,你将这些牌置入弃牌堆',
                        三合: '三合',
                        三合_info: '当你于回合内使用非装备牌或武器牌指定目标后,若你是此牌的目标,你可以进行一次判定.你将判定牌置于自己的武将牌上,称之为「方」',
                        化影: '化影',
                        化影_info: '结束阶段,你可以弃置至多X张牌(X为你装备区内的牌数且至少为1)并摸等量的牌,每弃置一张牌,你随机使用一张本局敌方角色使用过的单目标非转化普通锦囊牌,随机指定一个具有正收益的角色为目标',
                        聚众: '聚众',
                        聚众_info: '当你使用一张牌指定目标后,你可以进行一次判定.你将判定牌置于自己的武将牌上,称之为<方>,若你的<方>数量小于等于体力上限,你摸一张牌',
                        汲魂: '汲魂',
                        汲魂_info: '结束阶段,你可以弃置总点数之和为36的一张牌与任意张「方」,并对一名其他角色造成1点雷电伤害,其失去一点体力上限并弃光所以牌,你将体力值回满',
                        漪雷: '漪雷',
                        漪雷_info: '每当你造成一点伤害或有角色进入濒死后,可以指定距离受伤害角色2以内的一名其他角色进行判定,若结果为黑色,该角色受到一点雷电伤害并弃置一张牌',
                        雷躯: '雷躯',
                        雷躯_info: '每当你造成或受到一次伤害,亦或是你濒死时,可以指定距离受伤害角色2以内的一名其他角色进行判定,若结果为黑色,该角色受到一点雷电伤害并弃置一张牌',
                        民意: '民意',
                        民意_info: '锁定技,你计算与其他角色的距离时-2',
                        殇音: '殇音',
                        殇音_info: '弃牌阶段结束时,若你于此阶段内弃置过牌,则你可以选择一项:1.你令所有角色各回复1点体力;2. 令所有角色各失去一点体力',
                        业罪: '业罪',
                        业罪_info: '当一名角色回复体力时,你进行判定,若结果为♠️️或♦️️,你与其各失去一点体力',
                        焚魂: '焚魂',
                        焚魂_info: '出牌阶段限一次,你可以选择一名装备区装备比你少的角色,令其选择一个点数,你进行判定:<br>若点数相同,你对其造成2点伤害;<br>若点数不同,则你随机获得其区域内的一张牌',
                        业种: '业种',
                        业种_info: '当一名角色回复体力时,你可以进行一次判定其横置(若已横置则取消),若判定结果为♦️️,则其额外受到一点火焰伤害',
                        方雷: '方雷',
                        方雷_info: '结束阶段,你可以弃置总点数之和为36的一张牌与任意张「方」,并对一名其他角色造成3点雷电伤害,其弃置所有牌,其失去1点体力上限,你失去4点体力上限并摸3张牌',
                        '苍天已死,黄天当立!': '苍天已死,黄天当立!',
                        '苍天已死,黄天当立!_info': '觉醒技,当一名角色脱离濒死状态后,若你的体力上限大于等于存活角色数,你摸牌至体力上限,修改【济世】,失去【聚众】,并获得【雷公】,【方雷】',
                        济世: '济世',
                        济世_info: '当一名角色进入濒死状态后,你进行判定并增加一点体力上限,结果为黑色牌时你与目标各摸一张牌,结果为♥️️时你与目标各回复1点生命值,结果为♦️️则你与目标各摸2张牌',
                        '苍天已死!': '苍天已死!',
                        '苍天已死!_info': '觉醒技,当一名角色离开濒死状态后,若你的体力上限大于等于存活角色数,你摸等同于体力上限张数的牌,失去【聚众】,并获得【雷躯】,【三合】,【汲魂】,【民意】',
                        '黄天当立!': '黄天当立!',
                        '黄天当立!_info': '觉醒技,当一名角色离开濒死状态后,若你的体力上限大于等于存活角色数,你摸等同于体力上限张数的牌,获得【方雷】,【漪雷】',
                        吞精: '吞精',
                        吞精_info: '锁定技.其他角色失去体力后,若你的体力值:不大于该角色,你回复1点体力;不小于该角色,你摸一张牌',
                        淫汤: '淫汤',
                        淫汤_info: '锁定技.①当有角色于你的回合内受到伤害后,其获得X枚<毒>(X为伤害值).②准备阶段,你令所有拥有<毒>标记的角色移去所有<毒>标记并失去等量的体力.③当有角色因〖恶泉②〗进入濒死状态时,你令其所有技能失效直到回合结束',
                        淫纹: '淫纹',
                        淫纹_info: '当一名角色进入濒死状态后,你进行判定并增加一点体力上限,结果为黑色牌时你与目标各摸一张牌,结果为♥️️时你与目标各回复1点生命值,结果为♦️️则你与目标各摸2张牌',
                        性奴: '性奴',
                        性奴_info: '一名角色即将死亡时,你可以令其获得技能<阴兵>.拥有技能<阴兵>的角色回合即将开始时,此回合改为由你操控.(为了避免bug,内奸无法获得阴兵)',
                        驱奴: '驱奴',
                        驱奴_info: '锁定技,你的体力值或者体力上限不大于0后不会死亡.你的回合开始时,武将上的非锁定技在此回合内失效,之后判断一次游戏胜负,此时拥有技能<阴兵>的角色在规则中视为已死亡.当体力值大于0时,失去此技能',
                        精器: '精器',
                        精器_info: '出牌阶段,你可以展示一张未强化过的【诸葛连弩】或标准包/军争包/SP包中的防具牌,对其进行强化.当你处于濒死状态时,你可以重铸一张防具牌,将体力回复至1点',
                        灵材: '灵材',
                        灵材_info: '出牌阶段限一次,你可以弃置一张牌并获得一张由三张随机牌组成的药水;当你因弃置而失去药水牌时,你随机获得药水的组成卡牌之一',
                        神匠: '神匠',
                        神匠_info: '①游戏开始时,你随机获得5张不同副类别的装备牌,并置入你的装备区.②出牌阶段,你可以将装备区的牌移动至其他角色的装备区(可替换原装备).若你以此法移动了〖造刀〗的衍生装备,你摸两张牌.③你的防具牌与武器牌可以同时装备4个',
                        造刀: '造刀',
                        造刀_info: '出牌阶段限2次,你可以弃置一张手牌.根据此牌的花色点数,你有一定概率打造成功并获得一张武器牌(若打造失败或武器已有则改为摸一张【杀】,花色决定武器名称,点数决定成功率).此武器牌进入弃牌堆时,将其移出游戏',
                        良备: '良备',
                        良备_info: '摸牌阶段,你可以多摸X+1张牌.(X为你装备区里牌数的一半且向下取整)',
                        全备: '全备',
                        全备_info: '限定技.出牌阶段,你可选择一名有空装备栏的角色.系统为该角色的每个空装备栏选择一张装备牌,该角色使用之',
                        遗库: '遗库',
                        遗库_info: '当你濒死时,你可以选择一名其他角色.其获得【良备】和【全备】,你失去此技能',
                        雾隐: '雾隐',
                        雾隐_info: '当你失去体力,受到伤害后,或场上有人进入濒死状态后你可令其获得【大雾】,你的回合开始时,其回合开始时失去【大雾】',
                        拒表: '拒表',
                        拒表_info: '出牌阶段限一次,你可以和一名其他角色拼点.若你赢,你获得以下技能效果直到回合结束:你使用【杀】没有距离限制;可额外使用一张【杀】;使用【杀】时可额外指定一个目标.若你没赢,你不能使用【杀】直到回合结束',
                        荐杰t: '荐杰t',
                        荐杰t_info: '你的第一个准备阶段,你令两名其他角色分别获得龙印与凤印;出牌阶段限一次(你的第一个回合除外),或当拥有龙印、凤印的角色死亡时,你可以转移龙印、凤印',
                        称好t: '称好t',
                        称好t_info: '当一名角色受到属性伤害后,若其存活且其武将牌横置且是伤害传导的起点,则你可以观看牌堆顶的X张牌并分配给任意角色.(X为横置的角色数量且包含该角色)',
                        看破t: '看破t',
                        看破t_info: '你可以将你的任意一张黑色手牌当做【无懈可击】使用',
                        涅槃t: '涅槃t',
                        涅槃t_info: '限定技,当你处于濒死状态时,你可以弃置你区域内的所有牌并复原你的武将牌,摸三张牌并将体力回复至3点.你选择获得以下技能中的一个:〖八阵〗/〖火计〗/〖看破〗',
                        连环t: '连环t',
                        连环t_info: ' 你可以将一张♣️️牌当【铁索连环】使用或重铸.你使用【铁索连环】选择目标的上限数+1',
                        评才t: '评才t',
                        评才t_info: '出牌阶段限一次,你可以挑选一个宝物并擦拭掉其上面的灰尘.你可以根据宝物类型执行对应的效果',
                        隐山: '隐山',
                        隐山_info: '锁定技.当有伤害被防止时,或伤害值发生过减少的伤害事件结算结束后,你摸两张牌',
                        知才: '知才',
                        知才_info: '当一名角色进入濒死状态后,你进行判定并增加一点体力上限,结果为黑色牌时你与目标各摸一张牌,结果为♥️️时你与目标各回复1点生命值,结果为♦️️则你与目标各摸2张牌',
                        火计t: '火计t',
                        火计t_info: '出牌阶段,你可以将你的任意一张红色手牌当作【火攻】使用',
                        知才bug: '知才bug',
                        知才bug_info: '知才无法正确失去技能所以添加的技能',
                        隐世t: '隐世t',
                        隐世t_info: '锁定技,你始终跳过准备阶段,判定阶段,结束阶段.你不能被选择为延时锦囊牌的目标',
                        无言t: '无言t',
                        无言t_info: '锁定技,当你使用锦囊牌造成伤害时,你防止此伤害;锁定技,当你受到锦囊牌对你造成的伤害时,你防止此伤害',
                        诛害t: '诛害t',
                        诛害t_info: '其他角色的回合结束时,若其本回合内造成过伤害,则你可以选择一项:⒈将一张手牌当做【杀】对其使用.⒉视为对其使用一张【过河拆桥】',
                        云散: '云散',
                        云散_info: '玩家的回合开始时,驱散场上的大雾',
                        八阵t: '八阵t',
                        八阵t_info: '锁定技,若你的防具栏内没有牌且没有被废除,则你视为装备着【八卦阵】',
                        怒目: '怒目',
                        怒目_info: '锁定技,当你造成,受到伤害或者失去体力时,你获得一枚<暴怒>标记',
                        无谋: '无谋',
                        无谋_info: '锁定技,当你使用普通锦囊牌时,你选择一项:1.弃置1枚<暴怒>标记;2.失去1点体力.结束后你摸一张牌',
                        咆哮: ' 咆哮',
                        咆哮_info: '锁定技,出牌阶段,你使用【杀】没有数量限制',
                        无往: '无往',
                        无往_info: '出牌限三次,你可以弃置2枚<暴怒>标记,摸两张牌使本回合你与其他角色距离减2并选择一名本回合内未选择过的其他角色,你获得技能【无双】且出杀次数加一并令其防具无效直到回合结束',
                        修罗之怒: '修罗之怒',
                        修罗之怒_info: '限定技,出牌阶段你可以弃置8枚<暴怒>标记,增加2点体力上限并回复2点体力,摸一张牌,选择所有其他角色,对这些角色各造成1点火焰伤害.这些角色先各弃置其装备区里的牌,再各弃置所有手牌,最后你将你的武将牌翻面',
                        林姬: '林姬',
                        林姬_info: '锁定技,你计算与其他角色的距离时-5',
                        枭射: '枭射',
                        枭射_info: '当你失去一张装备区内的牌后,你摸一张牌张牌.若此时是你的回合外,你下一回合摸牌,出杀次数,手牌上限加一,若是你回合内,则你本回合出杀次数加一且手牌上限加一',
                        齐发: '齐发',
                        齐发_info: '每回合限3次,你可将任意张花色各不相同的手牌当做目标数上限为X的【杀】使用(X为此【杀】对应的实体牌数)',
                        结姻: '结姻',
                        结姻_info: '出牌阶段限一次,你可以选择一名男性角色并弃置一张手牌或将装备区内的一张装备牌置于其装备区,你与其体力较高的角色摸一张牌,体力值较低的角色回复1点体力',
                        甘露: '甘露',
                        甘露_info: '出牌阶段限一次.你可以令两名角色交换装备区内的牌',
                        制衡: '制衡',
                        制衡_info: '出牌阶段限一次,你可以弃置任意张牌并摸等量的牌,若你在发动〖制衡〗时弃置了所有手牌,则你多摸一张牌',
                        还乡: '还乡',
                        还乡_info: '觉醒技,当一名角色进入濒死状态后,你弃光所有牌,增加一点体力上限并回满体力,失去技能【结姻】并获得技能【甘露】,【枭影】,【林姬】',
                        兄命: '兄命',
                        兄命_info: '觉醒技,你的准备阶段开始时,你弃置所有装备牌,回满体力并获得技能【制衡】',
                        枭影: '枭影',
                        枭影_info: '当你成为其他角色使用【杀】或普通锦囊牌的目标后,你可以弃置一张装备牌,令此牌对你无效并获得此牌对应的所有实体牌.若此牌的使用者为女性角色,则你额外弃置所有装备牌',
                        笙歌: '笙歌',
                        笙歌_info: '弃牌阶段结束时,若你于此阶段内弃置过两张或更多的牌,则你可以选择一项:1. 令所有角色各回复1点体力;2. 令所有角色各失去1点体力',
                        破胆: '破胆',
                        破胆_info: '锁定技,你攻击范围内已受伤角色的手牌上限-2.若场上已受伤的角色数:不小于1,你的手牌上限+1;不小于3,你于摸牌阶段开始时令额定摸牌数+1;不小于5,回合结束时,你废除一名角色的一个随机装备栏',
                        锐骑: '锐骑',
                        锐骑_info: '当你于出牌阶段内对一名角色造成伤害后,你可以选择该角色武将牌上的一个技能.若如此做,此技能于其下个回合结束之前无效,你废除你的一个装备栏.(每名角色限一次)',
                        劫营: '劫营',
                        劫营_info: '回合开始时,若场上没有拥有<营>标记的角色,你获得1个<营>标记;结束阶段,你可以将你的一个<营>标记交给一名角色;有<营>标记的角色摸牌阶段多摸一张牌,出牌阶段使用【杀】的次数上限+1,手牌上限+1.有<营>的其他角色回合结束时,其移去<营>标记,你获得其所有手牌',
                        夺锐: '夺锐',
                        夺锐_info: '当你对一名其他角色造成伤害后,你可以废除你装备区内的一个装备栏(若已全部废除则可以跳过此步骤),获得该角色的一个技能直到其的下回合结束或其死亡(主公技,隐匿技,使命技除外),该角色该技能失效直到其回合结束,且若此时你已经拥有一个以此法获得的技能,你永久获得上一个以此法获得的技能',
                        破釜: '破釜',
                        破釜_info: '①锁定技,结束阶段或你受到伤害后废除一个装备栏并摸X张牌(X为你已废除的装备栏数),你可以令一名其他角色对其自己使用一张牌堆中的一张与此装备栏副类别相同的装备牌(没有可使用的牌则改为摸一张牌)②当你废除五个全部的装备栏时,你回复一点体力,你回复所有被废除的装备栏',
                        知遇: '知遇',
                        知遇_info: '当你废除五个全部的装备栏时,你回复一点体力,你回复所有被废除的装备栏',
                        宝刀: '宝刀',
                        宝刀_info: '你的回合开始时,你可以从牌堆,场上或弃牌堆中获得【古锭刀】',
                        破军: '破军',
                        破军_info: '当你使用【杀】指定目标后,你可以将其的至多X张牌置于其武将牌上(X为其体力值),其于当前回合结束时获得这些牌.当你因执行【杀】的效果而对一名角色造成伤害时,若该角色的手牌数和装备区内的牌数均不大于你,则此伤害+1',
                        大宝: '大宝',
                        大宝_info: '①游戏开始时,你可以选择弃光你的手牌并从牌库中获得【酒】,【铁索】,【杀】,【古锭刀】.②你的回合开始时,你可以从牌堆或场上获得【古锭刀】',
                        变幻: '变幻',
                        变幻_info: '①锁定技,你受伤,进入濒死状态以及有玩家死亡后,你发现一个技能并获得之.②游戏开始时,你受到一点雷电伤害并回复一点体力',
                        新生: '新生',
                        新生_info: '游戏开始时,你可以受到一点伤害回复一点体力值,你失去此技能',
                        借命: '借命',
                        借命_info: '觉醒技,准备阶段开始时,若你的体力上限大于等于存活角色数,你摸等同于体力上限张数的牌并失去技能【观星】,【看破】,获得技能【威重】,【北伐】,【尽命】,【吞灵】,【纳降】,【摄政】,【锦囊】,【逆局】',
                        观星: '观星',
                        观星_info: '准备阶段,你可以观看牌堆顶的5张牌(存活角色小于4时改为3张),并将其以任意顺序置于牌堆项或牌堆底,若你将〖观星〗的牌都放在了牌堆底,则你可以在结束阶段再次发动〖观星〗',
                        北伐: '北伐',
                        北伐_info: '出牌阶段限一次,你可以与一名角色共同失去一点体力上限,你对他使用牌没有距离限制',
                        纳蛮: '纳蛮',
                        纳蛮_info: '出牌阶段限一次,你可以将所有手牌当做【南蛮入侵】使用;当有角色受到【南蛮入侵】的伤害后,你摸一张牌弃置一张牌',
                        摄政: '摄政',
                        摄政_info: '觉醒技,准备阶段若你的装备区的装备牌为两张或更多时,你增加1点体力上限,并获得技能【野心】和【自立】',
                        纳降: '纳降',
                        纳降_info: '觉醒技.当你造成伤害后,若你已受伤,则你减1点体力上限并摸一张牌,获得【荐言】',
                        锦囊: '锦囊',
                        锦囊_info: '每回合限一次.当你于出牌阶段使用的锦囊牌结算结束后,你可以减1点体力上限并摸一张牌,获得此牌对应的所有实体牌',
                        奋搏: '奋搏',
                        奋搏_info: '一名角色的回合结束时,若你本回合内击杀过角色,则你可以进行一个额外的回合',
                        缮甲: '缮甲',
                        缮甲_info: '出牌阶段开始时,你可以摸五张牌,弃置5-X张牌(X为你本局游戏内不因使用而失去过的装备牌的数目且至多为3).若你没有以此法弃置基本牌或锦囊牌,则你可以视为使用了一张无距离限制且不计入出牌阶段使用次数的【杀】',
                        虎骑: '虎骑',
                        虎骑_info: '锁定技,你与其他角色的距离-1,当你于回合外受到伤害后,你可进行判定,若结果为红色,视为你对伤害来源使用一张【杀】(无距离限制)',
                        凌厉: '凌厉',
                        凌厉_info: '当你使用的装备牌结算完成时,你可以视为使用一张【杀】',
                        精兵: '精兵',
                        精兵_info: '当你因为使用或弃置装备使得装备区中装备牌数量等于你的体力时,你摸两张牌并回复一点体力',
                        ty_mishi: '密使',
                        ty_mishi_info: '其他角色的回合结束时,若其本回合内未对其他角色造成过伤害,则你可选择一项:①摸一张牌.②观看其两张手牌并获得其中的一张.③将其装备区内的一张牌移动至你的装备区',
                        ty_sishi: '死士',
                        ty_sishi_info: '①每回合限一次,当你成为基本牌或锦囊牌的目标后,你可以摸X张牌(X为你本回合内成为过基本牌或锦囊牌的目标的次数).②一名其他角色的结束阶段,若你本回合内没有发动过【死士】,则你可以弃置X张牌并对其造成1点伤害(X为其手牌数,无牌则不弃)',
                        ty_zhengjun: '正军',
                        ty_zhengjun_info: '一名其他角色的结束阶段开始时,若X:为0,你摸一张牌;不等于0,你可弃置X张牌并对其造成1点伤害(X为其本回合内使用的目标包含你的牌的数量)',
                        ty_chaozhan: '抄斩',
                        ty_chaozhan_info: '你的回合结束时,你可以将兵种切换为【密使】',
                        ty_qibing: '起兵',
                        ty_qibing_info: '你的回合结束时,你可以将兵种切换为【正军】',
                        ty_gongcuan: '宫篡',
                        ty_gongcuan_info: '你的回合结束时,你可以将兵种切换为【死士】',
                        ty_jinglue: '景略',
                        ty_jinglue_info: '出牌阶段,若场上没有与你对应的「死士」牌,则你可以摸一张牌观看一名其他角色的手牌,将其中一张牌标记为「死士」.当其使用对应的实体牌中包含「死士」的牌时,你取消此牌的所有目标.当「死士」牌不因使用而进入弃牌堆,或其回合结束后,若「死士」牌仍在其区域内,则你获得此牌',
                        ty_quanbian: '权变',
                        ty_quanbian_info: '觉醒技,当有角色死亡时,你可以加一点体力上限并回复2点体力,召出你的【死士】并失去其他两种兵种,最后获得技能【景略】,【败移】',
                        败移: '败移',
                        败移_info: '限定技,出牌阶段,若你的体力值小于等于2,你可以获得一点体力上限,回复2点体力并交换两名其他角色的座次,你获得技能【夷灭】,【泰然】',
                        ty_tairan: '泰然',
                        ty_tairan_info: '锁定技,回合结束时,你获得一点体力上限,回复Y点体力,并将手牌摸至X张.出牌阶段开始时,你失去Y点体力,弃置上次以此法获得的牌.(X为你的体力上限;Y=(X-你的体力值)且至多为10);摸牌至多摸十张',
                        ty_yimie: '夷灭',
                        ty_yimie_info: '当你对其他角色造成伤害时,若伤害值X小于Y,则你可失去一点体力体力,将伤害值改为Y.此伤害结算结束后,其回复(Y-X)点体力.(Y为其体力值)’',
                        ty_xinsuo: '心锁',
                        ty_xinsuo_info: '锁定技,一名角色受到伤害时,若其已经被横置,则你摸一张牌',
                        ty_xingniepan: '涅槃',
                        ty_xingniepan_info: '当你进入濒死状态后,你可以进行判定,若结果不为♠️️则你将体力回复到3点(若体力上限小于3则回复到体力上限)并且根据花色♥️️,♦️️,♣️️,分别获得技能【心锁】,【诛害】,【连环】,直到你的下一个回合开始每个回合结束你失去一点体力,若为♠️️则你失去一点体力上限摸x张牌(x为6减去你的体力上限)',
                        ty_jiexin: '竭心',
                        ty_jiexin_info: '当有角色受到伤害时,你可以失去一点体力并令其回复一点体力',
                        ty_xingniepan2: '星涅槃负面效果',
                        ty_xingniepan2_info: '每名角色的回合结束时,你失去一点体力',
                        ty_qizao1: '气躁',
                        ty_qizao1_info: '觉醒技,每个角色的回合结束时,若你的手牌数为1,你减少1点体力上限并摸两张牌,获得技能【峭激】',
                        ty_xuanfeng1: '旋风',
                        ty_xuanfeng1_info: '当你于弃牌阶段弃置过至少两张牌,或当你失去装备区里的牌后,若场上没有处于濒死状态的角色,则你可以弃置至多两名其他角色的共计两张牌.若此时处于你的回合内,你可以对其中一名目标角色造成1点伤害',
                        ty_fubing1: '父兵',
                        ty_fubing1_info: '觉醒技,准备阶段,若你的装备数为1,你减少1点体力上限并摸1张牌,获得技能【旋风】',
                        ty_buyi1: '补益',
                        ty_buyi1_info: '一名角色进入濒死状态时,你可展示其一张手牌.若此牌不为基本牌,则其弃置此牌并回复1点体力.若其以此法弃置的牌移动前为其的唯一一张手牌,则其摸一张牌',
                        ty_lizhan1: '历战',
                        ty_lizhan1_info: '多段觉醒技(3),每个角色的回合结束时,若你的已损体力值为1,你减少1点体力上限并摸两张牌,获得技能【补益】,【黩武】以及觉醒技【得功】',
                        ty_fenbo1: '奋搏',
                        ty_fenbo1_info: '一名角色的回合结束时,若你本回合内击杀过角色,则你可以进行一个额外的回合',
                        ty_degong1: '得功',
                        ty_degong1_info: '多段觉醒技(2),准备阶段开始,若你的体力值为1,你减少1点体力上限并摸两张牌,获得技能【缔盟】,觉醒技【称王】',
                        ty_xiongzi1: '雄姿',
                        ty_xiongzi1_info: '你的每一个阶段开始时,你摸一张牌',
                        ty_yinghun1: '英魂',
                        ty_yinghun1_info: '准备阶段开始时,若你已受伤,你可令一名其他角色执行一项:摸X张牌,弃置一张牌;或摸一张牌,弃置X张牌(X为你已损失的体力值)',
                        ty_chengwang1: '称王',
                        ty_chengwang1_info: '觉醒技,你的回合开始时,若你的体力上限为1,你获得4点体力上限,你失去技能【缔盟】,【黩武】并获得技能【雄姿】,【英魂】,【奋搏】',
                        ty_zhuangzhi1: '壮志',
                        ty_zhuangzhi1_info: '锁定技,你的手牌上限视为5',
                        ty_fuwang1: '父望',
                        ty_fuwang1_info: '锁定技,游戏开始时,你将你的体力上限调整为5点,失去此技能',
                        ty_dimeng: '缔盟',
                        ty_dimeng_info: '出牌阶段限一次,你可令两名满足X≤Y的其他角色交换手牌并获得如下效果:出牌阶段结束时,你弃置X张牌(X为这两名角色手牌数之差的绝对值;Y为你的手牌数)',
                        ty_quanji: '权计',
                        ty_quanji_info: '出牌阶段结束时,若你的手牌数大于体力值,当你的体力减少时(每一点分别计算),你可以摸一张牌,将一张手牌置于武将牌上,称为<权>;你的手牌上限+X(X为<权>的数量)',
                        ty_zhangong: '战功',
                        ty_zhangong_info: '每回合限2次,当你造成伤害后,你可以摸一张牌,将一张手牌置于武将牌上的<权>',
                        ty_zili: '自立',
                        ty_zili_info: '觉醒技.准备阶段,若你的<权>数大于2,则你回复1点体力并摸两张牌,减1点体力上限并获得【排异】,【弄权】,【增势】',
                        ty_paiyi: '排异',
                        ty_paiyi_info: '出牌阶段限一次,你可以移去一张<权>并选择一名角色,令其摸x张牌(x为你<权>数量和体力上限中更低的值),若你权的数量更高,你增加一点体力上限(最高增加到8)',
                        ty_zengshi: '增势',
                        ty_zengshi_info: '出牌阶段限一次,你可以移去一张<权>并选择一名角色,令你增加一点体力上限(最多增加到8点);其回复一点体力,若其体力值大于你,你令其弃置所以手牌',
                        ty_nongquan: '弄权',
                        ty_nongquan_info: '出牌阶段限一次,你可以移去一张<权>并选择一名角色,令其摸x+1张牌,若其手牌数大于你,你增加一点体力上限(最高到8)且对其造成x点伤害.(x为其体力值)',
                        ty_cuanwei: '篡魏',
                        ty_cuanwei_info: '觉醒技,当场上有角色死亡时,若剩余角色势力没有<魏>,则你觉醒此技能并摸一张牌,回复一点体力并获得【用权】,同时若这是你触发的第一个亡国觉醒技,你额外获得【吞天】,【极略】.若仍存在势力为<魏>的角色则你摸一张牌',
                        ty_weizhong: '野望',
                        ty_weizhong_info: '锁定技,当你的体力上限增加或减少时,你摸一张牌.若你的手牌数为全场最少,则你改为摸两张牌',
                        ty_weizhong1: '威重',
                        ty_weizhong1_info: '锁定技,当你的体力上限增加或减少时,你摸一张牌.若你的手牌数为全场最少,则你改为摸两张牌',
                        ty_yongquan: '用权',
                        ty_yongquan_info: '当你减少1点体力后,你可以失去一点体力上限并选择一项并摸一张牌:获得牌堆里你选择的类型的一张牌,或移动场上的一张牌',
                        jilue_yimie: '夷灭',
                        jilue_yimie_info: '',
                        ty_jilue: '极略',
                        ty_jilue_info: '当一名角色的判定牌生效前,你可以弃1枚<忍>标记并发动〖鬼才〗;每当你受到伤害后,你可以弃1枚<忍>标记并发动〖放逐〗;当你使用锦囊牌时,你可以弃1枚<忍>标记并发动〖集智〗;出牌阶段限一次,你可以弃1枚<忍>标记并发动〖制衡〗;出牌阶段,你可以弃1枚<忍>标记并获得〖完杀〗直到回合结束;每局游戏限一次当你即将造成伤害时,你可以弃置一枚<忍>标记并发动【夷灭】;出牌阶段时,你可以弃置一张<忍<来发动【景略】',
                        jilue_jinglue: '景略',
                        jilue_jinglue_info: '',
                        '1_info': '每当你造成一次伤害,若此伤害是你本回合第一次造成伤害,你摸两张牌;否则你增加一点体力上限并回复一点体力',
                        ty_renjie: '忍戒',
                        ty_renjie_info: '锁定技,当你受到1点伤害后,你摸一张牌并获得一枚<忍>标记;锁定技,当你于弃牌阶段内弃置牌后,你获得等同于失去的牌数量的<忍>标记',
                        ty_lianpo: '连破',
                        ty_lianpo_info: '一名角色的回合结束时,若你本回合内击杀过角色,则你可以获得一枚<忍>标记并进行一个额外的回合',
                        ty_tuntian: '吞天',
                        ty_tuntian_info: '当你造成伤害后,若你已受伤,你回复一点体力,否则你获得一点体力上限并摸一张牌',
                        ty_mieshu: '灭蜀',
                        ty_mieshu_info: '觉醒技,当场上有角色死亡时,若剩余角色势力没有<蜀>,则你觉醒此技能并摸一张牌,回复一点体力并获得【除奸】,同时若这是你触发的第一个亡国觉醒技,你额外获得【吞天】,【极略】.若仍存在势力为<蜀>的角色则你摸一张牌',
                        ty_wangwu: '亡吴',
                        ty_wangwu_info: '觉醒技,当场上有角色死亡时,若剩余角色势力没有<吴>,则你觉醒此技能并摸一张牌,回复一点体力并获得【威重】,【弓骑】,同时若这是你触发的第一个亡国觉醒技,你额外获得【吞天】,【极略】.若仍存在势力为<吴>的角色则你摸一张牌',
                        ty_gongqi: '弓骑',
                        ty_gongqi_info: '出牌阶段限一次,你可以弃置一张牌,你的攻击范围视为无限且使用与此牌花色相同的【杀】无次数限制直到回合结束.若你以此法弃置的牌为装备牌,则你可以弃置一名其他角色的一张牌',
                        ty_chujian: '除奸',
                        ty_chujian_info: '出牌阶段限一次.你可将任意张牌交给一名其他角色(称为<隙>),可视为使用一张具有伤害标签的基本牌/锦囊牌(不计入次数限制).若你以此法使用的牌未造成伤害,则你将〖诛佞〗于本回合内改为<限两次>',
                        ty_daoshu: '盗书',
                        ty_daoshu_info: '',
                        '2_info': '每回合限一次,当你对其他角色造成伤害时,若伤害值X小于Y,则你可失去1点体力,将伤害值改为Y.此伤害结算结束后,其回复(Y-X)点体力.(Y为其体力值)’',
                        ty_mingding: '命定',
                        ty_mingding_info: '你再无翻盘的可能,哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈!',
                        ty_sanyi: '三夷',
                        ty_sanyi_info: '锁定技,当你即将受到或造成伤害时,你防止此伤害,改为受到伤害的角色失去等量的体力,你从弃牌堆中随机获得一张基本牌',
                        借鉴1: '借鉴1',
                        借鉴1_info: '回合开始时,你可以指定一名未拥有<傀>标记的其他角色,令其获得一枚<傀>标记.每轮游戏开始时,你指定一名体力值最少且没有<傀>标记的其他角色,令其获得一枚<傀>标记',
                        借鉴2: '借鉴2',
                        借鉴2_info: '出牌阶段限一次,若场上没有因你产生的<命运签>,则你可以抽取一张<命运签>,令一名角色获得<命运签>直到你的下回合开始.若你以此法抽取的<命运签>为:上上签,你观看其手牌;上上签/上签,你获得其区域内的一张牌',
                        ty_bukui: '步溃',
                        ty_bukui_info: '①每轮开始以及你濒死时,你可以选择一名角色令其获得【命定】标记,拥有此标记的角色无法使用<桃>和<酒>.②锁定技,拥有【命定】标记的角色弃牌或者回复体力时你摸一张牌',
                        ty_kuishang: '溃殇',
                        ty_kuishang_info: '',
                        借鉴3: '借鉴3',
                        借鉴3_info: '当有角色使用的【决斗】或红色【杀】结算完成后,若此牌对应的目标数为1,则你可以对相同的目标使用一张【杀】或【决斗】(无距离和次数限制).若你以此法使用的牌不为转化牌,则你从牌堆中随机获得一张红色牌',
                        ty_juesha: '绝杀',
                        ty_juesha_info: '当一名角色脱离濒死状态后,你摸一张牌可以选择立即对其使用一张带有【伤害】标签的牌',
                        ty_luanshi: '乱世',
                        ty_luanshi_info: '你是否让这战乱来的更大一些？哈哈哈哈哈哈哈!(再发动一次乱武)',
                        ty_luanwu: '乱武',
                        ty_luanwu_info: '①限定技,出牌阶段,你可令除你外的所有角色依次对与其距离最近的另一名角色使用一张【杀】,否则失去1点体力.②在此回合内,当有角色死亡时你可以立刻发动一次【乱武】(不要求【乱武】还可以使用,且不消耗【乱武】使用次数)',
                        ty_jinglve2: 'ty_jinglve2',
                        ty_jinglve2_info: '',
                        ty_jinglve3: 'ty_jinglve3',
                        ty_jinglve3_info: '',
                        ty_sanluan: '三乱',
                        ty_sanluan_info: '觉醒技,准备阶段开始时,若场上拥有【命定】标记的角色数大于等于3,则你获得技能【乱武】',
                        ty_xiangcao: ' 降曹1',
                        ty_xiangcao_info: '游戏开始时,你将你的装备栏废除',
                        ty_weimu: '帷幕',
                        ty_weimu_info: '你不能成为黑色锦囊牌的目标',
                        ty_congjian: '从谏',
                        ty_congjian_info: '当你成为杀或锦囊牌的目标时,若此牌的目标数大于1,则你可以交给其中一名其他目标角色一张牌并摸一张牌,根据你给出的牌的类型执行:基本牌,你改为摸三张牌.装备牌,你额外复原一个装备区域.锦囊牌,你回复一点体力',
                        ty_xiaoxiong: '降曹',
                        ty_xiaoxiong_info: '①游戏开始时,你废除你的装备栏.②每轮游戏开始,有角色脱离濒死或者你的体力变化时,若你有被废除的装备栏,你选择其中一个回复之.③当你复原装备栏后,根据你被废除的装备数量执行以下几项:为0,你获得一张<决斗>.为1,你获得一张<杀>.为2,你获得技能【帷幕】直到下一个回合开始.为3,你获得一张酒.为4,你获得一张桃',
                        ty_chengru: '承辱',
                        ty_chengru_info: '当你复原装备栏后,根据你被废除的装备数量执行以下几项:为0,你获得一张<决斗>.为1,你获得一张<杀>.为2,你获得技能【帷幕】直到下一个回合开始.为3,你获得一张酒.为4,你获得一张桃',
                        ty_xiongluan: '熊乱!',
                        ty_xiongluan_info: '出牌阶段,若你的装备栏全未被废除,你可以废除你的判定区和装备区,指定一名其他角色.直到回合结束,你对其使用牌无距离和次数限制,其不能使用和打出手牌',
                        武器: '武器',
                        武器_info: '',
                        防具: '防具',
                        防具_info: '',
                        进攻马: '进攻马',
                        进攻马_info: '',
                        防御马: '防御马',
                        防御马_info: '',
                        宝物: '宝物',
                        宝物_info: '',
                        ty_huo: '镬',
                        ty_huo_info: '或许,死亡才是这镬汤之刑的唯一出路？',
                        ty_huo1: '获得镬',
                        ty_huo1_info: '锁定技,游戏开始时,你选择一名其他角色,当其受到伤害后,你受到等量的伤害,当其回复体力后,你回复等量的体力',
                        ty_huoshang: '镬殇',
                        ty_huoshang_info: '加伤',
                        ty_shajue: '杀绝',
                        ty_shajue_info: '锁定技,有角色进入濒死状态时,若其体力值小于0且不为你,则你获得一个<暴戾>标记,将体力回复到1并回复一点体力摸一张牌,获得使其进入濒死状态的牌(为你时不会获得使你进入濒死的牌),若为0则你获得一个<暴戾>标记并摸一张牌',
                        ty_shangxian1: '手牌上限为1',
                        ty_shangxian1_info: '你逃跑的样子比孙十万还狼狈!',
                        ty_buchusha: '不出杀',
                        ty_buchusha_info: '啧啧啧,毫无还手之力了么？',
                        ty_xionghuo1: '凶镬随机',
                        ty_xionghuo1_info: '',
                        ty_xionghuo: '凶镬',
                        ty_xionghuo_info: '①游戏开始时,你获得一个<暴戾>标记②出牌阶段限两次,你可以移除你的一个<暴戾>标记,令一名其他没有【镬】的角色获得【镬】直到其进入濒死状态.③锁定技,你对拥有【镬】的角色造成的伤害加1,并且他们的回合开始时,其随机触发以下一项效果:受到一点火焰伤害且本回合无法使用【杀】【决斗】【南蛮】【万箭】【火攻】;其流失一点体力且此回合手牌上限等于1,你回复一点生命值;你随机获得其一张手牌与装备区的牌并且其跳过摸牌阶段',
                        ty_zhiheng: '制衡',
                        ty_zhiheng_info: '出牌阶段限一次,你可以弃置任意张牌并摸等量的牌,你随机获得一张基本牌,最后若你的手牌中牌的类型大于等于三,你可以变得很会玩',
                        ty_quanshu: '权术',
                        ty_quanshu_info: '①锁定技,当场上有角色失去一点体力或受到一点伤害后,你获得一枚<权衡>标记,有角色回复一点体力后你失去一枚<权衡>标记 ②在一名角色的结束阶段,你根据你的<权衡>标记数来执行以下几项:小于等于1,你选择一名角色并对其造成一点雷电伤害;等于2或4,你摸一张牌;等于3或5,你选择一张牌弃置之;大于5且小于10,你选择一名角色,其回复一点体力,你将<权衡>标记弃置到5枚;大于10,你进行一个额外的回合,把你的<权衡>标记数归零',
                        ty_quanshu1: '权升',
                        ty_quanshu1_info: '',
                        ty_quanshu2: '权降',
                        ty_quanshu2_info: '',
                        ty_quanshu3: '权术1',
                        ty_quanshu3_info: '',
                        ty_quanshu4: '权术2',
                        ty_quanshu4_info: '',
                        ty_quanshu5: '权术3',
                        ty_quanshu5_info: '',
                        ty_quanshu6: '权术4',
                        ty_quanshu6_info: '',
                        ty_quanshu7: '权术5',
                        ty_quanshu7_info: '',
                        ty_quanshu8: '权术6',
                        ty_quanshu8_info: '',
                        ty_elue: '恶掠',
                        ty_elue_info: '当你即将对一名体力值小于你的角色造成伤害时,若其没有<财尽<标记,你获得其x张牌(x为你与其的体力值的差值),其获得<财尽>标记,否则你此次造成的伤害加一移除其<财尽>标记',
                        ty_caijing: '财尽',
                        ty_caijing_info: '财尽人亡~',
                        ty_lingruo: '凌弱',
                        ty_lingruo_info: '每回合限2次,当一名角色受到大于1点伤害后,你摸x张牌(x等于其受到的伤害)可以选择立即对其使用一张带有【伤害】标签的牌',
                        ty_miegang: '蔑纲',
                        ty_miegang_info: '①觉醒技,当有角色死亡后,若你的体力上限大于场上存活角色数,你回复一点体力获得技能【兴乱】,【贪狈】②场上角色死亡后,你增加一点体力上限并摸x张牌(x为场上角色数减去你的体力上限且至少为1)',
                        ty_xingluan: '兴乱',
                        ty_xingluan_info: '锁定技,场上有角色脱离死濒死后或是你的出牌阶段开始时,你视为使用一张随机普通锦囊牌(随机指定目标);若目标只有1人,你可以弃置一张手牌并获得此锦囊',
                        ty_tanbei: '贪狈',
                        ty_tanbei_info: '当一名角色进入濒死状态后,你摸一张牌,若你的已受伤且体力上限小于8,你获得一点上限.否则你回复一点体力',
                        ty_miegang1: '夺权',
                        ty_miegang1_info: '',
                        ty_TLL_fangju: '防具四持',
                        ty_TLL_fangju_info: '',
                        ty_TLL_wuqi: '武器四持',
                        ty_TLL_wuqi_info: '',
                        ty_pocheng: '破城',
                        ty_pocheng_info: '每回合限1次.当你使用牌结算结束后,你可选择一项:①观看牌堆中的三张点数为6的牌并获得其中一张(没有则改为摸一张牌);②令一名其他角色弃置一张点数为6的牌或交给你一张牌;③获得场上的一张点数为6的牌',
                        ty_xiangu: '险固',
                        ty_xiangu_info: '',
                        cheng: '城',
                        cheng_info: '',
                        cheng1: '城',
                        cheng1_info: '',
                        ty_poxian: '蛮克',
                        ty_poxian_info: '①每回合限两次,你对一名角色造成伤害后,若其装备区牌数量小于你且装备区有牌,你获得其中两张,若没有则你获得其x张手牌(x等于你装备区牌的数量)②你可以同时装备4个防具与武器',
                        ty_pojian: '破坚',
                        ty_pojian_info: '每回合限1次,当一名角色装备一张装备牌后,若其装备数小于等于你,你可以摸一张牌立即对其使用一张带有伤害属性的牌',
                        ty_chengpo: '城破',
                        ty_chengpo_info: '①游戏开始时,所有其他角色获得1个<城>标记,当拥有<城>标记的角色以任何形式受到伤害或弃置装备牌后,其失去等量的<城>标记.②觉醒技,一名角色的回合结束时,若场上没有<城>标记,你觉醒此技能,获得两点体力上限,摸两张牌,回复两点体力,获得技能【雄踞】,【兴乱】',
                        ty_fencheng: '焚城',
                        ty_fencheng_info: '这长安皇城内,还有几分原来辉煌的样子,现在的人间地狱到底因何而其？',
                        ty_fenshang: '焚殇',
                        ty_fenshang_info: '',
                        ty_fencheng1: '焚城弃牌',
                        ty_fencheng1_info: '',
                        ty_fencheng2: '焚城少摸牌',
                        ty_fencheng2_info: '',
                        ty_fencheng3: '焚城减少',
                        ty_fencheng3_info: '',
                        ty_shangxian0: '手牌上限为0',
                        ty_shangxian0_info: '',
                        ty_fencheng4: '焚城手牌上限为0',
                        ty_fencheng4_info: '',
                        ty_xiongju: '雄踞',
                        ty_xiongju_info: '在你对一名角色造成伤害后,若其没有<焚城标记,则你可令其获得一个.(<焚城>标记:在你的回合开始以及你受到伤害时,此标记数量翻倍,你的牌离开手牌时获得等同于弃牌数的标记,回复体力或装备装备时失去3倍的标记,你的拥有标记时摸牌阶段少摸一张牌,标记大于5时手牌上限为0,大于10时在结束阶段受到1+x点火焰伤害你摸等量的牌(10后每多10点标记使x的值加一,x最高为3))',
                        ty_jieshou: '竭守',
                        ty_jieshou_info: '①锁定技,每当你造成伤害后或在回合外使用或打出牌时,若你的体力上限大于1且你已经受伤,则你失去1点体力上限,否则若你的体力大于1,则你失去一点体力并摸一张牌.②锁定技,当有非延迟锦囊牌不因使用而进入弃牌堆后,你获得一个<誓>标记.当你的<誓>标记大于等于你的体力上限时,你移除等量的<誓>增加1点体力上限',
                        ty_zhendong: '镇东',
                        ty_zhendong_info: '①出牌阶段限一次,你可以令一名角色获得<讨>直到你的回合开始,拥有<讨>的角色体力变化时你摸一张牌,若为回复你失去一点体力,否则你回复一点体力(满体力改为摸一张牌);若其未处于濒死状态,你可以选择对其使用一张伤害牌.②锁定技,当一名角色死亡后,你增加一点体力上限(若其有<讨>则改为两点)并回复一点体力',
                        ty_zhendong1: '镇东',
                        ty_zhendong1_info: '',
                        ty_zhendong2: '讨',
                        ty_zhendong2_info: '',
                        ty_zhendong3: '镇东',
                        ty_zhendong3_info: '',
                        ty_zhendong4: '镇东',
                        ty_zhendong4_info: '',
                        ty_sanpan: '三叛',
                        ty_sanpan_info: '觉醒技,准备阶段开始时,若你的体力上限大于等于存活角色数,你将体力失去到一并摸等量的牌,获得技能【竭守】,【尽命】',
                        粮绝: '粮绝',
                        粮绝_info: '锁定技,当你受到1点火焰伤害后,你失去2点体力上限',
                        ty_shizheng: '誓征',
                        ty_shizheng_info: '锁定技,当有基本牌,普通锦囊牌或装备牌不是因使用而进入弃牌堆后,你获得一个<誓>标记.当你的<誓>标记大于等于你的体力上限时,你移除等量的<誓>增加1点体力上限',
                        誓: '誓',
                        誓_info: '',
                        ty_tuosi: '托嗣',
                        ty_tuosi_info: '锁定技,游戏开始时,你选择一名其他角色,其获得<嗣>,其回合结束后你可以失去一点体力上限并立即执行一个回合.②每回合限一次有嗣的角色濒死后,若你的体力上限大于1,则你失去一点体力上限并令其将体力回复到1,你与其各摸一张牌.③有<嗣>的角色受到大于1的伤害后,若你的体力上限大于伤害值,则你令伤害值变为0,你失去等量的体力上限并与其各摸等量的牌;有<嗣>的角色受到伤害后,你摸一张牌并可以立即对造成伤害得角色使用一张伤害牌',
                        ty_tuosi1: '救嗣',
                        ty_tuosi1_info: '锁定技,当一名拥有<嗣>标记的角色濒死时,你失去一点体力上限并令其将体力回复到1,你与他各摸一张牌',
                        ty_tuosi2: '冲阵',
                        ty_tuosi2_info: '当有<嗣>的角色受到伤害后,你摸一张牌并可以立刻对伤害来源使用一张带有伤害标签的牌',
                        ty_tuosi3: '死卫',
                        ty_tuosi3_info: '锁定技,当拥有<嗣>标记的角色受到大于一的伤害时,你减少一点体力上限并令其变为1,你与其各摸一张牌',
                        ty_zhenlong: '真龙',
                        ty_zhenlong_info: '①锁定技,你的♦️️牌视为【火杀】,♣️️牌视为【决斗】,你的♥️️牌视为【桃】.你使用杀无次数限制与距离限制,且其他角色无法响应你每回合使用第一张杀或决斗.②锁定技,你的回合开始时,若你的体力上限大于1,则你减少一点体力上限并摸1张牌.③锁定技,你濒死时若你的体力上限大于1,你减一点体力上限并将体力值回复至1',
                        ty_tuosi4: '突围',
                        ty_tuosi4_info: '锁定技,出牌阶段开始时,你失去一点体力上限并将手牌摸至体力上限',
                        ty_si: '嗣',
                        ty_si_info: '吾,定不负主公重托!',
                        ty_tuosi5: '奋突',
                        ty_tuosi5_info: '',
                        克危: '克危',
                        克危_info: '使命技,使命完成:当有<嗣>的角色的回合开始时,若你的体力上限为1,则你使命完成,拥有<嗣>的角色获得一点体力上限并回复一点体力,你将体力上限设为4并回满体力,你与其各摸两张牌,你获得失去所有技能并获得【龙魂】,【涯角】,其获得【仁德】,【激将】;使命失败:当拥有<嗣>的角色死亡后,使命失败,你将体力上限设为1,失去【托嗣】,【真龙】,并获得【天亡】',
                        ty_kewei1: '克危成功',
                        ty_kewei1_info: '',
                        ty_kewei2: '克危失败',
                        ty_kewei2_info: '',
                        ty_juejing: '绝境',
                        ty_juejing_info: '锁定技,你的手牌上限+2;当你进入或脱离濒死状态时,你摸一张牌',
                        ty_longhun: '龙魂',
                        ty_longhun_info: '你可以将同花色的一至两张牌按下列规则使用或打出:♥️️当【桃】,♦️️当火【杀】,♣️️当【闪】,♠️️当普【无懈可击】.若你以此法使用了两张红色牌,则此牌回复值或伤害值+1.若你以此法使用了两张黑色牌,则你弃置当前回合角色一张牌',
                        ty_yajiao: '涯角',
                        ty_yajiao_info: '当你于回合外因使用或打出而失去手牌后,你可以展示牌堆顶的一张牌.若这两张牌的类别相同,你可以将展示的牌交给一名角色;若类别不同,你可弃置攻击范围内包含你的角色区域里的一张牌',
                        ty_rende: '仁德',
                        ty_rende_info: '出牌阶段,你可以将至少一张手牌交给其他角色,你于此阶段内不能再以此法交给该角色牌;若你于此阶段内给出的牌首次达到两张,你可以视为使用一张基本牌',
                        ty_jijiang: '激将',
                        ty_jijiang_info: '主公技.①当你需要使用或打出【杀】时,你可以令其他蜀势力角色依次选择是否打出一张【杀】.若有角色响应,则你视为使用或打出了此【杀】.②每回合限一次.当有蜀势力角色于回合外使用或打出【杀】时,其可以令你摸一张牌',
                        ty_tianwang: '天亡',
                        ty_tianwang_info: '哈哈哈哈哈,天欲亡我季汉啊!!!',
                        ty_jianding: '坚定',
                        ty_jianding_info: '',
                        ty_longhun1: '龙魂暴击',
                        ty_longhun1_info: '',
                        ty_longhun2: '龙魂弃牌',
                        ty_longhun2_info: '',
                        ty_haozhan: '好战',
                        ty_haozhan_info: '锁定技,当其他角色受到伤害性锦囊以及♠️️【杀】的伤害时,你增加等同于伤害值的体力上限并回复等量的体力',
                        ty_hanyong: '悍勇',
                        ty_hanyong_info: '当有角色使用非【火攻】的伤害性锦囊以及♠️️【杀】时,你可以令此牌的伤害值基数+1.该角色获得一枚<燃>标记,若此角色不是你,你也获得一枚<燃>标记',
                        ty_ranshang1: '燃殇触发',
                        ty_ranshang1_info: '',
                        ty_ranshang2: '燃殇标记',
                        ty_ranshang2_info: '',
                        ty_ranshang: '燃殇',
                        ty_ranshang_info: '锁定技,当你受到1点火焰伤害后,你获得1枚<燃>标记;有<燃>标记角色的结束阶段开始时,其失去x点体力并摸x张牌,若x>1其减少一枚燃标记,若x>2且此角色为你,则你额外失去等量的体力上限并摸两张牌.(x为该角色拥有的<燃>标记数)',
                        ty_zhanyuan: '战缘',
                        ty_zhanyuan_info: '使命技,当你使用【决斗】造成伤害后,你获得一枚<战缘>标记,你受到来自决斗的伤害后,你获得一枚<败>败标记.使命成功:当你的回合开始时,若你的<战缘>标记大于2,则你使命成功,你增加一点体力上限并回复一点体力,摸两张牌,你获得技能【痴战】,【蛮嗣】.使命失败:在你受到伤害后,若你的<败>标记大于2,则你失去技能【嬉战】,失去一点体力上限并回复一点体力,摸两张牌,你获得技能【䓾影】,【协关】',
                        ty_xizhan: '嬉战',
                        ty_xizhan_info: '其他角色受到来自【南蛮入侵】或【万箭齐发】的伤害后,你可以摸一张牌视为对其使用一张【决斗】',
                        ty_jiaoman: '娇鬘',
                        ty_jiaoman_info: '锁定技,你造成或受到伤害后(造成伤害后条件触发每回合限一次),若场上手牌数大于0的角色大于1,则你可以令造成伤害的角色与一名你选择的其他角色拼点,赢家获得输家的一张牌,比较双方的手牌数,若相等则你回复一点体力;若拼点平手则你回复一点体力双方皆失去一点体力',
                        ty_zhanyuanshu: '输',
                        ty_zhanyuanshu_info: '',
                        ty_zhanyuan1: '战缘达成',
                        ty_zhanyuan1_info: '',
                        ty_zhanyuan2: '白给关锁',
                        ty_zhanyuan2_info: '',
                        ty_mansi: '蛮嗣',
                        ty_mansi_info: '①出牌阶段限一次,你可将任意张牌当做【南蛮入侵】并制定等量的角色为目标②锁定技:【南蛮入侵】对你无效',
                        ty_chizhan: '痴战',
                        ty_chizhan_info: '当有角色受到来自【决斗】的伤害后,你获得一张基本牌,【决斗】,【藤甲】或【南蛮入侵】',
                        ty_xieguan: '协关',
                        ty_xieguan_info: '每回合限两次,当一名角色受到来自来源不为你的红色牌伤害后,你可以与伤害来源各摸一张牌视为对受到伤害的角色使用一张杀(若伤害来源为<关锁>则你与其额外回复一点体力)',
                        ty_suoying: '䓾影',
                        ty_suoying_info: '每回合限一次,当你对其他角色(或其他角色对你)使用【杀】或普通锦囊牌指定唯一目标后,若此牌不是本回合你对其(或其对你)使用的第一张【杀】或普通锦囊牌,你可以弃置一张牌,获得此牌对应的所有实体牌(或令此牌对你无效)',
                        ty_manzu: '蛮族',
                        ty_manzu_info: '锁定技,【南蛮入侵】对你无效',
                        借鉴业炎: '借鉴业炎',
                        借鉴业炎_info: '限定技,出牌阶段,你可以对一至三名角色造成至多共3点火焰伤害(你可以任意分配每名目标角色受到的伤害点数),若你将对一名角色分配2点或更多的火焰伤害,你须先弃置四张不同花色的手牌再失去3点体力',
                        ty_jiaoman1: '娇蛮',
                        ty_jiaoman1_info: '',
                        ty_zaiqi3: '不能濒死再起',
                        ty_zaiqi3_info: '',
                        ty_zaiqi2: '再起加上限',
                        ty_zaiqi2_info: '',
                        ty_zaiqi1: '濒死再起',
                        ty_zaiqi1_info: '',
                        ty_zaiqi: '再起',
                        ty_zaiqi_info: '①摸牌阶段或你濒死时(濒死每回合限一次),若你已受伤,则你可以改为展示牌堆顶的X张牌(X为你已损失的体力值+1),并回复X点体力(X为其中♥️️牌的数目).你将这些♥️️牌置入弃牌堆,并获得其余的牌.②每回合限两次,当你的体力上限或体力值变化后,若你的体力值等于体力上限,你增加一点体力上限',
                        ty_guishu: '归蜀',
                        ty_guishu_info: '觉醒技:当你的体力上限小于等于1或是你濒死时,若你的<叛侵>标记数小于14,则你将体力上限调整为4并回满体力,摸一张牌失去技能【蛮掠】并获得技能【再起】,否则你将体力上限调整为7并复原此技能',
                        ty_qingpan: '侵叛',
                        ty_qingpan_info: '',
                        ty_manlue: '蛮掠',
                        ty_manlue_info: '①锁定技,你受到伤害时或有除了你以外的角色脱离死亡后(若时机为受到伤害时,此伤害取消;若时机为濒死后则每回合限触发一次),你失去一点体力上限,.你失去体力上限后,视为使用了一张【南蛮入侵】②锁定技,【南蛮入侵】对你无效当.当有角色受到来源为【南蛮入侵】的伤害时,若伤害来源为你,且其手牌数大于0,取消之,你获得其1张牌,若来源为你且其手牌数为0,你获得一枚<侵叛>标记',
                        ty_huoshou: '祸首',
                        ty_huoshou_info: '当有角色脱离濒死后,你失去一点体力上限并摸一张牌',
                        ty_manyong: '蛮勇',
                        ty_manyong_info: '你失去体力上限后,你视为使用一张南蛮入侵',
                        ty_manshe: '蛮摄',
                        ty_manshe_info: '锁定技,当你受到伤害结束后可以摸一张牌并视为对伤害来源使用一张【决斗】,你免疫【南蛮入侵】',
                        ty_lieren: '烈刃',
                        ty_lieren_info: '①锁定技:当场上有角色受到非雷电伤害后,你获得一枚<烈刃>标记②出牌阶段限一次,你可以消耗6枚标记并对一名角色投掷<仇矛>,该角色受到一点火焰伤害并获得1枚<矛>标记,拥有矛标记的角色受到伤害后若<矛>标记小于3会获得一枚<矛>标记,否则你收回其所有标记并受到等同于标记数的火焰伤害你回复等量体力,其回合结束后你也会强制收回其所有标记.③出牌阶段,你可以消耗9枚<烈刃>并视为使用一张【南蛮入侵】',
                        ty_lieren1: '仇矛',
                        ty_lieren1_info: '消耗6枚<烈刃>标记并选择一个角色,对其造成一点火焰伤害并令其获得一个<矛>',
                        ty_mao: '矛',
                        ty_mao_info: '',
                        ty_lieren2: '伤害收矛',
                        ty_lieren2_info: '',
                        ty_lieren3: '自动收矛',
                        ty_lieren3_info: '',
                        ty_lieren4: '发起南蛮',
                        ty_lieren4_info: '消耗8枚"烈刃>标记并视为使用一张【南蛮入侵】',
                        ty_wuxiang5: '',
                        ty_wuxiang5_info: '',
                        ty_wuxiang6: '',
                        ty_wuxiang6_info: '',
                        ty_wuxiang7: '',
                        ty_wuxiang7_info: '',
                        ty_wuxiang1: '无降',
                        ty_wuxiang1_info: '出牌阶段每项限一次,你可以弃置一张手牌/弃置一张装备牌/失去一点体力,视为对一名你选择的角色使用一张无次数与距离限制的【杀】,此杀命中后你摸一张牌,否则其视为对你使用一张【决斗】',
                        ty_wuxiangmiss: '检测杀',
                        ty_wuxiangmiss_info: '',
                        ty_zhanjue: '战绝',
                        ty_zhanjue_info: '①锁定技,当你受到伤害结束后,你摸一张牌并视为对伤害来源使用一张【决斗】②锁定技:你赢得决斗后,你回复一点体力',
                        ty_zhanjue1: '战绝回复',
                        ty_zhanjue1_info: '',
                        ty_wuxiang4: '无降体力上限',
                        ty_wuxiang4_info: '失去一点体力上限并视为对一名你选择的角色使用一张【杀】,若此杀命中你摸一张牌,否则其视为对你使用一张【决斗】',
                        ty_qingwang1: '勤王额外回合',
                        ty_qingwang1_info: '',
                        ty_qingwang2: '勤王检测',
                        ty_qingwang2_info: '',
                        ty_qingwang: '勤王',
                        ty_qingwang_info: '主公技,每轮限一次,当一名角色的出牌或摸牌阶段被跳过后,你可以在其回合结束后额外执行一个回合',
                        ty_wuxiangzhong: '杀命中',
                        ty_wuxiangzhong_info: '',
                        ty_jieshou1: '竭守',
                        ty_jieshou1_info: '',
                        ty_feng: '锋',
                        ty_feng_info: '',
                        ty_lu: '露',
                        ty_lu_info: '',
                        ty_fenglu: '锋露',
                        ty_fenglu_info: '①锁定技, 你使用牌没有距离与次数限制,你的回合内你使用伤害牌时获得一枚<锋>(上限为3),造成伤害后获得一枚<露>,当两种标记数量相同时你摸等量的牌.②回合结束时若你本回合使用过伤害牌且造成过伤害,你摸等于<锋>数量的牌.③你的手牌上限始终等于<露>的数量',
                        ty_fenglu1: '锋露被动',
                        ty_fenglu1_info: '',
                        ty_kuangcai: '狂才',
                        ty_kuangcai_info: '当你被成为其他角色牌的目标后,若你不处于濒死状态,你可以取消此牌并与其拼点,若你赢则你摸一张牌并获得一个<妄言>标记;平则你重复此效果;若你输且你与其有手牌,则受到来自该角色的一点伤害并重复此效果,否则你受到来自其的一点伤害并且此技能失效直到你的下个回合开始',
                        ty_kuang: '妄言',
                        ty_kuang_info: '锁定技,当你濒死时,若你的<妄言>标记数大于等于当前回合角色的体力值且该角色不为你,你回复至x点体力并摸x张牌,最后你失去所有<妄言>以及一点体力上限(x为伤害来源的体力值)',
                        ty_shenhuo: '神火',
                        ty_shenhuo_info: '在场上受到火焰伤害后你获得一枚<神火>,若此时你的神火标记大于等于场上角色体力值和,你觉醒此技能并随机分配x点火焰伤害(x为场上角色体力之和),失去技能【业种】,将体力上限调整为5并回满体力,最后获得技能【业炎】',
                        ty_yuhuo1: '火神',
                        ty_yuhuo1_info: '',
                        ty_yuhuo: '浴炎',
                        ty_yuhuo_info: '①锁定技,你造成伤害视为火焰伤害,你受到火焰伤害时改为回复等量体力并摸等量张牌,最后获得等量的<神火>标记.②当场上有角色即将受到雷电伤害时,你可取消之并令其失去等量体力.③锁定技,当你有牌离开你的区域后,你获得一枚>焚<,你受到伤害后焚数量翻倍,回合结束时你受到x点火焰伤害并将<焚>归0(x等于焚的数量除以10向下取整且最多为4),若此时你的<焚>数大于等于50,你改为受到5点雷电伤害.',
                        ty_yuhuo2: '取消雷伤',
                        ty_yuhuo2_info: '是否取消此雷电伤害并改为令其失去等量体力？',
                        ty_yuhuo3: '火浴',
                        ty_yuhuo3_info: '',
                        ty_yuhuoshang: '浴殇',
                        ty_yuhuoshang_info: '',
                        ty_yuhuo4: '浴火弃牌',
                        ty_yuhuo4_info: '',
                        神火音效: '神火音效',
                        神火音效_info: '',
                        自焚: '自焚',
                        自焚_info: '',
                        ty_ningqing: '凝忆',
                        ty_ningqing_info: '①锁定技,你造成的伤害视为冰属性,你受到冰属性伤害时改为获得等量的护甲.你即将回复生命值时,若回复量会使你的生命值大于1,你取消超过的回复量并获得等量的护甲,你的护甲为【重甲】②锁定技,当你失去最后的护甲时,你获得一点体力上限(最多为6),你脱离濒死状态后获得一点护甲.你的手牌上限增加x(x为你的护甲数).③锁定技,当你的手牌数小于你的已损体力时,你摸等于它们的差值数张牌',
                        ty_ningqing1: '冷清',
                        ty_ningqing1_info: '',
                        ty_ningqing2: '凝甲',
                        ty_ningqing2_info: '',
                        ty_ningqing3: '凝情上限',
                        ty_ningqing3_info: '',
                        ty_ningqing4: '凝情得甲',
                        ty_ningqing4_info: '',
                        ty_huzhong: '庇仲',
                        ty_huzhong_info: '当一名其他角色即将受到来源不为你且结算后会使其体力小于等于你的体力值的伤害时,你可以令其获得一点护甲并摸一张牌,视为对你使用了一张【决斗】',
                        ty_ningqing5: '凝情手牌上限',
                        ty_ningqing5_info: '',
                        ty_jueqing: '绝情',
                        ty_jueqing_info: '限定技,出牌阶段若你有护甲且你的体力上限大于等于6,则你可以弃置等于你护甲数张牌并摸等量的牌,你失去全部护甲并且本回合使用牌无距离与次数限制',
                        ty_jueqing1: '绝情无限制',
                        ty_jueqing1_info: '',
                        ty_shangshi: '伤逝',
                        ty_shangshi_info: '当你的手牌数小于X时,你可以将手牌摸至X张(X为你已损失的体力值)',
                        ty_zhongjia: '重甲',
                        ty_zhongjia_info: '',
                        ty_lihuo1: '砺火增加目标',
                        ty_lihuo1_info: '在你使用火属性的杀指定敌人后,你可以额外指定至多等于你已损生命值的角色作为额外目标',
                        ty_lihuo: '砺火',
                        ty_lihuo_info: '当你声明使用【杀】时,你可以将此【杀】改为火【杀】,失去一点体力,你使用火杀时可额外指定x个目标(x为你已损生命值)',
                        ty_fenpan: '焚叛',
                        ty_fenpan_info: '在你造成火焰伤害/受到伤害后,若该角色不为你,则你令受到伤害的角色/对你造成伤害的角色获得技能【燃尽】直到其一个造成过火焰伤害的回合结束',
                        ty_fenpan1: '燃尽',
                        ty_fenpan1_info: '你造成与受到的伤害视为火焰伤害,你即将造成火焰伤害时失去一点体力,你的回合结束时,若你造成过火焰伤害,则你失去此技能',
                        ty_fenpan2: '燃尽变火',
                        ty_fenpan2_info: '你造成与受到的伤害视为火焰伤害',
                        不知道: '不知道',
                        不知道_info: '',
                        ty_fenpan3: '焚叛造成伤害',
                        ty_fenpan3_info: '',
                        ty_chunniang1: '醇酿多刀标记',
                        ty_chunniang1_info: '',
                        ty_chunniang2: '醇酿多刀',
                        ty_chunniang2_info: '',
                        ty_chunniang: '醇酿',
                        ty_chunniang_info: '①锁定技,在一名区域内有牌的角色受到火焰伤害或来后,你选择其区域内的一张牌并将其置入你的武将牌上称为<醇>②当一名角色濒死时,若你有<醇>且<醇>中牌数大于等于其体力上限或该角色为你,你可以令其获得你所以的<醇>并回复至x点体力(x为场上拥有<燃尽>的角色数).③每当你脱离濒死后,若你的体力上限大于等于1则你失去一点体力上限你本局游戏每回合使用杀的次数上限加1',
                        ty_chunniang3: '醇酿濒死',
                        ty_chunniang3_info: '当一名角色濒死时,若你<醇>牌数大于等于其体力上限或该角色为你,你可以令其获得你所以的<醇>并回复至x点体力(x为场上拥有<燃尽>的角色数)',
                        仁借鉴: '仁借鉴',
                        仁借鉴_info: '锁定技.①当你使用的牌结算完成后,若你未因此牌造成过伤害,则你将此牌对应的所有实体牌置于仁库中.②当有牌不因溢出而离开仁库时,你摸一张牌',
                        ty_qingnang: '青囊',
                        ty_qingnang_info: '①锁定技,场上有角色回复体力后,若其手牌数大于你,你选择其x张牌置入<青囊>(x为你们手牌数之差);等于你,你与其各摸一张牌;小于你,其获得你一张牌你摸一张牌②你的回合开始时/有角色进入濒死时,你/濒死角色获得<青囊>上的所有牌,你的弃牌阶段开始时或场上角色脱离濒死后,你选择y张牌置入<青囊>中(y为你的手牌数减去你的体力值)',
                        ty_jixing: '弥济',
                        ty_jixing_info: '转换技,阳:你可以令一名没有【弥济】效果的其他角色获得你一张黑色牌,其不能使用或打出手牌直到出牌阶段开始.阴:你可以令一名没有【弥济】效果的其他角色获得你的一张红色牌,其获得<祛毒>.此技能转换时你医圣①使用次数加一',
                        ty_qudu: '祛毒',
                        ty_qudu_info: '',
                        ty_mazui: '麻醉',
                        ty_mazui_info: '',
                        ty_yisheng: '医圣',
                        ty_yisheng_info: '①锁定技,每局限0次,你造成伤害时可改为令目标回复等量体力.(剩余次数可在转化技标记上查看)②锁定技,当一名其他角色濒死时,若你的医圣①剩余使用次数大于0,你可以选择对其使用一张伤害牌',
                        ty_qingnang1: '青囊获取',
                        ty_qingnang1_info: '',
                        ty_qingnang2: '青囊放回',
                        ty_qingnang2_info: '',
                        ty_yisheng2: '医圣濒死',
                        ty_yisheng2_info: '',
                        医圣音效1: '医圣音效1',
                        医圣音效1_info: '',
                        医圣音效2: '医圣音效2',
                        医圣音效2_info: '',
                        医圣音效3: '医圣音效3',
                        医圣音效3_info: '',
                        弥济音效1: '弥济音效1',
                        弥济音效1_info: '',
                        弥济音效2: '弥济音效2',
                        弥济音效2_info: '',
                        ty_xiezhan: '协战',
                        ty_xiezhan_info: '①锁定技,游戏开始时,你获得等于你的体力值的<文丑>标记,这些标记会在【双雄】状态为文丑时以护甲的形式存在.②兄弟二人协战,你使用杀的次数限制加一,并且手牌上限加x(x为文丑拥有的护甲数)',
                        ty_shuangxiong: '双雄',
                        ty_shuangxiong_info: '①转换技,兄弟二人协战,阴为颜良;阳为文丑.颜良:你可以将你的一张红色手牌当做【决斗】使用或打出,你受到来源牌为黑色或基本牌的伤害后摸等同于伤害数的牌;文丑:你可以将你的一张黑色手牌当做【杀】使用或打出.你受到伤害后,若伤害来源牌为红色或锦囊牌,你摸等同于伤害数的牌.(两种时机都会转换该技能)②颜良:在你使用一张牌时/造成伤害后,若此牌为黑色基本牌,你摸一张牌(手牌数超过体力值时不触发)/获得一点护甲;文丑:在你使用一张牌时/造成伤害后,若此牌为红色锦囊牌,你摸一张牌(手牌数超过护甲值时不触发)/回复一点体力',
                        ty_shuangxiong5: '双雄伤',
                        ty_shuangxiong5_info: '',
                        ty_shuangxiong6: '双雄转换',
                        ty_shuangxiong6_info: '',
                        ty_xiezhan1: '文丑',
                        ty_xiezhan1_info: '',
                        ty_shuangxiong2: '双雄造伤',
                        ty_shuangxiong2_info: '',
                        ty_shuangxiong3: '双雄用牌',
                        ty_shuangxiong3_info: '',
                        ty_zhu: '诛',
                        ty_zhu_info: '你受到与造成的伤害增加x,你的摸牌数减少x(x为<诛>数),你对有<连>的角色造成伤害时改为获得其等于伤害数的牌,没有<诛>的角色濒死时你回复一点体力,有<诛>的角色失去牌时若其没有手牌,你随机弃置一张牌.你受到伤害时减少一枚<诛>',
                        ty_zhu1: '诛少摸牌',
                        ty_zhu1_info: '',
                        ty_zhu2: '诛相争',
                        ty_zhu2_info: '',
                        ty_lian2: '连相争',
                        ty_lian2_info: '',
                        ty_lian: '连',
                        ty_lian_info: '你摸牌阶段额外摸x张牌,手牌上限减x(x为<连>数量),有<连>的角色造成伤害时你摸一张牌,有<连>的角色失去牌时若其没有手牌,你失去一点体力,你对有<诛>的角色造成伤害时改为获得其等于伤害数的牌,你受到伤害时失去一枚<连>',
                        ty_lian1: '连减少手牌上限',
                        ty_lian1_info: '',
                        ty_lian3: '连利',
                        ty_lian3_info: '',
                        ty_zhu3: '诛同',
                        ty_zhu3_info: '',
                        ty_zhu4: '同诛',
                        ty_zhu4_info: '',
                        ty_lian4: '连同',
                        ty_lian4_info: '',
                        ty_beifa3: '北伐',
                        ty_beifa3_info: '出牌阶段,你可以将x张牌作为【火杀】对一名角色使用(x为<北伐>标记数加1),获得一枚<北伐>标记',
                        ty_zhulian: '诛连',
                        ty_zhulian_info: '①出牌阶段限x次(x为你的体力值),你可以选择一张手牌或装备区域的牌并令一名角色获得之,若此牌为黑,其将所有<连>标记变为<诛>并获得一枚诛标记,反之亦然.②拥有<诛>标记的角色拥有技能【诛】,拥有<连>标记的角色拥有技能【连】,有角色对你造成伤害后你可令其获得一枚<诛>,若其已有<诛>或<连>则改为数量加一并转换为另一种标记',
                        ty_zhulian2: '诛连受伤',
                        ty_zhulian2_info: '',
                        ty_zhulian3: '株连减少',
                        ty_zhulian3_info: '',
                        ty_xiahui: '黠慧',
                        ty_xiahui_info: '①锁定技,你受到大于1的伤害时将伤害值减少至1并摸减少数张牌,翻面并增加一点体力上限(最多为5).②当场上拥有<诛>或<连>的角色数变化时,你摸一张牌若场上拥有<连>角色数小于拥有<诛>的角色数,你选择并弃置一张牌.③在一名有<诛>的角色造成伤害令无<诛>的角色濒死时/有<连>的角色对无<连>的角色造成伤害后,你回复一点体力/摸一张牌',
                        ty_zhengrong: '征荣',
                        ty_zhengrong_info: '①当你使用基本牌或锦囊牌指定目标一名与你的距离大于一的目标后(若当前角色数小于等于3则依旧触发),你可以将一名目标角色的一张牌置于你的武将牌上,称为<荣>,若此时你的<荣>数量小于等于你的体力值,你摸一张牌,否则你摸一张牌选择你区域内的一张牌弃置.②你的出牌阶段开始或你濒死时,你可以用等量的手牌交换等量的<荣>',
                        ty_weijiang: '蔚疆',
                        ty_weijiang_info: '当一名距离你小于等于1的角色(包括你)受到来源不为你且有来源牌的伤害后,你可以令其获得伤害来源牌并选择你的一张<荣>获得之,若如此做,你视为对伤害来源使用了一张实体【杀】',
                        借鉴急袭: '借鉴急袭',
                        借鉴急袭_info: '结束阶段开始时,若你没有<醇>,你可以将至少一张【杀】置于你的武将牌上,称为<醇>.当一名角色处于濒死状态时,你可以移去一张<醇>,视为该角色使用一张【酒】',
                        ty_juyi: '聚义',
                        ty_juyi_info: '出牌阶段,你可以令一名没有<义士>标记的其他角色获得你的一张<荣>并获得<义士>标记,你与其各从牌堆底摸一张牌,你计算到有<义士>标记角色的距离视为1',
                        ty_juyi2: '聚义消除',
                        ty_juyi2_info: '',
                        ty_juyi3: '聚义距离减少',
                        ty_juyi3_info: '锁定技,有【义】的角色与你的距离视为1',
                        ty_juyi1: '聚义标记',
                        ty_juyi1_info: '清侧勤王,末将义不容辞!',
                        ty_zhengrong1: '征荣换牌',
                        ty_zhengrong1_info: '',
                        ty_cuanzei: '篡贼',
                        ty_cuanzei_info: '',
                        ty_facuan: '伐篡',
                        ty_facuan_info: '限定技,出牌阶段若你的<荣>数量大于你的体力值,你可以指定一名角色作为【篡贼】,每当【篡贼】造成伤害后,回复体力后,或是回合结束时,若你的<荣>数量大于你的体力值,则你选择一张<荣>弃置并视为对其使用一张杀,否则其失去【篡贼】;在【篡贼】造成伤害后,回复体力后,或回合结束时,拥有<义士>的角色也可以移除自身<义士>标记并视为对【篡贼】使用一张杀',
                        ty_facuan1: '伐篡用杀',
                        ty_facuan1_info: '',
                        ty_hongju: '鸿举',
                        ty_hongju_info: '觉醒技,准备阶段,若你武将牌上【荣】的数量不小于你的体力值,则你摸等同于【荣】数量的牌,失去一点体力上限并回复一点体力并获得技能【聚义】,【伐篡】',
                        ty_facuan2: '伐篡来源用杀',
                        ty_facuan2_info: '',
                        ty_juyi4: '聚义来源用杀',
                        ty_juyi4_info: '',
                        ty_huogang: '祸纲',
                        ty_huogang_info: '每回合限两次,当一名手牌数大于等于你或装备区牌数小于你的其他角色使用一张牌后,你可以发现一张牌(从三张牌中选择一张)并将此牌效果改为你发现牌的效果,若此牌的有目标且目标装备区内有牌,你选择一张获得之',
                        ty_taoluan: '滔乱',
                        ty_taoluan_info: '每轮限x次(x为你装备区牌数)你可以将一张装备区中的牌当做任意一张牌使用(闪,无懈,延迟锦囊除外),你的回合结束时,若你发动过【滔乱】,你可以选择至多y名角色并获得他们各一张牌(y为你本回合发动【滔乱】的次数)',
                        ty_taoluan1: '滔乱使摸',
                        ty_taoluan1_info: '',
                        ty_taoluan2: '滔乱结摸',
                        ty_taoluan2_info: '',
                        ty_taoluan3: '滔乱摸声',
                        ty_taoluan3_info: '',
                        ty_taoluan4: '滔乱声',
                        ty_taoluan4_info: '',
                        ty_taoluan5: '滔乱无懈',
                        ty_taoluan5_info: '',
                        ty_taoluan6: '滔乱闪',
                        ty_taoluan6_info: '',
                        ty_taoluan7: '滔乱无效',
                        ty_taoluan7_info: '锁定技,游戏开始时,你选择一名其他角色,当其受到伤害后,你受到等量的伤害,当其回复体力后,你回复等量的体力',
                        ty_fanglei: '方雷',
                        ty_fanglei_info: '出牌阶段开始时,你可以弃置一张手牌或装备牌与与之和为36点的<方>,对所有其他角色造成一点雷电伤害',
                        ty_jishigai: '济世',
                        ty_jishigai_info: '当一名角色进入濒死状态时,你进行一次判定,若判定结果不为♦️️你失去一点体力上限,否则你获得一点体力上限,结果为黑色牌时你与目标各摸一张牌;为♥️️时你与目标各回复1点生命值;为♦️️则你与目标各摸2张牌',
                        ty_beifa1: '北伐计数',
                        ty_beifa1_info: '',
                        ty_cuijiao: '摧蛟',
                        ty_cuijiao_info: '当你使用【火杀】指定目标后,你可选择:①失去一点体力并获得目标角色两张牌.②弃置一张普通锦囊牌并令此【杀】的伤害基数+1.③失去一点体力上限,并减少一枚<北伐>标记④背水:弃置所有装备区的牌,依次执行上述所有选项,并令此【杀】伤害基数加y(y为你弃置的装备牌数量).当你击杀一名角色后,你摸x张牌并移去一枚<北伐>(x为北伐标记数加1),增加一点体力上限并回复一点体力,此技能本回合失效',
                        ty_cuijiao1: '摧蛟杀人',
                        ty_cuijiao1_info: '',
                        ty_yongge: '恿戈',
                        ty_yongge_info: '觉醒技,准备阶段开始或你濒死时,若你的体力上限为1或你的手牌数为0,你选择一名手牌数最大的角色,令其增加x点体力上限并摸x张牌,你将体力上限调整到x并将体力回复至x-1,并从牌堆中装备五张不同的种类的装备牌,最后失去【北伐】并获得【战孤】.(x为你<北伐>标记数加1)',
                        ty_zhangu: '战孤',
                        ty_zhangu_info: '锁定技,准备或结束阶段,若你的体力上限大于1且没有手牌/装备区内没有牌,你从牌堆中获得三张类型不同的牌,若你已受伤,你失去一点体力上限,否则你失去一点体力',
                        ty_zhujian: '筑坚',
                        ty_zhujian_info: '①摸牌阶段或进入濒死时(濒死触发每局限一次),你可以失去一点体力上限,【戎备】x(x为体力上限).②你的装备区牌变化时,你将体力调整为y,并可以令一名角色将手牌数量调整到y(y为你装备区中牌的数量).③你即将受到伤害时,改为弃置等量的装备区中的牌,若装备区牌小于伤害数则弃置装备区的所有牌并令此伤害减少y',
                        ty_zhujian1: '筑坚',
                        ty_zhujian1_info: '',
                        ty_zhujian2: '筑坚',
                        ty_zhujian2_info: '',
                        ty_zhujian3: '筑坚',
                        ty_zhujian3_info: '',
                        ty_zhujian4: '筑坚信仰',
                        ty_zhujian4_info: '',
                        ty_zhujian5: '',
                        ty_zhujian5_info: '',
                        ty_zhengu: '镇骨',
                        ty_zhengu_info: '当一名距离你小于等于1的其他角色即将受到锦囊或火焰伤害时,若其没有<镇>,你可以将伤害转移给你并移动一张牌,其摸一张牌并获得<镇>,有<镇>的角色受到锦囊或火焰伤害后失去<镇>,你获得触发牌并选择一张装备区的牌弃置,有<镇>的角色回合开始时,其获得一点护甲并移去<镇>,且若你的体力上限小于等于其,你增加一点体力上限(最多为6)',
                        ty_zhengu1: '镇',
                        ty_zhengu1_info: '',
                        ty_zhengu2: '镇骨',
                        ty_zhengu2_info: '',
                        ty_zhengu3: '镇骨',
                        ty_zhengu3_info: '',
                        ty_longnu: '龙怒',
                        ty_longnu_info: '转换技,你转换此技能时失去一点体力并摸一张牌,你的雷,火属性杀无距离次数限制,(x为场上被横置的角色数).阳:①每回合限x次,你可以将一张红色手牌当做一张【火杀】使用或打出,转换此技能.②你受到基本牌或火属性伤害后转换此技能.③你受到雷属性伤害改为回复等量体力并摸等量张牌,场上被横置的其他角色造成的伤害属性为雷;阴:每回合限x次,你可以将一张黑色手牌当做【雷杀】使用或打出,转换此技能.②你受到锦囊牌或雷属性伤害后转换此技能.③你受到火属性伤害改为回复等量体力并摸等量张牌,场上被横置的其他角色造成的伤害属性为火',
                        ty_longnu1: '龙怒',
                        ty_longnu1_info: '',
                        ty_lianying: '连营',
                        ty_lianying_info: '①锁定技,游戏开始时或当你的武将牌重置时,你横置②你使用一张火或雷属性杀指定目标后,你可以横置一名未被横置的其他角色③你受到伤害后横置伤害源,一名横置角色死亡的回合结束后你失去一点体力上限并执行一个额外的回合',
                        ty_lianying1: '连营',
                        ty_lianying1_info: '',
                        ty_lianying2: '连营',
                        ty_lianying2_info: '',
                        ty_lianying3: '连营',
                        ty_lianying3_info: '',
                        ty_lianying4: '',
                        ty_lianying4_info: '',
                        ty_longnu2: '',
                        ty_longnu2_info: '',
                        ty_longnu3: '龙怒',
                        ty_longnu3_info: '',
                        ty_longnu4: '龙怒',
                        ty_longnu4_info: '',
                        ty_lianying5: '连营',
                        ty_lianying5_info: '',
                        ty_longnu5: '龙怒',
                        ty_longnu5_info: '',
                    },
                    skill: {
                        1: {
                            audio: 'ext:汤圆神将包/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.hasMark('renjie');
                            },
                            position: 'he',
                            filterCard(card, player, event) {
                                event = event || _status.event;
                                if (typeof event != 'string') event = event.parent.name;
                                var mod = game.checkMod(card, player, event, 'unchanged', 'cardDiscardable', player);
                                if (mod != 'unchanged') return mod;
                                return true;
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            selectCard: [1, Infinity],
                            prompt: '弃置一枚<忍>,弃置任意张牌并摸等量的牌.若弃置了所有的手牌,则可以多摸一张牌',
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    get.position(card) == 'h' &&
                                    !player.countCards('h', function (card) {
                                        return get.value(card) >= 8;
                                    })
                                ) {
                                    return 8 - get.value(card);
                                }
                                return 6 - get.value(card);
                            },
                            content() {
                                'step 0';
                                player.removeMark('renjie', 1);
                                player.discard(cards);
                                event.num = 1;
                                var hs = player.getCards('h');
                                if (!hs.length) event.num = 0;
                                for (var i = 0; i < hs.length; i++) {
                                    if (!cards.includes(hs[i])) {
                                        event.num = 0;
                                        break;
                                    }
                                }
                                ('step 1');
                                player.draw(event.num + cards.length);
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        var num = 0;
                                        var cards = player.getCards('he');
                                        for (var i = 0; i < cards.length; i++) {
                                            if (get.value(cards[i]) < 6) {
                                                num++;
                                            }
                                        }
                                        if (cards.length > 2) return 1;
                                        if (cards.length == 2 && player.storage.jilue > 1);
                                        return 0;
                                    },
                                },
                                threaten: 1.5,
                            },
                        },
                        2: {
                            audio: 'ext:汤圆神将包/audio:2',
                            usable: 1,
                            preHidden: true,
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return player != event.player && event.num < event.player.hp;
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) > -2) return false;
                                if (player.hp > 2) return true;
                                if (player.hp == 2 && event.player.hp < 3) return false;
                                return player.hp > 1;
                            },
                            logTarget: 'player',
                            content() {
                                player.loseHp();
                                trigger.player.addTempSkill('yimie2');
                                trigger.yimie_num = trigger.player.hp - trigger.num;
                                trigger.num = trigger.player.hp;
                            },
                        },
                        天罚: {
                            mod: {
                                targetInRange(card) {
                                    if (card.name == 'sha') return true;
                                },
                            },
                            trigger: {
                                player: 'useCardToTargeted',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && !player.inRange(event.target);
                            },
                            forced: true,
                            logTarget: 'target',
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    var type = get.subtype(card);
                                    return ['equip1', 'equip4', 'equip3', 'equip6'].includes(type) ? 6 : -6;
                                    switch (type) {
                                        case 'equip':
                                            return 4;
                                        case 'trick':
                                            return -4;
                                        default:
                                            return 0;
                                    }
                                }).judge2 = function (result) {
                                    return result.bool;
                                };
                                ('step 1');
                                if (trigger.parent.addCount !== false) {
                                    trigger.parent.addCount = false;
                                    var stat = player.getStat();
                                    if (stat && stat.card && stat.card.sha) stat.card.sha--;
                                }
                                if (result.bool === true) {
                                    var map = trigger.customArgs;
                                    var id = trigger.target.playerid;
                                    if (!map[id]) map[id] = {};
                                    if (typeof map[id].extraDamage != 'number') map[id].extraDamage = 0;
                                    map[id].extraDamage += trigger.target.hp - 1;
                                } else if (result.bool === false);
                            },
                        },
                        定夺: {
                            audio: 'liyu',
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.player != player && event.player.isAlive() && event.player.countGainableCards(player, 'hej') > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player
                                    .gainPlayerCard(get.prompt('new_liyu', trigger.player), trigger.player, 'hej', 'visibleMove')
                                    .set('ai', function (button) {
                                        var player = _status.event.player;
                                        var evt = _status.event.target;
                                        if (get.attitude(player, evt) > 0 && get.position(button.link) == 'j') return 4 + get.value(button.link);
                                        if (get.type(button.link) == 'equip') {
                                            if (
                                                get.attitude(player, evt) > 0 &&
                                                game.hasPlayer(function (current) {
                                                    return player.canUse({ name: 'juedou' }, current) && current != evt.target && get.effect(current, { name: 'juedou' }, player, player) > 2;
                                                })
                                            ) {
                                                return 5;
                                            } else if (
                                                game.hasPlayer(function (current) {
                                                    return player.canUse({ name: 'juedou' }, current) && current != evt && current != player && get.effect(current, { name: 'juedou' }, player, player) < 0;
                                                })
                                            ) {
                                                return 1;
                                            } else return 4;
                                        }
                                        return 3;
                                    })
                                    ('step 1');
                                if (result.cards?.length) {
                                    if (get.type(result.cards[0]) != 'equip') {
                                        trigger.player();
                                        event.finish();
                                    } else {
                                        if (
                                            !game.hasPlayer(function (current) {
                                                return current != player && current != trigger.player && player.canUse('juedou', current);
                                            })
                                        ) {
                                            event.finish();
                                            return;
                                        }
                                        trigger.player
                                            .chooseTarget(
                                                true,
                                                function (card, player, target) {
                                                    var evt = _status.event.parent;
                                                    return evt.player.canUse({ name: 'juedou' }, target) && target != _status.event.player;
                                                },
                                                '请选择一名角色,视为' + get.translation(player) + '对其使用【决斗】'
                                            )
                                            .set('ai', function (target) {
                                                var evt = _status.event.parent;
                                                return get.effect(target, { name: 'juedou' }, evt.player, _status.event.player) - 2;
                                            });
                                    }
                                } else event.finish();
                                ('step 2');
                                if (result.targets?.length) {
                                    player.useCard({ name: 'juedou' }, result.targets[0], 'noai');
                                }
                            },
                            ai: {
                                halfneg: true,
                            },
                        },
                        封异: {
                            shaRelated: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['boss_lvbu3'],
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                player.judge(function () {
                                    return 0;
                                });
                                if (!trigger.target.hasSkill('fengyin')) {
                                    trigger.target.addTempSkill('fengyin');
                                }
                                ('step 1');
                                var suit = result.suit;
                                var target = trigger.target;
                                var num = target.countCards('h', 'shan');
                                target
                                    .chooseToDiscard('请弃置一张' + get.translation(suit) + '牌,否则不能使用闪抵消此杀', 'he', function (card) {
                                        return card.suit == _status.event.suit;
                                    })
                                    .set('ai', function (card) {
                                        var num = _status.event.num;
                                        if (num == 0) return 0;
                                        if (card.name == 'shan') return num > 1 ? 2 : 0;
                                        return 8 - get.value(card);
                                    })
                                    .set('num', num)
                                    .set('suit', suit);
                                ('step 2');
                                if (!result.bool) {
                                    trigger.parent.directHit.add(trigger.target);
                                }
                            },
                            ai: {
                                ignoreSkill: true,
                                skillTagFilter(player, tag, arg) {
                                    if (tag == 'directHit_ai') {
                                        return get.attitude(player, arg.target) <= 0;
                                    }
                                    if (!arg || arg.isLink || !arg.card || arg.card.name != 'sha') return false;
                                    if (!arg.target || get.attitude(player, arg.target) >= 0) return false;
                                    if (!arg.skill || !lib.skill[arg.skill] || lib.skill[arg.skill].charlotte || get.is.locked(arg.skill) || !arg.target.getSkills(true, false).includes(arg.skill)) return false;
                                },
                                directHit_ai: true,
                            },
                        },
                        神烈: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'chooseToUse',
                            viewAs: {
                                name: 'sha',
                            },
                            viewAsFilter(player) {
                                return player.countCards('hs') > 0;
                            },
                            selectCard: [1, 4],
                            selectTarget() {
                                var card = get.card(),
                                    player = get.player();
                                if (card == undefined) return;
                                var range = [1, Math.max(1, ui.selected.cards.length)];
                                game.checkMod(card, player, range, 'selectTarget', player);
                                return range;
                            },
                            complexCard: true,
                            filterCard(card) {
                                if (!ui.selected.cards.length) return true;
                                var suit = card.suit;
                                for (var i of ui.selected.cards) {
                                    if (i.suit == suit) return false;
                                }
                                return true;
                            },
                            check(card) {
                                var player = _status.event.player,
                                    card = { name: 'sha' };
                                if (
                                    game.countPlayer(function (current) {
                                        return get.effect_use(current, card, player, player) > 0;
                                    }) <= ui.selected.cards.length
                                )
                                    return 0;
                                return 5 - get.value(card);
                            },
                            position: 'hs',
                            onuse(links, player) {
                                player.addTempSkill('xiongmang_effect');
                            },
                            ai: {
                                order: () => get.order({ name: 'sha' }) + 0.2,
                                respondSha: true,
                                skillTagFilter(player, tag, arg) {
                                    return player.countCards('hs') > 0;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                            subSkill: {
                                effect: {
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return (
                                            event.skill == 'xiongmang' &&
                                            !player.hasHistory('sourceDamage', function (evt) {
                                                return evt.card == event.card;
                                            })
                                        );
                                    },
                                    content() {
                                        player.loseMaxHp();
                                    },
                                },
                            },
                        },
                        倾力: {
                            derivation: ['beishui', 'qingjiao'],
                            trigger: {
                                global: 'phaseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            juexingji: true,
                            forced: true,
                            init(player, skill) {
                                if (!player.storage[skill]) player.storage[skill] = false;
                            },
                            filter(event, player) {
                                if (player.storage.choujue) return false;
                                return Math.abs(player.hp - player.countCards('h')) >= 3;
                            },
                            content() {
                                player.awakenSkill('choujue');
                                player.storage.choujue = true;
                                player.loseMaxHp();
                                player.addSkill('beishui');
                            },
                        },
                        ty_jingming: {
                            trigger: {
                                player: 'useCard',
                            },
                            group: 'ty_lingcun',
                            audio: 'ext:汤圆神将包/audio:2',
                            filter(event, player) {
                                return event.card && ((get.tag(event.card, 'damage') && get.type(event.card) == 'trick') || (event.card.name == 'sha' && !event.card.nature && event.card.suit == 'club')) && player.isDamaged();
                            },
                            content() {
                                trigger.baseDamage++;
                                player.loseHp(1);
                                player.loseMaxHp(1);
                            },
                        },
                        知命: {
                            trigger: {
                                player: 'dying',
                            },
                            juexingji: false,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                player.recover(3 - player.hp);
                                player.loseMaxHp(1);
                                player.addSkill('奋搏');
                                player.removeSkill('知命');
                            },
                        },
                        星引: {
                            audio: 'ext:汤圆神将包/audio:2',
                            juexingji: true,
                            derivation: 'reguanxing',
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.storage.zhiji) return false;
                                return player.countCards('h') == 0;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('olzhiji');
                                player.chooseDrawRecover(2, true);
                                ('step 1');
                                player.loseMaxHp();
                                player.storage.olzhiji = true;
                                player.addSkill('reguanxing');
                            },
                        },
                        星谋: {
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCardEnd',
                            },
                            check(event, player) {
                                return get.value(event.cards) + player.maxHp * 2 - 18 > 0;
                            },
                            filter(event, player) {
                                return player.isPhaseUsing() && get.type(event.card) == 'trick' && event.cards.filterInD().length;
                            },
                            content() {
                                player.loseMaxHp();
                                player.gain(trigger.cards.filterInD(), 'gain2', 'log');
                            },
                        },
                        拜天: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            derivation: ['zyexin', 'zzili'],
                            init(player) {
                                player.storage.zbaijiang = false;
                            },
                            filter(event, player) {
                                return !player.storage.zbaijiang && player.countCards('e') >= 2;
                            },
                            content() {
                                player.storage.zbaijiang = true;
                                player.removeSkill('zzhenggong');
                                player.removeSkill('zquanji');
                                player.removeSkill('zbaijiang');
                                player.addSkill('zyexin');
                                player.addSkill('zzili');
                                player.gainMaxHp();
                            },
                        },
                        逆局: {
                            audio: 'botu',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countMark('rebotu_count') >= Math.min(3, game.countPlayer())) return false;
                                var suits = [];
                                game.getGlobalHistory('cardMove', function (evt) {
                                    if (suits.length >= 4) return;
                                    if (evt.name == 'lose') {
                                        if (evt.position == ui.discardPile) {
                                            for (var i of evt.cards) suits.add(i.suit);
                                        }
                                    } else {
                                        if (evt.name == 'cardsDiscard') {
                                            for (var i of evt.cards) suits.add(i.suit);
                                        }
                                    }
                                });
                                return suits.length >= 4;
                            },
                            content() {
                                player.addTempSkill('rebotu_count', 'roundStart');
                                player.addMark('rebotu_count', 1, false);
                                player.loseMaxHp();
                                player.draw();
                                player.phase('nodelay');
                            },
                            group: 'rebotu_mark',
                            subSkill: {
                                count: {
                                },
                                mark: {
                                    trigger: {
                                        global: ['loseAfter', 'cardsDiscardAfter'],
                                        player: 'phaseAfter',
                                    },
                                    forced: true,
                                    firstDo: true,
                                    silent: true,
                                    filter(event, player) {
                                        if (event.name == 'phase') return true;
                                        if (player != _status.currentPhase) return false;
                                        if (event.name == 'lose') return event.position == ui.discardPile;
                                        return true;
                                    },
                                    content() {
                                        if (trigger.name == 'phase') {
                                            player.unmarkSkill('rebotu_mark');
                                            return;
                                        }
                                        var suits = [];
                                        game.getGlobalHistory('cardMove', function (evt) {
                                            if (suits.length >= 4) return;
                                            if (evt.name == 'lose') {
                                                if (evt.position == ui.discardPile) {
                                                    for (var i of evt.cards) suits.add(i.suit);
                                                }
                                            } else {
                                                if (evt.name == 'cardsDiscard') {
                                                    for (var i of evt.cards) suits.add(i.suit);
                                                }
                                            }
                                        });
                                        player.storage.rebotu_mark = suits;
                                        player.markSkill('rebotu_mark');
                                    },
                                    intro: {
                                        content: '本回合已有$花色的牌进入过弃牌堆',
                                    },
                                },
                            },
                        },
                        心智: {
                            audio: 'ext:汤圆神将包/audio:2',
                            juexingji: true,
                            derivation: 'gongxin',
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h') >= player.hp + 2) return true;
                                return false;
                            },
                            content() {
                                player.awakenSkill('qinxue');
                                player.loseMaxHp();
                                player.chooseDrawRecover(2, true);
                                player.addSkill('gongxin');
                            },
                        },
                        裂魂: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            filter: (event, player) => game.hasPlayer((current) => current != player && current.maxHp > 1),
                            filterTarget: (card, player, target) => target != player && target.maxHp > 1,
                            content() {
                                'step 0';
                                target.loseMaxHp();
                                ('step 1');
                                if (target.isIn()) target.addMark('yingba_mark', 1);
                                player.loseMaxHp();
                            },
                            mod: {
                                targetInRange(card, player, target) {
                                    if (target.hasMark('yingba_mark')) return true;
                                },
                            },
                            ai: {
                                combo: 'scfuhai',
                                threaten: 3,
                                order: 2,
                                result: {
                                    target(player, target) {
                                        if (target.isHealthy()) return -2;
                                        return -1;
                                    },
                                },
                            },
                            subSkill: {
                                mark: {
                                    marktext: '定',
                                    intro: {
                                        name: '平定',
                                        content: 'mark',
                                    },
                                    mod: {
                                        maxHandcard(player, numx) {
                                            var num = player.countMark('yingba_mark');
                                            if (num > 0)
                                                return (
                                                    numx +
                                                    num *
                                                    game.countPlayer(function (current) {
                                                        return current.hasSkill('yingba');
                                                    })
                                                );
                                        },
                                    },
                                },
                            },
                        },
                        魂存: {
                            juexingji: false,
                            audio: 'ext:汤圆神将包/audio:true',
                            derivation: 'oltiaoxin',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return !player.storage.kunfen;
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp(2);
                                ('step 1');
                                if (player.hp < 1) {
                                    player.recover();
                                }
                                ('step 2');
                                player.storage.kunfen = true;
                            },
                        },
                        ty_lingcun: {
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                if (player.maxHp > 2) {
                                    player.recover(1 - player.hp);
                                    player.loseMaxHp(2);
                                } else {
                                    player.die();
                                }
                            },
                        },
                        尽命: {
                            trigger: {
                                player: 'useCard',
                            },
                            filter(event, player) {
                                return event.card && (event.card.name == 'nanman' || event.card.name == 'wanjian' || event.card.name == 'huogong' || (event.card.name == 'sha' && !event.card.nature)) && player.isDamaged();
                            },
                            content() {
                                trigger.baseDamage++;
                                if (game.roundNumber <= player.hp) player.loseHp(1);
                                if (game.roundNumber <= player.hp) player.loseMaxHp(1);
                            },
                        },
                        延命: {
                            trigger: {
                                player: 'dying',
                            },
                            juexingji: false,
                            forced: true,
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                player.recover(1 - player.hp);
                                player.loseMaxHp(1);
                            },
                        },
                        策喻: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.recover();
                                        player.draw();
                                        break;
                                    case 'diamond':
                                        player.draw();
                                        player.draw();
                                        break;
                                    case 'club':
                                        player.draw();
                                        player.judge();
                                        break;
                                    case 'spade':
                                        player.draw();
                                        player.gainMaxHp();
                                        break;
                                }
                            },
                        },
                        残志: {
                            trigger: {
                                global: 'dying',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.player.recover();
                                        player.draw();
                                        player.recover();
                                        break;
                                    case 'diamond':
                                        trigger.player.draw();
                                        player.draw();
                                        break;
                                    case 'club':
                                        trigger.player.draw();
                                        player.judge();
                                        break;
                                    case 'spade':
                                        trigger.player.draw();
                                        player.gainMaxHp();
                                        player.draw();
                                        break;
                                }
                            },
                        },
                        延魂: {
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.recover();
                                        player.loseMaxHp();
                                        break;
                                    case 'diamond':
                                        player.draw();
                                        player.loseMaxHp();
                                        break;
                                    case 'club':
                                        player.judge();
                                        player.loseMaxHp();
                                        break;
                                    case 'spade':
                                        player.loseMaxHp();
                                        player.gainMaxHp(2);
                                        break;
                                }
                            },
                        },
                        雷公: {
                            group: 'xinleiji_misa',
                            audio: 'ext:汤圆神将包/audio:true',
                            audioname: ['boss_qinglong'],
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            filter(event, player) {
                                return event.card.name == 'shan' || (event.name == 'useCard' && event.card.name == 'shandian');
                            },
                            judgeCheck(card, bool) {
                                var suit = card.suit;
                                if (suit == 'spade') {
                                    if (bool && card.number > 1 && card.number < 10) return 5;
                                    return 4;
                                }
                                if (suit == 'club') return 2;
                                return 0;
                            },
                            content() {
                                player.judge(lib.skill.xinleiji.judgeCheck).judge2 = function (result) {
                                    return result.bool ? true : false;
                                };
                            },
                            ai: {
                                useShan: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (
                                            get.tag(card, 'respondShan') &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        ) {
                                            var hastarget = game.hasPlayer(function (current) {
                                                return get.attitude(target, current) < 0;
                                            });
                                            var be = target.countCards('e', { color: 'black' });
                                            if (target.countCards('h', 'shan') && be) {
                                                if (!target.hasSkill('xinguidao')) return 0;
                                                return [0, hastarget ? target.countCards('he') / 2 : 0];
                                            }
                                            if (target.countCards('h', 'shan') && target.countCards('h') > 2) {
                                                if (!target.hasSkill('xinguidao')) return 0;
                                                return [0, hastarget ? target.countCards('h') / 4 : 0];
                                            }
                                            if (target.countCards('h') > 3 || (be && target.countCards('h') >= 2)) {
                                                return [0, 0];
                                            }
                                            if (target.countCards('h') == 0) {
                                                return [1.5, 0];
                                            }
                                            if (target.countCards('h') == 1 && !be) {
                                                return [1.2, 0];
                                            }
                                            if (!target.hasSkill('xinguidao')) return [1, 0.05];
                                            return [1, Math.min(0.5, (target.countCards('h') + be) / 4)];
                                        }
                                    },
                                },
                            },
                        },
                        聚民: {
                            ai: {
                                reverseEquip: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && player == target && player == _status.currentPhase && get.subtype(card) == 'equip1') return [1, 3];
                                    },
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player != _status.currentPhase) return false;
                                if (event.parent.triggeredTargets3.length > 1) return false;
                                if (get.type(event.card) == 'equip' && get.subtype(event.card) != 'equip1') return false;
                                if (event.targets.includes(player)) return true;
                                return false;
                            },
                            callback() {
                                player.addToExpansion(card, 'gain2').gaintag.add('xinfu_jijun');
                            },
                            content() {
                                player.draw();
                                player.gainMaxHp();
                                player.judge(function (card) {
                                    return 1;
                                }).callback = lib.skill.xinfu_jijun.callback;
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                                mark(dialog, content, player) {
                                    var content = player.getExpansions('聚民');
                                    if (content && content.length) {
                                        dialog.addAuto(content);
                                        if (player == game.me || player.isUnderControl()) {
                                            var list = lib.skill.xinfu_fangtong.getAuto(player);
                                            if (list.length) {
                                                dialog.addText('<li>推荐方案:' + get.translation(list[0]) + '+ ' + get.translation(list.slice(1)));
                                            }
                                        }
                                    }
                                },
                            },
                            marktext: '方',
                        },
                        济民: {
                            trigger: {
                                global: 'dying',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.player.recover();
                                        player.gainMaxHp();
                                        player.recover();
                                        trigger.player.draw();
                                        break;
                                    case 'diamond':
                                        trigger.player.draw();
                                        player.draw();
                                        player.gainMaxHp(1);
                                        trigger.player.gainMaxHp();
                                        break;
                                    case 'club':
                                        trigger.player.draw();
                                        player.draw();
                                        player.draw();
                                        trigger.player.draw();
                                        break;
                                    case 'spade':
                                        trigger.player.draw();
                                        player.gainMaxHp();
                                        player.recover();
                                        trigger.player.loseHp();
                                        break;
                                }
                            },
                        },
                        天旨: {
                            trigger: {
                                player: 'judge',
                            },
                            forced: true,
                            content() {
                                var suit = trigger.card.suit;
                                switch (suit) {
                                    case 'heart':
                                        player.recover();
                                        break;
                                    case 'diamond':
                                        player.gainMaxHp();
                                        break;
                                    case 'club':
                                        player.draw();
                                        break;
                                    case 'spade':
                                        player.judge();
                                        player.judge();
                                        break;
                                }
                            },
                        },
                        塑影: {
                            trigger: {
                                player: 'useCardEnd',
                            },
                            audio: 'ext:Thunder/audio/skill:2',
                            filter(event, player) {
                                if (!player.storage.th_jiufa_count) player.storage.th_jiufa_count = [];
                                return player.storage.th_jiufa_count.length == 2;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.storage.th_jiufa_count = [];
                                player.chooseBool(get.prompt('th_jiufa')).set('prompt2', '你每次使用九张不同牌名的牌后,你可以亮出牌堆顶的九张牌,你选择并获得其中点数相同的牌各一张,其余的牌置入弃牌堆').ai = () => true;
                                ('step 1');
                                if (result.bool) {
                                    event.cards = get.cards(5).sort(function (a, b) {
                                        return a.number - b.number;
                                    });
                                    game.cardsGotoOrdering(event.cards);
                                    game.log(player, '展示了', event.cards);
                                    event.videoId = lib.status.videoId++;
                                    game.broadcastAll(
                                        function (player, id, cards) {
                                            var str;
                                            if (player == game.me && !_status.auto) {
                                                str = '九伐:选择并获得其中点数相同的牌各一张';
                                            } else {
                                                str = '九伐';
                                            }
                                            var dialog = ui.create.dialog(str, cards);
                                            dialog.videoId = id;
                                        },
                                        player,
                                        event.videoId,
                                        event.cards
                                    );
                                    event.time = get.utc();
                                    game.addVideo('showCards', player, ['九伐', get.cardsInfo(event.cards)]);
                                    game.addVideo('delay', null, 2);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var next = player.chooseButton([0, 4]);
                                next.set('dialog', event.videoId);
                                next.set('filterButton', function (button) {
                                    var map = {};
                                    if (Array.isArray(event.cards))
                                        for (var i of event.cards) {
                                            if (map[i.number] == undefined) map[i.number] = 1;
                                            else map[i.number]++;
                                        }
                                    if (map[button.link.number] == 1) return false;
                                    var select = {};
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        select[ui.selected.buttons[i].link.number] = true;
                                    }
                                    return !select[button.link.number];
                                });
                                next.set('ai', function (button) {
                                    return get.value(button.link, _status.event.player);
                                });
                                ('step 3');
                                if (result.bool && result.links) {
                                    var cards2 = [];
                                    for (var i = 0; i < result.links.length; i++) {
                                        cards2.push(result.links[i]);
                                        cards.remove(result.links[i]);
                                    }
                                    event.cards2 = cards2;
                                } else {
                                    game.broadcastAll('closeDialog', event.videoId);
                                    if (cards.length) {
                                        player.loseToDiscardpile(cards);
                                    }
                                    event.finish();
                                }
                                var time = 1000 - (get.utc() - event.time);
                                if (time > 0) {
                                }
                                ('step 4');
                                game.broadcastAll('closeDialog', event.videoId);
                                var cards2 = event.cards2;
                                player.gain(cards2, 'log', 'gain2');
                                if (cards.length) {
                                    player.loseToDiscardpile(cards);
                                }
                            },
                            group: 'th_jiufa_count',
                            subSkill: {
                                count: {
                                    trigger: {
                                        player: 'useCard1',
                                    },
                                    forced: true,
                                    audio: 'th_jiufa',
                                    filter(event, player) {
                                        if (!player.storage.th_jiufa_count) player.storage.th_jiufa_count = [];
                                        return !player.storage.th_jiufa_count.includes(get.translation(event.card.name)) && player.storage.th_jiufa_count.length < 2;
                                    },
                                    content() {
                                        player.storage.th_jiufa_count.push(get.translation(trigger.card.name));
                                        player.markAuto('th_jiufa_count');
                                    },
                                    mark: true,
                                    marktext: '九伐',
                                    intro: {
                                        content(storage, player) {
                                            return '已使用牌名:' + player.storage.th_jiufa_count;
                                        },
                                    },
                                },
                            },
                        },
                        释魂: {
                            audio: 'gongao',
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                var targets = game.filterPlayer();
                                ('step 0');
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        targets.recover();
                                        player.gainMaxHp(2);
                                        player.recover(2);
                                        break;
                                    case 'diamond':
                                        targets.draw();
                                        player.draw(3);
                                        break;
                                    case 'club':
                                        player.draw(4);
                                        targets.chooseToDiscard();
                                        break;
                                    case 'spade':
                                        targets.loseMaxHp();
                                        player.gainMaxHp();
                                        player.recover(36);
                                        break;
                                }
                            },
                        },
                        天指: {
                            trigger: {
                                player: 'judge',
                            },
                            forced: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                'step 0';
                                var cards = get.cards(1);
                                game.cardsGotoOrdering(cards);
                                player.showCards(cards, '旨');
                                var cardsx = [];
                                ('step 1');
                                switch (get.cards.suit) {
                                    case 'heart':
                                        player.cover();
                                        break;
                                    case 'diamond':
                                        player.gainMaxHp();
                                        break;
                                    case 'club':
                                        player.draw();
                                        break;
                                    case 'spade':
                                        player.judge();
                                        player.judge();
                                        break;
                                }
                            },
                        },
                        三合: {
                            ai: {
                                reverseEquip: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && player == target && player == _status.currentPhase && get.subtype(card) == 'equip1') return [1, 3];
                                    },
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player != _status.currentPhase) return false;
                                if (event.parent.triggeredTargets3.length > 1) return false;
                                if (get.type(event.card) == 'equip' && get.subtype(event.card) != 'equip1') return false;
                                if (event.targets.includes(player)) return true;
                                return false;
                            },
                            callback() {
                                player.addToExpansion(card, 'gain2').gaintag.add('xinfu_jijun');
                            },
                            content() {
                                player.judge(function (card) {
                                    return 1;
                                }).callback = lib.skill.xinfu_jijun.callback;
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                                mark(dialog, content, player) {
                                    var content = player.getExpansions('xinfu_jijun');
                                    if (content && content.length) {
                                        dialog.addAuto(content);
                                        if (player == game.me || player.isUnderControl()) {
                                            var list = lib.skill.xinfu_fangtong.getAuto(player);
                                            if (list.length) {
                                                dialog.addText('<li>推荐方案:' + get.translation(list[0]) + '+ ' + get.translation(list.slice(1)));
                                            }
                                        }
                                    }
                                },
                            },
                            marktext: '人合',
                        },
                        化影: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.storage.hshuanling.length && player.countCards('he');
                            },
                            init(player) {
                                player.storage.hshuanling = [];
                            },
                            intro: {
                                content: 'cards',
                            },
                            content() {
                                'step 0';
                                var num = Math.min(Math.max(1, player.countCards('e')), player.storage.hshuanling.length);
                                var next = player.chooseToDiscard('he', get.prompt2('hshuanling'), [1, num]);
                                next.ai = function (card) {
                                    if (get.position(card) == 'e') return 7 - get.value(card);
                                    return 8 - get.value(card);
                                };
                                next.delay = false;
                                ('step 1');
                                if (result.bool) {
                                    event.num = result.cards.length;
                                    player.draw(event.num);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num) {
                                    var targets = game.filterPlayer();
                                    var list = player.storage.hshuanling.slice(0);
                                    while (list.length) {
                                        var choice = list.randomRemove();
                                        var card = game.createCard(choice);
                                        var target;
                                        while (targets.length) {
                                            target = targets.randomRemove();
                                            if (lib.filter.targetEnabled2(card, player, target) && get.effect(target, card, player, player) > 0) {
                                                break;
                                            }
                                            target = null;
                                        }
                                        if (target) {
                                            player.storage.hshuanling.remove(choice);
                                            if (!player.storage.hshuanling.length) {
                                                player.unmarkSkill('hshuanling');
                                            } else {
                                            }
                                            player.useCard(card, target);
                                            break;
                                        }
                                    }
                                    event.num--;
                                    event.redo();
                                }
                            },
                            group: ['hshuanling_count'],
                            subSkill: {
                                count: {
                                    trigger: {
                                        global: 'useCard',
                                    },
                                    silent: true,
                                    filter(event, player) {
                                        if (get.is.converted(event)) return false;
                                        if (event.player.isFriendsOf(player)) return false;
                                        if (get.type(event.card) != 'trick') return false;
                                        if (event.targets.length != 1) return false;
                                        // if(event.targets[0].isEnemiesOf(player)) return false;
                                        if (get.info(event.card).multitarget) return false;
                                        if (get.info(event.card).singleCard) return false;
                                        if (!get.info(event.card).enable) return false;
                                        return true;
                                    },
                                    content() {
                                        player.storage.hshuanling.add(trigger.card);
                                        player.markSkill('hshuanling');
                                    },
                                    forced: true,
                                },
                            },
                        },
                        聚众: {
                            ai: {
                                reverseEquip: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && player == target && player == _status.currentPhase && get.subtype(card) == 'equip1') return [1, 3];
                                    },
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.parent.triggeredTargets3.length > 1) return false;
                                return true;
                            },
                            callback() {
                                player.addToExpansion(card, 'gain2').gaintag.add('xinfu_jijun');
                            },
                            content() {
                                player.judge(function (card) {
                                    return 1;
                                }).callback = lib.skill.xinfu_jijun.callback;
                                var cards = player.getExpansions('xinfu_jijun');
                                if (cards.length <= player.maxHp) {
                                    player.draw();
                                }
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                                mark(dialog, content, player) {
                                    var content = player.getExpansions('xinfu_jijun');
                                    if (content && content.length) {
                                        dialog.addAuto(content);
                                        if (player == game.me || player.isUnderControl()) {
                                            var list = lib.skill.xinfu_fangtong.getAuto(player);
                                            if (list.length) {
                                                dialog.addText('<li>推荐方案:' + get.translation(list[0]) + '+ ' + get.translation(list.slice(1)));
                                            }
                                        }
                                    }
                                },
                            },
                            marktext: '方',
                        },
                        汲魂: {
                            getAuto(player) {
                                var hs = player.getCards('he');
                                var ss = player.getExpansions('xinfu_jijun');
                                var bool = false,
                                    max = Math.pow(2, ss.length),
                                    index,
                                    i;
                                for (var i = 0; i < hs.length; i++) {
                                    for (var j = 1; j < max; j++) {
                                        var num = hs[i].number;
                                        index = j.toString(2);
                                        while (index.length < ss.length) {
                                            index = '0' + index;
                                        }
                                        for (var k = 0; k < ss.length; k++) {
                                            if (index[k] == '1') num += ss[k].number;
                                        }
                                        if (num == 36) {
                                            bool = true;
                                            break;
                                        }
                                    }
                                    if (bool) break;
                                }
                                if (!bool) return [];
                                var list = [hs[i]];
                                for (var k = 0; k < ss.length; k++) {
                                    if (index[k] == '1') list.push(ss[k]);
                                }
                                return list;
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0 && player.getExpansions('xinfu_jijun').length;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var info = ['是否发动【汲魂】？'];
                                info.push('<div class="text center">' + get.translation(player) + '的<方></div>');
                                info.push(player.getExpansions('xinfu_jijun'));
                                if (player.countCards('h')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的手牌区</div>');
                                    info.push(player.getCards('h'));
                                }
                                if (player.countCards('e')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的装备区</div>');
                                    info.push(player.getCards('e'));
                                }
                                var next = player.chooseButton();
                                next.set('createDialog', info);
                                next.set('selectButton', function () {
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    if (num == 36) return ui.selected.buttons.length;
                                    return ui.selected.buttons.length + 2;
                                });
                                next.set('filterButton', function (button) {
                                    var player = _status.event.player,
                                        cards = player.getExpansions('xinfu_jijun');
                                    if (ui.selected.buttons.length) {
                                        if (!cards.includes(button.link)) return false;
                                    } else if (cards.includes(button.link)) return false;
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    return button.link.number + num <= 36;
                                });
                                next.set('autolist', lib.skill.xinfu_fangtong.getAuto(player));
                                next.set('processAI', function () {
                                    if (_status.event.autolist && _status.event.autolist.length) {
                                        return {
                                            bool: true,
                                            links: _status.event.autolist,
                                        };
                                    }
                                    return { bool: false };
                                });
                                next.set('complexSelect', true);
                                ('step 1');
                                if (result.bool) {
                                    var tothrow = [];
                                    var cards = result.links.slice(0);
                                    for (var i = 0; i < cards.length; i++) {
                                        if (get.position(cards[i]) == 'x') {
                                            tothrow.push(cards[i]);
                                        } else {
                                            player.discard(cards[i]).delay = false;
                                        }
                                    }
                                    player.loseToDiscardpile(tothrow);
                                    player
                                        .chooseTarget('选择一个目标并对其造成1点雷电伤害,其失去1点体力上限并弃光手牌,你回满生命值', true, function (card, player, target) {
                                            return target != player;
                                        })
                                        .set('ai', function (target) {
                                            return get.damageEffect(target, _status.event.player, _status.event.player, 'thunder');
                                        });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var target = result.targets[0];
                                player.line(target, 'thunder');
                                target.damage(1, 'thunder');
                                target.chooseToDiscard(36, 'he', true);
                                target.loseMaxHp();
                                player.recover(36);
                            },
                        },
                        漪雷: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageAfter',
                                global: 'dying',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.count = Math.min(trigger.num, 9);
                                ('step 1');
                                event.count--;
                                player.chooseTarget(get.prompt('漪雷'), function (card, player, target) {
                                    return get.distance(trigger.player, target) <= 1 && trigger.player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder') + 0.1;
                                };
                                ('step 2');
                                if (result.targets?.length) {
                                    event.target = result.targets[0];
                                    event.target.judge(function (card) {
                                        return get.color(card) == 'red' ? 0 : -1;
                                    });
                                    trigger.player.line(event.target, 'thunder');
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result.color == 'black') {
                                    event.target.damage('thunder');
                                    event.target.chooseToDiscard(1, 'h', true);
                                }
                            },
                        },
                        雷躯: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageAfter',
                                player: ['damageEnd', 'dying'],
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('jidian'), function (card, player, target) {
                                    return get.distance(trigger.player, target) <= 1 && trigger.player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder') + 0.1;
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.target = result.targets[0];
                                    event.target.judge(function (card) {
                                        return get.color(card) == 'red' ? 0 : -1;
                                    });
                                    trigger.player.line(event.target, 'thunder');
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.color == 'black') {
                                    event.target.damage('thunder');
                                    event.target.chooseToDiscard(1, 'h', true);
                                }
                            },
                        },
                        民意: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 2;
                                },
                            },
                        },
                        殇音: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseDiscardEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                var cards = [];
                                player.getHistory('lose', function (evt) {
                                    if (evt.type == 'discard' && evt.getParent('phaseDiscard') == event) cards.addArray(evt.cards2);
                                });
                                return cards.length;
                            },
                            content() {
                                'step 0';
                                event.forceDie = true;
                                if (typeof event.count != 'number') {
                                    // event.count=trigger.cards.length-1;
                                    event.count = 1;
                                }
                                var recover = 0,
                                    lose = 0,
                                    players = game.filterPlayer();
                                for (var i = 0; i < players.length; i++) {
                                    if (players[i].hp < players[i].maxHp) {
                                        if (get.attitude(player, players[i]) > 0) {
                                            if (players[i].hp < 2) {
                                                lose--;
                                                recover += 0.5;
                                            }
                                            lose--;
                                            recover++;
                                        } else if (get.attitude(player, players[i]) < 0) {
                                            if (players[i].hp < 2) {
                                                lose++;
                                                recover -= 0.5;
                                            }
                                            lose++;
                                            recover--;
                                        }
                                    } else {
                                        if (get.attitude(player, players[i]) > 0) {
                                            lose--;
                                        } else if (get.attitude(player, players[i]) < 0) {
                                            lose++;
                                        }
                                    }
                                }
                                var prompt = get.prompt('qinyin') + '(剩余' + get.cnNumber(event.count) + '次)';
                                player.chooseControl('失去体力', '回复体力', 'cancel2', ui.create.dialog(get.prompt('qinyin'), 'hidden')).ai = function () {
                                    if (lose > recover && lose > 0) return 0;
                                    if (lose < recover && recover > 0) return 1;
                                    return 2;
                                };
                                ('step 1');
                                if (result.control == 'cancel2') {
                                    event.finish();
                                } else {
                                    event.bool = result.control == '回复体力';
                                    event.num = 0;
                                    event.players = game.filterPlayer();
                                }
                                ('step 2');
                                if (event.num < event.players.length) {
                                    var target = event.players[event.num];
                                    if (event.bool) {
                                        target.recover();
                                    } else {
                                        target.loseHp();
                                    }
                                    event.num++;
                                    event.redo();
                                }
                                ('step 3');
                                if (event.count > 1) {
                                    event.count--;
                                    event.goto(0);
                                }
                            },
                            ai: {
                                expose: 0.1,
                                threaten: 2,
                            },
                        },
                        业罪: {
                            trigger: {
                                global: 'recover',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'diamond':
                                        trigger.player.loseHp();
                                        player.loseHp();
                                        break;
                                    case 'spade':
                                        trigger.player.loseHp();
                                        player.loseHp();
                                        break;
                                }
                            },
                        },
                        焚魂: {
                            trigger: {
                                global: 'dying',
                            },
                            content() {
                                'step 0';
                                var list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].map((i) => get.strNumber(i));
                                trigger.player
                                    .chooseControl(list)
                                    .set('ai', function () {
                                        return get.rand(0, 12);
                                    })
                                    .set('prompt', '请选择一个点数');
                                ('step 1');
                                if (result.control) {
                                    trigger.player.$damagepop(result.control, 'thunder');
                                    var num = result.index + 1;
                                    event.num = num;
                                } else {
                                    triger.player.$damagepop('K', 'thunder');
                                    event.num = 13;
                                }
                                game.log(target, '选择的点数是', '#y' + get.strNumber(event.num));
                                player.judge(function (card) {
                                    if (card.number == _status.event.getParent('xinfu_lveming').num) return 4;
                                    return 0;
                                });
                                ('step 2');
                                if (result.bool == true) {
                                    player.loseHp(9);
                                } else {
                                    player.draw(2);
                                }
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        var numj = target.countCards('j');
                                        var numhe = target.countCards('he');
                                        if (numhe == 0) return numj > 0 ? 6 : -6;
                                        return -6 - (numj + 1) / numhe;
                                    },
                                },
                                threaten: 1.1,
                            },
                        },
                        业种: {
                            trigger: {
                                global: 'recoverEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:4',
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0 || event.player == player;
                            },
                            filter(event, player) {
                                return event.player.isAlive();
                            },
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        if (!trigger.player.isLinked()) trigger.player.link();
                                        break;
                                    case 'diamond':
                                        if (!trigger.player.isLinked()) {
                                            trigger.player.link();
                                        }
                                        trigger.player.damage('fire');
                                        break;
                                    case 'club':
                                        if (!trigger.player.isLinked()) trigger.player.link();
                                        break;
                                    case 'spade':
                                        if (!trigger.player.isLinked()) trigger.player.link();
                                        break;
                                }
                            },
                        },
                        方雷: {
                            getAuto(player) {
                                var hs = player.getCards('he');
                                var ss = player.getExpansions('xinfu_jijun');
                                var bool = false,
                                    max = Math.pow(2, ss.length),
                                    index,
                                    i;
                                for (var i = 0; i < hs.length; i++) {
                                    for (var j = 1; j < max; j++) {
                                        var num = hs[i].number;
                                        index = j.toString(2);
                                        while (index.length < ss.length) {
                                            index = '0' + index;
                                        }
                                        for (var k = 0; k < ss.length; k++) {
                                            if (index[k] == '1') num += ss[k].number;
                                        }
                                        if (num == 36) {
                                            bool = true;
                                            break;
                                        }
                                    }
                                    if (bool) break;
                                }
                                if (!bool) return [];
                                var list = [hs[i]];
                                for (var k = 0; k < ss.length; k++) {
                                    if (index[k] == '1') list.push(ss[k]);
                                }
                                return list;
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0 && player.getExpansions('xinfu_jijun').length;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var info = ['是否发动【方雷】？'];
                                info.push('<div class="text center">' + get.translation(player) + '的<方></div>');
                                info.push(player.getExpansions('xinfu_jijun'));
                                if (player.countCards('h')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的手牌区</div>');
                                    info.push(player.getCards('h'));
                                }
                                if (player.countCards('e')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的装备区</div>');
                                    info.push(player.getCards('e'));
                                }
                                var next = player.chooseButton();
                                next.set('createDialog', info);
                                next.set('selectButton', function () {
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    if (num == 36) return ui.selected.buttons.length;
                                    return ui.selected.buttons.length + 2;
                                });
                                next.set('filterButton', function (button) {
                                    var player = _status.event.player,
                                        cards = player.getExpansions('xinfu_jijun');
                                    if (ui.selected.buttons.length) {
                                        if (!cards.includes(button.link)) return false;
                                    } else if (cards.includes(button.link)) return false;
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    return button.link.number + num <= 36;
                                });
                                next.set('autolist', lib.skill.xinfu_fangtong.getAuto(player));
                                next.set('processAI', function () {
                                    if (_status.event.autolist && _status.event.autolist.length) {
                                        return {
                                            bool: true,
                                            links: _status.event.autolist,
                                        };
                                    }
                                    return { bool: false };
                                });
                                next.set('complexSelect', true);
                                ('step 1');
                                if (result.bool) {
                                    var tothrow = [];
                                    var cards = result.links.slice(0);
                                    for (var i = 0; i < cards.length; i++) {
                                        if (get.position(cards[i]) == 'x') {
                                            tothrow.push(cards[i]);
                                        } else {
                                            player.discard(cards[i]).delay = false;
                                        }
                                    }
                                    player.loseToDiscardpile(tothrow);
                                    player
                                        .chooseTarget('失去4点体力上限,选择一个目标并对其造成3点雷电伤害,并使其弃置所有手牌并失去1点体力上限,你摸3张牌', true, function (card, player, target) {
                                            return target != player;
                                        })
                                        .set('ai', function (target) {
                                            return get.damageEffect(target, _status.event.player, _status.event.player, 'thunder');
                                        });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var target = result.targets[0];
                                player.line(target, 'thunder');
                                target.damage(3, 'thunder');
                                target.chooseToDiscard(36, 'he', true).delay = false;
                                target.loseMaxHp(1);
                                player.loseMaxHp(4);
                                player.draw(3);
                            },
                        },
                        '苍天已死,黄天当立!': {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dyingAfter',
                            },
                            derivation: ['ty_jishigai', 'ty_fanglei', '雷公'],
                            filter(event, player) {
                                return player.maxHp >= game.players.length;
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.draw(game.players.length - player.countCards('h'));
                                player.removeSkill('济世');
                                player.removeSkill('聚众');
                                player.addSkill('ty_jishigai');
                                player.addSkill('ty_fanglei');
                                player.addSkill('雷公');
                                player.awakenSkill('苍天已死,黄天当立!');
                            },
                        },
                        济世: {
                            trigger: {
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.player.recover();
                                        player.gainMaxHp();
                                        player.recover();
                                        trigger.player.draw();
                                        break;
                                    case 'diamond':
                                        trigger.player.draw();
                                        player.draw();
                                        trigger.player.draw();
                                        player.draw();
                                        player.gainMaxHp();
                                        break;
                                    case 'club':
                                        trigger.player.draw();
                                        player.draw();
                                        player.gainMaxHp();
                                        break;
                                    case 'spade':
                                        trigger.player.draw();
                                        player.draw();
                                        player.gainMaxHp();
                                        break;
                                }
                            },
                        },
                        '苍天已死!': {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dyingAfter',
                            },
                            derivation: ['汲魂', '三合', '雷躯', '民意'],
                            filter(event, player) {
                                return player.maxHp >= game.players.length;
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.draw(Math.min(player.maxHp, 20));
                                player.removeSkill('聚众');
                                player.addSkill('汲魂');
                                player.addSkill('三合');
                                player.addSkill('雷躯');
                                player.addSkill('民意');
                                player.awakenSkill('苍天已死!');
                            },
                        },
                        '黄天当立!': {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dyingAfter',
                            },
                            derivation: ['方雷', '漪雷'],
                            filter(event, player) {
                                return player.maxHp >= game.players.length;
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.draw(Math.min(player.maxHp, 20));
                                player.addSkill('方雷');
                                player.addSkill('漪雷');
                                player.awakenSkill('黄天当立!');
                            },
                        },
                        吞精: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'loseHpAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != event.player && (player.hp >= event.player.hp || player.isDamaged());
                            },
                            logTarget: 'player',
                            content() {
                                if (player.hp <= trigger.player.hp) player.recover();
                                if (player.hp >= trigger.player.hp) player.draw();
                            },
                        },
                        淫汤: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player == _status.currentPhase && event.player.isIn();
                            },
                            logTarget: 'player',
                            content() {
                                trigger.player.addMark('equan', trigger.num, false);
                            },
                            group: ['equan_block', 'equan_lose'],
                            marktext: '毒',
                            intro: {
                                name: '恶泉(毒)',
                                name2: '毒',
                            },
                            subSkill: {
                                lose: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return game.hasPlayer(function (current) {
                                            return current.hasMark('equan');
                                        });
                                    },
                                    logTarget() {
                                        return game.filterPlayer(function (current) {
                                            return current.hasMark('equan');
                                        });
                                    },
                                    content() {
                                        game.countPlayer(function (current) {
                                            var num = current.countMark('equan');
                                            if (num > 0) {
                                                current.removeMark('equan', num);
                                                current.loseHp(num);
                                            }
                                        });
                                    },
                                },
                                block: {
                                    trigger: {
                                        global: 'dyingBegin',
                                    },
                                    forced: true,
                                    logTarget: 'player',
                                    filter(event, player) {
                                        var evt = event.getParent(2);
                                        return evt.name == 'equan_lose' && evt.player == player;
                                    },
                                    content() {
                                        trigger.player.addTempSkill('baiban');
                                    },
                                },
                            },
                        },
                        淫纹: {
                            trigger: {
                                global: 'loseHpEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.player.damage('nature');
                                        trigger.player.recover();
                                        break;
                                    case 'diamond':
                                        player.draw();
                                        break;
                                    case 'club':
                                        player.gainMaxHp();
                                        break;
                                    case 'spade':
                                        trigger.player.damage('nature');
                                        trigger.player.recover();
                                        break;
                                }
                            },
                        },
                        性奴: {
                            trigger: {
                                global: 'dieBefore',
                            },
                            _priority: -1,
                            filter(event, player) {
                                return event.player.hp <= 0 && !event.player.hasSkill('zqyinbing') && event.player.identity != 'nei';
                            },
                            logTarget: 'player',
                            content() {
                                trigger.cancel();
                                if (!trigger.player.hasSkill('zqyinbing')) {
                                    trigger.player.addSkill('zqyinbing');
                                }
                            },
                            ai: {
                                save: true,
                                expose: 0.2,
                                threaten: 8,
                                result: {
                                    player: 10,
                                    target: 1,
                                },
                            },
                            group: 'zqguiwang1',
                        },
                        驱奴: {
                            init(player) {
                                //player.recover(0-player.hp);
                                if (player.hp > 0) {
                                    player.removeSkill('zqyinbing');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'damage')) return 'zerotarget';
                                    },
                                },
                                threaten: 0,
                                expose: 2,
                            },
                            group: ['zqyinbing1', 'zqyinbing2', 'zqyinbing3', 'zqyinbing5'],
                        },
                        精器: {
                            group: ['xinfu_jingxie2'],
                            position: 'he',
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            filter(event, player) {
                                var he = player.getCards('he');
                                for (var i = 0; i < he.length; i++) {
                                    if (['bagua', 'baiyin', 'lanyinjia', 'renwang', 'tengjia', 'zhuge'].includes(he[i].name)) return true;
                                }
                                return false;
                            },
                            filterCard(card) {
                                return ['bagua', 'baiyin', 'lanyinjia', 'renwang', 'tengjia', 'zhuge'].includes(card.name);
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            check() {
                                return 1;
                            },
                            content() {
                                'step 0';
                                player.showCards(cards);
                                ('step 1');
                                var card = cards[0];
                                var bool = get.position(card) == 'e';
                                if (bool) player.removeEquipTrigger(card);
                                game.addVideo('skill', player, ['xinfu_jingxie', [bool, get.cardInfo(card)]]);
                                game.broadcastAll(function (card) {
                                    card.init([card.suit, card.number, 'rewrite_' + card.name]);
                                }, card);
                                if (bool) {
                                    var info = get.info(card);
                                    if (info.skills) {
                                        for (var i = 0; i < info.skills.length; i++) {
                                            player.addSkillTrigger(info.skills[i]);
                                        }
                                    }
                                }
                            },
                            ai: {
                                basic: {
                                    order: 10,
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        灵材: {
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard(card) {
                                return get.type(card) != 'hsyaoshui';
                            },
                            check(card) {
                                return 8 - get.value(card);
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            position: 'he',
                            content() {
                                'step 0';
                                var names = [];
                                var inpile = lib.inpile.slice(0);
                                inpile.randomSort();
                                var single = false;
                                var equip = Math.random() < 0.5;
                                var equips = [];
                                for (var i = 0; i < inpile.length; i++) {
                                    if (lib.inpile[i] == 'chuansongmen') continue;
                                    var info = lib.card[inpile[i]];
                                    if (!info.enable) continue;
                                    if (!info.filterTarget) continue;
                                    if (typeof info.selectTarget == 'function') continue;
                                    if (inpile[i].includes('_')) continue;
                                    if (info.type == 'equip') {
                                        equips.push(inpile[i]);
                                        continue;
                                    }
                                    if (equip && names.length >= 2) continue;
                                    if (names.length >= 3) continue;
                                    var select = get.select(info.selectTarget);
                                    if (select[0] == -1 && select[1] == -1) {
                                        names.push(inpile[i]);
                                        if (info.modTarget) single = true;
                                    } else if (select[0] == 1 && select[1] == 1) {
                                        names.push(inpile[i]);
                                        single = true;
                                    }
                                }
                                if (equip) {
                                    names.push(equips.randomGet());
                                }
                                names.sort(lib.sort.name);
                                var name = 'hsyaoshui_' + names[0] + '_' + names[1] + '_' + names[2];
                                if (!lib.card[name]) {
                                    lib.card[name] = get.copy(lib.skill.lianjin.template);
                                    lib.card[name].names = names;
                                    lib.card[name].selectTarget = single ? 1 : -1;
                                    lib.translate[name] = '药水';
                                    lib.translate[name + '_info'] = get.translation(names[0]) + '、' + get.translation(names[1]) + '、' + get.translation(names[2]);
                                }
                                var fakecard = game.createCard(name, cards[0].suit, cards[0].number);
                                player.gain(fakecard, 'gain2');
                                // cards[0].style.transitionDuration='0.2s';
                                // ui.refresh(cards[0]);
                                // cards[0].classList.add('opaque');
                                // event.cardname=name;
                                // if(player!=game.me){
                                //     var fakecard=game.createCard(name);
                                //     fakecard.node.info.remove();
                                //     player.$draw(fakecard);
                                // }
                                // game.delay(0,200);
                                // stp 1
                                // cards[0].style.transitionDuration='0s';
                                // ui.refresh(cards[0]);
                                // cards[0].classList.remove('fullskin');
                                // cards[0].init([cards[0].suit,cards[0].number,event.cardname]);
                                // game.delay(0,100);
                                // stp 2
                                // cards[0].style.transitionDuration='';
                                // ui.refresh(cards[0]);
                                // cards[0].classList.remove('opaque');
                                // game.delay(0,200);
                            },
                            template: {
                                type: 'hsyaoshui',
                                enable: true,
                                fullimage: true,
                                image: 'card/hsyaoshui',
                                derivation: 'hs_kazhakusi',
                                multitarget: true,
                                multiline: true,
                                filterTarget(card, player, target) {
                                    var info = get.info(card);
                                    var names = info.names;
                                    for (var i = 0; i < names.length; i++) {
                                        var info2 = lib.card[names[i]];
                                        if (get.select(info2.selectTarget)[0] == -1 && !info2.modTarget) continue;
                                        if (!lib.filter.targetEnabled2({ name: names[i] }, player, target)) return false;
                                    }
                                    return true;
                                },
                                content() {
                                    'step 0';
                                    event.names = get.info(card).names.slice(0);
                                    ('step 1');
                                    if (event.names.length) {
                                        var name = event.names.shift();
                                        var info = lib.card[name];
                                        var targets = [];
                                        if (get.select(info.selectTarget)[0] == -1 && !info.modTarget) {
                                            var targets = game.filterPlayer(function (current) {
                                                return player.canUse(name, current);
                                            });
                                            targets.sort(lib.sort.seat);
                                        } else {
                                            if (target.isDead()) {
                                                return;
                                            }
                                            targets.push(target);
                                        }
                                        player.useCard(game.createCard({ name: name, suit: card.suit, number: card.number }), targets, 'noai');
                                        player.addExpose(0.2);
                                        event.redo();
                                    }
                                },
                                ai: {
                                    order: 9.1,
                                    threaten: 1.5,
                                    result: {
                                        target(player, target, card) {
                                            var info = get.info(card);
                                            if (!info) return 0;
                                            if (!Array.isArray(info.names)) return 0;
                                            var names = info.names;
                                            if (names.includes('xingjiegoutong') && target.countCards('h') >= 3) return -1;
                                            var num = 0;
                                            for (var i = 0; i < names.length; i++) {
                                                var info2 = lib.card[names[i]];
                                                if (get.select(info2.selectTarget)[0] == -1 && !info2.modTarget) continue;
                                                var eff = get.effect(target, { name: names[i] }, player, target);
                                                if (eff > 0) {
                                                    num++;
                                                } else if (eff < 0) {
                                                    num -= 0.9;
                                                }
                                            }
                                            return num;
                                        },
                                    },
                                },
                            },
                            ai: {
                                order: 9,
                                result: {
                                    player: 1,
                                },
                                threaten: 1.4,
                            },
                            group: 'lianjin_discard',
                            subSkill: {
                                discard: {
                                    trigger: {
                                        player: 'discardAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (Array.isArray(event.cards))
                                            for (var i of event.cards) {
                                                if (get.type(i) == 'hsyaoshui') return true;
                                            }
                                        return false;
                                    },
                                    content() {
                                        var list = [],
                                            cards = [];
                                        for (var i = 0; i < trigger.cards.length; i++) {
                                            if (get.type(trigger.cards[i]) == 'hsyaoshui') {
                                                list.push(trigger.cards[i]);
                                            }
                                        }
                                        for (var i = 0; i < list.length; i++) {
                                            var names = get.info(list[i]).names;
                                            if (names) {
                                                cards.push(game.createCard(names.randomGet()));
                                            }
                                        }
                                        player.gain(cards, 'draw2', 'log');
                                    },
                                },
                            },
                        },
                        神匠: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            group: ['pytianjiang_move', 'ty_TLL_wuqi', 'ty_TLL_fangju'],
                            forced: true,
                            filter(event, player) {
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            content() {
                                'step 0';
                                var i = 0;
                                var list = [];
                                while (i++ < 5) {
                                    var card = get.cardPile(function (card) {
                                        if (get.type(card) != 'equip') return false;
                                        return list.length == 0 || get.subtype(card) != get.subtype(list[0]);
                                    });
                                    if (card) list.push(card);
                                }
                                if (!list.length) {
                                    event.finish();
                                    return;
                                }
                                event.list = list;
                                player.gain(event.list, 'gain4');
                                ('step 1');
                                var card = event.list.shift();
                                if (player.getCards('h').includes(card)) {
                                    player.$give(card, player, false);
                                    player.equip(card);
                                }
                                if (event.list.length) event.redo();
                            },
                        },
                        造刀: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            usable: 2,
                            filterCard: true,
                            selectCard: 1,
                            check(card) {
                                var player = _status.event.player;
                                var name = 'pyzhuren_' + card[card.name == 'shandian' ? 'name' : 'suit'];
                                if (!lib.card[name] || (_status.pyzhuren && _status.pyzhuren[name])) {
                                    if (!player.countCards('h', 'sha')) return 4 - get.value(card);
                                    return 0;
                                }
                                return 7 - get.value(card);
                            },
                            content() {
                                //QQQ
                                if (!_status.pyzhuren) _status.pyzhuren = {};
                                var rand = 0.85;
                                var num = cards[0].number;
                                if (num > 4) rand = 0.9;
                                if (num > 8) rand = 0.95;
                                if (num > 12 || cards[0].name == 'shandian' || get.isLuckyStar(player)) rand = 1;
                                var name = 'pyzhuren_' + cards[0][cards[0].name == 'shandian' ? 'name' : 'suit'];
                                if (!lib.card[name] || _status.pyzhuren[name] || Math.random() > rand) {
                                    player.popup('杯具');
                                    game.log(player, '锻造失败');
                                    var card = get.cardPile(function (card) {
                                        return card.name == 'sha';
                                    });
                                    if (card) player.gain(card, 'gain2');
                                } else {
                                    _status.pyzhuren[name] = true;
                                    player.gain(game.createCard(name, cards[0].name == 'shandian' ? 'spade' : cards[0].suit, 1), 'gain2');
                                }
                            },
                            ai: {
                                order: 10,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        良备: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            forced: true,
                            preHidden: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                trigger.num += 1 + Math.floor(player.countCards('e') / 2);
                            },
                        },
                        全备: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            limited: true,
                            filter(event, player) {
                                return game.hasPlayer((current) => lib.skill.rongbei.filterTarget(null, player, current));
                            },
                            filterTarget(card, player, target) {
                                for (var i = 1; i < 6; i++) {
                                    if (target.isEmpty(i)) return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                event.num = 0;
                                player.awakenSkill('全备');
                                ('step 1');
                                while (!target.isEmpty(event.num)) {
                                    event.num++;
                                    if (event.num > 5) {
                                        event.finish();
                                        return;
                                    }
                                }
                                var card = get.cardPile2(function (card) {
                                    return get.subtype(card) == 'equip' + event.num && target.canUse(card, target);
                                });
                                if (card) {
                                    target.chooseUseTarget(card, true, 'nopopup');
                                }
                                event.num++;
                                if (event.num <= 5) event.redo();
                            },
                            ai: {
                                order: 5,
                                result: {
                                    target(player, target) {
                                        return (target.hasSkillTag('noe') ? 2 : 1) * (5 - target.countCards('e') - target.countDisabled());
                                    },
                                },
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        遗库: {
                            audio: 'ext:汤圆神将包/audio:true',
                            forceDie: true,
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            derivation: ['良备', '全备'],
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('olfusong'), '令一名角色获得【全备】,【良备】', function (card, player, target) {
                                        return target.hp > player.hp;
                                    })
                                    .set('forceDie', true)
                                    .set('ai', (target) => get.attitude(_status.event.player, target));
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    target.addSkill('良备');
                                    target.addSkill('全备');
                                    player.removeSkill('遗库');
                                }
                            },
                        },
                        雾隐: {
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd'],
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            content() {
                                trigger.player.addSkill('dawu2');
                            },
                        },
                        拒表: {
                            audio: 'ext:汤圆神将包/audio:true',
                            audioname: ['re_taishici'],
                            enable: 'phaseUse',
                            derivation: '知才',
                            filterTarget(card, player, target) {
                                return player.canCompare(target);
                            },
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    player.addTempSkill('知才', 'phaseBefore');
                                    target.addSkill('kuangfeng2');
                                    target.addSkill('ranshang');
                                    target.link();
                                    player.removeSkill('拒表');
                                } else {
                                    player.damage('thunder');
                                }
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        return false;
                                    },
                                },
                            },
                        },
                        荐杰t: {
                            derivation: ['jianjie_faq'],
                            group: ['xinfu_jianjie1', 'xinfu_jianjie2'],
                            audio: 'ext:汤圆神将包/audio:3',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.phaseNumber > 1) return false;
                                return !game.hasPlayer(function (current) {
                                    return current.hasSkill('smh_huoji') || current.hasSkill('smh_lianhuan');
                                });
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget('请将「龙印」交给一名角色', true, function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        return 10 + get.attitude(player, target);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'fire');
                                    target.addSkill('smh_huoji');
                                }
                                if (
                                    game.hasPlayer(function (current) {
                                        return !current.hasSkill('smh_huoji') && current != player;
                                    })
                                ) {
                                    player
                                        .chooseTarget('请将「凤印」交给一名角色', true, function (card, player, target) {
                                            return target != player && !target.hasSkill('smh_huoji');
                                        })
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return 10 + get.attitude(player, target);
                                        });
                                } else event.finish();
                                ('step 2');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    target.addSkill('smh_lianhuan');
                                }
                            },
                        },
                        称好t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.lianhuanable == true && event.player.isAlive();
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.cards = get.cards(
                                    game.countPlayer(function (current) {
                                        return current.isLinked();
                                    }) + 1
                                );
                                ('step 1');
                                if (event.cards.length > 1) {
                                    player.chooseCardButton('【称好】:请选择要分配的牌', true, event.cards, [1, event.cards.length]).set('ai', function (button) {
                                        if (ui.selected.buttons.length == 0) return 1;
                                        return 0;
                                    });
                                } else if (event.cards.length == 1) {
                                    event._result = { links: event.cards.slice(0), bool: true };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    for (var i = 0; i < result.links.length; i++) {
                                        event.cards.remove(result.links[i]);
                                    }
                                    event.togive = result.links.slice(0);
                                    player
                                        .chooseTarget('将' + get.translation(result.links) + '交给一名角色', true)
                                        .set('ai', function (target) {
                                            var att = get.attitude(_status.event.player, target);
                                            if (_status.event.enemy) {
                                                return -att;
                                            } else if (att > 0) {
                                                return att / (1 + target.countCards('h'));
                                            } else {
                                                return att / 100;
                                            }
                                        })
                                        .set('enemy', get.value(event.togive[0], player, 'raw') < 0);
                                }
                                ('step 3');
                                if (result.targets.length) {
                                    result.targets[0].gain(event.togive, 'draw');
                                    player.line(result.targets[0], 'green');
                                    game.log(result.targets[0], '获得了' + get.cnNumber(event.togive.length) + '张牌');
                                    event.goto(1);
                                }
                            },
                        },
                        看破t: {
                            mod: {
                                aiValue(player, card, num) {
                                    if (card.name != 'wuxie' && get.color(card) != 'black') return;
                                    var cards = player.getCards('hs', function (card) {
                                        return card.name == 'wuxie' || get.color(card) == 'black';
                                    });
                                    cards.sort(function (a, b) {
                                        return (b.name == 'wuxie' ? 1 : 2) - (a.name == 'wuxie' ? 1 : 2);
                                    });
                                    var geti = function () {
                                        if (cards.includes(card)) {
                                            return cards.indexOf(card);
                                        }
                                        return cards.length;
                                    };
                                    if (card.name == 'wuxie') return Math.min(num, [6, 4, 3][Math.min(geti(), 2)]) * 0.6;
                                    return Math.max(num, [6, 4, 3][Math.min(geti(), 2)]);
                                },
                                aiUseful() {
                                    return lib.skill.kanpo.mod.aiValue.apply(this, arguments);
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'chooseToUse',
                            filterCard(card) {
                                return get.color(card) == 'black';
                            },
                            viewAsFilter(player) {
                                return player.countCards('hs', { color: 'black' }) > 0;
                            },
                            viewAs: {
                                name: 'wuxie',
                            },
                            position: 'hs',
                            prompt: '将一张黑色手牌当无懈可击使用',
                            check(card) {
                                var tri = _status.event.getTrigger();
                                if (tri && tri.card && tri.card.name == 'chiling') return -1;
                                return 8 - get.value(card);
                            },
                            threaten: 1.2,
                            ai: {
                                basic: {
                                    useful: [6, 4, 3],
                                    value: [6, 4, 3],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        涅槃t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'chooseToUse',
                            mark: true,
                            limited: true,
                            init(player) {
                                player.storage.olniepan = false;
                            },
                            filter(event, player) {
                                if (player.storage.olniepan) return false;
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return true;
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('olniepan');
                                player.storage.olniepan = true;
                                player.discard(player.getCards('hej'));
                                ('step 1');
                                player.link(false);
                                ('step 2');
                                player.turnOver(false);
                                ('step 3');
                                player.draw(3);
                                ('step 4');
                                if (player.hp < 3) {
                                    player.recover(3 - player.hp);
                                }
                                ('step 5');
                                player.chooseControl('bazhen', 'rehuoji', 'rekanpo').set('prompt', '选择获得一个技能').ai = function () {
                                    return ['rehuoji', 'bazhen'].randomGet();
                                };
                                ('step 6');
                                player.addSkillLog(result.control);
                            },
                            ai: {
                                order: 1,
                                skillTagFilter(player, tag, target) {
                                    if (player != target || player.storage.olniepan) return false;
                                },
                                save: true,
                                result: {
                                    player(player) {
                                        if (player.hp <= 0) return 10;
                                        if (player.hp <= 2 && player.countCards('he') <= 1) return 10;
                                        return 0;
                                    },
                                },
                                threaten(player, target) {
                                    if (!target.storage.olniepan) return 0.6;
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        连环t: {
                            audio: 'xinlianhuan',
                            audioname: ['ol_pangtong'],
                            group: ['ollianhuan3', 'ollianhuan5', 'lianhuan4'],
                        },
                        评才t: {
                            wolong_card() {
                                'step 0';
                                var ingame = game.hasPlayer(function (current) {
                                    return ['sp_zhugeliang', 're_sp_zhugeliang', 'ol_sp_zhugeliang'].includes(current.name) || ['sp_zhugeliang', 're_sp_zhugeliang', 'ol_sp_zhugeliang'].includes(current.name2);
                                })
                                    ? true
                                    : false;
                                var prompt = '请选择';
                                prompt += ingame ? '至多两名' : '一名';
                                prompt += '角色,对其造成1点火焰伤害';
                                var range = ingame ? [1, 2] : [1, 1];
                                player.chooseTarget(prompt, range).set('ai', function (target) {
                                    var player = _status.event.player;
                                    return get.damageEffect(target, player, player, 'fire');
                                });
                                ('step 1');
                                if (result.bool && result.targets.length) {
                                    player.line(result.targets, 'fire');
                                    result.targets.sortBySeat();
                                    for (var i = 0; i < result.targets.length; i++) {
                                        result.targets[i].damage('fire');
                                    }
                                }
                            },
                            fengchu_card() {
                                'step 0';
                                var ingame = game.hasPlayer(function (current) {
                                    return ['re_pangtong', 'pangtong', 'ol_pangtong'].includes(current.name) || ['re_pangtong', 'pangtong', 'ol_pangtong'].includes(current.name2);
                                })
                                    ? true
                                    : false;
                                var prompt = '请选择';
                                prompt += ingame ? '至多四名' : '至多三名';
                                prompt += '要横置的角色';
                                var range = ingame ? [1, 4] : [1, 3];
                                player.chooseTarget(prompt, range).set('ai', function (target) {
                                    var player = _status.event.player;
                                    return get.effect(target, { name: 'tiesuo' }, player, player);
                                });
                                ('step 1');
                                if (result.bool && result.targets.length) {
                                    player.line(result.targets, 'green');
                                    result.targets.sortBySeat();
                                    for (var i = 0; i < result.targets.length; i++) {
                                        result.targets[i].link();
                                    }
                                }
                            },
                            xuanjian_card() {
                                'step 0';
                                event.ingame = game.hasPlayer(function (current) {
                                    return ['re_xushu', 'xin_xushu', 'xushu'].includes(current.name) || ['re_xushu', 'xin_xushu', 'xushu'].includes(current.name2);
                                })
                                    ? true
                                    : false;
                                var prompt = '请选择一名角色,令其回复一点体力并摸一张牌';
                                prompt += event.ingame ? ',你摸一张牌' : '';
                                player.chooseTarget(prompt).set('ai', function (target) {
                                    var player = _status.event.player;
                                    return get.attitude(player, target) * (target.isDamaged() ? 2 : 1);
                                });
                                ('step 1');
                                if (result.bool && result.targets.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'thunder');
                                    target.draw();
                                    target.recover();
                                    if (event.ingame) player.draw();
                                }
                            },
                            shuijing_card() {
                                'step 0';
                                event.ingame = game.hasPlayer(function (current) {
                                    return current.name == 'simahui' || current.name2 == 'simahui';
                                })
                                    ? true
                                    : false;
                                var prompt = '将一名角色装备区中的';
                                prompt += event.ingame ? '一张牌' : '防具牌';
                                prompt += '移动到另一名角色的装备区中';
                                var next = player.chooseTarget(2, function (card, player, target) {
                                    if (ui.selected.targets.length) {
                                        if (!_status.event.ingame) {
                                            return target.isEmpty(2) ? true : false;
                                        }
                                        var from = ui.selected.targets[0];
                                        if (target.isMin()) return false;
                                        var es = from.getCards('e');
                                        for (var i = 0; i < es.length; i++) {
                                            if (['equip3', 'equip4'].includes(get.subtype(es[i])) && target.getEquip('liulongcanjia')) continue;
                                            if (es[i].name == 'liulongcanjia' && target.countCards('e', { subtype: ['equip3', 'equip4'] }) > 1) continue;
                                            if (target.isEmpty(get.subtype(es[i]))) return true;
                                        }
                                        return false;
                                    } else {
                                        if (!event.ingame) {
                                            if (target.getEquip(2)) return true;
                                            return false;
                                        }
                                        return target.countCards('e') > 0;
                                    }
                                });
                                next.set('ingame', event.ingame);
                                next.set('ai', function (target) {
                                    var player = _status.event.player;
                                    var att = get.attitude(player, target);
                                    if (ui.selected.targets.length == 0) {
                                        if (att < 0) {
                                            if (
                                                game.hasPlayer(function (current) {
                                                    if (get.attitude(player, current) > 0) {
                                                        var es = target.getCards('e');
                                                        for (var i = 0; i < es.length; i++) {
                                                            if (['equip3', 'equip4'].includes(get.subtype(es[i])) && current.getEquip('liulongcanjia')) continue;
                                                            else if (es[i].name == 'liulongcanjia' && target.countCards('e', { subtype: ['equip3', 'equip4'] }) > 1) continue;
                                                            else if (current.isEmpty(get.subtype(es[i]))) return true;
                                                        }
                                                        return false;
                                                    }
                                                })
                                            )
                                                return -att;
                                        }
                                        return 0;
                                    }
                                    if (att > 0) {
                                        var es = ui.selected.targets[0].getCards('e');
                                        var i;
                                        for (var i = 0; i < es.length; i++) {
                                            if (['equip3', 'equip4'].includes(get.subtype(es[i])) && target.getEquip('liulongcanjia')) continue;
                                            if (es[i].name == 'liulongcanjia' && target.countCards('e', { subtype: ['equip3', 'equip4'] }) > 1) continue;
                                            if (target.isEmpty(get.subtype(es[i]))) break;
                                        }
                                        if (i == es.length) return 0;
                                    }
                                    return -att * get.attitude(player, ui.selected.targets[0]);
                                });
                                next.set('multitarget', true);
                                next.set('targetprompt', ['被移走', '移动目标']);
                                next.set('prompt', prompt);
                                ('step 1');
                                if (result.bool) {
                                    player.line2(result.targets, 'green');
                                    event.targets = result.targets;
                                } else event.finish();
                                ('step 2');
                                ('step 3');
                                if (targets.length == 2) {
                                    if (!event.ingame) {
                                        event._result = {
                                            bool: true,
                                            links: [targets[0].getEquip(2)],
                                        };
                                    } else {
                                        player
                                            .choosePlayerCard(
                                                'e',
                                                true,
                                                function (button) {
                                                    return get.equipValue(button.link);
                                                },
                                                targets[0]
                                            )
                                            .set('targets0', targets[0])
                                            .set('targets1', targets[1])
                                            .set('filterButton', function (button) {
                                                var targets1 = _status.event.targets1;
                                                if (['equip3', 'equip4'].includes(get.subtype(button.link)) && targets1.getEquip('liulongcanjia')) return false;
                                                if (button.link.name == 'liulongcanjia' && targets1.countCards('e', { subtype: ['equip3', 'equip4'] }) > 1) return false;
                                                return !targets1.countCards('e', { subtype: get.subtype(button.link) });
                                            });
                                    }
                                } else event.finish();
                                ('step 4');
                                if (result.bool && result.links.length) {
                                    var link = result.links[0];
                                    if (get.position(link) == 'e') event.targets[1].equip(link);
                                    else if (link.viewAs) event.targets[1].addJudge({ name: link.viewAs }, [link]);
                                    else event.targets[1].addJudge(link);
                                    event.targets[0].$give(link, event.targets[1], false);
                                }
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            usable: 1,
                            content() {
                                'step 0';
                                var list = ['wolong', 'fengchu', 'xuanjian', 'shuijing'];
                                var list2 = [];
                                for (var i = 0; i < list.length; i++) {
                                    list2.push(game.createCard(list[i] + '_card', '', ''));
                                }
                                //list2.randomSort();
                                event.time = get.utc();
                                player.chooseButton(['请选择要擦拭的宝物', list2], true).set('ai', function (button) {
                                    var player = _status.event.player;
                                    if (button.link.name == 'xuanjian_card') {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return current.isDamaged() && current.hp < 3 && get.attitude(player, current) > 1;
                                            })
                                        )
                                            return 1 + Math.random();
                                        else return 1;
                                    } else if (button.link.name == 'wolong_card') {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return get.damageEffect(current, player, player, 'fire') > 0;
                                            })
                                        )
                                            return 1.2 + Math.random();
                                        else return 0.5;
                                    } else return 0.6;
                                });
                                ('step 1');
                                var delay = 8400 - (get.utc() - event.time);
                                if (delay > 0) {
                                    event.dialog = ui.create.dialog(get.translation(player) + '正在擦拭宝物..' + (_status.connectMode ? '' : '<br>(点击屏幕可跳过等待)'));
                                    event.videoId = lib.status.videoId++;
                                    game.broadcast('createDialog', event.videoId, get.translation(player) + '正在擦拭宝物..');
                                    game.pause();
                                    event.pingcai_delayed = true;
                                    setTimeout(function () {
                                        if (event.pingcai_delayed == true) {
                                            delete event.pingcai_delayed;
                                            game.resume();
                                        }
                                    }, delay);
                                    if (!_status.connectMode) {
                                        event.forceMine = true;
                                        event.custom.replace.window = function () {
                                            if (event.pingcai_delayed == true) {
                                                delete event.forceMine;
                                                delete event.pingcai_delayed;
                                                game.resume();
                                            }
                                        };
                                    }
                                }
                                event.card = result.links[0];
                                ('step 2');
                                player.$throw(event.card);
                                event.insert(lib.skill.xinfu_pingcai[event.card.name], {
                                    player: player,
                                });
                            },
                            ai: {
                                order: 7,
                                fireAttack: true,
                                threaten: 1.7,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        隐山: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: ['damageCancelled', 'damageZero', 'damageAfter'],
                            },
                            forced: true,
                            filter(event, player, name) {
                                if (name == 'damageCancelled') return true;
                                for (var i of event.change_history) {
                                    if (i < 0) return true;
                                }
                                return false;
                            },
                            content() {
                                player.draw(2);
                            },
                        },
                        知才: {
                            trigger: {
                                player: 'phaseJieshuAfter',
                            },
                            forced: true,
                            limited: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.addSkill('评才t');
                                        player.addSkill('隐世t');
                                        break;
                                    case 'diamond':
                                        player.addSkill('火计t');
                                        player.addSkill('看破t');
                                        player.addSkill('八阵t');
                                        break;
                                    case 'club':
                                        player.addSkill('连环t');
                                        player.addSkill('涅槃t');
                                        break;
                                    case 'spade':
                                        player.addSkill('无言t');
                                        player.addSkill('诛害t');
                                        break;
                                        'step 2';
                                        player.removeSkill('知才');
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        火计t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            filterCard(card) {
                                return get.color(card) == 'red';
                            },
                            viewAs: {
                                name: 'huogong',
                                nature: 'fire',
                            },
                            viewAsFilter(player) {
                                if (!player.countCards('hs', { color: 'red' })) return false;
                            },
                            position: 'hs',
                            prompt: '将一张红色牌当火攻使用',
                            check(card) {
                                var player = _status.currentPhase;
                                if (player.countCards('h') > player.hp) {
                                    return 6 - get.value(card);
                                }
                                return 3 - get.value(card);
                            },
                            ai: {
                                fireAttack: true,
                                basic: {
                                    order: 4,
                                    value: [3, 1],
                                    useful: 1,
                                },
                                wuxie(target, card, player, current, state) {
                                    if (get.attitude(current, player) >= 0 && state > 0) return false;
                                },
                                result: {
                                    player(player) {
                                        var nh = player.countCards('h');
                                        if (nh <= player.hp && nh <= 4 && _status.event.name == 'chooseToUse') {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'huogong' }, player, _status.event)) {
                                                return -10;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'huogong') return -10;
                                                if (viewAs && viewAs.name == 'huogong') return -10;
                                            }
                                        }
                                        return 0;
                                    },
                                    target(player, target) {
                                        if (target.hasSkill('huogong2') || target.countCards('h') == 0) return 0;
                                        if (player.countCards('h') <= 1) return 0;
                                        if (target == player) {
                                            if (typeof _status.event.filterCard == 'function' && _status.event.filterCard({ name: 'huogong' }, player, _status.event)) {
                                                return -1.5;
                                            }
                                            if (_status.event.skill) {
                                                var viewAs = get.info(_status.event.skill).viewAs;
                                                if (viewAs == 'huogong') return -1.5;
                                                if (viewAs && viewAs.name == 'huogong') return -1.5;
                                            }
                                            return 0;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    damage: 1,
                                    fireDamage: 1,
                                    natureDamage: 1,
                                    norepeat: 1,
                                },
                            },
                        },
                        知才bug: {
                            trigger: {
                                player: 'phaseBefore',
                            },
                            _priority: 1,
                            forced: true,
                            content() {
                                player.removeSkill('知才');
                            },
                        },
                        隐世t: {
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: ['phaseZhunbeiBefore', 'phaseJieshuBefore'],
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            group: 'xinfu_pdgyingshi2',
                            content() {
                                trigger.cancel();
                                game.log(player, '跳过了', event.triggername == 'phaseZhunbeiBefore' ? '准备阶段' : '结束阶段');
                            },
                        },
                        无言t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                source: 'damageBegin2',
                                player: 'damageBegin4',
                            },
                            forced: true,
                            check(event, player) {
                                if (player == event.player) return true;
                                return false;
                            },
                            filter(event, player) {
                                return get.type(event.card, 'trick') == 'trick';
                            },
                            content() {
                                trigger.cancel();
                            },
                            ai: {
                                notrick: true,
                                notricksource: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'trick' && get.tag(card, 'damage')) {
                                            return 'zeroplayertarget';
                                        }
                                    },
                                    player(card, player, target, current) {
                                        if (get.type(card) == 'trick' && get.tag(card, 'damage')) {
                                            return 'zeroplayertarget';
                                        }
                                    },
                                },
                            },
                        },
                        诛害t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != event.player && event.player.getHistory('sourceDamage').length && event.player.isIn() && (player.countCards('h') > 0 || player.canUse('guohe', event.player));
                            },
                            content() {
                                'step 0';
                                var target = trigger.player;
                                var choiceList = ['将一张手牌当做【杀】对其使用', '视为对其使用一张【过河拆桥】'];
                                var bool = false,
                                    hs = player.getCards('h');
                                for (var i of hs) {
                                    if (game.checkMod(i, player, 'unchanged', 'cardEnabled2', player) !== false && player.canUse({ name: 'sha' }, target, false)) {
                                        bool = true;
                                        break;
                                    }
                                }
                                var choices = [];
                                if (bool) choices.push('选项一');
                                else choiceList[0] = '<span style="opacity:0.5">' + choiceList[0] + '</span>';
                                if (player.canUse('guohe', target)) choices.push('选项二');
                                else choiceList[1] = '<span style="opacity:0.5">' + choiceList[1] + '</span>';
                                choices.push('cancel2');
                                player
                                    .chooseControl(choices)
                                    .set('choiceList', choiceList)
                                    .set('prompt', get.prompt('rezhuhai', target))
                                    .set('ai', function () {
                                        var choices = _status.event.controls;
                                        var eff1 = 0,
                                            eff2 = 0;
                                        var player = _status.event.player,
                                            target = _status.event.getTrigger().player;
                                        if (choices.includes('选项一')) eff1 = get.effect(target, { name: 'sha' }, player, player);
                                        if (choices.includes('选项二')) eff2 = get.effect(target, { name: 'guohe' }, player, player);
                                        if (eff1 > 0 && ((player.hasSkill('xsqianxin') && player.isDamaged()) || eff1 > eff2)) return '选项一';
                                        if (eff2 > 0) return '选项二';
                                        return 'cancel2';
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    if (result.control == '选项一') {
                                        player
                                            .chooseCard(
                                                'h',
                                                true,
                                                function (card, player) {
                                                    if (!game.checkMod(card, player, 'unchanged', 'cardEnabled2', player)) return false;
                                                    return player.canUse({ name: 'sha' }, _status.event.getTrigger().player, false);
                                                },
                                                '选择一张手牌当做【杀】对' + get.translation(trigger.player) + '使用'
                                            )
                                            .set('ai', function (card) {
                                                var player = _status.event.player;
                                                return get.effect(_status.event.getTrigger().player, { name: 'sha' }, player, player) / Math.max(1, get.value(card));
                                            });
                                    } else {
                                        player.useCard({ name: 'guohe' }, trigger.player, 'rezhuhai');
                                        event.finish();
                                    }
                                } else event.finish();
                                ('step 2');
                                if (result.bool) {
                                    player.useCard({ name: 'sha' }, result.cards, 'rezhuhai', trigger.player, false);
                                }
                            },
                        },
                        云散: {
                            trigger: {
                                player: 'phaseBefore',
                            },
                            forced: true,
                            _priority: 1,
                            content() {
                                player.addSkill('dawu3');
                            },
                        },
                        八阵t: {
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['re_sp_zhugeliang', 'ol_sp_zhugeliang', 'ol_pangtong'],
                            group: 'bazhen_bagua',
                        },
                        怒目: {
                            audio: 'ext:汤圆神将包/audio:true',
                            marktext: '暴',
                            trigger: {
                                source: 'damageSource',
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            forced: true,
                            content() {
                                player.addMark('baonu');
                            },
                            intro: {
                                name: '暴怒',
                                content: 'mark',
                            },
                            ai: {
                                combo: 'ol_shenfen',
                                maixie: true,
                                maixie_hp: true,
                            },
                        },
                        无谋: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.type(event.card) == 'trick';
                            },
                            content() {
                                'step 0';
                                if (player.hasMark('baonu')) {
                                    player.chooseControlList(['移去一枚【暴怒】标记', '失去一点体力'], true).set('ai', function (event, player) {
                                        if (player.storage.baonu > 6) return 0;
                                        if (player.hp + player.countCards('h', 'tao') > 3) return 1;
                                        return 0;
                                    });
                                } else {
                                    player.loseHp();
                                    player.draw();
                                    event.finish();
                                }
                                ('step 1');
                                if (result.index == 0) {
                                    player.removeMark('baonu', 1);
                                    player.draw();
                                } else {
                                    player.loseHp();
                                    player.draw();
                                }
                            },
                            ai: {
                                effect: {
                                    player_use(card, player) {
                                        if (get.type(card) == 'trick' && get.value(card) < 6) {
                                            return [0, -2];
                                        }
                                    },
                                },
                            },
                        },
                        咆哮: {
                            audio: 'ext:汤圆神将包/audio:2',
                            firstDo: true,
                            audioname2: {
                                old_guanzhang: 'old_fuhun',
                            },
                            audioname: ['re_zhangfei', 'guanzhang', 'xiahouba'],
                            trigger: {
                                player: 'useCard1',
                            },
                            forced: true,
                            filter(event, player) {
                                return !event.audioed && event.card.name == 'sha' && player.countUsed('sha', true) > 1 && event.parent.type == 'phase';
                            },
                            content() {
                                trigger.audioed = true;
                            },
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return Infinity;
                                },
                            },
                            ai: {
                                unequip: true,
                                skillTagFilter(player, tag, arg) {
                                    if (!get.zhu(player, 'shouyue')) return false;
                                    if (arg && arg.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        无往: {
                            audio: 'ext:汤圆神将包/audio:true',
                            usable: 3,
                            enable: 'phaseUse',
                            derivation: 'wushuang',
                            filter(event, player) {
                                return player.countMark('baonu') >= 2;
                            },
                            filterTarget(card, player, target) {
                                return target != player && !target.hasSkill('ol_wuqian_targeted');
                            },
                            content() {
                                player.removeMark('baonu', 2);
                                player.addTempSkill('wushuang');
                                player.addTempSkill('民意');
                                player.addMark('shunshi_mark', 1, false);
                                player.addTempSkill('shunshi_mark', { player: 'phaseEnd' });
                                player.storage.ol_wuqian_target = target;
                                player.addTempSkill('ol_wuqian_target');
                                target.addTempSkill('ol_wuqian_targeted');
                                player.draw(2);
                            },
                            subSkill: {
                                equip: {
                                    ai: {
                                        unequip: true,
                                        skillTagFilter(player, tag, arg) {
                                            if (arg && arg.target && arg.target.hasSkill('ol_wuqian_targeted')) return true;
                                            return false;
                                        },
                                    },
                                },
                                targeted: {
                                    ai: {
                                        unequip2: true,
                                    },
                                },
                                target: {
                                    intro: {
                                        content: '获得无双,出杀次数加一且目标防具失效直到回合结束',
                                    },
                                },
                            },
                        },
                        修罗之怒: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            limited: true,
                            filter(event, player) {
                                return player.countMark('baonu') >= 8;
                            },
                            content() {
                                'step 0';
                                player.removeMark('baonu', 8);
                                player.draw();
                                player.gainMaxHp(2);
                                player.recover(2);
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                player.line(event.targets, 'green');
                                event.targets2 = event.targets.slice(0);
                                event.targets3 = event.targets.slice(0);
                                ('step 1');
                                if (event.targets2.length) {
                                    event.targets2.shift().damage('fire');
                                    event.redo();
                                }
                                ('step 2');
                                if (event.targets.length) {
                                    event.current = event.targets.shift();
                                    event.current.discard(event.current.getCards('e')).delay = false;
                                }
                                ('step 3');
                                if (event.targets.length) event.goto(2);
                                ('step 4');
                                if (event.targets3.length) {
                                    var target = event.targets3.shift();
                                    target.chooseToDiscard(18, 'h', true).delay = false;
                                }
                                ('step 5');
                                if (event.targets3.length) event.goto(4);
                                ('step 6');
                                player.turnOver();
                                player.awakenSkill('修罗之怒');
                            },
                            ai: {
                                combo: 'baonu',
                                order: 10,
                                result: {
                                    player(player) {
                                        return game.countPlayer(function (current) {
                                            if (current != player) {
                                                return get.sgn(get.damageEffect(current, player, player));
                                            }
                                        });
                                    },
                                },
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        林姬: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 5;
                                },
                            },
                        },
                        枭射: {
                            audio: 'ext:汤圆神将包/audio:true',
                            audioname: ['sp_sunshangxiang', 're_sunshangxiang'],
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                var evt = event.getl(player);
                                return evt && evt.player == player && evt.es && evt.es.length;
                            },
                            content() {
                                'step 0';
                                event.count = trigger.getl(player).es.length;
                                ('step 1');
                                event.count--;
                                player.draw();
                                player.addMark('shunshi_mark', 1, false);
                                player.addTempSkill('shunshi_mark', { player: 'phaseEnd' });
                                ('step 2');
                                if (event.count > 0) {
                                    player.chooseBool(get.prompt2('xiaoji')).set('frequentSkill', 'xiaoji').ai = lib.filter.all;
                                }
                                ('step 3');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                            ai: {
                                noe: true,
                                reverseEquip: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                    },
                                },
                            },
                        },
                        齐发: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'chooseToUse',
                            usable: 3,
                            viewAs: {
                                name: 'sha',
                            },
                            viewAsFilter(player) {
                                return player.countCards('hs') > 0;
                            },
                            selectCard: [1, 4],
                            selectTarget() {
                                var card = get.card(),
                                    player = get.player();
                                if (card == undefined) return;
                                var range = [1, Math.max(1, ui.selected.cards.length)];
                                game.checkMod(card, player, range, 'selectTarget', player);
                                return range;
                            },
                            complexCard: true,
                            filterCard(card) {
                                if (!ui.selected.cards.length) return true;
                                var suit = card.suit;
                                for (var i of ui.selected.cards) {
                                    if (i.suit == suit) return false;
                                }
                                return true;
                            },
                            check(card) {
                                var player = _status.event.player,
                                    card = { name: 'sha' };
                                if (
                                    game.countPlayer(function (current) {
                                        return get.effect_use(current, card, player, player) > 0;
                                    }) <= ui.selected.cards.length
                                )
                                    return 0;
                                return 5 - get.value(card);
                            },
                            position: 'hs',
                            onuse(links, player) {
                                player.addTempSkill('xiongmang_effect');
                            },
                            ai: {
                                order: () => get.order({ name: 'sha' }) + 0.2,
                                respondSha: true,
                                skillTagFilter(player, tag, arg) {
                                    return player.countCards('hs') > 0;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                            subSkill: {
                                effect: {
                                    trigger: {
                                        player: 'useCardAfter',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return (
                                            event.skill == 'xiongmang' &&
                                            !player.hasHistory('sourceDamage', function (evt) {
                                                return evt.card == event.card;
                                            })
                                        );
                                    },
                                    content() {
                                        player.draw(2);
                                    },
                                },
                            },
                        },
                        结姻: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            filterCard: true,
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (get.position(card) == 'e') {
                                    var subtype = get.subtype(card);
                                    if (
                                        !game.hasPlayer(function (current) {
                                            return current != player && current.hp != player.hp && get.attitude(player, current) > 0 && !current.countCards('e', { subtype: subtype });
                                        })
                                    ) {
                                        return 0;
                                    }
                                    if (player.countCards('h', { subtype: subtype })) return 20 - get.value(card);
                                    return 10 - get.value(card);
                                } else {
                                    if (player.countCards('e')) return 0;
                                    if (player.countCards('h', { type: 'equip' })) return 0;
                                    return 8 - get.value(card);
                                }
                            },
                            filterTarget(card, player, target) {
                                if (!target.hasSex('male')) return false;
                                var card = ui.selected.cards[0];
                                if (!card) return false;
                                if (get.position(card) == 'e' && !target.isEmpty(get.subtype(card))) return false;
                                return true;
                            },
                            discard: false,
                            delay: false,
                            lose: false,
                            content() {
                                'step 0';
                                if (get.position(cards[0]) == 'e') event._result = { index: 0 };
                                else if (get.type(cards[0]) != 'equip' || !target.isEmpty(get.subtype(cards[0]))) event._result = { index: 1 };
                                else
                                    player.chooseControl().set('choiceList', ['将' + get.translation(cards[0]) + '置入' + get.translation(target) + '的装备区', '弃置' + get.translation(cards[0])]).ai = function () {
                                        return 1;
                                    };
                                ('step 1');
                                if (result.index == 0) {
                                    player.$give(cards, target, false);
                                    target.equip(cards[0]);
                                } else {
                                    player.discard(cards);
                                }
                                ('step 2');
                                if (player.hp > target.hp) {
                                    player.draw();
                                    if (target.isDamaged()) target.recover();
                                } else if (player.hp < target.hp) {
                                    target.draw();
                                    if (player.isDamaged()) player.recover();
                                }
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    var es = player.getCards('e');
                                    for (var i = 0; i < es.length; i++) {
                                        if (player.countCards('h', { subtype: get.subtype(es[i]) })) return 10;
                                    }
                                    return 2;
                                },
                                result: {
                                    target(player, target) {
                                        var goon = function () {
                                            var es = player.getCards('e');
                                            for (var i = 0; i < es.length; i++) {
                                                if (player.countCards('h', { subtype: get.subtype(es[i]) })) return true;
                                            }
                                            return false;
                                        };
                                        if (player.hp < target.hp) {
                                            if (player.isHealthy()) {
                                                if (!player.needsToDiscard(1) || goon()) return 0.1;
                                                return 0;
                                            }
                                            return 1.5;
                                        }
                                        if (player.hp > target.hp) {
                                            if (target.isHealthy()) {
                                                if (!player.needsToDiscard(1) || goon()) return 0.1;
                                                return 0;
                                            }
                                            return 1;
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        甘露: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            selectTarget: 2,
                            delay: 0,
                            filterTarget(card, player, target) {
                                if (target.isMin()) return false;
                                if (ui.selected.targets.length == 0) return true;
                                if (ui.selected.targets[0].countCards('e') == 0 && target.countCards('e') == 0) return false;
                                return true;
                            },
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                targets[0].swapEquip(targets[1]);
                                ('step 1');
                                var num = Math.abs(targets[0].countCards('e') - targets[1].countCards('e'));
                            },
                            ai: {
                                order: 10,
                                expose: 0.2,
                                threaten(player, target) {
                                    return 0.8 * Math.max(1 + target.maxHp - target.hp);
                                },
                                result: {
                                    target(player, target) {
                                        if (!ui.selected.targets.length) return -get.value(target.getCards('e'), target);
                                        var target2 = ui.selected.targets[0];
                                        var eff_target = get.value(target2.getCards('e'), target) - get.value(target.getCards('e'), target);
                                        if (get.sgn(eff_target) == get.sgn(-get.value(target2.getCards('e'), target2))) return 0;
                                        return eff_target;
                                    },
                                },
                            },
                        },
                        制衡: {
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['shen_caopi'],
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filterCard(card, player, event) {
                                event = event || _status.event;
                                if (typeof event != 'string') event = event.parent.name;
                                var mod = game.checkMod(card, player, event, 'unchanged', 'cardDiscardable', player);
                                if (mod != 'unchanged') return mod;
                                return true;
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            selectCard: [1, Infinity],
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    get.position(card) == 'h' &&
                                    !player.countCards('h', 'du') &&
                                    (player.hp > 2 ||
                                        !player.countCards('h', function (card) {
                                            return get.value(card) >= 8;
                                        }))
                                ) {
                                    return 1;
                                }
                                return 6 - get.value(card);
                            },
                            content() {
                                'step 0';
                                player.discard(cards);
                                event.num = 1;
                                var hs = player.getCards('h');
                                if (!hs.length) event.num = 0;
                                for (var i = 0; i < hs.length; i++) {
                                    if (!cards.includes(hs[i])) {
                                        event.num = 0;
                                        break;
                                    }
                                }
                                ('step 1');
                                player.draw(event.num + cards.length);
                            },
                            subSkill: {
                                draw: {
                                    trigger: {
                                        player: 'loseEnd',
                                    },
                                    silent: true,
                                    filter(event, player) {
                                        if (event.getParent(2).skill != 'rezhiheng' && event.getParent(2).skill != 'jilue_zhiheng') return false;
                                        if (player.countCards('h')) return false;
                                        if (Array.isArray(event.cards))
                                            for (var i of event.cards) {
                                                if (i.original == 'h') return true;
                                            }
                                        return false;
                                    },
                                    content() {
                                        player.addTempSkill('rezhiheng_delay', trigger.getParent(2).skill + 'After');
                                    },
                                    forced: true,
                                },
                                delay: {
                                },
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player: 1,
                                },
                                threaten: 1.55,
                            },
                        },
                        还乡: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dying',
                            },
                            forced: true,
                            juexingji: true,
                            derivation: ['甘露', '枭影', '林姬'],
                            content() {
                                player.chooseToDiscard(36, 'he', true);
                                player.gainMaxHp();
                                player.recover(36);
                                player.removeSkill('结姻');
                                player.addSkill('甘露');
                                player.addSkill('枭影');
                                player.addSkill('林姬');
                                player.removeSkill('还乡');
                            },
                        },
                        兄命: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.chooseToDiscard(36, 'e', true);
                                player.recover(36);
                                player.addSkill('制衡');
                                player.removeSkill('兄命');
                            },
                        },
                        枭影: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            filter(event, player) {
                                return (
                                    (event.card.name == 'sha' || get.type(event.card) == 'trick') &&
                                    event.player != player &&
                                    player.countCards('he', function (card) {
                                        return _status.connectMode || get.type(card) == 'equip';
                                    }) &&
                                    !player.hasSkill('rejiaojin2')
                                );
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard('he', '骄矜:是否弃置一张装备牌令' + get.translation(trigger.card) + '对你无效？', function (card, player) {
                                    return get.type(card) == 'equip';
                                });
                                next.set('ai', function (card) {
                                    if (_status.event.goon2) {
                                        return 3 + _status.event.val - get.value(card);
                                    }
                                    return 0;
                                });
                                next.set('val', get.value(trigger.cards.filterInD()));
                                next.set('goon2', get.effect(player, trigger.card, trigger.player, player) < 0);
                                ('step 1');
                                if (result.bool) {
                                    var cards = trigger.cards.filterInD();
                                    if (cards.length) player.gain(cards, 'gain2', 'log');
                                    trigger.excluded.push(player);
                                    if (trigger.player.hasSex('female')) player.chooseToDiscard(36, 'e', true);
                                }
                            },
                        },
                        笙歌: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseDiscardEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                var cards = [];
                                player.getHistory('lose', function (evt) {
                                    if (evt.type == 'discard' && evt.getParent('phaseDiscard') == event) cards.addArray(evt.cards2);
                                });
                                return cards.length > 1;
                            },
                            content() {
                                'step 0';
                                event.forceDie = true;
                                if (typeof event.count != 'number') {
                                    // event.count=trigger.cards.length-1;
                                    event.count = 1;
                                }
                                var recover = 0,
                                    lose = 0,
                                    players = game.filterPlayer();
                                for (var i = 0; i < players.length; i++) {
                                    if (players[i].hp < players[i].maxHp) {
                                        if (get.attitude(player, players[i]) > 0) {
                                            if (players[i].hp < 2) {
                                                lose--;
                                                recover += 0.5;
                                            }
                                            lose--;
                                            recover++;
                                        } else if (get.attitude(player, players[i]) < 0) {
                                            if (players[i].hp < 2) {
                                                lose++;
                                                recover -= 0.5;
                                            }
                                            lose++;
                                            recover--;
                                        }
                                    } else {
                                        if (get.attitude(player, players[i]) > 0) {
                                            lose--;
                                        } else if (get.attitude(player, players[i]) < 0) {
                                            lose++;
                                        }
                                    }
                                }
                                var prompt = get.prompt('qinyin') + '(剩余' + get.cnNumber(event.count) + '次)';
                                player.chooseControl('失去体力', '回复体力', 'cancel2', ui.create.dialog(get.prompt('qinyin'), 'hidden')).ai = function () {
                                    if (lose > recover && lose > 0) return 0;
                                    if (lose < recover && recover > 0) return 1;
                                    return 2;
                                };
                                ('step 1');
                                if (result.control == 'cancel2') {
                                    event.finish();
                                } else {
                                    event.bool = result.control == '回复体力';
                                    event.num = 0;
                                    event.players = game.filterPlayer();
                                }
                                ('step 2');
                                if (event.num < event.players.length) {
                                    var target = event.players[event.num];
                                    if (event.bool) {
                                        target.recover();
                                    } else {
                                        target.loseHp();
                                    }
                                    event.num++;
                                    event.redo();
                                }
                                ('step 3');
                                if (event.count > 1) {
                                    event.count--;
                                    event.goto(0);
                                }
                            },
                            ai: {
                                expose: 0.1,
                                threaten: 2,
                            },
                        },
                        破胆: {
                            audio: 'drlt_zhiti',
                            global: 'olzhiti2',
                            mod: {
                                maxHandcard(player, num) {
                                    if (
                                        game.hasPlayer(function (current) {
                                            return current.isDamaged();
                                        })
                                    )
                                        return num + 1;
                                },
                            },
                            trigger: {
                                player: ['phaseDrawBegin2', 'phaseEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                var num = event.name == 'phase' ? 5 : 3;
                                if (
                                    num == 3
                                        ? event.numFixed
                                        : !game.hasPlayer(function (current) {
                                            return current.countDisabled() < 5;
                                        })
                                )
                                    return false;
                                return (
                                    game.countPlayer(function (current) {
                                        return current.isDamaged();
                                    }) >= num
                                );
                            },
                            forced: true,
                            content() {
                                'step 0';
                                if (trigger.name == 'phaseDraw') {
                                    trigger.num++;
                                    event.finish();
                                } else {
                                    player
                                        .chooseTarget(get.prompt('olzhiti'), '废除一名角色的一个随机装备栏', function (card, player, target) {
                                            return target.countDisabled() < 5;
                                        })
                                        .set('ai', function (target) {
                                            return -get.attitude(_status.event.player, target) * (target.countCards('e') + 1);
                                        });
                                }
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    var list = [];
                                    for (var i = 1; i < 6; i++) {
                                        if (!target.isDisabled(i)) list.add(i == 3 || i == 4 ? 6 : i);
                                    }
                                    var num = list.randomGet();
                                    if (num != 6) target.disableEquip(num);
                                    else {
                                        target.disableEquip(3);
                                        target.disableEquip(4);
                                    }
                                }
                            },
                        },
                        锐骑: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                if (!player.isPhaseUsing() || event.player.isDead()) return false;
                                for (var i in event.player.disabledSkills) {
                                    if (event.player.disabledSkills[i].includes('olduorui2')) return false;
                                }
                                var list = [];
                                var listm = [];
                                var listv = [];
                                if (event.player.name1 != undefined) listm = lib.character[event.player.name1][3];
                                else listm = lib.character[event.player.name][3];
                                if (event.player.name2 != undefined) listv = lib.character[event.player.name2][3];
                                listm = listm.concat(listv);
                                var func = function (skill) {
                                    var info = get.info(skill);
                                    if (!info || info.charlotte) return false;
                                    return true;
                                };
                                for (var i = 0; i < listm.length; i++) {
                                    if (func(listm[i])) list.add(listm[i]);
                                }
                                return list.length;
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) >= 0) return false;
                                if (event.getParent('phaseUse').skipped) return true;
                                var nd = player.needsToDiscard();
                                return (
                                    player.countCards('h', function (card) {
                                        return player.getUseValue(card, null, true) > 0 && (nd ? true : get.tag(card, 'damage') > 0);
                                    }) == 0
                                );
                            },
                            logTarget: 'player',
                            content() {
                                'step 0';
                                var list = [];
                                var listm = [];
                                var listv = [];
                                if (trigger.player.name1 != undefined) listm = lib.character[trigger.player.name1][3];
                                else listm = lib.character[trigger.player.name][3];
                                if (trigger.player.name2 != undefined) listv = lib.character[trigger.player.name2][3];
                                listm = listm.concat(listv);
                                var func = function (skill) {
                                    var info = get.info(skill);
                                    if (!info || info.charlotte) return false;
                                    return true;
                                };
                                for (var i = 0; i < listm.length; i++) {
                                    if (func(listm[i])) list.add(listm[i]);
                                }
                                event.skills = list;
                                player.chooseControl(list).set('prompt', '选择' + get.translation(trigger.player) + '武将牌上的一个技能并令其失效');
                                ('step 1');
                                player.chooseToDisable();
                                trigger.player.disableSkill('olduorui2', result.control);
                                trigger.player.addTempSkill('olduorui2', { player: 'phaseAfter' });
                                game.log(player, '选择了', trigger.player, '的技能', '#g【' + get.translation(result.control) + '】');
                            },
                        },
                        劫营: {
                            audio: 'ext:汤圆神将包/audio:2',
                            global: 'drlt_jieying_mark',
                            group: ['drlt_jieying_1', 'drlt_jieying_2', 'drlt_jieying_3'],
                            subSkill: {
                                1: {
                                    audio: 'drlt_jieying',
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return !game.hasPlayer(function (current) {
                                            return current.hasMark('drlt_jieying_mark');
                                        });
                                    },
                                    content() {
                                        player.addMark('drlt_jieying_mark', 1);
                                    },
                                },
                                2: {
                                    audio: 'drlt_jieying',
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.hasMark('drlt_jieying_mark');
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseTarget(get.prompt('drlt_jieying'), '将<营>交给一名角色;其摸牌阶段多摸一张牌,出牌阶段使用【杀】的次数上限+1且手牌上限+1.该角色回合结束后,其移去<营>标记,你获得其所有手牌', (card, player, target) => target != player).ai = function (target) {
                                            if (get.attitude(player, target) > 0) return 0.1;
                                            if (get.attitude(player, target) < 1 && (target.isTurnedOver() || target.countCards('h') < 1)) return 0.2;
                                            if (get.attitude(player, target) < 1 && target.countCards('h') > 0 && target.countCards('j', { name: 'lebu' }) > 0) return target.countCards('h') * 0.8 + target.getHandcardLimit() * 0.7 + 2;
                                            if (get.attitude(player, target) < 1 && target.countCards('h') > 0) return target.countCards('h') * 0.8 + target.getHandcardLimit() * 0.7;
                                            return 1;
                                        };
                                        ('step 1');
                                        if (result.targets?.length) {
                                            var target = result.targets[0];
                                            player.line(target);
                                            var mark = player.countMark('drlt_jieying_mark');
                                            player.removeMark('drlt_jieying_mark', mark);
                                            target.addMark('drlt_jieying_mark', mark);
                                        }
                                    },
                                },
                                3: {
                                    audio: 'drlt_jieying',
                                    trigger: {
                                        global: 'phaseEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player != event.player && event.player.hasMark('drlt_jieying_mark') && event.player.isAlive();
                                    },
                                    logTarget: 'player',
                                    content() {
                                        if (trigger.player.countCards('h') > 0) {
                                            trigger.player.give(trigger.player.getCards('h'), player);
                                        }
                                        trigger.player.removeMark('drlt_jieying_mark', trigger.player.countMark('drlt_jieying_mark'));
                                    },
                                },
                            },
                        },
                        夺锐: {
                            audio: 'ext:汤圆神将包/audio:true',
                            init(player, skill) {
                                if (!player.storage.drlt_duorui) player.storage.drlt_duorui = [];
                            },
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return player != event.player && event.player.isAlive();
                            },
                            check(event, player) {
                                if (player.countDisabled() < 5 && player.isDisabled(5)) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                var list = [];
                                var listm = [];
                                var listv = [];
                                if (trigger.player.name1 != undefined) listm = lib.character[trigger.player.name1][3];
                                else listm = lib.character[trigger.player.name][3];
                                if (trigger.player.name2 != undefined) listv = lib.character[trigger.player.name2][3];
                                listm = listm.concat(listv);
                                var func = function (skill) {
                                    var info = get.info(skill);
                                    if (!info || info.charlotte || info.hiddenSkill || info.dutySkill || (info.unique && !info.gainable) || lib.skill.drlt_duorui.bannedList.includes(skill)) return false;
                                    return true;
                                };
                                for (var i = 0; i < listm.length; i++) {
                                    if (func(listm[i])) list.add(listm[i]);
                                }
                                event.skills = list;
                                if (player.countDisabled() < 5) {
                                    player.chooseToDisable().ai = function (event, player, list) {
                                        if (list.includes('equip5')) return 'equip5';
                                        return list.randomGet();
                                    };
                                }
                                ('step 1');
                                if (event.skills.length) {
                                    player
                                        .chooseControl(event.skills)
                                        .set('prompt', '请选择要获得的技能')
                                        .set('ai', function () {
                                            return event.skills.randomGet();
                                        });
                                } else event.finish();
                                ('step 2');
                                player.addTempSkill(result.control, { player: 'dieAfter' });
                                player.popup(result.control, 'thunder');
                                player.storage.drlt_duorui = [result.control];
                                player.storage.drlt_duorui_player = trigger.player;
                                trigger.player.storage.drlt_duorui = [result.control];
                                trigger.player.addTempSkill('drlt_duorui1', { player: 'phaseAfter' });
                                game.log(player, '获得了技能', '#g【' + get.translation(result.control) + '】');
                            },
                            group: ['duorui_clear'],
                        },
                        破釜: {
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['知遇'],
                            trigger: {
                                player: ['damageEnd', 'phaseJieshuEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countDisabled() < 5;
                            },
                            content() {
                                'step 0';
                                player.chooseToDisable().ai = function (event, player, list) {
                                    var getVal = function (num) {
                                        var card = player.getEquip(num);
                                        if (card) {
                                            var val = get.value(card);
                                            if (val > 0) return 0;
                                            return 5 - val;
                                        }
                                        switch (num) {
                                            case 'equip3':
                                                return 4.5;
                                                break;
                                            case 'equip4':
                                                return 4.4;
                                                break;
                                            case 'equip5':
                                                return 4.3;
                                                break;
                                            case 'equip2':
                                                return (3 - player.hp) * 1.5;
                                                break;
                                            case 'equip1': {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return (get.realAttitude || get.attitude)(player, current) < 0 && get.distance(player, current) > 1;
                                                    })
                                                )
                                                    return 0;
                                                return 3.2;
                                            }
                                        }
                                    };
                                    list.sort(function (a, b) {
                                        return getVal(b) - getVal(a);
                                    });
                                    return list[0];
                                };
                                ('step 1');
                                var cardType = result.control;
                                event.cardType = cardType;
                                var num = player.countDisabled();
                                if (num < 5) player.draw(num);
                                player
                                    .chooseTarget(lib.filter.notMe, '是否令一名其他角色从牌堆中使用一张' + get.translation(cardType) + '牌？')
                                    .set('ai', function (target) {
                                        var player = _status.event.player,
                                            type = _status.event.cardType;
                                        var card = get.cardPile2(function (card) {
                                            return get.subtype(card) == type && target.canUse(card, target);
                                        });
                                        if (!card) return 0;
                                        return get.effect(target, card, target, player);
                                    })
                                    .set('cardType', event.cardType);
                                ('step 2');
                                if (!result.bool) return;
                                var target = result.targets[0];
                                player.line(target, 'green');
                                var card = get.cardPile2(function (card) {
                                    return get.subtype(card) == event.cardType && target.canUse(card, target);
                                });
                                if (card) target.chooseUseTarget(card, 'nopopup', true);
                                else target.draw();
                            },
                        },
                        知遇: {
                            trigger: {
                                player: 'disableEquipAfter',
                            },
                            filter(event, player) {
                                return player.countDisabled() >= 5;
                            },
                            forced: true,
                            content() {
                                player.recover();
                                player.chooseToEnable();
                                player.chooseToEnable();
                                player.chooseToEnable();
                                player.chooseToEnable();
                                player.chooseToEnable();
                            },
                        },
                        宝刀: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                var card = get.cardPile('guding', 'field');
                                if (card) {
                                    player.gain(card, 'gain2', 'log');
                                }
                            },
                        },
                        破军: {
                            shaRelated: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card.name == 'sha' && event.target.hp > 0 && event.target.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                var next = player.choosePlayerCard(trigger.target, 'he', [1, Math.min(trigger.target.hp, trigger.target.countCards('he'))], get.prompt('repojun', trigger.target));
                                next.set('ai', function (button) {
                                    if (!_status.event.goon) return 0;
                                    var val = get.value(button.link);
                                    if (button.link == _status.event.target.getEquip(2)) return 2 * (val + 3);
                                    return val;
                                });
                                next.set('goon', get.attitude(player, trigger.target) <= 0);
                                next.set('forceAuto', true);
                                ('step 1');
                                if (result.bool) {
                                    var target = trigger.target;
                                    target.addSkill('repojun2');
                                    target.addToExpansion('giveAuto', result.cards, target).gaintag.add('repojun2');
                                }
                            },
                            ai: {
                                unequip: true,
                                directHit_ai: true,
                                skillTagFilter(player, tag, arg) {
                                    if (get.attitude(player, arg.target) > 0) return false;
                                    if (tag == 'directHit_ai') return arg.target.hp >= Math.max(1, arg.target.countCards('h') - 1);
                                    if (arg && arg.name == 'sha' && arg.target.getEquip(2)) return true;
                                    return false;
                                },
                            },
                            group: 'repojun3',
                        },
                        大宝: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            group: '宝刀',
                            filter(event, player) {
                                return game.players.length > 1 && (event.name != 'phase' || game.phaseNumber == 0);
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                var card = get.cardPile('guding', 'field');
                                var card2 = get.cardPile('tiesuo', 'field');
                                var card3 = get.cardPile('jiu', 'field');
                                var card4 = get.cardPile('sha', 'field');
                                if (card && card2 && card3 && card4) {
                                    player.chooseToDiscard(4, 'h', true);
                                    player.gain(card, 'gain2', 'log');
                                    player.gain(card2, 'gain2', 'log');
                                    player.gain(card3, 'gain2', 'log');
                                    player.gain(card4, 'gain2', 'log');
                                }
                            },
                        },
                        变幻: {
                            trigger: {
                                player: ['damageEnd', 'dying'],
                                global: 'dieAfter',
                            },
                            group: '新生',
                            audio: 'ext:汤圆神将包/audio:4',
                            forced: true,
                            content() {
                                'step 0';
                                var list = get.gainableSkills();
                                list.remove(player.getSkills());
                                list = list.randomGets(3);
                                event.skillai = function () {
                                    return get.max(list, get.skillRank, 'item');
                                };
                                if (event.isMine()) {
                                    var dialog = ui.create.dialog('forcebutton');
                                    dialog.add('选择获得一项技能');
                                    var clickItem = function () {
                                        _status.event._result = this.link;
                                        dialog.close();
                                        game.resume();
                                    };
                                    for (var i = 0; i < list.length; i++) {
                                        if (lib.translate[list[i] + '_info']) {
                                            var translation = get.translation(list[i]);
                                            if (translation[0] == '新' && translation.length == 3) {
                                                translation = translation.slice(1, 3);
                                            } else {
                                                translation = translation.slice(0, 2);
                                            }
                                            var item = dialog.add('<div class="popup pointerdiv" style="width:80%;display:inline-block"><div class="skill">【' + translation + '】</div><div>' + lib.translate[list[i] + '_info'] + '</div></div>');
                                            item.firstChild.addEventListener('click', clickItem);
                                            item.firstChild.link = list[i];
                                        }
                                    }
                                    dialog.add(ui.create.div('.placeholder'));
                                    event.switchToAuto = function () {
                                        event._result = event.skillai();
                                        dialog.close();
                                        game.resume();
                                    };
                                    _status.imchoosing = true;
                                    game.pause();
                                } else {
                                    event._result = event.skillai();
                                }
                                ('step 1');
                                _status.imchoosing = false;
                                var link = result;
                                player.addSkill(link, true);
                                player.popup(link);
                                game.log(player, '获得了技能', '【' + get.translation(link) + '】');
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card, 'trick') == 'trick' && player == target) return [1, 1];
                                    },
                                },
                            },
                        },
                        新生: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            filter(event, player) {
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            content() {
                                player.damage(1, 'thunder');
                                player.recover();
                            },
                        },
                        借命: {
                            audio: 'ext:汤圆神将包/audio:true',
                            derivation: ['benghuai', 'weizhong'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.maxHp >= game.players.length && !player.storage.juyi;
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.draw(Math.min(player.maxHp, 20));
                                player.addSkill('weizhong');
                                player.removeSkill('看破t');
                                player.removeSkill('观星');
                                player.addSkill('北伐');
                                player.addSkill('尽命');
                                player.addSkill('摄政');
                                player.addSkill('逆局');
                                player.addSkill('纳降');
                                player.addSkill('锦囊');
                                player.removeSkill('借命'); //QQQ
                                player.storage.juyi = true;
                                player.awakenSkill('juyi');
                            },
                        },
                        观星: {
                            audio: 'guanxing',
                            audioname: ['jiangwei', 're_jiangwei', 're_zhugeliang', 'gexuan', 'ol_jiangwei'],
                            forced: true,
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            async content(event, trigger, player) {
                                var num = 5;
                                var cards = get.cards(num);
                                game.cardsGotoOrdering(cards);
                                const result = await player
                                    .chooseToMove()
                                    .set('list', [['牌堆顶', cards], ['牌堆底']])
                                    .set('prompt', '将牌移动到牌堆顶或牌堆底')
                                    .set('processAI', function (list) {
                                        var cards = list[0][1];
                                        const target = trigger.name == 'phaseZhunbei' ? player : player.next;
                                        const att = get.attitude(player, target);
                                        const top = [], bottom = cards;
                                        for (const i of target.getCards('j')) {
                                            const judge = get.judge(i);
                                            bottom.sort((a, b) => (judge(b) - judge(a)) * att); //态度大于0价值高的牌放前面
                                            if (bottom.length) {
                                                top.push(bottom.shift());
                                            }
                                        }
                                        bottom.sort((a, b) => (get.value(b) - get.value(a)) * att); //态度大于0价值高的牌放前面
                                        while (bottom.length) {
                                            top.push(bottom.shift());
                                        }
                                        return [top, bottom];
                                    }).forResult(); //给别人观星
                                result.moved[0].reverse();
                                for (var i of result.moved[0]) {
                                    ui.cardPile.insertBefore(i, ui.cardPile.firstChild);
                                }
                                for (var i of result.moved[1]) {
                                    ui.cardPile.appendChild(i);
                                }
                                player.popup(get.cnNumber(result.moved[0].length) + '上' + get.cnNumber(result.moved[1].length) + '下');
                                game.log(player, '将' + get.cnNumber(result.moved[0].length) + '张牌置于牌堆顶');
                                game.updateRoundNumber();
                            },
                            subSkill: {
                                on: {
                                },
                            },
                        },
                        北伐: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            filter: (event, player) => game.hasPlayer((current) => current != player && current.maxHp > 1),
                            filterTarget: (card, player, target) => target != player && target.maxHp > 1,
                            content() {
                                'step 0';
                                target.loseMaxHp();
                                ('step 1');
                                if (target.isIn()) target.addMark('yingba_mark', 1);
                                player.loseMaxHp();
                            },
                            mod: {
                                targetInRange(card, player, target) {
                                    if (target.hasMark('yingba_mark')) return true;
                                },
                            },
                            ai: {
                                combo: 'scfuhai',
                                threaten: 3,
                                order: 2,
                                result: {
                                    target(player, target) {
                                        if (target.isHealthy()) return -2;
                                        return -1;
                                    },
                                },
                            },
                            subSkill: {
                                mark: {
                                    marktext: '定',
                                    intro: {
                                        name: '平定',
                                        content: 'mark',
                                    },
                                    mod: {
                                        maxHandcard(player, numx) {
                                            var num = player.countMark('yingba_mark');
                                            if (num > 0)
                                                return (
                                                    numx +
                                                    num *
                                                    game.countPlayer(function (current) {
                                                        return current.hasSkill('yingba');
                                                    })
                                                );
                                        },
                                    },
                                },
                            },
                        },
                        纳蛮: {
                            audio: 'ext:汤圆神将包/audio:2',
                            group: 'mansi_viewas',
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'nanman';
                            },
                            forced: true,
                            content() {
                                player.draw();
                                player.chooseToDiscard(1, 'he', true);
                            },
                            intro: {
                                content: '已因此技能获得了#张牌',
                            },
                        },
                        摄政: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            derivation: ['zyexin', 'zzili'],
                            init(player) {
                                player.storage.zbaijiang = false;
                            },
                            filter(event, player) {
                                return !player.storage.zbaijiang && player.countCards('e') >= 2;
                            },
                            content() {
                                player.storage.zbaijiang = true;
                                player.addSkill('zyexin');
                                player.addSkill('zzili');
                                player.gainMaxHp();
                                player.removeSkill('摄政');
                            },
                        },
                        纳降: {
                            trigger: {
                                source: 'damageSource',
                            },
                            juexingji: true,
                            forced: true,
                            filter(event, player) {
                                return player.isDamaged();
                            },
                            content() {
                                player.awakenSkill('xsqianxin');
                                player.loseMaxHp();
                                player.draw();
                                player.addSkill('rejianyan');
                                player.removeSkill('纳降');
                            },
                        },
                        锦囊: {
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCardEnd',
                            },
                            check(event, player) {
                                return get.value(event.cards) + player.maxHp * 2 - 18 > 0;
                            },
                            filter(event, player) {
                                return player.isPhaseUsing() && get.type(event.card) == 'trick' && event.cards.filterInD().length;
                            },
                            content() {
                                player.loseMaxHp();
                                player.draw();
                                player.gain(trigger.cards.filterInD(), 'gain2', 'log');
                            },
                        },
                        奋搏: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.getStat('kill') > 0;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                        },
                        缮甲: {
                            group: ['xinshanjia_count'],
                            mod: {
                                aiValue(player, card, num) {
                                    if ((player.storage.xinshanjia || 0) < 3 && get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) {
                                        return num / player.hp;
                                    }
                                },
                            },
                            subSkill: {
                                count: {
                                    forced: true,
                                    silent: true,
                                    trigger: {
                                        player: 'loseEnd',
                                    },
                                    filter(event, player) {
                                        return event.cards2 && event.cards2.length;
                                    },
                                    content() {
                                        lib.skill.xinshanjia.sync(player);
                                    },
                                },
                            },
                            audio: 'true',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            intro: {
                                content: '本局游戏内已失去过#张装备牌',
                            },
                            forced: true,
                            sync(player) {
                                var history = player.actionHistory;
                                var num = 0;
                                for (var i = 0; i < history.length; i++) {
                                    for (var j = 0; j < history[i].lose.length; j++) {
                                        if (history[i].lose[j].parent.name == 'useCard') continue;
                                        num += history[i].lose[j].cards2.filter(function (card) {
                                            return get.type(card, false) == 'equip';
                                        }).length;
                                    }
                                }
                                player.storage.xinshanjia = num;
                                if (num > 0) player.markSkill('xinshanjia');
                            },
                            content() {
                                'step 0';
                                player.draw(5);
                                ('step 1');
                                lib.skill.xinshanjia.sync(player);
                                var num = 5 - player.storage.xinshanjia;
                                if (num > 0) {
                                    player.chooseToDiscard('he', true, num).ai = get.disvalue;
                                }
                                ('step 2');
                                var bool = true;
                                if (result.cards?.length) {
                                    for (var i = 0; i < result.cards.length; i++) {
                                        if (['basic', 'trick'].includes(get.type(result.cards[i], 'trick', result.cards[i].original == 'h' ? player : false))) {
                                            bool = false;
                                            break;
                                        }
                                    }
                                }
                                if (bool) {
                                    player.chooseUseTarget({ name: 'sha' }, '是否视为使用一张【杀】？', false, 'nodistance');
                                }
                            },
                            ai: {
                                threaten: 3,
                                noe: true,
                                reverseOrder: true,
                                skillTagFilter(player) {
                                    if (player.storage.xinshanjia > 2) return false;
                                },
                                effect: {
                                    target(card, player, target) {
                                        if (player.storage.xinshanjia < 3 && get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                    },
                                },
                            },
                        },
                        虎骑: {
                            mod: {
                                globalFrom(player, target, distance) {
                                    return distance - 1;
                                },
                            },
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != _status.currentPhase;
                            },
                            content() {
                                'step 0';
                                var func = function (result) {
                                    if (get.color(result) == 'red') return 1;
                                    return 0;
                                };
                                if (get.itemtype(trigger.source) != 'player' || !player.canUse('sha', trigger.source, false))
                                    func = function (result) {
                                        return 0;
                                    };
                                else if (get.effect(trigger.source, { name: 'sha' }, player, player) < 0)
                                    func = function (result) {
                                        if (get.color(result) == 'red') return -1;
                                        return 0;
                                    };
                                player.judge(func).judge2 = function (result) {
                                    return result.color == 'red' ? true : false;
                                };
                                ('step 1');
                                if (result.color == 'red' && get.itemtype(trigger.source) == 'player' && player.canUse('sha', trigger.source, false)) {
                                    player.useCard({ name: 'sha' }, trigger.source, false, 'noai');
                                }
                            },
                        },
                        凌厉: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'useCardEnd',
                            },
                            filter(event, player) {
                                return get.type(event.card) == 'equip';
                            },
                            forced: true,
                            content() {
                                player.chooseUseTarget({ name: 'sha' }, get.prompt('凌厉'), '视为使用一张【杀】', false);
                            },
                        },
                        精兵: {
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            prompt: '是否发动【精兵】回复一点体力并摸两张牌?',
                            filter(event, player) {
                                if (player.isHealthy() || player.countCards('e') != player.hp) return false;
                                var evt = event.getl(player);
                                if (event.name == 'equip' && event.player == player) return !evt || evt.cards.length != 1;
                                return evt && evt.es.length;
                            },
                            content() {
                                player.draw(2);
                                player.recover();
                            },
                        },
                        ty_mishi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return (
                                    player != event.player &&
                                    event.player.getHistory('sourceDamage', function (evt) {
                                        return evt.player != event.player;
                                    }).length == 0
                                );
                            },
                            content() {
                                'step 0';
                                var list = ['摸一张牌'],
                                    target = trigger.player,
                                    str = get.translation(target);
                                event.target = target;
                                event.addIndex = 0;
                                if (target.countCards('h') > 0) list.push('观看' + str + '的四张手牌并获得其中一张');
                                else event.addIndex++;
                                if (
                                    target.countCards('e', function (card) {
                                        return player.canEquip(card);
                                    }) > 0
                                )
                                    list.push('将' + str + '装备区内的一张牌移动至自己的装备区');
                                player
                                    .chooseControl('cancel2')
                                    .set('choiceList', list)
                                    .set('prompt', get.prompt('xinqieting', target))
                                    .set('ai', function () {
                                        var evt = _status.event.parent;
                                        if (get.attitude(evt.player, evt.target) > 0) return 0;
                                        var val = evt.target.hasSkillTag('noe') ? 6 : 0;
                                        if (
                                            evt.target.countCards('e', function (card) {
                                                return evt.player.canEquip(card) && get.value(card, evt.target) > val && get.effect(evt.player, card, evt.player, evt.player) > 0;
                                            }) > 0
                                        )
                                            return 2 - evt.addIndex;
                                        if (evt.target.countCards('h') > 0) return 1;
                                        return 0;
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    if (result.index == 0) {
                                        player.draw();
                                        event.finish();
                                    } else if (result.index + event.addIndex == 1) {
                                        player.choosePlayerCard(target, 'h', 4, true);
                                        player.addExpose(0.4);
                                        event.goto(3);
                                    } else {
                                        player.addExpose(0.1);
                                        player
                                            .choosePlayerCard(target, 'e', true)
                                            .set('filterButton', function (button) {
                                                return _status.event.player.canEquip(button.link);
                                            })
                                            .set('ai', function (button) {
                                                var player = _status.event.player;
                                                return get.effect(player, button.link, player, player);
                                            });
                                    }
                                } else event.finish();
                                ('step 2');
                                if (result.cards?.length) {
                                    var card = result.cards[0];
                                    target.$give(card, player, false);
                                    player.equip(card);
                                }
                                event.finish();
                                ('step 3');
                                if (result.bool) player.chooseButton(['选择获得一张牌', result.cards], true);
                                else event.finish();
                                ('step 4');
                                if (result.links?.length) {
                                    var card = result.links[0];
                                    if (lib.filter.canBeGained(card, player, target)) player.gain(card, target, 'giveAuto', 'bySelf');
                                    else game.log('但', card, '不能被', player, '获得!');
                                }
                            },
                        },
                        ty_sishi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseJieshuBegin',
                                target: 'useCardToTargeted',
                            },
                            forced: true,
                            filter(event, player, name) {
                                return ((name == 'phaseJieshuBegin' && event.player != player && player.countCards('he') >= event.player.countCards('h')) || (event.targets && event.targets.includes(player) && ['basic', 'trick'].includes(get.type(event.card, 'trick')))) && !player.hasSkill('xindanshou_as');
                            },
                            content() {
                                'step 0';
                                if (event.triggername == 'phaseJieshuBegin') {
                                    var num = trigger.player.countCards('h');
                                    if (num > 0)
                                        player
                                            .chooseToDiscard(get.prompt('xindanshou', trigger.player), num, '弃置' + get.cnNumber(num) + '张牌并对' + get.translation(trigger.player) + '造成1点伤害', 'he')
                                            .set('ai', function (card) {
                                                if (get.damageEffect(_status.event.getTrigger().player, _status.event.player, _status.event.player) > 0) return Math.max(5.5, 8 - _status.event.selectTarget) - get.value(card);
                                                return -1;
                                            });
                                    else
                                        player.chooseBool(get.prompt('xindanshou', trigger.player), '对' + get.translation(trigger.player) + '造成1点伤害').ai = function () {
                                            return get.damageEffect(trigger.player, player, player) > 0;
                                        };
                                } else {
                                    var num = 0;
                                    game.countPlayer2(function (current) {
                                        var history = current.getHistory('useCard');
                                        for (var j = 0; j < history.length; j++) {
                                            if (['basic', 'trick'].includes(get.type(history[j].card, 'trick')) && history[j].targets && history[j].targets.includes(player)) num++;
                                        }
                                    });
                                    event.num = num;
                                    player
                                        .chooseBool(get.prompt('xindanshou') + '(可摸' + get.cnNumber(num) + '张牌)', get.translation('xindanshou_info'))
                                        .set('ai', function () {
                                            return _status.event.choice;
                                        })
                                        .set(
                                            'choice',
                                            (function () {
                                                if (player.isPhaseUsing()) {
                                                    if (
                                                        player.countCards('h', function (card) {
                                                            return ['basic', 'trick'].includes(get.type(card, 'trick')) && player.canUse(card, player, null, true) && get.effect(player, card, player) > 0 && player.getUseValue(card, null, true) > 0;
                                                        })
                                                    )
                                                        return false;
                                                    return true;
                                                }
                                                if (num > 2) return true;
                                                var card = trigger.card;
                                                if (get.tag(card, 'damage') && player.hp <= trigger.parent.baseDamage && (!get.tag(card, 'respondShan') || !player.hasShan()) && (!get.tag(card, 'respondSha') || !player.hasSha())) return true;
                                                var source = _status.currentPhase,
                                                    todis = source.countCards('h') - Math.max(0, source.needsToDiscard());
                                                if (
                                                    todis <=
                                                    Math.max(
                                                        Math.min(
                                                            2 + (source.hp <= 1 ? 1 : 0),
                                                            player.countCards('he', function (card) {
                                                                return get.value(card, player) < Math.max(5.5, 8 - todis);
                                                            })
                                                        ),
                                                        player.countCards('he', function (card) {
                                                            return get.value(card, player) <= 0;
                                                        })
                                                    ) &&
                                                    get.damageEffect(source, player, player) > 0
                                                )
                                                    return false;
                                                if (!source.isPhaseUsing() || get.attitude(player, source) > 0) return true;
                                                if (card.name == 'sha' && !source.getCardUsable('sha')) return true;
                                                return Math.random() < num / 3;
                                            })()
                                        );
                                }
                                ('step 1');
                                if (result.bool) {
                                    if (!result.cards || !result.cards.length) {
                                    }
                                    if (event.triggername == 'useCardToTargeted') {
                                        player.draw(num);
                                        player.addTempSkill('xindanshou_as');
                                    } else {
                                        trigger.player.damage('nocard');
                                    }
                                }
                            },
                            subSkill: {
                                as: {
                                },
                            },
                            ai: {
                                threaten: 0.6,
                                effect: {
                                    target(card, player, target, current) {
                                        if (typeof card != 'object' || target.hasSkill('xindanshou_as') || !['basic', 'trick'].includes(get.type(card, 'trick'))) return;
                                        var num = 0;
                                        game.countPlayer2(function (current) {
                                            var history = current.getHistory('useCard');
                                            for (var j = 0; j < history.length; j++) {
                                                if (['basic', 'trick'].includes(get.type(history[j].card, 'trick')) && history[j].targets && history[j].targets.includes(player)) num++;
                                            }
                                        });
                                        if (player == target && current > 0) return [1.1, num];
                                        return [0.9, num];
                                    },
                                },
                            },
                        },
                        ty_zhengjun: {
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (player == event.player) return false;
                                var num = event.player.getHistory('useCard', function (evt) {
                                    return evt.targets.includes(player);
                                }).length;
                                return num == 0 || (event.player.isAlive() && num <= player.countCards('he'));
                            },
                            content() {
                                'step 0';
                                var num = trigger.player.getHistory('useCard', function (evt) {
                                    return evt.targets.includes(player);
                                }).length;
                                event.num = num;
                                if (num == 0) {
                                    if (player.hasSkill('mobiledanshou')) event._result = { bool: true };
                                    else player.chooseBool('是否发动【胆守】摸一张牌？', lib.translate.mobiledanshou_info);
                                } else event.goto(2);
                                ('step 1');
                                if (result.bool) {
                                    player.draw();
                                }
                                event.finish();
                                ('step 2');
                                player
                                    .chooseToDiscard(num, get.prompt('mobiledanshou', trigger.player), '弃置' + get.translation(num) + '张牌并对其造成1点伤害', 'he')
                                    .set('ai', function (card) {
                                        if (!_status.event.goon) return 0;
                                        var num = _status.event.parent.num;
                                        if (num == 1) return 8 - get.value(card);
                                        if (num == 2) return 6.5 - get.value(card);
                                        return 5 - get.value(card);
                                    })
                                    .set('goon', get.damageEffect(trigger.player, player, player) > 0);
                                ('step 3');
                                if (result.bool) {
                                    player.addExpose(0.2);
                                    trigger.player.damage();
                                }
                            },
                        },
                        ty_chaozhan: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            content() {
                                player.removeSkill('ty_zhengjun');
                                player.removeSkill('ty_sishi');
                                player.addSkill('ty_mishi');
                            },
                        },
                        ty_qibing: {
                            trigger: {
                                player: 'phaseJieshuAfter',
                            },
                            content() {
                                player.removeSkill('ty_mishi');
                                player.removeSkill('ty_sishi');
                                player.addSkill('ty_zhengjun');
                            },
                        },
                        ty_gongcuan: {
                            trigger: {
                                player: 'phaseJieshuEnd',
                            },
                            content() {
                                player.addSkill('ty_sishi');
                                player.removeSkill('ty_zhengjun');
                                player.removeSkill('ty_mishi');
                            },
                        },
                        ty_jinglue: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.hasSkill('jinglve2')) return false;
                                return game.hasPlayer(function (current) {
                                    return current != player && current.countCards('h') > 0;
                                });
                            },
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                if (!player.storage.jinglve4) player.storage.jinglve4 = [];
                                player.storage.jinglve4.add(target);
                                player.chooseButton(['选择一张牌作为「死士」', target.getCards('h')], true).set('ai', function (button) {
                                    var target = _status.event.parent.target;
                                    var card = button.link;
                                    var val = target.getUseValue(card);
                                    if (val > 0) return val;
                                    return get.value(card);
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.storage.jinglve2 = target;
                                    player.storage.jinglve3 = result.links[0];
                                    player.addSkill('jinglve2');
                                }
                            },
                            ai: {
                                order: 12,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        ty_quanbian: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            limited: true,
                            juexingji: true,
                            derivation: ['ty_sishi', 'ty_jinglue', '败移'],
                            content() {
                                player.gainMaxHp();
                                player.recover(2);
                                player.addSkill('ty_sishi');
                                player.removeSkill('ty_zhengjun');
                                player.removeSkill('ty_mishi');
                                player.removeSkill('ty_chaozhan');
                                player.removeSkill('ty_qibing');
                                player.removeSkill('ty_gongcuan');
                                player.addSkill('ty_jinglue');
                                player.addSkill('败移');
                                player.removeSkill('ty_quanbian');
                                player.update();
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        败移: {
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            selectTarget: 2,
                            limited: true,
                            derivation: ['ty_yimie', 'ty_tairan'],
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.hp <= 2 && game.players.length > 2;
                            },
                            multitarget: true,
                            multiline: true,
                            changeSeat: true,
                            contentBefore() {
                                player.$fullscreenpop('败移', 'thunder');
                            },
                            content() {
                                player.gainMaxHp();
                                player.recover(2);
                                player.addSkill('ty_yimie');
                                player.addSkill('ty_tairan');
                                player.awakenSkill('败移');
                                game.broadcastAll(
                                    function (target1, target2) {
                                        game.swapSeat(target1, target2);
                                    },
                                    targets[0],
                                    targets[1]
                                );
                            },
                            ai: {
                                order: 1,
                                result: {
                                    target(player, target) {
                                        if (player.hasUnknown() && target != player.next && target != player.previous) return 0;
                                        var distance = Math.pow(get.distance(player, target, 'absolute'), 2);
                                        if (!ui.selected.targets.length) return distance;
                                        var distance2 = Math.pow(get.distance(player, ui.selected.targets[0], 'absolute'), 2);
                                        return Math.min(0, distance - distance2);
                                    },
                                },
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_tairan: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'phaseEnd',
                            },
                            forced: true,
                            preHidden: true,
                            filter(event, player) {
                                return player.hp < player.maxHp || player.countCards('h') < player.maxHp;
                            },
                            content() {
                                'step 0';
                                player.gainMaxHp();
                                ('step 1');
                                player.addSkill('tairan2');
                                if (!player.storage.tairan2) player.storage.tairan2 = 0;
                                var num = Math.min(player.maxHp - player.hp, 10);
                                if (num > 0) {
                                    player.storage.tairan2 += num;
                                    player.recover(num);
                                    player.storage.tairan_mark = num;
                                    player.addTempSkill('tairan_mark', { player: 'phaseUseBegin' });
                                    player.markSkill('tairan_mark');
                                }
                                ('step 2');
                                if (player.countCards('h') < player.maxHp) player.drawTo(Math.min(player.maxHp, 10 + player.countCards('h'))).gaintag = ['tairan'];
                            },
                            subSkill: {
                                mark: {
                                    onremove(player) {
                                        delete player.storage.tairan_mark;
                                    },
                                    intro: {
                                        content: '泰然血量为#',
                                    },
                                },
                            },
                        },
                        ty_yimie: {
                            audio: 'ext:汤圆神将包/audio:true',
                            preHidden: true,
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return player != event.player && event.num < event.player.hp;
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) > -2) return false;
                                if (player.hp > 2) return true;
                                if (player.hp == 2 && event.player.hp < 3) return false;
                                return player.hp > 1;
                            },
                            logTarget: 'player',
                            content() {
                                player.loseHp();
                                trigger.player.addTempSkill('yimie2');
                                trigger.yimie_num = trigger.player.hp - trigger.num;
                                trigger.num = trigger.player.hp;
                            },
                        },
                        ty_xinsuo: {
                            trigger: {
                                global: 'damageBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.player != player && event.player.isLinked();
                            },
                            content() {
                                player.draw();
                            },
                        },
                        ty_xingniepan: {
                            trigger: {
                                player: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        player.recover(3 - player.hp);
                                        player.addTempSkill('ty_xingniepan2', { player: 'phaseZhunbeiBegin' });
                                        player.addSkill('ty_xinsuo');
                                        break;
                                    case 'diamond':
                                        player.recover(3 - player.hp);
                                        player.addTempSkill('ty_xingniepan2', { player: 'phaseZhunbeiBegin' });
                                        player.addSkill('诛害t');
                                        break;
                                    case 'club':
                                        player.recover(3 - player.hp);
                                        player.addTempSkill('ty_xingniepan2', { player: 'phaseZhunbeiBegin' });
                                        player.addSkill('连环t');
                                        break;
                                    case 'spade':
                                        player.loseMaxHp();
                                        player.draw(6 - player.maxHp);
                                        break;
                                }
                            },
                        },
                        ty_jiexin: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.player.hp <= player.hp;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                player.loseHp();
                                player.draw();
                                trigger.player.recover();
                            },
                        },
                        ty_xingniepan2: {
                            trigger: {
                                global: 'phaseJieshuEnd',
                            },
                            forced: true,
                            content() {
                                player.loseHp();
                            },
                        },
                        ty_qizao1: {
                            trigger: {
                                global: 'phaseJieshuEnd',
                            },
                            filter(event, player) {
                                return player.countCards('h') == 1 && player.maxHp > 1;
                            },
                            derivation: 'syjiqiao',
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            limited: true,
                            juexingji: true,
                            content() {
                                player.loseMaxHp();
                                player.draw(2);
                                player.addSkill('syjiqiao');
                                player.awakenSkill('ty_qizao1');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_xuanfeng1: {
                            audio: 'ext:汤圆神将包/audio:true',
                            audioname: ['boss_lvbu3', 're_heqi', 'xin_lingtong'],
                            trigger: {
                                player: ['loseAfter', 'phaseDiscardEnd'],
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (_status.dying.length) return false;
                                if (event.name == 'phaseDiscard') {
                                    var cards = [];
                                    player.getHistory('lose', function (evt) {
                                        if (evt && evt.type == 'discard' && evt.getParent('phaseDiscard') == event && evt.hs) cards.addArray(evt.hs);
                                    });
                                    return cards.length > 1;
                                } else {
                                    var evt = event.getl(player);
                                    return evt && evt.es && evt.es.length;
                                }
                            },
                            content() {
                                'step 0';
                                event.count = 2;
                                event.targets = [];
                                ('step 1');
                                event.count--;
                                player
                                    .chooseTarget('弃置一名其他角色的一张牌', function (card, player, target) {
                                        if (player == target) return false;
                                        return target.countDiscardableCards(player, 'he');
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(_status.event.player, target);
                                    });
                                ('step 2');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'green');
                                    targets.add(result.targets[0]);
                                    player.discardPlayerCard(result.targets[0], 'he', true);
                                } else if (!targets.length) event.finish();
                                ('step 3');
                                if (event.count) event.goto(1);
                                else if (player == _status.currentPhase) {
                                    player
                                        .chooseTarget('是否对一名目标角色造成1点伤害', function (card, player, target) {
                                            return _status.event.targets.includes(target);
                                        })
                                        .set('targets', targets)
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.damageEffect(target, player, player);
                                        });
                                } else event.finish();
                                ('step 4');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'thunder');
                                    result.targets[0].damage();
                                }
                            },
                            ai: {
                                effect: {
                                    player_use(card, player, target) {
                                        if (
                                            player == target &&
                                            get.type(card) == 'equip' &&
                                            player.countCards('hes', function (cardx) {
                                                return card != cardx && (!card.cards || !card.cards.includes(cardx)) && (player.hasSkill('yongjin') || get.subtype(card) == get.subtype(cardx)) && (get.position(cardx) == 'e' || player.canUse(cardx, player));
                                            }) > 0
                                        )
                                            return;
                                        if (
                                            !game.hasPlayer(function (current) {
                                                return get.attitude(player, current) < 0 && current.countDiscardableCards(player, 'he') > 0 && get.damageEffect(current, player, player) > 0;
                                            })
                                        )
                                            return;
                                        if (
                                            typeof card == 'object' &&
                                            player.isPhaseUsing() &&
                                            player.needsToDiscard() == 2 &&
                                            card.cards &&
                                            card.cards.filter(function (i) {
                                                return get.position(i) == 'h';
                                            }).length &&
                                            !get.tag(card, 'draw') &&
                                            !get.tag(card, 'gain') &&
                                            !(get.tag(card, 'discard') && target == player && player.countCards('e') > 0)
                                        )
                                            return 'zeroplayertarget';
                                    },
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                        if (get.tag(card, 'damage') && target.hp > 2) {
                                            var num1 = target.countCards('h'),
                                                num2 = target.getHandcardLimit();
                                            if (num1 > num2) return [1, 1];
                                            if (num1 == num2) return [1.1, _status.event.player == target ? 3 : 0.5];
                                            if (num1 == num2 - 1) return [0.1, _status.event.player == target ? 4.5 : 0.1];
                                        }
                                        if (typeof card == 'object' && (card.name == 'shunshou' || card.name == 'guohe' || card.name == 'zhujinqiyuan') && target.countCards('h') > 0 && get.attitude(player, target) < 0) return [1, -1];
                                    },
                                },
                                reverseEquip: true,
                                noe: true,
                                expose: 0.2,
                            },
                        },
                        ty_fubing1: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            filter(event, player) {
                                return player.countCards('e') == 1 && player.maxHp > 1;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            limited: true,
                            juexingji: true,
                            derivation: 'ty_xuanfeng1',
                            content() {
                                player.loseMaxHp();
                                player.draw(1);
                                player.addSkill('ty_xuanfeng1');
                                player.awakenSkill('ty_fubing1');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_buyi1: {
                            audio: 'ext:汤圆突破包/audio:2',
                            trigger: {
                                global: 'dying',
                            },
                            filter(event, player) {
                                return event.player.countCards('h') > 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            content() {
                                'step 0';
                                if (player == trigger.player)
                                    player.chooseCard('h', true).set('ai', function (card) {
                                        if (get.type(card) != 'basic') return 100 - get.value(card);
                                        return 0;
                                    });
                                else player.choosePlayerCard('h', trigger.player, true);
                                ('step 1');
                                var card = result.cards[0],
                                    target = trigger.player;
                                player.showCards(card, get.translation(player) + '对' + (player == target ? '自己' : get.translation(target)) + '发动了【补益】');
                                if (get.type(card, target) != 'basic') {
                                    target.discard(card);
                                    target.recover();
                                    if (target.countCards('h') == 1) target.draw();
                                }
                            },
                            logTarget: 'player',
                        },
                        ty_lizhan1: {
                            trigger: {
                                global: 'phaseJieshuEnd',
                            },
                            filter(event, player) {
                                return player.maxHp - player.hp == 1 && player.maxHp > 1;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            limited: true,
                            juexingji: true,
                            derivation: ['duwu', 'ty_buyi1', 'ty_degong1'],
                            content() {
                                player.loseMaxHp();
                                player.draw(2);
                                player.addSkill('duwu');
                                player.addSkill('ty_buyi1');
                                player.addSkill('ty_degong1');
                                player.awakenSkill('ty_lizhan1');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_fenbo1: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.getStat('kill') > 0;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                        },
                        ty_degong1: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            filter(event, player) {
                                return player.hp == 1 && player.maxHp > 1;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            limited: true,
                            juexingji: true,
                            derivation: ['ty_dimeng', 'ty_chengwang1'],
                            content() {
                                player.loseMaxHp();
                                player.draw(2);
                                player.addSkill('ty_dimeng');
                                player.addSkill('ty_chengwang1');
                                player.awakenSkill('ty_degong1');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_xiongzi1: {
                            trigger: {
                                player: ['phaseBegin', 'phaseJudgeBegin', 'phaseDrawBegin', 'phaseUseBegin', 'phaseDiscardBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                player.draw();
                            },
                        },
                        ty_yinghun1: {
                            audio: 'yinghun',
                            audioname: ['re_sunjian', 'sunce', 're_sunben', 're_sunce', 'ol_sunjian'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.getDamagedHp() > 0;
                            },
                            forced: true,
                            preHidden: true,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt2('gzyinghun'), function (card, player, target) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        if (player.getDamagedHp() == 1 && target.countCards('he') == 0) {
                                            return 0;
                                        }
                                        if (get.attitude(_status.event.player, target) > 0) {
                                            return 10 + get.attitude(_status.event.player, target);
                                        }
                                        if (player.getDamagedHp() == 1) {
                                            return -1;
                                        }
                                        return 1;
                                    })
                                    .setHiddenSkill(event.name);
                                ('step 1');
                                if (result.bool) {
                                    event.num = player.getDamagedHp();
                                    event.target = result.targets[0];
                                    if (event.num == 1) {
                                        event.directcontrol = true;
                                    } else {
                                        var str1 = '摸' + get.cnNumber(event.num, true) + '弃一';
                                        var str2 = '摸一弃' + get.cnNumber(event.num, true);
                                        player
                                            .chooseControl(str1, str2, function (event, player) {
                                                return _status.event.choice;
                                            })
                                            .set('choice', get.attitude(player, event.target) > 0 ? str1 : str2);
                                        event.str = str1;
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.directcontrol || result.control == event.str) {
                                    event.target.draw(event.num);
                                    event.target.chooseToDiscard(true, 'he');
                                } else {
                                    event.target.draw();
                                    event.target.chooseToDiscard(event.num, true, 'he');
                                }
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == target.maxHp) return 0.5;
                                    if (target.hp == 1) return 2;
                                    if (target.hp == 2) return 1.5;
                                    return 0.5;
                                },
                                maixie: true,
                            },
                        },
                        ty_chengwang1: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            filter(event, player) {
                                return player.maxHp == 1;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            limited: true,
                            juexingji: true,
                            derivation: ['ty_fenbo1', 'ty_xiongzi1', 'ty_yinghun1'],
                            content() {
                                player.gainMaxHp(4);
                                player.removeSkill('duwu');
                                player.removeSkill('ty_dimeng');
                                player.addSkill('ty_fenbo1');
                                player.addSkill('ty_xiongzi1');
                                player.addSkill('ty_yinghun1');
                                player.awakenSkill('ty_chengwang1');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                            ai: {
                                treaten: 2,
                            },
                        },
                        ty_zhuangzhi1: {
                            mod: {
                                maxHandcardBase(player, num) {
                                    return 5;
                                },
                            },
                        },
                        ty_fuwang1: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp(player.maxHp - 5);
                                player.removeSkill('ty_fuwang1');
                            },
                        },
                        ty_dimeng: {
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return game.hasPlayer((current) => lib.skill.oldimeng.filterTarget(null, player, current));
                            },
                            selectTarget: 2,
                            complexTarget: true,
                            filterTarget(card, player, target) {
                                if (target == player) return false;
                                var ps = player.countCards('he');
                                if (!ui.selected.targets.length) {
                                    var hs = target.countCards('h');
                                    return game.hasPlayer(function (current) {
                                        if (current == player || current == target) return false;
                                        var cs = current.countCards('h');
                                        return (hs > 0 || cs > 0) && Math.abs(hs - cs) <= ps;
                                    });
                                }
                                var current = ui.selected.targets[0],
                                    hs = target.countCards('h'),
                                    cs = current.countCards('h');
                                return (hs > 0 || cs > 0) && Math.abs(hs - cs) <= ps;
                            },
                            multitarget: true,
                            multiline: true,
                            content() {
                                targets[0].swapHandcards(targets[1]);
                                var num = Math.abs(targets[0].countCards('h') - targets[1].countCards('h'));
                                if (num > 0) {
                                    player.addMark('oldimeng_discard', num, false);
                                    player.addTempSkill('oldimeng_discard', 'phaseUseAfter');
                                }
                            },
                            ai: {
                                threaten: 4.5,
                                pretao: true,
                                nokeep: true,
                                order: 1,
                                expose: 0.2,
                                result: {
                                    target(player, target) {
                                        if (!ui.selected.targets.length) return -Math.sqrt(target.countCards('h'));
                                        var h1 = ui.selected.targets[0].getCards('h'),
                                            h2 = target.getCards('h');
                                        if (h2.length > h1.length) return 0;
                                        var delval = get.value(h2, target) - get.value(h1, ui.selected.targets[0]);
                                        if (delval >= 0) return 0;
                                        return -delval * (h1.length - h2.length);
                                    },
                                },
                            },
                            subSkill: {
                                discard: {
                                    trigger: {
                                        player: 'phaseUseEnd',
                                    },
                                    forced: true,
                                    charlotte: true,
                                    filter(event, player) {
                                        return player.countCards('he') > 0;
                                    },
                                    content() {
                                        player.chooseToDiscard('he', true, player.countMark('oldimeng_discard'));
                                    },
                                },
                            },
                        },
                        ty_quanji: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd', 'phaseUseEnd'],
                                global: 'dieAfter',
                            },
                            forced: true,
                            notemp: true,
                            filter(event, player) {
                                if (event.name == 'phaseUse') return player.countCards('h') > player.hp;
                                return event.num > 0;
                            },
                            content() {
                                'step 0';
                                event.count = trigger.num || 1;
                                ('step 1');
                                event.count--;
                                player.draw();
                                ('step 2');
                                if (player.countCards('h')) {
                                    player.chooseCard('将一张手牌置于武将牌上作为<权>', true);
                                } else {
                                    event.goto(4);
                                }
                                ('step 3');
                                if (result.cards?.length) {
                                    player.addToExpansion(result.cards, player, 'give').gaintag.add('quanji');
                                }
                                ('step 4');
                                if (event.count > 0) {
                                    player.chooseBool(get.prompt2('requanji')).set('frequentSkill', 'requanji');
                                } else event.finish();
                                ('step 5');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.getExpansions('quanji').length;
                                },
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions('quanji');
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                threaten: 0.8,
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
                                            if (!target.hasFriend()) return;
                                            if (target.hp >= 4) return [0.5, get.tag(card, 'damage') * 2];
                                            if (!target.hasSkill('paiyi') && target.hp > 1) return [0.5, get.tag(card, 'damage') * 1.5];
                                            if (target.hp == 3) return [0.5, get.tag(card, 'damage') * 1.5];
                                            if (target.hp == 2) return [1, get.tag(card, 'damage') * 0.5];
                                        }
                                    },
                                },
                            },
                        },
                        ty_zhangong: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageSource',
                            },
                            forced: true,
                            notemp: true,
                            usable: 2,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                ('step 1');
                                if (player.countCards('h')) {
                                    player.chooseCard('将一张手牌置于武将牌上作为<权>', true);
                                } else {
                                    event.goto(4);
                                }
                                ('step 2');
                                if (result.cards?.length) {
                                    player.addToExpansion(result.cards, player, 'giveAuto').gaintag.add('quanji');
                                }
                                ('step 3');
                                if (event.count > 0) {
                                    player.chooseBool(get.prompt2('quanji')).set('frequentSkill', 'quanji');
                                } else event.finish();
                                ('step 4');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                threaten: 0.8,
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
                                            if (!target.hasFriend()) return;
                                            if (target.hp >= 4) return [0.5, get.tag(card, 'damage') * 2];
                                            if (!target.hasSkill('paiyi') && target.hp > 1) return [0.5, get.tag(card, 'damage') * 1.5];
                                            if (target.hp == 3) return [0.5, get.tag(card, 'damage') * 1.5];
                                            if (target.hp == 2) return [1, get.tag(card, 'damage') * 0.5];
                                        }
                                    },
                                },
                            },
                        },
                        ty_zili: {
                            derivation: ['ty_paiyi', 'ty_zengshi', 'ty_nongquan'],
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return player.getExpansions('quanji').length > 2;
                            },
                            content() {
                                player.awakenSkill('ty_zili');
                                player.recover();
                                player.draw(2);
                                player.loseMaxHp();
                                player.addSkill('ty_paiyi');
                                player.addSkill('ty_zengshi');
                                player.addSkill('ty_nongquan');
                            },
                        },
                        ty_paiyi: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.getExpansions('quanji').length;
                            },
                            chooseButton: {
                                dialog(event, player) {
                                    return ui.create.dialog('ty_paiyi', player.getExpansions('quanji'), 'hidden');
                                },
                                backup(links, player) {
                                    return {
                                        audio: 'ty_paiyi',
                                        audioname: ['re_zhonghui'],
                                        filterTarget: true,
                                        filterCard() {
                                            return false;
                                        },
                                        selectCard: -1,
                                        card: links[0],
                                        delay: false,
                                        content: lib.skill.ty_paiyi.contentx,
                                        ai: {
                                            order: 10,
                                            result: {
                                                target(player, target) {
                                                    if (player != target) return 0;
                                                    if (player.hasSkill('ty_quanji') || player.countCards('h') + 2 <= player.hp + player.getExpansions('quanji').length) return 1;
                                                    return 0;
                                                },
                                            },
                                        },
                                    };
                                },
                                prompt() {
                                    return '请选择〖排异〗的目标';
                                },
                            },
                            contentx() {
                                'step 0';
                                var card = lib.skill.ty_paiyi_backup.card;
                                player.loseToDiscardpile(card);
                                ('step 1');
                                if (player.getExpansions('quanji').length < player.maxHp) {
                                    target.draw(1, player.getExpansions('quanji').length);
                                } else {
                                    target.draw(1, player.maxHp);
                                    if (player.maxHp < 8) player.gainMaxHp();
                                }
                            },
                            ai: {
                                order: 1,
                                combo: 'quanji',
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_zengshi: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.getExpansions('quanji').length;
                            },
                            chooseButton: {
                                dialog(event, player) {
                                    return ui.create.dialog('ty_zengshi', player.getExpansions('quanji'), 'hidden');
                                },
                                backup(links, player) {
                                    return {
                                        audio: 'ty_zengshi',
                                        audioname: ['re_zhonghui'],
                                        filterTarget: true,
                                        filterCard() {
                                            return false;
                                        },
                                        selectCard: -1,
                                        card: links[0],
                                        delay: false,
                                        content: lib.skill.ty_zengshi.contentx,
                                        ai: {
                                            order: 10,
                                            result: {
                                                target(player, target) {
                                                    if (player != target) return 0;
                                                    if (player.hasSkill('ty_quanji') || player.countCards('h') + 2 <= player.hp + player.getExpansions('quanji').length) return 1;
                                                    return 0;
                                                },
                                            },
                                        },
                                    };
                                },
                                prompt() {
                                    return '请选择〖增势〗的目标';
                                },
                            },
                            contentx() {
                                'step 0';
                                var card = lib.skill.ty_zengshi_backup.card;
                                player.loseToDiscardpile(card);
                                ('step 1');
                                if (player.maxHp < 8) {
                                    player.gainMaxHp();
                                }
                                target.recover();
                                ('step 2');
                                if (target.hp > player.hp) {
                                    target.chooseToDiscard(36, 'h', true);
                                }
                            },
                            ai: {
                                order: 1,
                                combo: 'quanji',
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_nongquan: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.getExpansions('quanji').length;
                            },
                            chooseButton: {
                                dialog(event, player) {
                                    return ui.create.dialog('ty_nongquan', player.getExpansions('quanji'), 'hidden');
                                },
                                backup(links, player) {
                                    return {
                                        audio: 'ty_nongquan',
                                        filterTarget: true,
                                        playerTarget: false,
                                        filterCard() {
                                            return false;
                                        },
                                        selectCard: -1,
                                        card: links[0],
                                        delay: false,
                                        content: lib.skill.ty_nongquan.contentx,
                                        ai: {
                                            order: 10,
                                            result: {
                                                target(player, target) {
                                                    if (player != target) return 0;
                                                    if (player.hasSkill('ty_quanji') || player.countCards('h') + 2 <= player.hp + player.getExpansions('quanji').length) return 1;
                                                    return 0;
                                                },
                                            },
                                        },
                                    };
                                },
                                prompt() {
                                    return '请选择〖弄权〗的目标';
                                },
                            },
                            contentx() {
                                'step 0';
                                var card = lib.skill.ty_nongquan_backup.card;
                                player.loseToDiscardpile(card);
                                ('step 1');
                                target.draw(1, target.hp + 1);
                                ('step 2');
                                if (target.countCards('h') > player.countCards('h')) {
                                    target.damage(1, target.hp);
                                    if (player.maxHp < 8) player.gainMaxHp();
                                }
                            },
                            ai: {
                                order: 1,
                                combo: 'quanji',
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_cuanwei: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            juexingji: true,
                            limited: true,
                            forced: true,
                            _priority: 3,
                            derivation: ['ty_jilue', 'ty_tuntian', 'ty_yongquan'],
                            async content(event, trigger, player) {
                                //QQQ
                                if (
                                    game.countPlayer(function (current) {
                                        return current.group == 'wei';
                                    }) < 1
                                ) {
                                    player.draw();
                                    player.recover();
                                    player.addSkill('ty_jilue');
                                    player.addSkill('ty_tuntian');
                                    player.addSkill('ty_yongquan');
                                    player.awakenSkill('ty_cuanwei');
                                } else {
                                    player.draw();
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_weizhong: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: ['gainMaxHpEnd', 'loseMaxHpEnd'],
                            },
                            forced: true,
                            content() {
                                player.draw(player.isMinHandcard() ? 2 : 1);
                            },
                        },
                        ty_weizhong1: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: ['gainMaxHpEnd', 'loseMaxHpEnd'],
                            },
                            forced: true,
                            content() {
                                player.draw(player.isMinHandcard() ? 2 : 1);
                            },
                        },
                        ty_yongquan: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            _priority: 1,
                            content() {
                                'step 0';
                                event.count = Math.min(trigger.num, 9);
                                ('step 1');
                                event.count--;
                                player.loseMaxHp();
                                var choiceList = ['获得一张指定类型的牌'];
                                if (player.canMoveCard()) choiceList.push('移动场上的一张牌');
                                player
                                    .chooseControl('cancel2')
                                    .set('choiceList', choiceList)
                                    .set('prompt', get.prompt('rangjie'))
                                    .set('ai', function () {
                                        var player = _status.event.player;
                                        if (player.canMoveCard(true)) return 1;
                                        return 0;
                                    });
                                ('step 2');
                                if (result.control == 'cancel2') event.finish();
                                else {
                                    player.draw();
                                    if (result.index == 0) {
                                        player
                                            .chooseControl('basic', 'trick', 'equip')
                                            .set('prompt', '选择获得一种类型的牌')
                                            .set('ai', function () {
                                                var player = _status.event.player;
                                                if (player.hp <= 3 && !player.countCards('h', { name: ['shan', 'tao'] })) return 'basic';
                                                if (player.countCards('he', { type: 'equip' }) < 2) return 'equip';
                                                return 'trick';
                                            });
                                    } else {
                                        player.moveCard(true);
                                        event.goto(4);
                                    }
                                }
                                ('step 3');
                                var card = get.cardPile2(function (card) {
                                    return get.type(card, 'trick') == result.control;
                                });
                                if (card) player.gain(card, 'gain2', 'log');
                                ('step 4');
                                if (event.count > 0) event.goto(1);
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'damage')) {
                                            if (player.hasSkillTag('jueqing', false, target)) return [1, -2];
                                            if (!target.hasFriend()) return;
                                            var num = 1;
                                            if (get.attitude(player, target) > 0) {
                                                if (player.needsToDiscard()) {
                                                    num = 0.7;
                                                } else {
                                                    num = 0.5;
                                                }
                                            }
                                            if (target.hp >= 4) return [1, num * 2];
                                            if (target.hp == 3) return [1, num * 1.5];
                                            if (target.hp == 2) return [1, num * 0.5];
                                        }
                                    },
                                },
                            },
                        },
                        jilue_yimie: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageBegin1',
                            },
                            limited: true,
                            animationcolour: 'legend',
                            filter(event, player) {
                                return player != event.player && event.num < event.player.hp && player.hasMark('renjie');
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) > -2) return false;
                                if (player.hp > 2) return true;
                                if (player.hp == 2 && event.player.hp < 3) return false;
                                return player.hp > 1;
                            },
                            logTarget: 'player',
                            content() {
                                player.loseHp();
                                player.removeMark('jilue', 1);
                                trigger.player.addTempSkill('yimie2');
                                trigger.yimie_num = trigger.player.hp - trigger.num;
                                trigger.num = trigger.player.hp;
                                player.awakenSkill('jilue_yimie');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_jilue: {
                            group: ['jilue_guicai', 'jilue_fangzhu', 'jilue_wansha', 'jilue_zhiheng', 'jilue_jizhi', 'jilue_jizhi_clear', 'jilue_yimie', 'jilue_jinglue'],
                        },
                        jilue_jinglue: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            prompt: '弃置一枚<忍>,摸一张牌并观看一名角色的手牌,秘密地选择一张牌并标记为<死士>,当其使用死士牌时你令其无效,其回合结束或者弃置,打出死士牌时你获得之',
                            filter(event, player) {
                                if (player.hasSkill('jinglve2')) return false;
                                return game.hasPlayer(function (current) {
                                    return current != player && current.countCards('h') > 0 && player.hasMark('renjie');
                                });
                            },
                            filterTarget(card, player, target) {
                                return target != player && target.countCards('h') > 0;
                            },
                            content() {
                                'step 0';
                                player.draw();
                                player.removeMark('renjie', 1);
                                if (!player.storage.jinglve4) player.storage.jinglve4 = [];
                                player.storage.jinglve4.add(target);
                                player.chooseButton(['选择一张牌作为「死士」', target.getCards('h')], true).set('ai', function (button) {
                                    var target = _status.event.parent.target;
                                    var card = button.link;
                                    var val = target.getUseValue(card);
                                    if (val > 0) return val;
                                    return get.value(card);
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.storage.jinglve2 = target;
                                    player.storage.jinglve3 = result.links[0];
                                    player.addSkill('jinglve2');
                                }
                            },
                            ai: {
                                order: 12,
                                result: {
                                    target: -2,
                                    player: 1,
                                },
                            },
                        },
                        ty_renjie: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            group: 'renjie2',
                            notemp: true,
                            _priority: 3,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.draw();
                                player.addMark('renjie', trigger.num);
                            },
                            intro: {
                                name2: '忍',
                                content: 'mark',
                            },
                            ai: {
                                maixie: true,
                                maixie_hp: true,
                                combo: 'sbaiyin',
                            },
                        },
                        ty_lianpo: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.getStat('kill') > 0;
                            },
                            content() {
                                player.addMark('renjie', 1);
                                player.phase('nodelay');
                            },
                        },
                        ty_tuntian: {
                            trigger: {
                                source: 'damageSource',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                if (player.hp < player.maxHp) {
                                    player.recover();
                                } else {
                                    player.gainMaxHp();
                                    player.draw();
                                }
                            },
                        },
                        ty_mieshu: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            juexingji: true,
                            limited: true,
                            forced: true,
                            _priority: 2,
                            derivation: 'ty_chujian',
                            audio: 'ext:汤圆神将包/audio:true',
                            async content(event, trigger, player) {
                                //QQQ
                                if (
                                    game.countPlayer(function (current) {
                                        return current.group == 'shu';
                                    }) < 1
                                ) {
                                    player.draw();
                                    player.recover();
                                    player.addSkill('ty_jilue');
                                    player.addSkill('ty_tuntian');
                                    player.addSkill('ty_chujian');
                                    player.awakenSkill('ty_mieshu');
                                } else {
                                    player.draw();
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_wangwu: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            juexingji: true,
                            limited: true,
                            _priority: 1,
                            forced: true,
                            derivation: ['ty_weizhong', 'ty_gongqi'],
                            audio: 'ext:汤圆神将包/audio:true',
                            async content(event, trigger, player) {
                                //QQQ
                                if (
                                    game.countPlayer(function (current) {
                                        return current.group == 'wu';
                                    }) < 1
                                ) {
                                    player.draw();
                                    player.recover();
                                    player.addSkill('ty_jilue');
                                    player.addSkill('ty_tuntian');
                                    player.addSkill('ty_weizhong');
                                    player.addSkill('ty_gongqi');
                                    player.awakenSkill('ty_wangwu');
                                } else {
                                    player.draw();
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_gongqi: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            position: 'he',
                            filterCard: true,
                            filter(event, player) {
                                return player.countCards('h') > 0;
                            },
                            check(card) {
                                var base = 0,
                                    player = _status.event.player,
                                    suit = card.suit,
                                    added = false,
                                    added2 = false,
                                    added3;
                                if (
                                    get.type(card) == 'equip' &&
                                    game.hasPlayer(function (target) {
                                        var att = get.attitude(player, target);
                                        if (att >= 0) return 0;
                                        if (
                                            target.countCards('he', function (card) {
                                                return get.value(card) > 5;
                                            })
                                        )
                                            return -att;
                                    })
                                )
                                    base += 6;
                                var hs = player.getCards('h');
                                var muniu = player.getEquip('muniu');
                                if (muniu && card != muniu && muniu.cards) hs = hs.concat(muniu.cards);
                                for (var i of hs) {
                                    if (i != card && i.name == 'sha') {
                                        if (i.suit == suit) {
                                            if (player.hasValueTarget(i, false)) {
                                                added3 = true;
                                                base += 5.5;
                                            }
                                        } else {
                                            if (player.hasValueTarget(i, false)) added2 = true;
                                            if (!added && !player.hasValueTarget(i, null, true) && player.hasValueTarget(i, false, true)) {
                                                base += 4;
                                                added = true;
                                            }
                                        }
                                    }
                                }
                                if (added3 && !added2) base -= 4.5;
                                return base - get.value(card);
                            },
                            content() {
                                'step 0';
                                if (!player.storage.xingongji2) player.storage.xingongji2 = [];
                                player.storage.xingongji2.add(cards[0].suit);
                                player.addTempSkill('xingongji2');
                                ('step 1');
                                if (get.type(cards[0], null, cards[0].original == 'h' ? player : false) == 'equip') {
                                    player
                                        .chooseTarget('是否弃置一名角色的一张牌？', function (card, player, target) {
                                            return player != target && target.countCards('he') > 0;
                                        })
                                        .set('ai', function (target) {
                                            var att = get.attitude(player, target);
                                            if (att >= 0) return 0;
                                            if (
                                                target.countCards('he', function (card) {
                                                    return get.value(card) > 5;
                                                })
                                            )
                                                return -att;
                                            return -att * 0.8;
                                        });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.line(result.targets, 'green');
                                    player.discardPlayerCard(result.targets[0], 'he', true);
                                }
                            },
                            ai: {
                                order: 4.5,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_chujian: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            usable: 2,
                            filter(event, player) {
                                if (!player.countCards('he')) return false;
                                return !player.getStat('skill').zhuning || player.hasSkill('zhuning_double');
                            },
                            filterCard: true,
                            position: 'he',
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            selectCard: [1, Infinity],
                            delay: false,
                            lose: false,
                            discard: false,
                            check(card) {
                                if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') return 0;
                                if (!ui.selected.cards.length && card.name == 'du') return 20;
                                var player = get.owner(card);
                                if (ui.selected.cards.length >= Math.max(1, player.countCards('h') - player.hp)) return 0;
                                return 10 - get.value(card);
                            },
                            content() {
                                'step 0';
                                target.gain(cards, player, 'giveAuto').gaintag.add('fengxiang_tag');
                                ('step 1');
                                var list = [];
                                for (var name of lib.inpile) {
                                    var type = get.type(name);
                                    if (type != 'basic' && type != 'trick') continue;
                                    var card = { name: name };
                                    if (get.tag(card, 'damage') > 0 && player.hasUseTarget(card)) {
                                        list.push([type, '', name]);
                                    }
                                    if (name == 'sha') {
                                        for (var i of lib.inpile_nature) {
                                            card.nature = i;
                                            if (player.hasUseTarget(card)) list.push([type, '', name, i]);
                                        }
                                    }
                                }
                                if (list.length) {
                                    player.chooseButton(['是否视为使用一张伤害牌？', [list, 'vcard']]).set('ai', function (button) {
                                        return _status.event.player.getUseValue({ name: button.link[2] });
                                    });
                                } else event.finish();
                                ('step 2');
                                if (result.links?.length) {
                                    player.chooseUseTarget({ name: result.links[0][2], nature: result.links[0][3] }, true, false);
                                } else event.finish();
                                ('step 3');
                                if (
                                    !player.hasHistory('sourceDamage', function (evt) {
                                        if (!evt.card) return false;
                                        var evtx = evt.getParent('useCard');
                                        return evtx.card == evt.card && evtx.getParent(2) == event;
                                    })
                                )
                                    player.addTempSkill('zhuning_double');
                            },
                            subSkill: {
                                double: {
                                },
                            },
                            ai: {
                                fireAttack: true,
                                order: 4,
                                result: {
                                    target(player, target) {
                                        if (target.hasSkillTag('nogain')) return 0;
                                        if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') {
                                            if (target.hasSkillTag('nodu')) return 0;
                                            return -10;
                                        }
                                        if (target.hasJudge('lebu')) return 0;
                                        var nh = target.countCards('h');
                                        var np = player.countCards('h');
                                        if (player.hp == player.maxHp || player.storage.rerende < 0 || player.countCards('h') <= 1) {
                                            if (nh >= np - 1 && np <= player.hp && !target.hasSkill('haoshi')) return 0;
                                        }
                                        return Math.max(1, 5 - nh);
                                    },
                                },
                            },
                        },
                        ty_daoshu: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            filterTarget(c, p, t) {
                                return t != p && t.countGainableCards(p, 'h') > 0;
                            },
                            filter(e, p) {
                                return player.hasMark('jilue') && !p.hasSkill('daoshu_used');
                            },
                            prompt: '弃置一枚<忍>,选择一种花色并获得一名角色的一张手牌,若花色相同你对其造成一点伤害,不同则你需交给他一张花色不同的牌',
                            content() {
                                'step 0';
                                player.chooseControl(lib.suit).set('prompt', '请选择一个花色').ai = function () {
                                    return lib.suit.randomGet();
                                };
                                player.removeMark('jilue', 1);
                                ('step 1');
                                event.suit = result.control;
                                player.popup(event.suit + 2);
                                game.log(player, '选择了', event.suit + 2);
                                player.gainPlayerCard(target, true, 'h', 'visibleMove');
                                ('step 2');
                                if (result.cards?.length) {
                                    var suit2 = result.cards[0].suit;
                                    if (suit2 == event.suit) {
                                        target.damage();
                                        event.finish();
                                    } else {
                                        player.addTempSkill('daoshu_used', 'phaseUseEnd');
                                        if (
                                            player.countCards('h', function (card) {
                                                return card.suit != suit2;
                                            }) == 0
                                        ) {
                                            player.showHandcards();
                                            event.finish();
                                        } else
                                            player
                                                .chooseCard(
                                                    'h',
                                                    true,
                                                    function (card) {
                                                        return card.suit != _status.event.suit2;
                                                    },
                                                    '交给' + get.translation(target) + '一张不为' + get.translation(suit2) + '花色的牌'
                                                )
                                                .set('suit2', suit2);
                                    }
                                } else event.finish();
                                ('step 3');
                                player.give(result.cards, target, true);
                            },
                            ai: {
                                order: 1,
                                result: {
                                    target: -1,
                                },
                            },
                            subSkill: {
                                used: {
                                },
                            },
                        },
                        ty_mingding: {
                            name: '命定',
                            forced: true,
                            charlotte: true,
                            mod: {
                                cardEnabled(card, player) {
                                    if (card.name == 'tao' || card.name == 'jiu') return false;
                                },
                                cardSavable(card, player) {
                                    if (card.name == 'tao' || card.name == 'jiu') return false;
                                },
                            },
                            mark: true,
                            intro: {
                                content: '你的死亡已经注定!(你不能使用【酒】或【桃】)',
                            },
                            ai: {
                                neg: true,
                            },
                        },
                        ty_sanyi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'damageBefore',
                                source: 'damageBefore',
                            },
                            forced: true,
                            content() {
                                var card = get.cardPile2(function (card) {
                                    return ['tao', 'jiu', 'sha', 'shan'].includes(card.name);
                                });
                                trigger.cancel();
                                trigger.player.loseHp(trigger.num);
                                player.gain(card, 'gain2');
                            },
                            ai: {
                                treaten: 1.2,
                                jueqing: true,
                            },
                        },
                        借鉴1: {
                            trigger: {
                                player: 'phaseBefore',
                                global: 'roundStart',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['tw_beimihu'],
                            filter(event, player, name) {
                                return game.hasPlayer(function (current) {
                                    if (name == 'roundStart' && !current.isMinHp()) return false;
                                    return current != player && !current.hasMark('zongkui_mark');
                                });
                            },
                            content() {
                                'step 0';
                                var targets = game.filterPlayer(function (current) {
                                    if (event.triggername == 'roundStart' && !current.isMinHp()) return false;
                                    return current != player && !current.hasMark('zongkui_mark');
                                });
                                if (event.triggername == 'roundStart' && targets.length == 1) {
                                    event._result = { bool: true, targets: targets };
                                } else {
                                    var next = player
                                        .chooseTarget(get.prompt('zongkui'), '令一名' + (event.triggername == 'roundStart' ? '体力值最小的' : '') + '其他角色获得<傀>标记', function (card, player, target) {
                                            if (_status.event.round && !target.isMinHp()) return false;
                                            return target != player && !target.hasMark('zongkui_mark');
                                        })
                                        .set('ai', function (target) {
                                            var num = target.isMinHp() ? 0.5 : 1;
                                            return num * get.threaten(target);
                                        })
                                        .set('round', event.triggername == 'roundStart');
                                    if (event.triggername == 'roundStart') next.set('forced', true);
                                }
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    target.addMark('zongkui_mark', 1);
                                }
                            },
                            subSkill: {
                                mark: {
                                    marktext: '傀',
                                    intro: {
                                        name2: '傀',
                                        content: 'mark',
                                    },
                                },
                            },
                            ai: {
                                combo: 'guju',
                                threaten: 1.4,
                            },
                        },
                        借鉴2: {
                            audio: 'ext:汤圆神将包/audio:2',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return !player.storage.tiansuan2;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseControl('上上签', '上签', '中签', '下签', '下下签', 'cancel2')
                                    .set('prompt', '天算:是否增加其中一个命运签的权重？')
                                    .set('ai', function () {
                                        return Math.random() < 0.5 ? 0 : 4;
                                    });
                                ('step 1');
                                var list = [0, 1, 1, 2, 2, 2, 3, 3, 4];
                                if (result.control != 'cancel2') list.push(result.index);
                                var num = list.randomGet();
                                event.num = num;
                                var str = get.translation(player) + '抽取的命运签为:' + lib.skill['tiansuan2_' + num].name;
                                game.log(player, '抽取出了', '#g' + lib.skill['tiansuan2_' + num].name);
                                event.dialog = ui.create.dialog(str);
                                event.videoId = lib.status.videoId++;
                                game.broadcast('createDialog', event.videoId, str);
                                game.pause();
                                setTimeout(function () {
                                    game.resume();
                                }, 1500);
                                ('step 2');
                                event.dialog.close();
                                game.broadcast('closeDialog', event.videoId);
                                player.chooseTarget(true, '令一名角色获得<' + lib.skill['tiansuan2_' + num].name + '>').set('ai', lib.skill['tiansuan2_' + num].aiCheck);
                                ('step 3');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    game.log(player, '令', target, '获得了命运签');
                                    player.storage.tiansuan2 = target;
                                    player.storage.tiansuan3 = 'tiansuan2_' + num;
                                    player.addTempSkill('tiansuan2', { player: 'phaseBegin' });
                                    target.addSkill('tiansuan2_' + num);
                                    if (num < 2 && target.countGainableCards(player, target == player ? 'e' : 'he') > 0) {
                                        var next = player.gainPlayerCard(target, target == player ? 'e' : 'he', true);
                                        if (num == 0) next.visible = true;
                                    } else game.delayx();
                                }
                            },
                            derivation: 'tiansuan_faq',
                            ai: {
                                order: 7,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_bukui: {
                            group: 'ty_kuishang',
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'roundStart',
                                player: 'dying',
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(false, function (card, player, target) {
                                        return target != player && !target.hasSkill('ty_mingding');
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(player, target) + 1;
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.line(target, 'green');
                                    target.addSkill('ty_mingding');
                                }
                            },
                            ai: {
                                treaten: 1.8,
                                result: {
                                    target(player, target) {
                                        return -6;
                                    },
                                },
                            },
                        },
                        ty_kuishang: {
                            trigger: {
                                global: ['recoverEnd', 'discardEnd'],
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.player.hasSkill('ty_mingding');
                            },
                            content() {
                                player.draw();
                            },
                        },
                        借鉴3: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                global: 'useCardAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.targets.length != 1 || event.targets[0] == player || event.targets[0].isDead()) return false;
                                if (event.card.name != 'juedou' && (event.card.name != 'sha' || get.color(event.card) != 'red')) return false;
                                if (_status.connectMode && player.countCards('h') > 0) return true;
                                return player.hasSha() || player.hasUsableCard('juedou');
                            },
                            content() {
                                player
                                    .chooseToUse(
                                        function (card, player, event) {
                                            var name = card.name;
                                            if (name != 'sha' && name != 'juedou') return false;
                                            return lib.filter.cardEnabled.apply(this, arguments);
                                        },
                                        '合击:是否对' + get.translation(trigger.targets[0]) + '使用一张【杀】或【决斗】？'
                                    )
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', trigger.targets[0])
                                    .set('addCount', false);
                            },
                            group: 'heji_gain',
                            subSkill: {
                                gain: {
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.getParent(2).name == 'heji';
                                    },
                                    content() {
                                        var card = get.cardPile2(function (card) {
                                            return get.color(card, false) == 'red';
                                        });
                                        if (card) player.gain(card, 'gain2');
                                    },
                                },
                            },
                            mod: {
                                aiOrder(player, card, num) {
                                    if (card.name == 'sha' && get.color(card, player) == 'red')
                                        return (
                                            num +
                                            0.6 *
                                            (_status.event.name == 'chooseToUse' &&
                                                player.hasHistory('useCard', function (evt) {
                                                    return evt.card.name == 'sha' && evt.cards.length == 1;
                                                })
                                                ? 1
                                                : -1)
                                        );
                                },
                            },
                        },
                        ty_juesha: {
                            trigger: {
                                global: 'dyingAfter',
                            },
                            logTarget: 'player',
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (
                                    !player.hasSha() &&
                                    player.hasUsableCard(function (card) {
                                        return get.tag(card, 'damage');
                                    })
                                )
                                    return false;
                                return event.player != player && event.player.isAlive();
                            },
                            content() {
                                'step 0';
                                event.target = trigger.player;
                                ('step 1');
                                player.draw();
                                player
                                    .chooseToUse('绝杀:是否对' + get.translation(event.target) + '使用一张带有【伤害】标签的牌？', function (card, player, event) {
                                        if (!get.tag(card, 'damage')) return false;
                                        return lib.filter.cardEnabled.apply(this, arguments);
                                    })
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', event.target)
                                    .set('addCount', false);
                            },
                        },
                        ty_luanshi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dieAfter',
                            },
                            animationColour: 'legend',
                            filter(event, player, name) {
                                return _status.currentPhase == player;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            selectTarget: -1,
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                event.current = player.next;
                                event.currented = [];
                                ('step 1');
                                event.currented.push(event.current);
                                event.current.addTempClass('target');
                                event.current
                                    .chooseToUse(
                                        '乱武:使用一张杀或失去一点体力',
                                        function (card) {
                                            if (card.name != 'sha') return false;
                                            return lib.filter.filterCard.apply(this, arguments);
                                        },
                                        function (card, player, target) {
                                            if (player == target) return false;
                                            var dist = get.distance(player, target);
                                            if (dist > 1) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return current != player && get.distance(player, current) < dist;
                                                    })
                                                ) {
                                                    return false;
                                                }
                                            }
                                            return lib.filter.filterTarget.apply(this, arguments);
                                        }
                                    )
                                    .set('ai2', function () {
                                        return get.effect_use.apply(this, arguments) + 0.01;
                                    });
                                ('step 2');
                                if (result.bool == false) event.current.loseHp();
                                event.current = event.current.next;
                                if (event.current != player && !event.currented.includes(event.current)) {
                                    event.goto(1);
                                }
                            },
                        },
                        ty_luanwu: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            limited: true,
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            selectTarget: -1,
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                player.addTempSkill('ty_luanshi');
                                player.awakenSkill('ty_luanwu');
                                event.current = player.next;
                                event.currented = [];
                                ('step 1');
                                event.currented.push(event.current);
                                event.current.addTempClass('target');
                                event.current
                                    .chooseToUse(
                                        '乱武:使用一张杀或失去一点体力',
                                        function (card) {
                                            if (card.name != 'sha') return false;
                                            return lib.filter.filterCard.apply(this, arguments);
                                        },
                                        function (card, player, target) {
                                            if (player == target) return false;
                                            var dist = get.distance(player, target);
                                            if (dist > 1) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return current != player && get.distance(player, current) < dist;
                                                    })
                                                ) {
                                                    return false;
                                                }
                                            }
                                            return lib.filter.filterTarget.apply(this, arguments);
                                        }
                                    )
                                    .set('ai2', function () {
                                        return get.effect_use.apply(this, arguments) + 0.01;
                                    });
                                ('step 2');
                                if (result.bool == false) event.current.loseHp();
                                event.current = event.current.next;
                                if (event.current != player && !event.currented.includes(event.current)) {
                                    event.goto(1);
                                }
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        if (lib.config.mode == 'identity' && game.zhu.isZhu && player.identity == 'fan') {
                                            if (game.zhu.hp == 1 && game.zhu.countCards('h') <= 2) return 1;
                                        }
                                        var num = 0;
                                        var players = game.filterPlayer();
                                        for (var i = 0; i < players.length; i++) {
                                            var att = get.attitude(player, players[i]);
                                            if (att > 0) att = 1;
                                            if (att < 0) att = -1;
                                            if (players[i] != player && players[i].hp <= 3) {
                                                if (players[i].countCards('h') == 0) num += att / players[i].hp;
                                                else if (players[i].countCards('h') == 1) num += att / 2 / players[i].hp;
                                                else if (players[i].countCards('h') == 2) num += att / 4 / players[i].hp;
                                            }
                                            if (players[i].hp == 1) num += att * 1.5;
                                        }
                                        if (player.hp == 1) {
                                            return -num;
                                        }
                                        if (player.hp == 2) {
                                            return -game.players.length / 4 - num;
                                        }
                                        return -game.players.length / 3 - num;
                                    },
                                },
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_jinglve2: {
                            mark: true,
                            intro: {
                                name: '死士',
                                mark(dialog, content, player) {
                                    dialog.addText('记录目标');
                                    dialog.add([content]);
                                    if (player == game.me || player.isUnderControl()) {
                                        dialog.addText('死士牌');
                                        dialog.add([player.storage.jinglve3]);
                                    }
                                },
                            },
                            onremove(player) {
                                delete player.storage.jinglve2;
                                delete player.storage.jinglve3;
                            },
                            trigger: {
                                global: ['dieEnd', 'loseEnd', 'gainEnd'],
                            },
                            silent: true,
                            lastDo: true,
                            charlotte: true,
                            filter(event, player) {
                                if (event.name != 'gain' && event.player != player.storage.jinglve2) return false;
                                return event.name == 'die' || (event.cards.includes(player.storage.jinglve3) && (event.name == 'gain' || (event.position != ui.ordering && event.position != ui.discardPile)));
                            },
                            content() {
                                player.removeSkill('jinglve2');
                            },
                            group: 'jinglve3',
                            forced: true,
                        },
                        ty_jinglve3: {
                            audio: 'jinglve',
                            trigger: {
                                global: ['loseAfter', 'useCard', 'phaseAfter', 'cardsDiscardAfter'],
                            },
                            filter(event, player) {
                                if (event.player && event.player != player.storage.ty_jinglve2) return false;
                                if (event.name == 'phase') return event.player.getCards('hej').includes(player.storage.ty_jinglve3);
                                if (!event.cards.includes(player.storage.ty_jinglve3)) return false;
                                return event.name == 'useCard' || get.position(player.storage.ty_jinglve3, true) == 'd' || event.position == ui.discardPile;
                            },
                            forced: true,
                            charlotte: true,
                            logTarget: 'player',
                            content() {
                                if (trigger.name == 'useCard') {
                                    trigger.all_excluded = true;
                                    trigger.targets.length = 0;
                                } else {
                                    if (trigger.name == 'phase') {
                                        player.gain(player.storage.ty_jinglve3, trigger.player, 'giveAuto');
                                    } else if (get.position(player.storage.ty_jinglve3, true) == 'd') player.gain(player.storage.ty_jinglve3, 'gain2');
                                }
                                player.removeSkill('ty_jinglve2');
                            },
                        },
                        ty_sanluan: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            limited: true,
                            animationColour: 'legend',
                            derivation: 'ty_luanwu',
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return (
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_mingding');
                                    }) >= 3
                                );
                            },
                            content() {
                                player.awakenSkill('ty_sanluan');
                                player.addSkill('ty_luanwu');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_xiangcao: {
                            trigger: {
                                player: 'enterGame',
                                global: 'phaseBefore',
                            },
                            filter(event, player) {
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.removeSkill('ty_xiangcao');
                            },
                        },
                        ty_weimu: {
                            trigger: {
                                global: 'useCard1',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            firstDo: true,
                            filter(event, player, card) {
                                if (get.color(event.card) != 'black') return false;
                                return (event.card.name == 'nanman' && player != event.player) || (event.card.name == 'wanjian' && player != event.player) || (event.card.name == 'taoyuan' && player.hp < player.maxHp) || event.card.name == 'wugu';
                            },
                            content() { },
                            mod: {
                                targetEnabled(card) {
                                    if ((get.type(card) == 'trick' || get.type(card) == 'delay') && get.color(card) == 'black') return false;
                                },
                            },
                        },
                        ty_congjian: {
                            audio: 'ext:汤圆神将包/audio:true',
                            audioname2: {
                                tongyuan: 'ocongjian_tongyuan',
                            },
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.type(event.card) == 'sha' || (get.type(event.card) == 'trick' && event.targets.length > 1 && player.countCards('he') > 0);
                            },
                            content() {
                                'step 0';
                                player.chooseCardTarget({
                                    filterCard: true,
                                    selectCard: 1,
                                    position: 'he',
                                    filterTarget(card, player, target) {
                                        return player != target && _status.event.targets.includes(target);
                                    },
                                    ai1(card) {
                                        if (card.name == 'du') return 20;
                                        if (_status.event.player.storage.drlt_xiongluan && get.type(card) == 'equip') return 15;
                                        return 6 - get.value(card);
                                    },
                                    ai2(target) {
                                        var att = get.attitude(_status.event.player, target);
                                        if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') {
                                            if (target.hasSkillTag('nodu')) return 0.1;
                                            return 1 - att;
                                        }
                                        return att - 3;
                                    },
                                    prompt: get.prompt2('ty_congjian'),
                                    targets: trigger.targets,
                                });
                                ('step 1');
                                if (result.targets?.length) {
                                    event.target = result.targets[0];
                                    player.line(event.target);
                                    event.target.gain(result.cards[0], player, 'give');
                                    var num = 1;
                                    if (get.type(result.cards[0]) == 'basic') num = 2;
                                    if (get.type(result.cards[0]) == 'equip') player.chooseToEnable();
                                    if (get.type(result.cards[0]) == 'trick') player.recover();
                                    player.draw(num);
                                }
                            },
                        },
                        ty_xiaoxiong: {
                            trigger: {
                                global: ['dyingAfter', 'roundStart'],
                                player: 'changeHp',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            group: ['ty_xiangcao', 'ty_chengru'],
                            filter(event, player) {
                                return player.countDisabled() > 0;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.chooseToEnable();
                            },
                        },
                        ty_chengru: {
                            trigger: {
                                player: 'enableEquipAfter',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                if (player.countDisabled() == 1) {
                                    var card = get.cardPile2(function (card) {
                                        return ['sha'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                                if (player.countDisabled() == 2) {
                                    player.addTempSkill('ty_weimu', { player: 'phaseBegin' });
                                }
                                if (player.countDisabled() == 3) {
                                    var card = get.cardPile2(function (card) {
                                        return ['jiu'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                                if (player.countDisabled() == 4) {
                                    var card = get.cardPile2(function (card) {
                                        return ['tao'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                                if (player.countDisabled() < 1) {
                                    var card = get.cardPile2(function (card) {
                                        return ['juedou'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                            },
                        },
                        ty_xiongluan: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            mark: true,
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.disableJudge();
                                player.addTempSkill('drlt_xiongluan_effect');
                                player.storage.drlt_xiongluan_effect = [target];
                                target.addSkill('drlt_xiongluan_ban');
                                target.markSkillCharacter('drlt_xiongluan_effect', player, '雄乱', '无法使用或打出任何手牌');
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target(player, target) {
                                        if (target.getEquip('bagua') || target.getEquip('rewrite_bagua')) return 0;
                                        var hs = player.countCards('h', function (card) {
                                            return ['sha', 'juedou'].includes(card.name) && get.effect(target, card, player, player) != 0;
                                        });
                                        var ts = target.hp;
                                        if (hs >= ts && ts > 1) return -1;
                                        return 0;
                                    },
                                },
                            },
                            intro: {
                                content: '曹贼,你欺人太甚!!!',
                            },
                        },
                        武器: {
                            mark: true,
                            content: '复了武器栏',
                        },
                        防具: {
                            mark: true,
                            content: '复了防具栏',
                        },
                        进攻马: {
                            mark: true,
                            content: '复了进攻马栏',
                        },
                        防御马: {
                            mark: true,
                            content: '复了防御马栏',
                        },
                        宝物: {
                            mark: true,
                            content: '复了宝物栏',
                        },
                        ty_huo: {
                            trigger: {
                                player: 'dyingAfter',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            content() {
                                player.removeSkill('ty_huo');
                            },
                            mark: true,
                            intro: {
                                content: '生不如死,求死不得',
                            },
                            ai: {
                                neg: true,
                            },
                        },
                        ty_huo1: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            content() {
                                player.addMark('ty_xionghuo', 1);
                            },
                        },
                        ty_huoshang: {
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.player.hasSkill('ty_huo');
                            },
                            content() {
                                trigger.num++;
                            },
                        },
                        ty_shajue: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'dying',
                            },
                            filter(event, player) {
                                return event.player.hp <= 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw();
                                player.addMark('ty_xionghuo', 1);
                                if (trigger.parent.name == 'damage' && get.itemtype(trigger.parent.cards) == 'cards' && get.position(trigger.parent.cards[0], true) == 'o' && trigger.player.hp < 0 && trigger.player != player) {
                                    player.gain(trigger.parent.cards, 'gain2');
                                    player.recover(1 - player.hp);
                                    player.recover();
                                }
                                if (trigger.player == player && player.hp < 0) {
                                    player.recover(1 - player.hp);
                                    player.recover();
                                }
                            },
                        },
                        ty_shangxian1: {
                            mod: {
                                maxHandcardBase(player, num) {
                                    return 1;
                                },
                            },
                            mark: true,
                            intro: {
                                content: '这就丢盔弃甲了？就这么点胆子？',
                            },
                        },
                        ty_buchusha: {
                            mod: {
                                cardEnabled(card, player) {
                                    if (card.name == 'sha' || card.name == 'juedou' || card.name == 'huogong' || card.name == 'nanman' || card.name == 'wanjian') return false;
                                },
                            },
                            mark: true,
                            intro: {
                                content: '有这么痛苦么,拿不起刀的懦夫',
                            },
                        },
                        ty_xionghuo1: {
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseBegin',
                            },
                            filter(event, player) {
                                return event.player.hasSkill('ty_huo') && event.player != player;
                            },
                            content() {
                                'step 0';
                                var list = [1, 2, 3];
                                var num = list.randomGet();
                                event.goto(num);
                                ('step 1');
                                player.line(trigger.player, 'fire');
                                trigger.player.damage('fire');
                                trigger.player.addTempSkill('ty_buchusha', 'phaseAfter');
                                event.goto(4);
                                ('step 2');
                                player.line(trigger.player, 'water');
                                trigger.player.loseHp();
                                player.recover();
                                trigger.player.addTempSkill('ty_shangxian1', 'phaseAfter');
                                event.goto(4);
                                ('step 3');
                                player.line(trigger.player, 'green');
                                trigger.player.skip('phaseDraw');
                                var card1 = trigger.player.getCards('h').randomGet();
                                var card2 = trigger.player.getCards('e').randomGet();
                                var list = [];
                                if (card1) list.push(card1);
                                if (card2) list.push(card2);
                                if (list.length) {
                                    player.gain(list, trigger.player, 'giveAuto', 'bySelf');
                                }
                                ('step 4');
                            },
                        },
                        ty_xionghuo: {
                            enable: 'phaseUse',
                            usable: 2,
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_huoshang', 'ty_xionghuo1', 'ty_huo1'],
                            filter(event, player) {
                                return player.countMark('ty_xionghuo') > 0;
                            },
                            filterTarget(card, player, target) {
                                if (target.hasSkill('ty_huo')) return false;
                                return player != target > 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            content() {
                                player.removeMark('ty_xionghuo', 1);
                                target.addSkill('ty_huo');
                            },
                            ai: {
                                order: 11,
                                result: {
                                    target(player, target) {
                                        if (
                                            (player.countMark('ty_xionghuo') >= 2 ||
                                                !game.hasPlayer(function (current) {
                                                    return current != player && get.attitude(player, current) < 0 && current.hasMark('ty_xionghuo');
                                                })) &&
                                            player.countCards('h', function (card) {
                                                return (
                                                    get.tag(card, 'damage') &&
                                                    player.canUse(card, target, null, true) &&
                                                    player.getUseValue(card) > 0 &&
                                                    get.effect_use(target, card, player) > 0 &&
                                                    target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                    })
                                                );
                                            })
                                        )
                                            return 3 / Math.max(1, target.hp);
                                        if (
                                            (!player.hasUnknown() &&
                                                game.countPlayer(function (current) {
                                                    return get.attitude(player, current) < 0;
                                                }) <= 1) ||
                                            player.countMark('ty_xionghuo') >= 2
                                        ) {
                                            return -1;
                                        }
                                        return 0;
                                    },
                                },
                                effect: {
                                    player(card, player, target) {
                                        if (
                                            player != target &&
                                            get.tag(card, 'damage') &&
                                            target &&
                                            target.hasMark('ty_xionghuo') &&
                                            !target.hasSkillTag('filterDamage', null, {
                                                player: player,
                                                card: card,
                                            })
                                        )
                                            return [1, 0, 1, -2];
                                    },
                                },
                                threaten: 1.6,
                            },
                        },
                        ty_zhiheng: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filterCard(card, player, event) {
                                event = event || _status.event;
                                if (typeof event != 'string') event = event.parent.name;
                                var mod = game.checkMod(card, player, event, 'unchanged', 'cardDiscardable', player);
                                if (mod != 'unchanged') return mod;
                                return true;
                            },
                            discard: false,
                            lose: false,
                            delay: false,
                            selectCard: [1, Infinity],
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    get.position(card) == 'h' &&
                                    !player.countCards('h', 'du') &&
                                    (player.hp > 2 ||
                                        !player.countCards('h', function (card) {
                                            return get.value(card) >= 8;
                                        }))
                                ) {
                                    return 1;
                                }
                                return 6 - get.value(card);
                            },
                            content() {
                                'step 0';
                                player.discard(cards);
                                event.num = 1;
                                var hs = player.getCards('h');
                                if (!hs.length) event.num = 0;
                                for (var i = 0; i < hs.length; i++) {
                                    if (!cards.includes(hs[i])) {
                                        event.num = 0;
                                        break;
                                    }
                                }
                                ('step 1');
                                player.draw(event.num + cards.length);
                                ('step 2');
                                var hs = player.getCards('h');
                                var list = [];
                                for (var i of hs) {
                                    list.add(get.type2(i, player));
                                    if (list.length >= 3) break;
                                }
                                if (list.length >= 1) {
                                    var card = get.cardPile2(function (card) {
                                        return ['tao', 'jiu', 'sha', 'shan'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                                if (list.length >= 3) {
                                    var card = get.cardPile(function (card) {
                                        return ['zhuge', 'lebu', 'tao'].includes(card.name);
                                    });
                                    player.gain(card, 'gain2');
                                }
                            },
                        },
                        ty_quanshu: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            group: ['ty_quanshu1', 'ty_quanshu2', 'ty_quanshu3', 'ty_quanshu4', 'ty_quanshu5', 'ty_quanshu6', 'ty_quanshu7', 'ty_quanshu8'],
                            _priority: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') <= 1;
                            },
                            forced: true,
                            content() {
                                //QQQ
                                'step 0';
                                player.chooseTarget().set('ai', function (target) {
                                    return -get.attitude(player, target);
                                });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage(1, 'thunder');
                                }
                            },
                            ai: {
                                result: {
                                    player: -2,
                                    target(player, target) {
                                        return -2;
                                    },
                                },
                            },
                        },
                        ty_quanshu1: {
                            mark: true,
                            marktext: '权衡',
                            intro: {
                                content: '乱世权衡,此起彼伏',
                            },
                            trigger: {
                                global: ['damageEnd', 'loseHpEnd'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            init(player) {
                                player.storage.ty_quanshu1 = [];
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.addMark('ty_quanshu1', trigger.num);
                            },
                        },
                        ty_quanshu2: {
                            trigger: {
                                global: 'recoverEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.removeMark('ty_quanshu1', trigger.num);
                            },
                        },
                        ty_quanshu3: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') == 2;
                            },
                            _priority: 2,
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                            },
                        },
                        ty_quanshu4: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') == 3;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 3,
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.chooseToDiscard(1, 'he', true);
                            },
                        },
                        ty_quanshu5: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            _priority: 4,
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') == 4;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                            },
                        },
                        ty_quanshu6: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            _priority: 5,
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') == 5;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.chooseToDiscard(1, 'he', true);
                            },
                        },
                        ty_quanshu7: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') > 5 && player.countMark('ty_quanshu1') < 10;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 6,
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget().set('ai', function (target) {
                                    return get.attitude(player, target);
                                });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].recover();
                                }
                                player.removeMark('ty_quanshu1', player.countMark('ty_quanshu1') - 5);
                            },
                            ai: {
                                result: {
                                    target(player, target) {
                                        return 1.5;
                                    },
                                    player: 1,
                                },
                            },
                        },
                        ty_quanshu8: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 7,
                            filter(event, player) {
                                return player.countMark('ty_quanshu1') >= 10;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.removeMark('ty_quanshu1', player.countMark('ty_quanshu1'));
                                ('step 1');
                                player.phase('nodelay');
                            },
                        },
                        ty_elue: {
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.player.hp < player.hp;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            async content(event, trigger, player) {
                                //QQQ
                                if (trigger.player.hasSkill('ty_caijing')) {
                                    trigger.num++;
                                    trigger.player.removeSkill('ty_caijing');
                                } else {
                                    player.gainPlayerCard(trigger.player, player.hp - trigger.player.hp, 'he', true);
                                    trigger.player.addSkill('ty_caijing');
                                }
                            },
                            ai: {
                                expose: 0.7,
                                threaten: 2,
                            },
                        },
                        ty_caijing: {
                            mark: true,
                            marktext: '财尽',
                            intro: {
                                content: '人财两空,知道下一个要夺走你的什么了么？哈哈哈哈哈哈哈哈哈!',
                            },
                            forced: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            content() { },
                        },
                        ty_lingruo: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            usable: 2,
                            logTarget: 'player',
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (
                                    !player.hasSha() &&
                                    player.hasUsableCard(function (card) {
                                        return get.tag(card, 'damage');
                                    })
                                )
                                    return false;
                                return event.player != player && event.num >= 2;
                            },
                            content() {
                                'step 0';
                                event.target = trigger.player;
                                ('step 1');
                                player.draw(trigger.num);
                                player
                                    .chooseToUse('凌弱:是否对' + get.translation(event.target) + '使用一张带有【伤害】标签的牌？', function (card, player, event) {
                                        if (!get.tag(card, 'damage')) return false;
                                        return lib.filter.cardEnabled.apply(this, arguments);
                                    })
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', event.target)
                                    .set('addCount', false);
                            },
                        },
                        ty_miegang: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            juexingji: true,
                            animationcolour: 'legend',
                            forced: true,
                            limited: true,
                            derivation: ['ty_xingluan', 'ty_tanbei'],
                            group: ['ty_miegang1'],
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.maxHp > game.players.length;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.recover();
                                player.addSkill('ty_xingluan');
                                player.addSkill('ty_tanbei');
                                player.awakenSkill('ty_miegang');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_xingluan: {
                            trigger: {
                                global: 'dyingAfter',
                                player: 'phaseUseBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            content() {
                                'step 0';
                                var list = [];
                                for (var i = 0; i < lib.inpile.length; i++) {
                                    if (lib.filter.filterCard({ name: lib.inpile[i] }, player)) {
                                        var info = lib.card[lib.inpile[i]];
                                        if (info.type == 'trick' && !info.multitarget && !info.notarget) {
                                            if (Array.isArray(info.selectTarget)) {
                                                if (info.selectTarget[0] > 0 && info.selectTarget[1] >= info.selectTarget[0]) {
                                                    list.push(lib.inpile[i]);
                                                }
                                            } else if (typeof info.selectTarget == 'number') {
                                                list.push(lib.inpile[i]);
                                            }
                                        }
                                    }
                                }
                                while (list.length) {
                                    var card = { name: list.randomRemove() };
                                    var info = get.info(card);
                                    var targets = game.filterPlayer(function (current) {
                                        return lib.filter.filterTarget(card, player, current);
                                    });
                                    if (targets.length) {
                                        targets.sort(lib.sort.seat);
                                        if (info.selectTarget != -1) {
                                            var num = info.selectTarget;
                                            if (Array.isArray(num)) {
                                                if (targets.length < num[0]) continue;
                                                num = num[0] + Math.floor(Math.random() * (num[1] - num[0] + 1));
                                            } else {
                                                if (targets.length < num) continue;
                                            }
                                            targets = targets.randomGets(num);
                                        }
                                        player.useCard(card, targets, 'noai');
                                        if (targets.length == 1) {
                                            event.cardname = card.name;
                                        }
                                        break;
                                    }
                                }
                                ('step 1');
                                if (player.countCards('h') && event.cardname) {
                                    player.chooseToDiscard('是否弃置一张手牌并获得' + get.translation(event.cardname) + '？', 'h').ai = function (card) {
                                        return get.value({ name: event.cardname }) - get.value(card);
                                    };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.cards?.length) {
                                    var card = result.cards[0];
                                    var fakecard = game.createCard(event.cardname, card.suit, card.number);
                                    player.gain(fakecard, 'gain2', 'log');
                                }
                            },
                        },
                        ty_tanbei: {
                            trigger: {
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.player != player;
                            },
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.maxHp < 8 && player.hp == player.maxHp) {
                                    player.gainMaxHp();
                                } else {
                                    player.recover();
                                }
                                player.draw();
                            },
                        },
                        ty_miegang1: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:ty_miegang',
                            forced: true,
                            _priority: 5,
                            async content(event, trigger, player) {
                                //QQQ
                                player.gainMaxHp();
                                player.draw(1, game.players.length - player.maxHp);
                            },
                        },
                        ty_TLL_fangju: {
                            trigger: {
                                player: 'equipBegin',
                            },
                            forced: true,
                            silent: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return get.subtype(event.card) == 'equip2';
                            },
                            async content(event, trigger, player) {
                                trigger.cancel();
                                const card = trigger.cards[0];
                                if (card) {
                                    const vcard = new lib.element.VCard(card);
                                    const cardSymbol = Symbol('card');
                                    card.cardSymbol = cardSymbol;
                                    card[cardSymbol] = vcard;
                                    player.vcardsMap?.equips.push(vcard);
                                    player.node.equips.appendChild(card);
                                    card.style.transform = '';
                                    card.node.name2.innerHTML = `${get.translation(card.suit)}${card.number} ${get.translation(card.name)}`;
                                }
                                const info = get.info(card, false);
                                if (info.skills) {
                                    for (const i of info.skills) {
                                        player.addSkillTrigger(i);
                                    }
                                }
                                const cards = player.getCards('e', { subtype: get.subtype(card) });//没有trigger.card
                                const num = cards.length - 4;
                                if (num > 0) {
                                    const { links } = await player.chooseButton(['选择弃置', cards], num, true).forResult();
                                    if (links.length) {
                                        player.discard(links);
                                    }
                                }
                            },
                        },
                        ty_TLL_wuqi: {
                            trigger: {
                                player: 'equipBegin',
                            },
                            forced: true,
                            silent: true,
                            filter(event, player) {
                                return get.subtype(event.card) == 'equip1';
                            },
                            async content(event, trigger, player) {
                                trigger.cancel();
                                const card = trigger.cards[0];
                                if (card) {
                                    const vcard = new lib.element.VCard(card);
                                    const cardSymbol = Symbol('card');
                                    card.cardSymbol = cardSymbol;
                                    card[cardSymbol] = vcard;
                                    player.vcardsMap?.equips.push(vcard);
                                    player.node.equips.appendChild(card);
                                    card.style.transform = '';
                                    card.node.name2.innerHTML = `${get.translation(card.suit)}${card.number} ${get.translation(card.name)}`;
                                }
                                const info = get.info(card, false);
                                if (info.skills) {
                                    for (const i of info.skills) {
                                        player.addSkillTrigger(i);
                                    }
                                }
                                const cards = player.getCards('e', { subtype: get.subtype(card) });//没有trigger.card
                                const num = cards.length - 4;
                                if (num > 0) {
                                    const { links } = await player.chooseButton(['选择弃置', cards], num, true).forResult();
                                    if (links.length) {
                                        player.discard(links);
                                    }
                                }
                            },
                        },
                        ty_pocheng: {
                            audio: 'xinfu_xingluan',
                            usable: 1,
                            trigger: {
                                player: 'useCardAfter',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var list = ['观看牌堆中三张点数为6的牌并获得其中一张'];
                                event.addIndex = 1;
                                var bool2 = false,
                                    bool3 = game.hasPlayer(function (current) {
                                        if (current != player && current.countCards('he') > 0) bool2 = true;
                                        return current.hasCard(function (card) {
                                            return card.number == 6 && lib.filter.canBeGained(card, current, player);
                                        }, 'ej');
                                    });
                                if (bool2) {
                                    event.addIndex = 0;
                                    list.push('令一名其他角色弃置一张点数为6的牌或交给你一张牌');
                                }
                                if (bool3) list.push('获得场上一张点数为6的牌');
                                player
                                    .chooseControl('cancel2')
                                    .set('choiceList', list)
                                    .set('prompt', get.prompt('xinxingluan'))
                                    .set('ai', function () {
                                        var player = _status.event.player;
                                        if (
                                            game.hasPlayer(function (current) {
                                                if (current == player) return false;
                                                var att = -get.sgn(get.attitude(player, current) - 0.1);
                                                return current.hasCard(function (card) {
                                                    return card.number == 6 && lib.filter.canBeGained(card, current, player) && get.sgn(get.useful(card, current)) == att;
                                                }, 'ej');
                                            })
                                        )
                                            return 2 - _status.event.parent.addIndex;
                                        if (
                                            game.hasPlayer(function (target) {
                                                if (target == player) return false;
                                                var att = get.attitude(player, target);
                                                return (
                                                    att < 0 &&
                                                    target.countCards('he') > 0 &&
                                                    !target.hasCard(function (card) {
                                                        return get.value(card, target) <= 0;
                                                    }, 'he')
                                                );
                                            })
                                        )
                                            return 1;
                                        return 0;
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    if (result.index == 0) {
                                    } else if (result.index + event.addIndex == 1) event.goto(6);
                                    else event.goto(4);
                                } else event.finish();
                                ('step 2');
                                var cards = [];
                                while (cards.length < 3) {
                                    var card = get.cardPile(function (card) {
                                        return !cards.includes(card) && card.number == 6;
                                    });
                                    if (!card) break;
                                    cards.push(card);
                                }
                                if (!cards.length) {
                                    player.draw();
                                    event.finish();
                                } else if (cards.length == 1) {
                                    event._result = { bool: true, links: cards };
                                } else
                                    player.chooseButton(['兴乱:选择获得其中一张', cards], true).set('ai', function (button) {
                                        return get.value(button.link, _status.event.player);
                                    });
                                ('step 3');
                                if (result.bool) {
                                    player.gain(result.links, 'gain2');
                                }
                                event.finish();
                                ('step 4');
                                player
                                    .chooseTarget('获得一名角色装备区或判定区内点数为6的牌', true, function (card, player, current) {
                                        return current.hasCard(function (card) {
                                            return card.number == 6 && lib.filter.canBeGained(card, current, player);
                                        }, 'ej');
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player,
                                            att = -get.sgn(get.attitude(player, target) - 0.1),
                                            max = 0,
                                            ej = target.getCards('ej', function (card) {
                                                return card.number == 6 && lib.filter.canBeGained(card, target, player);
                                            });
                                        for (var i of ej) {
                                            var num = get.useful(i, target) * att;
                                            if (num > max) max = num;
                                            return max;
                                        }
                                    });
                                ('step 5');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    player.gainPlayerCard(target, 'ej', true).set('filterButton', function (button) {
                                        return button.link.number == 6;
                                    });
                                }
                                event.finish();
                                ('step 6');
                                player
                                    .chooseTarget('令一名其他角色弃置一张点数为6的牌,否则交给你一张牌', true, function (card, player, current) {
                                        return current != player && current.countCards('he') > 0;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player,
                                            att = get.attitude(player, target);
                                        if (att >= 0) return 0;
                                        if (
                                            !target.hasCard(function (card) {
                                                return get.value(card, target) <= 0;
                                            }, 'he')
                                        )
                                            return -att / Math.sqrt(target.countCards('he'));
                                        return 0;
                                    });
                                ('step 7');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    event.target = target;
                                    target.chooseToDiscard('he', '弃置一张点数为6的牌,否则交给' + get.translation(player) + '一张牌', function (card) {
                                        return card.number == 6;
                                    }).ai = (card) => 8 - get.value(card);
                                }
                                ('step 8');
                                if (!result.bool) {
                                    target.chooseCard('he', true, '交给' + get.translation(player) + '一张牌');
                                } else event.finish();
                                ('step 9');
                                if (result.bool) player.gain(result.cards, target, 'giveAuto');
                            },
                        },
                        ty_xiangu: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.name != 'phase' || game.phaseNumber == 0;
                            },
                            logTarget(event, player) {
                                return game.filterPlayer((current) => current != player && !current.hasSkill('cheng'));
                            },
                            content() {
                                var list = game.filterPlayer((current) => current != player && !current.hasSkill('cheng')).sortBySeat();
                                for (var i of list) i.addSkill('cheng');
                            },
                        },
                        cheng: {
                            mark: true,
                            marktext: '城',
                            markCount: 2,
                            group: 'cheng1',
                            audio: 'ext:汤圆神将包/audio:true',
                            intro: {
                                content: '破此城墙,才能进去大肆掠夺!',
                            },
                            forced: true,
                            trigger: {
                                player: 'loseAfter',
                            },
                            filter(event, player) {
                                return event.type == 'equip' && event.player == player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countMark('cheng') > 1) player.removeMark('cheng', 1);
                                else {
                                    player.removeMark('cheng');
                                    player.removeSkill('cheng');
                                }
                            },
                        },
                        cheng1: {
                            trigger: {
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.num > 0;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countMark('cheng') > trigger.num) {
                                    player.removeMark('cheng', trigger.num);
                                } else {
                                    player.removeMark('cheng');
                                    player.removeSkill('cheng');
                                }
                            },
                        },
                        ty_poxian: {
                            trigger: {
                                source: 'damageBegin1',
                            },
                            usable: 2,
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_TLL_fangju', 'ty_TLL_wuqi'],
                            filter(event, player) {
                                return player.countCards('e') >= event.player.countCards('e') && event.player != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (trigger.player.countCards('e') >= 1) {
                                    player.gainPlayerCard(trigger.player, 2, 'e', true);
                                } else {
                                    player.gainPlayerCard(trigger.player, player.countCards('e'), 'h', true);
                                }
                            },
                        },
                        ty_pojian: {
                            trigger: {
                                global: 'equipAfter',
                            },
                            usable: 1,
                            logTarget: 'player',
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (
                                    !player.hasSha() &&
                                    player.hasUsableCard(function (card) {
                                        return get.tag(card, 'damage');
                                    })
                                )
                                    return false;
                                return event.player.countCards('e') <= player.countCards('e') && event.player != player;
                            },
                            content() {
                                'step 0';
                                event.target = trigger.player;
                                ('step 1');
                                player.draw();
                                player
                                    .chooseToUse('破坚:是否对' + get.translation(event.target) + '使用一张带有【伤害】标签的牌？', function (card, player, event) {
                                        if (!get.tag(card, 'damage')) return false;
                                        return lib.filter.cardEnabled.apply(this, arguments);
                                    })
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', event.target)
                                    .set('addCount', false);
                            },
                        },
                        ty_chengpo: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            group: 'ty_xiangu',
                            juexingji: true,
                            limited: true,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            derivation: 'ty_xiongju',
                            filter(event, player) {
                                return !game.hasPlayer(function (current) {
                                    return current.hasSkill('cheng');
                                });
                            },
                            content() {
                                player.gainMaxHp(2);
                                player.recover(2);
                                player.draw(2);
                                player.awakenSkill('ty_chengpo');
                                player.addSkill('ty_xiongju');
                                player.addSkill('ty_xingluan');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_fencheng: {
                            mark: true,
                            marktext: '焚',
                            intro: {
                                content: '城破家亡,粮贵万钱,人人相食,乱世跌宕(回合开始以及受到伤害时标记数会翻倍,牌离开你的区域时会获得等量标记,回复体力以及装备装备时减少3倍的标记,标记一旦高于10就是你的死期了.)',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: ['phaseBegin', 'damageEnd'],
                            },
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_fencheng', player.countMark('ty_fencheng'));
                            },
                            ai: {
                                neg: true,
                            },
                            group: ['ty_fencheng1', 'ty_fencheng2', 'ty_fencheng3', 'ty_fencheng4'],
                        },
                        ty_fenshang: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_fencheng') && event.player != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (trigger.player.countMark('ty_fencheng') >= 10 && trigger.player.countMark('ty_fencheng') < 20) {
                                    trigger.player.damage(1, 'fire');
                                    player.draw();
                                    trigger.player.removeMark('ty_fencheng', trigger.player.countMark('ty_fencheng'));
                                }
                                if (trigger.player.countMark('ty_fencheng') >= 20 && trigger.player.countMark('ty_fencheng') < 30) {
                                    trigger.player.damage(2, 'fire');
                                    player.draw(2);
                                    trigger.player.removeMark('ty_fencheng', trigger.player.countMark('ty_fencheng'));
                                }
                                if (trigger.player.countMark('ty_fencheng') >= 30 && trigger.player.countMark('ty_fencheng') < 40) {
                                    trigger.player.damage(3, 'fire');
                                    player.draw(3);
                                    trigger.player.removeMark('ty_fencheng', trigger.player.countMark('ty_fencheng'));
                                }
                                if (trigger.player.countMark('ty_fencheng') >= 40) {
                                    trigger.player.damage(4, 'fire');
                                    player.draw(4);
                                    trigger.player.removeMark('ty_fencheng', trigger.player.countMark('ty_fencheng'));
                                }
                            },
                        },
                        ty_fencheng1: {
                            trigger: {
                                player: 'loseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_fencheng', event.num);
                            },
                        },
                        ty_fencheng2: {
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                trigger.num--;
                            },
                        },
                        ty_fencheng3: {
                            trigger: {
                                player: ['recoverEnd', 'equipEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hasMark('ty_fencheng');
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.removeMark('ty_fencheng', trigger.num + trigger.num + trigger.num);
                            },
                        },
                        ty_shangxian0: {
                            mod: {
                                maxHandcardBase(player, num) {
                                    return 0;
                                },
                            },
                        },
                        ty_fencheng4: {
                            trigger: {
                                player: 'phaseDiscardBefore',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return player.countMark('ty_fencheng') >= 5;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addTempSkill('ty_shangxian0', { player: 'phaseDiscardAfter' });
                            },
                        },
                        ty_xiongju: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.player != player && event.player.countMark('ty_fencheng') < 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.player.addSkill('ty_fencheng');
                            },
                            group: 'ty_fenshang',
                            ai: {
                                result: {
                                    target(player, target) {
                                        return -1;
                                    },
                                },
                            },
                        },
                        ty_jieshou: {
                            trigger: {
                                player: ['respondEnd', 'useCardEnd'],
                            },
                            forced: true,
                            group: ['ty_jieshou1', 'ty_shizheng'],
                            audio: 'ext:汤圆神将包/audio:2',
                            filter(event, player) {
                                return player.maxHp > 1 && player != _status.currentPhase;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.hp < player.maxHp) {
                                    player.loseMaxHp();
                                }
                                if (player.hp == player.maxHp && player.hp > 1) {
                                    player.loseHp();
                                    player.draw;
                                }
                            },
                        },
                        ty_zhendong: {
                            audio: 'ext:汤圆神将包/audio:2',
                            group: ['ty_zhendong1', 'ty_zhendong3', 'ty_zhendong4'],
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            content() {
                                if (trigger.player.hasSkill('ty_zhendong2')) {
                                    player.gainMaxHp(2);
                                } else {
                                    player.gainMaxHp();
                                }
                                player.recover();
                            },
                            ai: {
                                threaten: 1.5,
                            },
                        },
                        ty_zhendong1: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            filterTarget(event, target, player) {
                                return target != player;
                            },
                            filter(event, player) {
                                return game.players.length > 1 && player.isAlive();
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            content() {
                                'step 0';
                                target.addSkill('ty_zhendong2');
                            },
                            ai: {
                                order: 3,
                                expose: 0.4,
                                threaten: 1.5,
                                result: {
                                    target: -2.5,
                                    player: 4,
                                },
                            },
                        },
                        ty_zhendong3: {
                            trigger: {
                                player: ['phaseBegin', 'dieBegin'],
                            },
                            silent: true,
                            charlotte: true,
                            forced: true,
                            content() {
                                for (var i = 0; i < game.players.length; i++) {
                                    if (game.players[i].hasSkill('ty_zhendong2')) {
                                        game.players[i].removeSkill('ty_zhendong2');
                                    }
                                }
                            },
                        },
                        ty_zhendong2: {
                            charlotte: true,
                            mark: true,
                            marktext: '讨',
                            intro: {
                                content: '子元莫慌,末将公休愿为大魏讨伐逆贼',
                            },
                            ai: {
                                treaten: 10,
                            },
                        },
                        ty_zhendong4: {
                            trigger: {
                                global: ['changeHp'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_zhendong2') && event.player != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                                if (trigger.num > 0) player.loseHp();
                                else {
                                    if (player.isHealthy()) player.draw();
                                    else player.recover();
                                }
                                if (trigger.player && player.countCards('h', (card) => get.tag(card, 'damage'))) {
                                    await player
                                        .chooseToUse('镇东:是否对' + get.translation(trigger.player) + '使用一张带有【伤害】标签的牌？', (card, player, event) => get.tag(card, 'damage'))
                                        .set('filterTarget', (card, player, target) => target == trigger.player || ui.selected.targets.includes(trigger.player))
                                        .set('addCount', false);
                                }
                            },
                        },
                        ty_sanpan: {
                            audio: 'ext:汤圆神将包/audio:2',
                            derivation: ['ty_jingming', 'ty_jieshou'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.maxHp >= game.players.length && !player.storage.ty_sanpan;
                            },
                            forced: true,
                            juexingji: true,
                            content() {
                                player.draw(player.hp - 1);
                                player.loseHp(player.hp - 1);
                                player.addSkill('ty_jieshou');
                                player.addSkill('ty_jingming');
                                player.storage.ty_sanpan = true;
                                player.awakenSkill('ty_sanpan');
                            },
                        },
                        粮绝: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.nature == 'fire';
                            },
                            forced: true,
                            check() {
                                return false;
                            },
                            content() {
                                player.loseMaxHp(2);
                            },
                            intro: {
                                name2: '燃',
                                content: 'mark',
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (card.name == 'sha') {
                                            if (card.nature == 'fire' || player.hasSkill('zhuque_skill')) return 2;
                                        }
                                        if (get.tag(card, 'fireDamage') && current < 0) return 2;
                                    },
                                },
                            },
                            group: 'ranshang2',
                        },
                        ty_shizheng: {
                            trigger: {
                                global: ['loseAfter', 'cardsDiscardAfter'],
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                if (event.name == 'lose' && event.position != ui.discardPile) return false;
                                else {
                                    var evt = event.parent;
                                    if (evt.relatedEvent && evt.relatedEvent.name == 'useCard') return false;
                                }
                                return (event.cards2 && event.cards2.length ? event.cards2 : event.cards).filter((i) => ['basic', 'trick', 'equip'].includes(get.type(i))).filterInD('d').length;
                            },
                            init(player) {
                                player.storage.誓 = 0;
                            },
                            content() {
                                'step 0';
                                var num = (trigger.cards2 && trigger.cards2.length ? trigger.cards2 : trigger.cards).filter((i) => ['basic', 'trick', 'equip'].includes(get.type(i))).filterInD('d').length;
                                player.addMark('誓', num);
                                ('step 1');
                                if (player.storage.誓 >= player.maxHp) {
                                    player.storage.誓 -= player.maxHp;
                                    player.gainMaxHp();
                                } else event.finish();
                                event.redo();
                            },
                            mark: true,
                            marktext: '誓',
                            intro: {
                                content(storage, player) {
                                    return '誓:' + player.storage.誓;
                                },
                            },
                        },
                        誓: {
                            mark: true,
                            marktext: '誓',
                            intro: {
                                content(storage, player) {
                                    return '誓:' + player.storage.誓;
                                },
                            },
                        },
                        ty_tuosi: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            audio: 'ext:汤圆神将包/audio:6',
                            group: ['ty_tuosi1', 'ty_tuosi2', 'ty_tuosi3', 'ty_tuosi5'],
                            forced: true,
                            filter(event, player) {
                                return game.players.length > 1 && (event.name != 'phase' || game.phaseNumber == 0);
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget('请选择获得【嗣】的目标', true, function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        var att = get.attitude(_status.event.player, target);
                                        if (att > 0) return att + 1;
                                        if (att == 0) return Math.random();
                                        return att;
                                    }).animate = false;
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    target.addSkill('ty_si');
                                }
                            },
                        },
                        ty_tuosi1: {
                            trigger: {
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            usable: 1,
                            filter(event, player) {
                                return event.player.hasSkill('ty_si') && player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp();
                                trigger.player.recover(1 - trigger.player.hp);
                                trigger.player.draw();
                            },
                        },
                        ty_tuosi2: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.source && event.source.isIn() && event.player.hasSkill('ty_si');
                            },
                            content() {
                                'step 0';
                                event.target = trigger.source;
                                ('step 1');
                                player.draw();
                                player
                                    .chooseToUse('冲阵:是否对' + get.translation(event.target) + '使用一张带有【伤害】标签的牌？', function (card, player, event) {
                                        if (!get.tag(card, 'damage')) return false;
                                        return lib.filter.cardEnabled.apply(this, arguments);
                                    })
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', event.target)
                                    .set('addCount', false);
                            },
                        },
                        ty_tuosi3: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            usable: 1,
                            filter(event, player) {
                                return event.player.hasSkill('ty_si') && event.num >= 2 && player.maxHp > event.num;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.cancel();
                                player.loseMaxHp(trigger.num);
                                trigger.player.draw(trigger.num);
                            },
                        },
                        ty_zhenlong: {
                            mod: {
                                cardname(card, player, name) {
                                    if (card.suit == 'diamond') return 'sha';
                                    if (card.suit == 'club') return 'juedou';
                                    if (card.suit == 'heart') return 'tao';
                                },
                                cardnature(card, player) {
                                    if (card.suit == 'diamond') return 'fire';
                                },
                                targetInRange(card) {
                                    if (card.suit == 'diamond') return true;
                                },
                                cardUsable(card) {
                                    if (card.name == 'sha' && card.suit == 'diamond') return Infinity;
                                },
                            },
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card.name == 'sha' || event.card.name == 'juedou';
                            },
                            content() {
                                trigger.directHit.addArray(game.players);
                                if (trigger.addCount !== false) {
                                    trigger.addCount = false;
                                    if (player.stat[player.stat.length - 1].card.sha > 0) {
                                        player.stat[player.stat.length - 1].card.sha--;
                                    }
                                }
                            },
                            group: ['ty_jianding', 'ty_tuosi4'],
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'respondSha') && current < 0) return 0.6;
                                    },
                                },
                                directHit_ai: true,
                                skillTagFilter(player, tag, arg) {
                                    return arg.card.name == 'sha' || arg.card.name == 'juedou';
                                },
                            },
                        },
                        ty_tuosi4: {
                            trigger: {
                                player: 'phaseDrawBefore',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp();
                                player.draw();
                            },
                        },
                        ty_si: {
                            mark: true,
                            marktext: '嗣',
                            intro: {
                                content: '当年与真龙将军子龙七进七出,领先半个身位,我们俩真是太厉害辣!',
                            },
                            trigger: {
                                player: 'dieAfter',
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.removeSkill('ty_si');
                                player.removeMark('ty_si');
                            },
                        },
                        ty_tuosi5: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            usable: 1,
                            filter(event, player) {
                                return event.player.hasSkill('ty_si') && player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp();
                                player.phase('nodelay');
                            },
                        },
                        克危: {
                            trigger: {
                                player: 'dieAfter',
                            },
                            juexingji: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.removeSkill('ty_kewei');
                            },
                            group: ['ty_kewei1', 'ty_kewei2'],
                        },
                        ty_kewei1: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            limited: true,
                            forced: true,
                            animationColour: 'legend',
                            filter(event, player) {
                                return event.player.hasSkill('ty_si') && player.maxHp == 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                game.log(player, '成功完成使命');
                                player.removeSkill('ty_kewei');
                                player.removeSkill('ty_zhenlong');
                                player.removeSkill('ty_tuosi');
                                player.removeSkill('ty_juejing');
                                trigger.player.addSkill('ty_rende');
                                trigger.player.addSkill('ty_jijiang');
                                trigger.player.gainMaxHp();
                                trigger.player.recover();
                                trigger.player.draw(2);
                                player.gainMaxHp(4 - player.maxHp);
                                player.recover(4);
                                player.draw(2);
                                player.addSkill('ty_longhun');
                                player.addSkill('ty_yajiao');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_kewei2: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return !game.hasPlayer(function (current) {
                                    return current.hasSkill('ty_si');
                                });
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                game.log(player, '使命失败');
                                player.removeSkill('ty_kewei');
                                player.addSkill('ty_tianwang');
                                player.removeSkill('ty_tuosi');
                                player.removeSkill('ty_zhenlong');
                                player.loseMaxHp(player.maxHp - 1);
                            },
                        },
                        ty_juejing: {
                            mod: {
                                maxHandcard(player, num) {
                                    return 2 + num;
                                },
                            },
                            _priority: 9,
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: ['dying', 'dyingAfter'],
                            },
                            forced: true,
                            content() {
                                player.draw();
                            },
                        },
                        ty_longhun: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt: '将♦️️牌当做杀,♥️️牌当做桃,♣️️牌当做闪,♠️️牌当做无懈可击使用或打出',
                            viewAs(cards, player) {
                                var name = false;
                                var nature = null;
                                //根据选择的卡牌的花色 判断要转化出的卡牌是闪还是火杀还是无懈还是桃
                                switch (cards[0]?.suit) {
                                    case 'club':
                                        name = 'shan';
                                        break;
                                    case 'diamond':
                                        name = 'sha';
                                        nature = 'fire';
                                        break;
                                    case 'spade':
                                        name = 'wuxie';
                                        break;
                                    case 'heart':
                                        name = 'tao';
                                        break;
                                }
                                //返回判断结果
                                if (name) return { name: name, nature: nature };
                                return null;
                            },
                            check(card) {
                                if (ui.selected.cards.length) return 0;
                                var player = _status.event.player;
                                if (_status.event.type == 'phase') {
                                    var max = 0;
                                    var name2;
                                    var list = ['sha', 'tao'];
                                    var map = { sha: 'diamond', tao: 'heart' };
                                    for (var i = 0; i < list.length; i++) {
                                        var name = list[i];
                                        if (
                                            player.countCards('hes', function (card) {
                                                return (name != 'sha' || get.value(card) < 5) && card.suit == map[name];
                                            }) > 0 &&
                                            player.getUseValue({ name: name, nature: name == 'sha' ? 'fire' : null }) > 0
                                        ) {
                                            var temp = get.order({ name: name, nature: name == 'sha' ? 'fire' : null });
                                            if (temp > max) {
                                                max = temp;
                                                name2 = map[name];
                                            }
                                        }
                                    }
                                    if (name2 == card.suit) return name2 == 'diamond' ? 5 - get.value(card) : 20 - get.value(card);
                                    return 0;
                                }
                                return 1;
                            },
                            selectCard: [1, 2],
                            complexCard: true,
                            position: 'hes',
                            filterCard(card, player, event) {
                                //如果已经选了一张牌 那么第二张牌和第一张花色相同即可
                                if (ui.selected.cards.length) return card.suit == ui.selected.cards[0].suit;
                                event = event || _status.event;
                                //获取当前时机的卡牌选择限制
                                var filter = event._backup.filterCard;
                                //获取卡牌花色
                                var name = card.suit;
                                //如果这张牌是♣️️并且当前时机能够使用/打出闪 那么这张牌可以选择
                                if (name == 'club' && filter({ name: 'shan', cards: [card] }, player, event)) return true;
                                //如果这张牌是♦️️并且当前时机能够使用/打出火杀 那么这张牌可以选择
                                if (name == 'diamond' && filter({ name: 'sha', cards: [card], nature: 'fire' }, player, event)) return true;
                                //如果这张牌是♠️️并且当前时机能够使用/打出无懈 那么这张牌可以选择
                                if (name == 'spade' && filter({ name: 'wuxie', cards: [card] }, player, event)) return true;
                                //如果这张牌是♥️️并且当前时机能够使用/打出桃 那么这张牌可以选择
                                if (name == 'heart' && filter({ name: 'tao', cards: [card] }, player, event)) return true;
                                //上述条件都不满足 那么就不能选择这张牌
                                return false;
                            },
                            filter(event, player) {
                                //获取当前时机的卡牌选择限制
                                var filter = event.filterCard;
                                //如果当前时机能够使用/打出火杀并且角色有♦️️ 那么可以发动技能
                                if (filter({ name: 'sha', nature: 'fire' }, player, event) && player.countCards('hes', { suit: 'diamond' })) return true;
                                //如果当前时机能够使用/打出闪并且角色有♣️️ 那么可以发动技能
                                if (filter({ name: 'shan' }, player, event) && player.countCards('hes', { suit: 'club' })) return true;
                                //如果当前时机能够使用/打出桃并且角色有♥️️ 那么可以发动技能
                                if (filter({ name: 'tao' }, player, event) && player.countCards('hes', { suit: 'heart' })) return true;
                                //如果当前时机能够使用/打出无懈可击并且角色有♠️️ 那么可以发动技能
                                if (filter({ name: 'wuxie' }, player, event) && player.countCards('hes', { suit: 'spade' })) return true;
                                return false;
                            },
                            ai: {
                                respondSha: true,
                                respondShan: true,
                                skillTagFilter(player, tag) {
                                    var name;
                                    switch (tag) {
                                        case 'respondSha':
                                            name = 'diamond';
                                            break;
                                        case 'respondShan':
                                            name = 'club';
                                            break;
                                        case 'save':
                                            name = 'heart';
                                            break;
                                    }
                                    if (!player.countCards('hes', { suit: name })) return false;
                                },
                                order(item, player) {
                                    if (player && _status.event.type == 'phase') {
                                        var max = 0;
                                        var list = ['sha', 'tao'];
                                        var map = { sha: 'diamond', tao: 'heart' };
                                        for (var i = 0; i < list.length; i++) {
                                            var name = list[i];
                                            if (
                                                player.countCards('hes', function (card) {
                                                    return (name != 'sha' || get.value(card) < 5) && card.suit == map[name];
                                                }) > 0 &&
                                                player.getUseValue({ name: name, nature: name == 'sha' ? 'fire' : null }) > 0
                                            ) {
                                                var temp = get.order({ name: name, nature: name == 'sha' ? 'fire' : null });
                                                if (temp > max) max = temp;
                                            }
                                        }
                                        max /= 1.1;
                                        return max;
                                    }
                                    return 2;
                                },
                            },
                            hiddenCard(player, name) {
                                if (name == 'wuxie' && _status.connectMode && player.countCards('hs') > 0) return true;
                                if (name == 'wuxie') return player.countCards('hes', { suit: 'spade' }) > 0;
                                if (name == 'tao') return player.countCards('hes', { suit: 'heart' }) > 0;
                            },
                            group: ['ty_longhun1', 'ty_longhun2'],
                            subSkill: {
                                num: {
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        var evt = event;
                                        return ['sha', 'tao'].includes(evt.card.name) && evt.skill == 'relonghun' && evt.cards && evt.cards.length == 2;
                                    },
                                    content() {
                                        trigger.baseDamage++;
                                    },
                                },
                                discard: {
                                    trigger: {
                                        player: ['useCardAfter', 'respondAfter'],
                                    },
                                    forced: true,
                                    logTarget() {
                                        return _status.currentPhase;
                                    },
                                    autodelay(event) {
                                        return event.name == 'respond' ? 0.5 : false;
                                    },
                                    filter(evt, player) {
                                        return ['shan', 'wuxie'].includes(evt.card.name) && evt.skill == 'relonghun' && evt.cards && evt.cards.length == 2 && _status.currentPhase && _status.currentPhase != player && _status.currentPhase.countDiscardableCards(player, 'he');
                                    },
                                    content() {
                                        player.line(_status.currentPhase, 'green');
                                        player.discardPlayerCard(_status.currentPhase, 'he', true);
                                    },
                                },
                            },
                        },
                        ty_yajiao: {
                            audio: 'reyajiao',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player != _status.currentPhase && event.hs && event.hs.length && ['useCard', 'respond'].includes(event.parent.name);
                            },
                            content() {
                                'step 0';
                                event.card = get.cards()[0];
                                game.cardsGotoOrdering(event.card);
                                event.videoId = lib.status.videoId++;
                                var judgestr = get.translation(player) + '发动了【涯角】';
                                game.addVideo('judge1', player, [get.cardInfo(event.card), judgestr, event.videoId]);
                                game.broadcastAll(
                                    function (player, card, str, id, cardid) {
                                        var event;
                                        if (game.online) {
                                            event = {};
                                        } else {
                                            event = _status.event;
                                        }
                                        if (game.chess) {
                                            event.node = card.copy('thrown', 'center', ui.arena).addTempClass('start');
                                        } else {
                                            event.node = player.$throwordered(card.copy(), true);
                                        }
                                        if (lib.cardOL) lib.cardOL[cardid] = event.node;
                                        event.node.cardid = cardid;
                                        event.node.classList.add('thrownhighlight');
                                        ui.arena.classList.add('thrownhighlight');
                                        event.dialog = ui.create.dialog(str);
                                        event.dialog.classList.add('center');
                                        event.dialog.videoId = id;
                                    },
                                    player,
                                    event.card,
                                    judgestr,
                                    event.videoId,
                                    get.id()
                                );
                                game.log(player, '展示了', event.card);
                                if (get.type(event.card, 'trick') == get.type(trigger.parent.card, 'trick')) {
                                    player
                                        .chooseTarget('选择获得此牌的角色')
                                        .set('ai', function (target) {
                                            var att = get.attitude(_status.event.player, target);
                                            if (_status.event.du) {
                                                if (target.hasSkillTag('nodu')) return 0;
                                                return -att;
                                            }
                                            if (att > 0) {
                                                return att + Math.max(0, 5 - target.countCards('h'));
                                            }
                                            return att;
                                        })
                                        .set('du', event.card.name == 'du');
                                } else {
                                    event.disbool = true;
                                    player
                                        .chooseTarget('是否弃置攻击范围内包含你的一名角色区域内的一张牌？', function (card, player, target) {
                                            return target.inRange(player) && target.countDiscardableCards(player, 'hej') > 0;
                                        })
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.effect(target, { name: 'guohe' }, player, player);
                                        });
                                }
                                ('step 1');
                                if (event.disbool) {
                                    if (result.targets?.length) {
                                        player.line(result.targets[0], 'green');
                                        player.discardPlayerCard(result.targets[0], 'hej', true);
                                    }
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    ui.arena.classList.remove('thrownhighlight');
                                } else if (result.targets?.length) {
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    player.line(result.targets, 'green');
                                    result.targets[0].gain(event.card, 'log');
                                    ui.arena.classList.remove('thrownhighlight');
                                } else {
                                    event.dialog.close();
                                    game.addVideo('judge2', null, event.videoId);
                                    ui.arena.classList.remove('thrownhighlight');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'respond') && target.countCards('h') > 1) return [1, 0.2];
                                    },
                                },
                            },
                        },
                        ty_rende: {
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['gz_jun_liubei', 'shen_caopi'],
                            enable: 'phaseUse',
                            filterCard: true,
                            selectCard: [1, Infinity],
                            discard: false,
                            lose: false,
                            delay: false,
                            filterTarget(card, player, target) {
                                if (player.storage.rerende2 && player.storage.rerende2.includes(target)) return false;
                                return player != target;
                            },
                            onremove: ['rerende', 'rerende2'],
                            check(card) {
                                if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') return 0;
                                if (!ui.selected.cards.length && card.name == 'du') return 20;
                                var player = get.owner(card);
                                if (ui.selected.cards.length >= Math.max(2, player.countCards('h') - player.hp)) return 0;
                                if (player.hp == player.maxHp || player.storage.rerende < 0 || player.countCards('h') <= 1) {
                                    var players = game.filterPlayer();
                                    for (var i = 0; i < players.length; i++) {
                                        if (players[i].hasSkill('haoshi') && !players[i].isTurnedOver() && !players[i].hasJudge('lebu') && get.attitude(player, players[i]) >= 3 && get.attitude(players[i], player) >= 3) {
                                            return 11 - get.value(card);
                                        }
                                    }
                                    if (player.countCards('h') > player.hp) return 10 - get.value(card);
                                    if (player.countCards('h') > 2) return 6 - get.value(card);
                                    return -1;
                                }
                                return 10 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var evt = _status.event.getParent('phaseUse');
                                if (evt && evt.name == 'phaseUse' && !evt.rerende) {
                                    var next = game.createEvent('rerende_clear');
                                    _status.event.next.remove(next);
                                    evt.after.push(next);
                                    evt.rerende = true;
                                    next.player = player;
                                    next.setContent(lib.skill.rerende1.content);
                                }
                                if (!Array.isArray(player.storage.rerende2)) {
                                    player.storage.rerende2 = [];
                                }
                                player.storage.rerende2.push(target);
                                target.gain(cards, player, 'giveAuto');
                                if (typeof player.storage.rerende != 'number') {
                                    player.storage.rerende = 0;
                                }
                                if (player.storage.rerende >= 0) {
                                    player.storage.rerende += cards.length;
                                    if (player.storage.rerende >= 2) {
                                        var list = [];
                                        if (
                                            lib.filter.cardUsable({ name: 'sha' }, player, event.getParent('chooseToUse')) &&
                                            game.hasPlayer(function (current) {
                                                return player.canUse('sha', current);
                                            })
                                        ) {
                                            list.push(['基本', '', 'sha']);
                                        }
                                        for (var i of lib.inpile_nature) {
                                            if (
                                                lib.filter.cardUsable({ name: 'sha', nature: i }, player, event.getParent('chooseToUse')) &&
                                                game.hasPlayer(function (current) {
                                                    return player.canUse({ name: 'sha', nature: i }, current);
                                                })
                                            ) {
                                                list.push(['基本', '', 'sha', i]);
                                            }
                                        }
                                        if (
                                            lib.filter.cardUsable({ name: 'tao' }, player, event.getParent('chooseToUse')) &&
                                            game.hasPlayer(function (current) {
                                                return player.canUse('tao', current);
                                            })
                                        ) {
                                            list.push(['基本', '', 'tao']);
                                        }
                                        if (
                                            lib.filter.cardUsable({ name: 'jiu' }, player, event.getParent('chooseToUse')) &&
                                            game.hasPlayer(function (current) {
                                                return player.canUse('jiu', current);
                                            })
                                        ) {
                                            list.push(['基本', '', 'jiu']);
                                        }
                                        if (list.length) {
                                            player.chooseButton(['是否视为使用一张基本牌？', [list, 'vcard']]).set('ai', function (button) {
                                                var player = _status.event.player;
                                                var card = { name: button.link[2], nature: button.link[3] };
                                                if (card.name == 'tao') {
                                                    if (player.hp == 1 || (player.hp == 2 && !player.hasShan()) || player.needsToDiscard()) {
                                                        return 5;
                                                    }
                                                    return 1;
                                                }
                                                if (card.name == 'sha') {
                                                    if (
                                                        game.hasPlayer(function (current) {
                                                            return player.canUse(card, current) && get.effect(current, card, player, player) > 0;
                                                        })
                                                    ) {
                                                        if (card.nature == 'fire') return 2.95;
                                                        if (card.nature == 'thunder' || card.nature == 'ice') return 2.92;
                                                        return 2.9;
                                                    }
                                                    return 0;
                                                }
                                                if (card.name == 'jiu') {
                                                    return 0.5;
                                                }
                                                return 0;
                                            });
                                        } else {
                                            event.finish();
                                        }
                                        player.storage.rerende = -1;
                                    } else {
                                        event.finish();
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 1');
                                if (result && result.bool && result.links[0]) {
                                    var card = { name: result.links[0][2], nature: result.links[0][3] };
                                    player.chooseUseTarget(card, true);
                                }
                            },
                            ai: {
                                fireAttack: true,
                                order(skill, player) {
                                    if (player.hp < player.maxHp && player.storage.rerende < 2 && player.countCards('h') > 1) {
                                        return 10;
                                    }
                                    return 4;
                                },
                                result: {
                                    target(player, target) {
                                        if (target.hasSkillTag('nogain')) return 0;
                                        if (ui.selected.cards.length && ui.selected.cards[0].name == 'du') {
                                            if (target.hasSkillTag('nodu')) return 0;
                                            return -10;
                                        }
                                        if (target.hasJudge('lebu')) return 0;
                                        var nh = target.countCards('h');
                                        var np = player.countCards('h');
                                        if (player.hp == player.maxHp || player.storage.rerende < 0 || player.countCards('h') <= 1) {
                                            if (nh >= np - 1 && np <= player.hp && !target.hasSkill('haoshi')) return 0;
                                        }
                                        return Math.max(1, 5 - nh);
                                    },
                                },
                                effect: {
                                    target(card, player, target) {
                                        if (player == target && get.type(card) == 'equip') {
                                            if (player.countCards('e', { subtype: get.subtype(card) })) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return current != player && get.attitude(player, current) > 0;
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                    },
                                },
                                threaten: 0.8,
                            },
                        },
                        ty_jijiang: {
                            audio: 'jijiang1',
                            audioname: ['liushan', 're_liubei', 're_liushan', 'ol_liushan'],
                            group: ['rejijiang1', 'rejijiang3'],
                            zhuSkill: true,
                            filter(event, player) {
                                if (
                                    !player.hasZhuSkill('rejijiang') ||
                                    !game.hasPlayer(function (current) {
                                        return current != player && current.group == 'shu';
                                    })
                                )
                                    return false;
                                return !event.jijiang && (event.type != 'phase' || !player.hasSkill('jijiang3'));
                            },
                            enable: ['chooseToUse', 'chooseToRespond'],
                            viewAs: {
                                name: 'sha',
                            },
                            filterCard() {
                                return false;
                            },
                            selectCard: -1,
                            ai: {
                                order() {
                                    return get.order({ name: 'sha' }) + 0.3;
                                },
                                respondSha: true,
                                skillTagFilter(player) {
                                    if (
                                        !player.hasZhuSkill('rejijiang') ||
                                        !game.hasPlayer(function (current) {
                                            return current != player && current.group == 'shu';
                                        })
                                    )
                                        return false;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                basic: {
                                    useful: [5, 3, 1],
                                    value: [5, 3, 1],
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        var eff = (function () {
                                            if (!isLink && player.hasSkill('jiu')) {
                                                if (
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -0.5;
                                            }
                                            return -1.5;
                                        })();
                                        if (
                                            !isLink &&
                                            target.mayHaveShan() &&
                                            !player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        )
                                            return eff / 1.2;
                                        return eff;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                        },
                        ty_tianwang: {
                            mark: true,
                            marktext: '亡',
                            intro: {
                                content: '每个回合结束时失去1点体力',
                            },
                            trigger: {
                                global: 'phaseAfter',
                            },
                            forced: true,
                            content() {
                                player.loseHp();
                            },
                        },
                        ty_jianding: {
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp <= 0 && player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp();
                                player.recover(1 - player.hp);
                            },
                        },
                        ty_longhun1: {
                            trigger: {
                                player: 'useCard',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                var evt = event;
                                return ['sha', 'tao'].includes(evt.card.name) && evt.skill == 'ty_longhun' && evt.cards && evt.cards.length == 2;
                            },
                            content() {
                                trigger.baseDamage++;
                            },
                        },
                        ty_longhun2: {
                            trigger: {
                                player: ['useCardAfter', 'respondAfter'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            logTarget() {
                                return _status.currentPhase;
                            },
                            autodelay(event) {
                                return event.name == 'respond' ? 0.5 : false;
                            },
                            filter(evt, player) {
                                return ['shan', 'wuxie'].includes(evt.card.name) && evt.skill == 'ty_longhun' && evt.cards && evt.cards.length == 2 && _status.currentPhase && _status.currentPhase != player && _status.currentPhase.countDiscardableCards(player, 'he');
                            },
                            content() {
                                player.line(_status.currentPhase, 'green');
                                player.discardPlayerCard(_status.currentPhase, 'he', true);
                            },
                        },
                        ty_haozhan: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                return event.card && event.player != player && ((get.tag(event.card, 'damage') && get.type(event.card) == 'trick') || (event.card.name == 'sha' && event.card.suit == 'spade'));
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.gainMaxHp(trigger.num);
                                player.recover(trigger.num);
                            },
                        },
                        ty_hanyong: {
                            trigger: {
                                global: 'useCard',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            check(event, player) {
                                return (get.attitude(player, event.player) >= 0 && event.player.hp > 1) || (get.attitude(player, event.player) < 0 && event.player.hp <= 1) || event.player == player || event.card.name == 'nanman' || event.card.name == 'wanjian';
                            },
                            filter(event, player) {
                                return event.card && ((get.tag(event.card, 'damage') && get.type(event.card) == 'trick' && event.card.name != 'huogong') || (event.card.name == 'sha' && event.card.suit == 'spade'));
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.baseDamage++;
                                trigger.player.addMark('ty_ranshang2', 1);
                                if (trigger.player != player) {
                                    player.addMark('ty_ranshang2', 1);
                                }
                            },
                        },
                        ty_ranshang1: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                return event.player.countMark('ty_ranshang2') > 0;
                            },
                            content() {
                                'step 0';
                                if (trigger.player == player && player.countMark('ty_ranshang2') > 2 && player.countMark('ty_ranshang2') >= player.maxHp) {
                                    player.die();
                                }
                                ('step 1');
                                if (trigger.player.countMark('ty_ranshang2') == 1) {
                                    trigger.player.draw();
                                    trigger.player.loseHp();
                                    event.goto(4);
                                }
                                ('step 2');
                                if (trigger.player.countMark('ty_ranshang2') > 1) {
                                    trigger.player.draw(trigger.player.countMark('ty_ranshang2'));
                                    trigger.player.loseHp(trigger.player.countMark('ty_ranshang2'));
                                    if (trigger.player.countMark('ty_ranshang2') > 2 && trigger.player == player) {
                                        player.loseMaxHp(player.countMark('ty_ranshang2'));
                                        player.draw(2);
                                    }
                                    event.goto(3);
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                trigger.player.removeMark('ty_ranshang2', 1);
                                ('step 4');
                                event.finish();
                            },
                        },
                        ty_ranshang2: {
                            mark: true,
                            intro: {
                                name2: '燃',
                                content: 'mark',
                            },
                        },
                        ty_ranshang: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.nature == 'fire';
                            },
                            forced: true,
                            check() {
                                return false;
                            },
                            content() {
                                player.addMark('ty_ranshang2', trigger.num);
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (card.name == 'sha') {
                                            if (card.nature == 'fire' || player.hasSkill('zhuque_skill')) return 2;
                                        }
                                        if (get.tag(card, 'fireDamage') && current < 0) return 2;
                                    },
                                },
                            },
                            group: ['ty_ranshang2', 'ty_ranshang1'],
                        },
                        ty_zhanyuan: {
                            mark: true,
                            intro: {
                                content: '本姑娘赢得的决斗次数,很厉害吧~',
                            },
                            _priority: 7,
                            derivation: ['ty_mansi', 'ty_chizhan', 'ty_xieguan'],
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            group: ['ty_zhanyuanshu', 'ty_zhanyuan1', 'ty_zhanyuan2'],
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return event.num > 0 && event.card && event.card.name == 'juedou'; //QQQ
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_zhanyuan', 1);
                            },
                        },
                        ty_xizhan: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'damageEnd',
                            },
                            group: 'ty_manzu',
                            viewAs: {
                                name: 'juedou',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            filter(event, player) {
                                return event.card && event.source && event.player != player && event.num > 0 && (event.card.name == 'nanman' || event.card.name == 'wanjian') && event.player.isIn();
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                                player.useCard({ name: 'juedou' }, trigger.player);
                            },
                            ai: {
                                wuxie(target, card, player, viewer) {
                                    if (player == game.me && get.attitude(viewer, player) > 0) {
                                        return 0;
                                    }
                                },
                                basic: {
                                    order: 5,
                                    useful: 1,
                                    value: 5.5,
                                },
                                result: {
                                    target: -1.5,
                                    player(player, target, card) {
                                        if (
                                            player.hasSkillTag(
                                                'directHit_ai',
                                                true,
                                                {
                                                    target: target,
                                                    card: card,
                                                },
                                                true
                                            )
                                        ) {
                                            return 0;
                                        }
                                        if (get.damageEffect(target, player, target) > 0 && get.attitude(player, target) > 0 && get.attitude(target, player) > 0) {
                                            return 0;
                                        }
                                        var hs1 = target.getCards('h', 'sha');
                                        var hs2 = player.getCards('h', 'sha');
                                        if (hs1.length > hs2.length + 1) {
                                            return -2;
                                        }
                                        var hsx = target.getCards('h');
                                        if (hsx.length > 2 && hs2.length == 0 && hsx[0].number < 6) {
                                            return -2;
                                        }
                                        if (hsx.length > 3 && hs2.length == 0) {
                                            return -2;
                                        }
                                        if (hs1.length > hs2.length && (!hs2.length || hs1[0].number > hs2[0].number)) {
                                            return -2;
                                        }
                                        return -0.5;
                                    },
                                },
                                tag: {
                                    respond: 2,
                                    respondSha: 2,
                                    damage: 1,
                                },
                            },
                        },
                        ty_jiaoman: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            group: 'ty_jiaoman1',
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 10,
                            filter(event, player) {
                                return (
                                    event.num > 0 &&
                                    event.source &&
                                    event.source.countCards('h') > 0 &&
                                    event.player.isIn() &&
                                    game.countPlayer(function (current) {
                                        return current.countCards('h') > 0;
                                    }) >= 2
                                );
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(true, function (card, player, target) {
                                    return target.countCards('h') > 0 && target != trigger.source;
                                });
                                ('step 1');
                                event.target = result.targets[0];
                                event.target.chooseToCompare(trigger.source);
                                ('step 2');
                                var target = event.target;
                                if (result.bool) {
                                    target.gainPlayerCard(trigger.source, 1, 'he', true);
                                } else if (result.tie) {
                                    target.loseHp();
                                    trigger.source.loseHp();
                                    player.recover();
                                } else {
                                    trigger.source.gainPlayerCard(target, 1, 'he', true);
                                }
                                ('step 3');
                                var target1 = event.target;
                                if (target1.countCards('h') == trigger.source.countCards('h')) {
                                    player.recover();
                                }
                            },
                        },
                        ty_zhanyuanshu: {
                            mark: true,
                            intro: {
                                content: '哼,有点本事嘛~那本姑娘就再陪你玩会儿!',
                            },
                            _priority: 6,
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.num > 0 && event.card && event.card.name == 'juedou';
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_zhangyuanshu', 1);
                            },
                        },
                        ty_zhanyuan1: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            juexingji: true,
                            animationColour: 'legend',
                            filter(event, player) {
                                return player.countMark('ty_zhanyuan') > 2;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                game.log(player, '成功完成使命');
                                player.removeSkill('ty_zhanyuanshu');
                                player.removeSkill('ty_zhanyuan');
                                player.removeSkill('ty_zhanyuan1');
                                player.removeSkill('ty_zhanyuan2');
                                player.removeMark('ty_zhanyuanshu');
                                player.removeMark('ty_zhanyuan');
                                player.draw(2);
                                player.gainMaxHp();
                                player.recover();
                                player.addSkill('ty_mansi');
                                player.addSkill('ty_chizhan');
                            },
                        },
                        ty_zhanyuan2: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return player.countMark('ty_zhanyuanshu') > 2;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                game.log(player, '使命失败');
                                player.removeSkill('ty_zhanyuanshu');
                                player.removeSkill('ty_zhanyuan');
                                player.removeSkill('ty_zhanyuan1');
                                player.removeSkill('ty_zhanyuan2');
                                player.removeSkill('ty_xizhan');
                                player.removeMark('ty_zhanyuanshu');
                                player.removeMark('ty_zhanyuan');
                                player.addSkill('ty_suoying');
                                player.addSkill('ty_xieguan');
                                player.loseMaxHp();
                                player.recover();
                                player.draw(2);
                            },
                        },
                        ty_mansi: {
                            enable: 'phaseUse',
                            viewAs: {
                                name: 'nanman',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            usable: 1,
                            filterCard: true,
                            prompt: '将任意张手牌当做【南蛮入侵】并指定等量的角色使用',
                            selectCard() {
                                if (ui.selected.targets.length) return [ui.selected.targets.length, Math.min(ui.selected.targets.length + 1, game.players.length - 1)];
                                return [1, game.countPlayer() - 1];
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (
                                    game.countPlayer(function (current) {
                                        return current != player && player.canUse('nanman', current) && get.effect(current, { name: 'nanman' }, player, player) > 0;
                                    }) <= ui.selected.cards.length
                                )
                                    return 0;
                                return 7 - get.value(card);
                            },
                            selectTarget() {
                                return ui.selected.cards.length;
                            },
                            ai: {
                                order: 5,
                                result: {
                                    player: 1.5,
                                    target: -1.5,
                                    ignoreStatus: true,
                                    target_use(player, target) {
                                        if (player.hasUnknown(2) && get.mode() != 'guozhan') return 0;
                                        var nh = target.countCards('h');
                                        if (get.mode() == 'identity') {
                                            if (target.isZhu && nh <= 2 && target.hp <= 1) return -100;
                                        }
                                        if (nh == 0) return -2;
                                        if (nh == 1) return -1.7;
                                        return -1.5;
                                    },
                                },
                                effect: {
                                    player(card, player, target) {
                                        if (card.name == 'nanman' && get.attitude(player, target) >= 0) {
                                            return 'zeroplayertarget';
                                        }
                                    },
                                },
                                wuxie(target, card, player, viewer) {
                                    if (get.attitude(viewer, target) > 0 && target.countCards('h', 'sha')) {
                                        if (!target.countCards('h') || target.hp == 1 || Math.random() < 0.7) return 0;
                                    }
                                },
                                basic: {
                                    order: 9,
                                    useful: [5, 1],
                                    value: 5,
                                },
                                tag: {
                                    respond: 1,
                                    respondSha: 1,
                                    damage: 1,
                                    multitarget: 1,
                                    multineg: 1,
                                },
                            },
                        },
                        ty_chizhan: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.player != player && event.card && event.card.name == 'juedou' && event.num > 0;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                var card = get.cardPile2(function (card) {
                                    return ['tao', 'jiu', 'sha', 'shan', 'juedou', 'nanman', 'tengjia'].includes(card.name);
                                });
                                player.gain(card, 'gain2');
                            },
                        },
                        ty_xieguan: {
                            usable: 2,
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.player != player && event.source && get.colour(event.card) == 'red' && event.card;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                                trigger.source.draw();
                                player.useCard({ name: 'sha' }, trigger.player);
                                if (trigger.source.name == 'guansuo' || trigger.source.name2 == 'guansuo') {
                                    trigger.source.recover();
                                    player.recover();
                                }
                            },
                        },
                        ty_suoying: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'useCardToPlayered',
                                target: 'useCardToTargeted',
                            },
                            usable: 1,
                            forced: true,
                            filter(event, player, name) {
                                if (!event.targets || event.targets.length != 1 || event.player == event.target) return false;
                                if (event.card.name != 'sha' && get.type(event.card) != 'trick') return false;
                                if (name == 'useCardToPlayered') {
                                    if (!event.cards.filterInD().length) return false;
                                    var target = event.target;
                                    return (
                                        player
                                            .getHistory('useCard', function (evt) {
                                                return evt.targets && evt.targets.includes(target);
                                            })
                                            .indexOf(event.parent) > 0
                                    );
                                } else {
                                    var source = event.player;
                                    return (
                                        source
                                            .getHistory('useCard', function (evt) {
                                                return evt.targets && evt.targets.includes(player);
                                            })
                                            .indexOf(event.parent) > 0
                                    );
                                }
                            },
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard('he');
                                var prompt;
                                if (event.triggername == 'useCardToTargeted') {
                                    event.target = trigger.player;
                                    prompt = '令' + get.translation(trigger.card) + '对你无效';
                                    next.set('goon', -get.effect(player, trigger.card, trigger.player, player));
                                } else {
                                    event.target = trigger.targets[0];
                                    prompt = '弃置一张牌,并获得' + get.translation(trigger.cards.filterInD());
                                    next.set('goon', get.value(trigger.cards.filterInD()));
                                }
                                next.set('prompt', get.prompt('souying', event.target));
                                next.set('prompt2', prompt);
                                next.set('ai', function (card) {
                                    return _status.event.goon - get.value(card);
                                });
                                ('step 1');
                                if (result.bool) {
                                    if (event.triggername == 'useCardToPlayered') player.gain(trigger.cards.filterInD(), 'gain2');
                                    else trigger.excluded.add(player);
                                }
                            },
                            ai: {
                                expose: 0.25,
                            },
                        },
                        ty_manzu: {
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            audio: 'manyi',
                            filter(event, player) {
                                return event.card.name == 'nanman';
                            },
                            content() {
                                trigger.cancel();
                            },
                        },
                        借鉴业炎: {
                            forceDie: true,
                            enable: 'phaseUse',
                            audio: 'ext:汤圆神将包/audio:3',
                            filterTarget(card, player, target) {
                                var length = ui.selected.cards.length;
                                return length == 0 || length == 4;
                            },
                            filterCard(card) {
                                var suit = card.suit;
                                for (var i = 0; i < ui.selected.cards.length; i++) {
                                    if (ui.selected.cards[i].suit == suit) return false;
                                }
                                return true;
                            },
                            complexCard: true,
                            limited: true,
                            selectCard: [0, 4],
                            line: 'fire',
                            check() {
                                return -1;
                            },
                            selectTarget() {
                                if (ui.selected.cards.length == 4) return [1, 2];
                                if (ui.selected.cards.length == 0) return [1, 3];
                                game.uncheck('target');
                                return [1, 3];
                            },
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                player.awakenSkill('yeyan');
                                event.num = 0;
                                targets.sortBySeat();
                                ('step 1');
                                if (cards.length == 4) event.goto(2);
                                else {
                                    if (event.num < targets.length) {
                                        targets[event.num].damage('fire', 1, 'nocard');
                                        event.num++;
                                    }
                                    if (event.num == targets.length) event.finish();
                                    else event.redo();
                                }
                                ('step 2');
                                player.loseHp(3);
                                if (targets.length == 1) event.goto(4);
                                else {
                                    player
                                        .chooseTarget('请选择受到2点伤害的角色', true, function (card, player, target) {
                                            return _status.event.targets.includes(target);
                                        })
                                        .set('ai', function (target) {
                                            return 1;
                                        })
                                        .set('forceDie', true)
                                        .set('targets', targets);
                                }
                                ('step 3');
                                if (event.num < targets.length) {
                                    var dnum = 1;
                                    if (result.bool && result.targets && targets[event.num] == result.targets[0]) dnum = 2;
                                    targets[event.num].damage('fire', dnum, 'nocard');
                                    event.num++;
                                }
                                if (event.num == targets.length) event.finish();
                                else event.redo();
                                ('step 4');
                                player
                                    .chooseControl('2点', '3点')
                                    .set('prompt', '请选择伤害点数')
                                    .set('ai', function () {
                                        return '3点';
                                    })
                                    .set('forceDie', true);
                                ('step 5');
                                targets[0].damage('fire', result.control == '2点' ? 2 : 3, 'nocard');
                            },
                            ai: {
                                order: 1,
                                fireAttack: true,
                                result: {
                                    target(player, target) {
                                        if (target.hasSkillTag('nofire')) return 0;
                                        if (lib.config.mode == 'versus') return -1;
                                        if (player.hasUnknown()) return 0;
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        ty_jiaoman1: {
                            trigger: {
                                source: 'damageSource',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 11,
                            usable: 1,
                            filter(event, player) {
                                return (
                                    event.num > 0 &&
                                    event.source &&
                                    player.countCards('h') > 0 &&
                                    event.player.isIn() &&
                                    game.countPlayer(function (current) {
                                        return current.countCards('h') > 0;
                                    }) >= 2
                                );
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(true, function (card, player, target) {
                                    return target.countCards('h') > 0 && target != trigger.source;
                                });
                                ('step 1');
                                event.target = result.targets[0];
                                event.target.chooseToCompare(trigger.source);
                                ('step 2');
                                var target = event.target;
                                if (result.bool) {
                                    target.gainPlayerCard(trigger.source, 1, 'he', true);
                                } else if (result.tie) {
                                    target.loseHp();
                                    trigger.source.loseHp();
                                    player.recover();
                                } else {
                                    trigger.source.gainPlayerCard(target, 1, 'he', true);
                                }
                                ('step 3');
                                var target1 = event.target;
                                if (target1.countCards('h') == trigger.source.countCards('h')) {
                                    player.recover();
                                }
                            },
                        },
                        ty_zaiqi3: {
                            charlotte: true,
                        },
                        ty_zaiqi2: {
                            trigger: {
                                player: ['changeHp', 'loseMaxHpEnd', 'gianMaxHpEnd'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            usable: 2,
                            filter(event, player) {
                                return player.isIn() && player.hp == player.maxHp;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.gainMaxHp();
                            },
                        },
                        ty_zaiqi1: {
                            audio: 'ext:汤圆神将包/audio:true',
                            inherit: 'zaiqi',
                            trigger: {
                                player: 'dying',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.hp < player.maxHp && !player.hasSkill('ty_zaiqi3');
                            },
                            content() {
                                'step 0';
                                event.cards = get.cards(player.getDamagedHp() + 1);
                                game.cardsGotoOrdering(event.cards);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (i.suit == 'heart') {
                                        num++;
                                        ui.discardPile.appendChild(i);
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    player.recover(num);
                                }
                                player.addTempSkill('ty_zaiqi3', 'roundStart');
                                ('step 2');
                                if (event.cards.length) {
                                    player.gain(event.cards);
                                    player.$gain2(event.cards);
                                }
                            },
                            check(event, player) {
                                if (player.getDamagedHp() < 2) {
                                    return false;
                                } else if (player.getDamagedHp() == 2) {
                                    return player.countCards('h') >= 2;
                                }
                                return true;
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == 1) return 2;
                                    if (target.hp == 2) return 1.5;
                                    return 1;
                                },
                            },
                        },
                        ty_zaiqi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            inherit: 'zaiqi',
                            group: ['ty_zaiqi1', 'ty_zaiqi2'],
                            trigger: {
                                player: 'phaseDrawBegin1',
                            },
                            filter(event, player) {
                                return !event.numFixed && player.hp < player.maxHp;
                            },
                            check(event, player) {
                                if (player.getDamagedHp() < 2) {
                                    return false;
                                } else if (player.getDamagedHp() == 2) {
                                    return player.countCards('h') >= 2;
                                }
                                return true;
                            },
                            content() {
                                'step 0';
                                trigger.changeToZero();
                                event.cards = get.cards(player.getDamagedHp() + 1);
                                game.cardsGotoOrdering(event.cards);
                                player.showCards(event.cards);
                                ('step 1');
                                var num = 0;
                                event.cards = event.cards.filter((i) => {
                                    if (i.suit == 'heart') {
                                        num++;
                                        ui.discardPile.appendChild(i);
                                        return false;
                                    }
                                    return true;
                                });
                                if (num > 0) {
                                    player.recover(num);
                                }
                                ('step 2');
                                if (event.cards.length) {
                                    player.gain(event.cards);
                                    player.$gain2(event.cards);
                                }
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hp == 1) return 2;
                                    if (target.hp == 2) return 1.5;
                                    return 1;
                                },
                            },
                        },
                        ty_guishu: {
                            trigger: {
                                player: ['loseMaxHpEnd', 'dying'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            derivation: 'ty_zaiqi',
                            juexingji: true,
                            animationColour: 'legend',
                            forced: true,
                            mark: true,
                            filter(event, player) {
                                return player.isIn() && (player.maxHp == 1 || player.hp < 1);
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countMark('ty_qingpan') < 10) {
                                    player.gainMaxHp(4 - player.maxHp);
                                    player.recover(4 - player.hp);
                                    player.removeSkill('ty_manlue');
                                    player.awakenSkill('ty_guishu');
                                    player.addSkill('ty_zaiqi');
                                } else {
                                    player.gainMaxHp(7 - player.maxHp);
                                    player.removeMark('ty_qingpan', player.countMark('ty_qingpan'));
                                }
                            },
                        },
                        ty_qingpan: {
                            mark: true,
                            intro: {
                                content: '北入中原,肆意掠夺',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                return player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.cancel();
                                player.loseMaxHp();
                            },
                        },
                        ty_manlue: {
                            trigger: {
                                global: 'damageBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            group: ['ty_manzu', 'ty_huoshou', 'ty_qingpan', 'ty_manyong'],
                            filter(event, player) {
                                return event.source && event.card && event.card.name == 'nanman' && event.num > 0 && event.player != player && event.source == player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (trigger.player.countCards('h') > 0) {
                                    trigger.cancel();
                                    player.gainPlayerCard(trigger.player, 1, 'he', true);
                                } else {
                                    player.addMark('ty_qingpan', 1);
                                }
                            },
                        },
                        ty_huoshou: {
                            trigger: {
                                global: 'dyingAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            usable: 1,
                            forced: true,
                            filter(event, player) {
                                return event.player != player && player.isIn() && player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.loseMaxHp();
                                player.draw();
                            },
                        },
                        ty_manyong: {
                            trigger: {
                                player: 'loseMaxHpEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 9,
                            forced: true,
                            filter(event, player) {
                                return player.isIn();
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                player.line(event.targets, 'green');
                                player.useCard({ name: 'nanman' }, event.targets);
                            },
                        },
                        ty_manshe: {
                            trigger: {
                                player: 'damageAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: 'ty_manzu',
                            forced: true,
                            _priority: 11,
                            filter(event, player) {
                                return event.num > 0 && event.source;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                                player.useCard({ name: 'juedou' }, trigger.source);
                            },
                        },
                        ty_lieren: {
                            mark: true,
                            intro: {
                                content: '战火所至,寸草不生',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_lieren1', 'ty_lieren2', 'ty_lieren3', 'ty_lieren4'],
                            forced: true,
                            trigger: {
                                global: 'damageEnd',
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.num > 0 && event.nature != 'thunder';
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_lieren', trigger.num);
                            },
                        },
                        ty_lieren1: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.countMark('ty_lieren') > 5;
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                event.targets[0].addSkill('ty_mao');
                                event.targets[0].damage(1, 'fire');
                                player.removeMark('ty_lieren', 6);
                            },
                        },
                        ty_mao: {
                            mark: true,
                            intro: {
                                content: '仇矛在身',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return player.hasSkill('ty_mao') && player.countMark('ty_mao') < 3;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_mao', 1);
                            },
                        },
                        ty_lieren2: {
                            trigger: {
                                global: 'damageAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_mao') && event.player.countMark('ty_mao') > 2 && event.player != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.player.removeSkill('ty_mao');
                                trigger.player.removeMark('ty_mao');
                                trigger.player.damage(3, 'fire');
                                player.recover(3);
                            },
                        },
                        ty_lieren3: {
                            trigger: {
                                global: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_mao') && event.player != player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.recover(trigger.player.countMark('ty_mao'));
                                trigger.player.damage(trigger.player.countMark('ty_mao'), 'fire');
                                trigger.player.removeSkill('ty_mao');
                                trigger.player.removeMark('ty_mao');
                            },
                        },
                        ty_lieren4: {
                            enable: 'phaseUse',
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player.countMark('ty_lieren') > 7;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                player.line(event.targets, 'green');
                                player.useCard({ name: 'nanman' }, event.targets);
                                player.removeMark('ty_lieren', 8);
                            },
                        },
                        ty_wuxiang5: {
                            charlotte: true,
                        },
                        ty_wuxiang6: {
                            charlotte: true,
                        },
                        ty_wuxiang7: {
                            charlotte: true,
                        },
                        ty_wuxiang1: {
                            enable: 'phaseUse',
                            audio: 'ext:汤圆神将包/audio:3',
                            filter(event, player) {
                                return !player.hasSkill('ty_wuxiang5') || (!player.hasSkill('ty_wuxiang6') && player.countCards('h') > 0) || (!player.hasSkill('ty_wuxiang7') && player.countCards('e') > 0);
                            },
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            content() {
                                'step 0';
                                var list = [];
                                if (target && !player.hasSkill('ty_wuxiang5')) list.push('失去一点体力');
                                if (target && player.countCards('h') > 0 && !player.hasSkill('ty_wuxiang6')) list.push('弃置一张手牌');
                                if (target && player.countCards('e') > 0 && !player.hasSkill('ty_wuxiang7')) list.push('弃置一张装备牌');
                                list.push('cancel2');
                                player
                                    .chooseControl(list)
                                    .set('prompt', get.prompt('ty_wuxiang1', target))
                                    .set('ai', function () {
                                        var player = _status.event.player;
                                        var bool1 = !player.hasSkill('ty_wuxiang5');
                                        var bool2 = !player.hasSkill('ty_wuxiang6');
                                        var bool3 = !player.hasSkill('ty_wuxiang7');
                                        if (target && bool1) return '失去一点体力';
                                        if (target && player.countCards('h') > 0 && bool2) return '弃置一张手牌';
                                        if (target && player.countCards('e') > 0 && bool3) return '弃置一张装备牌';
                                        return 'cancel2';
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    event.control = result.control;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.control == '弃置一张手牌' && target && player.countCards('h') > 0) {
                                    player.chooseToDiscard('h', 1, false).set('ai', function (card) {
                                        return 12 - get.value(card);
                                    });
                                    event.goto(5);
                                }
                                ('step 3');
                                if (event.control == '弃置一张装备牌' && target && player.countCards('e') > 0) {
                                    player.chooseToDiscard('e', 1, false).set('ai', function (card) {
                                        return 12 - get.value(card);
                                    });
                                    event.goto(5);
                                }
                                ('step 4');
                                if (event.control == '失去一点体力' && target) {
                                    player.addTempSkill('ty_wuxiang5');
                                    player.addTempSkill('ty_wuxiangzhong', ['shaAfter', 'shaCancelled']);
                                    player.addTempSkill('ty_wuxiangmiss', ['shaAfter', 'shaCancelled']);
                                    player.loseHp();
                                    player.useCard({ name: 'sha' }, target);
                                    event.finish();
                                }
                                ('step 5');
                                if (result.bool && event.control == '弃置一张手牌') {
                                    player.addTempSkill('ty_wuxiang6');
                                }
                                if (result.bool && event.control == '弃置一张装备牌') {
                                    player.addTempSkill('ty_wuxiang7');
                                }
                                if (result.bool) {
                                    player.addTempSkill('ty_wuxiangzhong', ['shaAfter', 'shaCancelled']);
                                    player.addTempSkill('ty_wuxiangmiss', ['shaAfter', 'shaCancelled]']);
                                    player.useCard({ name: 'sha' }, target);
                                }
                            },
                            ai: {
                                order: 4,
                                expose: 0.2,
                                threaten: 1.1,
                                result: {
                                    target: -2,
                                    player: 0,
                                },
                            },
                        },
                        ty_wuxiangmiss: {
                            trigger: {
                                player: 'shaMiss',
                            },
                            _priority: 10,
                            forced: true,
                            filter(event, player) {
                                return player.isAlive() && event.player && event.player.isAlive();
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                trigger.target.useCard({ name: 'juedou' }, player);
                            },
                        },
                        ty_zhanjue: {
                            trigger: {
                                player: 'damageAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:3',
                            group: 'ty_zhanjue1',
                            forced: true,
                            _priority: 10,
                            filter(event, player) {
                                return event.num > 0 && event.source && event.source != player && player.isAlive && event.source.isAlive;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                                player.useCard({ name: 'juedou' }, trigger.source);
                            },
                        },
                        ty_zhanjue1: {
                            forced: true,
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.card && event.source && event.card.name == 'juedou' && event.num > 0 && event.player != player && event.source == player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.recover();
                            },
                        },
                        ty_qingwang1: {
                            charlotte: true,
                        },
                        ty_qingwang2: {
                            trigger: {
                                global: 'phaseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            charlotte: true,
                            filter(event, player) {
                                return player.hasSkill('ty_qingwang1') && player.isAlive();
                            },
                            content() {
                                player.phase('nodelay');
                            },
                        },
                        ty_qingwang: {
                            trigger: {
                                global: ['phaseDrawSkipped', 'phaseDrawCancelled', 'phaseUseSkipped', 'phaseUseCancelled'],
                            },
                            group: 'ty_qingwang2',
                            filter(event, player) {
                                if (!player.hasZhuSkill('ty_qingwang')) return false;
                                return !player.hasSkill('ty_zaiqi3');
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addTempSkill('ty_zaiqi3', 'roundStart');
                                player.addTempSkill('ty_qingwang1', 'phaseBegin');
                            },
                            zhuSkill: true,
                            audioname2: {
                                yuanshu: 'ty_qingwang2',
                            },
                        },
                        ty_wuxiangzhong: {
                            forced: true,
                            trigger: {
                                global: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.card && event.source && event.card.name == 'sha' && event.num > 0 && event.player != player && event.source == player;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.draw();
                            },
                        },
                        ty_jieshou1: {
                            trigger: {
                                source: 'damageSource',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.maxHp > 1;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.hp < player.maxHp) {
                                    player.loseMaxHp();
                                }
                                if (player.hp == player.maxHp && player.hp > 1) {
                                    player.loseHp();
                                    player.draw;
                                }
                            },
                        },
                        ty_feng: {
                            mark: true,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            intro: {
                                content: '哈哈哈哈哈,还有谁？',
                            },
                            trigger: {
                                player: 'useCard',
                            },
                            _priority: 9,
                            filter(event, player) {
                                return (_status.currentPhase = player && get.tag(event.card, 'damage'));
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countMark('ty_feng') < 3) {
                                    player.addMark('ty_feng', 1);
                                }
                            },
                        },
                        ty_lu: {
                            mark: true,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            intro: {
                                content: '几见锋芒露几何',
                            },
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return (_status.currentPhase = player);
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_lu', 1);
                                if (player.countMark('ty_feng') == player.countMark('ty_lu')) {
                                    player.draw(player.countMark('ty_lu'));
                                }
                            },
                        },
                        ty_fenglu: {
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'phaseEnd',
                            },
                            group: ['ty_feng', 'ty_lu', 'ty_fenglu1'],
                            forced: true,
                            filter(event, player) {
                                return player.isAlive() && player.hasMark('ty_feng') && player.hasMark('ty_lu');
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countMark('ty_lu') > 0 && player.countMark('ty_feng') > 0) {
                                    player.draw(player.countMark('ty_feng'));
                                }
                                if (player.hasMark('ty_lu') > 0) {
                                    player.removeMark('ty_lu', player.countMark('ty_lu'));
                                }
                                if (player.hasMark('ty_feng') > 0) {
                                    player.removeMark('ty_feng', player.countMark('ty_feng'));
                                }
                            },
                        },
                        ty_fenglu1: {
                            audio: 'ext:汤圆神将包/audio:true',
                            mod: {
                                targetInRange(card, player) {
                                    return true;
                                },
                                cardUsable(card, player) {
                                    return Infinity;
                                },
                                maxHandcardBase(player, num) {
                                    return player.countMark('ty_lu');
                                },
                            },
                        },
                        ty_kuangcai: {
                            trigger: {
                                target: 'useCardToTargeted',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return player != event.player && player.countCards('h') > 0 && event.player.countCards('h') > 0 && !player.hasSkill('ty_zaiqi3') && player.hp > 0;
                            },
                            content() {
                                'step 0';
                                trigger.targets.length = 0;
                                trigger.parent.triggeredTargets2.length = 0;
                                ('step 1');
                                player.chooseToCompare(trigger.player);
                                ('step 2');
                                if (result.bool) {
                                    player.addMark('ty_kuang', 1);
                                    player.draw();
                                } else if (result.tie) {
                                    if (player.countCards('h') > 0 && trigger.player.countCards('h') > 0) {
                                        event.goto(1);
                                    }
                                } else {
                                    if (player.countCards('h') > 0 && trigger.player.countCards('h') > 0) {
                                        player.damage(1, trigger.player);
                                        event.goto(1);
                                    } else {
                                        player.damage(1, trigger.player);
                                        player.addTempSkill('ty_zaiqi3', { player: 'phaseBegin' });
                                    }
                                }
                            },
                        },
                        ty_kuang: {
                            mark: true,
                            markText: '狂',
                            intro: {
                                content: '哈哈哈,哪个还有话可说？',
                            },
                            animationColour: 'legend',
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'chooseToUse',
                            },
                            filter(event, player) {
                                if (event.type == 'dying') {
                                    if (player != event.dying) return false;
                                    return _status.currentPhase && _status.currentPhase != player && _status.currentPhase.isAlive() && player.hasMark('ty_kuang') && player.countMark('ty_kuang') >= _status.currentPhase.hp;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                player.removeMark('ty_kuang', player.countMark('ty_kuang'));
                                player.draw(event.source.hp);
                                player.recover(player.hp - _status.currentPhase.hp);
                                player.loseMaxHp();
                            },
                        },
                        ty_shenhuo: {
                            mark: true,
                            intro: {
                                content: '东风将至,业火即起.燃烧吧!哈哈哈哈哈!',
                            },
                            trigger: {
                                global: 'damageEnd',
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return player.isAlive() && event.nature == 'fire';
                            },
                            forced: true,
                            derivation: 'yeyan',
                            content() {
                                'step 0';
                                var num = trigger.num;
                                if (num > 0) {
                                    player.addMark('ty_shenhuo', num);
                                }
                                var num1 = 0;
                                game.players.forEach((p) => (num1 += p.hp));
                                game.log(num1);
                                if (player.countMark('ty_shenhuo') >= num1) {
                                    player.removeMark('ty_shenhuo', player.countMark('ty_shenhuo'));
                                    player.popup('xiangxing');
                                    game.log(player, '发动神火!');
                                    player.removeSkill('ty_shenhuo');
                                } else {
                                    event.goto(4);
                                }
                                ('step 1');
                                var list = game.filterPlayer();
                                list.remove(player);
                                list.sort(lib.sort.seat);
                                var num2 = 0;
                                game.players.forEach((p) => (num2 += p.hp));
                                game.log(num2);
                                var list2 = [];
                                for (var i = 0; i < list.length; i++) {
                                    list2.push(0);
                                }
                                for (var i = 0; i < num2; i++) {
                                    list2[Math.floor(Math.random() * list2.length)]++;
                                }
                                event.list = list;
                                event.list2 = list2;
                                ('step 2');
                                if (event.list.length) {
                                    var target = event.list.shift();
                                    target.damage(event.list2.shift(), 'fire');
                                    player.line(target, 'thunder');
                                    event.redo();
                                }
                                ('step 3');
                                player.maxHp = 5;
                                player.recover(5 - player.hp);
                                player.update();
                                player.addSkill('yeyan');
                                player.removeSkill('业种');
                                player.removeMark('ty_shenhuo', player.countMark('ty_shenhuo'));
                                ('step 4');
                            },
                        },
                        ty_yuhuo1: {
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:4',
                            trigger: {
                                player: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.nature == 'fire' && event.num > 0 && player.isAlive();
                            },
                            content() {
                                trigger.cancel();
                                player.recover(trigger.num);
                                player.draw(trigger.num);
                                player.addMark('ty_shenhuo', trigger.num);
                            },
                        },
                        ty_yuhuo: {
                            group: ['ty_yuhuo1', 'ty_yuhuo2', 'ty_yuhuo3', 'ty_yuhuoshang', 'ty_yuhuo4'],
                            trigger: {
                                global: 'damageBegin1',
                            },
                            _priority: 99,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:4',
                            filter(event, player) {
                                return event.source && event.source == player && event.nature != 'fire' && player.isAlive();
                            },
                            content() {
                                trigger.nature = 'fire';
                            },
                        },
                        ty_yuhuo2: {
                            audio: 'ext:汤圆神将包/audio:4',
                            trigger: {
                                global: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.nature == 'thunder' && player.isAlive() && event.num > 0;
                            },
                            content() {
                                trigger.cancel();
                                trigger.player.loseHp(trigger.num);
                            },
                        },
                        ty_yuhuo3: {
                            mark: true,
                            marktext: '焚',
                            intro: {
                                content: '我将在这业火之中,重获新生',
                            },
                            audio: 'ext:汤圆神将包/audio:1',
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_yuhuo3', player.countMark('ty_yuhuo3'));
                            },
                        },
                        ty_yuhuoshang: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_yuhuo3') && event.player.countMark('ty_yuhuo3') >= 10;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (trigger.player.countMark('ty_yuhuo3') >= 10 && trigger.player.countMark('ty_yuhuo3') < 20) {
                                    trigger.player.damage(1, 'fire');
                                    trigger.player.removeMark('ty_yuhuo3', trigger.player.countMark('ty_yuhuo3'));
                                }
                                if (trigger.player.countMark('ty_yuhuo3') >= 20 && trigger.player.countMark('ty_yuhuo3') < 30) {
                                    trigger.player.damage(2, 'fire');
                                    trigger.player.removeMark('ty_yuhuo3', trigger.player.countMark('ty_yuhuo3'));
                                }
                                if (trigger.player.countMark('ty_yuhuo3') >= 30 && trigger.player.countMark('ty_yuhuo3') < 40) {
                                    trigger.player.damage(3, 'fire');
                                    trigger.player.removeMark('ty_yuhuo3', trigger.player.countMark('ty_yuhuo3'));
                                }
                                if (trigger.player.countMark('ty_yuhuo3') >= 40 && trigger.player.countMark('ty_yuhuo3') < 50) {
                                    trigger.player.damage(4, 'fire');
                                    trigger.player.removeMark('ty_yuhuo3', trigger.player.countMark('ty_yuhuo3'));
                                }
                                if (trigger.player.countMark('ty_yuhuo3') >= 50) {
                                    trigger.player.damage(5, 'thunder', 'nosource');
                                    trigger.player.removeMark('ty_yuhuo3', trigger.player.countMark('ty_yuhuo3'));
                                }
                            },
                        },
                        ty_yuhuo4: {
                            trigger: {
                                player: 'loseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:1',
                            forced: true,
                            async content(event, trigger, player) {
                                //QQQ
                                player.addMark('ty_yuhuo3', event.num);
                            },
                        },
                        神火音效: {
                            audio: 'ext:汤圆神将包/audio:true',
                            animationColour: 'legend',
                        },
                        自焚: {
                            animationColour: 'gray',
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        ty_ningqing: {
                            trigger: {
                                player: 'recoverBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_shangshi', 'ty_ningqing1', 'ty_ningqing2', 'ty_ningqing3', 'ty_ningqing4', 'ty_ningqing5', 'ty_zhongjia'],
                            forced: true,
                            filter(event, player) {
                                return player.hp > 0 || (player.hp <= 0 && event.num + player.hp > 1);
                            },
                            content() {
                                if (player.hp <= 1) {
                                    player.changeHujia(player.hp + trigger.num - 1);
                                    trigger.num -= player.hp + trigger.num - 1;
                                } else {
                                    player.changeHujia(trigger.num);
                                    trigger.num -= trigger.num;
                                }
                            },
                            ai: {
                                maixue: true,
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_ningqing1: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                return event.source && event.source == player && event.nature != 'ice';
                            },
                            content() {
                                trigger.nature = 'ice';
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_ningqing2: {
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                player: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.nature == 'ice' && event.num > 0 && player.isAlive();
                            },
                            content() {
                                trigger.cancel();
                                player.changeHujia(trigger.num);
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_ningqing3: {
                            trigger: {
                                player: 'clearHujia',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return player.isAlive() && player.maxHp < 6;
                            },
                            content() {
                                player.gainMaxHp();
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_ningqing4: {
                            trigger: {
                                player: 'dyingAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                player.changeHujia();
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_huzhong: {
                            trigger: {
                                global: 'damageBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.source && event.source != player && event.player != player && event.player.hp - event.num <= player.hp && player.isAlive();
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) >= 4;
                            },
                            content() {
                                trigger.player.changeHujia();
                                trigger.player.draw();
                                trigger.player.useCard({ name: 'juedou' }, player);
                            },
                            prompt() {
                                var player = _status.event.getTrigger().player;
                                return '是否令<' + get.translation(player) + '>获得一点护甲并摸一张牌,视为对你使用一张【决斗】？';
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_ningqing5: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_jueqing: {
                            limited: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            animationColour: 'legend',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.hujia > 0 && player.maxHp >= 6;
                            },
                            content() {
                                player.chooseToDiscard(player.hujia, 'h', true);
                                player.draw(player.hujia);
                                player.changeHujia(-player.hujia);
                                player.addTempSkill('ty_jueqing1');
                                player.awakenSkill('ty_jueqing');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_jueqing1: {
                            charlotte: true,
                            mod: {
                                targetInRange(card, player) {
                                    return true;
                                },
                                cardUsable(card, player) {
                                    return Infinity;
                                },
                            },
                            marktext: '恨',
                            intro: {
                                content: '本回合使用牌无距离,次数限制',
                            },
                        },
                        ty_shangshi: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: ['loseAfter', 'changeHp'],
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') < player.getDamagedHp();
                            },
                            content() {
                                player.draw(player.getDamagedHp() - player.countCards('h'));
                            },
                            ai: {
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh' && player.maxHp - player.hp < player.countCards('h')) {
                                        return false;
                                    }
                                },
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_zhongjia: {
                            trigger: {
                                player: 'damageBegin1',
                            },
                            lastDo: true,
                            forced: true,
                            filter(event, player) {
                                return player.hujia > 0 && event.num > 0 && player.isAlive && event.num > player.hujia;
                            },
                            content() {
                                trigger.num -= trigger.num - player.hujia;
                            },
                            audioname2: {
                                key_shiki: 'shiki_omusubi',
                            },
                        },
                        ty_lihuo1: {
                            trigger: {
                                player: 'useCard1',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (event.card.name == 'sha' && get.nature(event.card) == 'fire') return true;
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return !trigger.targets.includes(current) && lib.filter.targetEnabled2(trigger.card, player, current);
                                });
                                player
                                    .chooseTarget('疬火:是否为' + get.translation(trigger.card) + '增加1到' + get.translation(player.maxHp - player.hp) + '个目标？', [1, player.maxHp - player.hp], function (card, player, target) {
                                        var trigger = _status.event.getTrigger();
                                        var card = trigger.card;
                                        return !trigger.targets.includes(target) && lib.filter.targetEnabled2(card, player, target);
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        var card = _status.event.getTrigger().card;
                                        return get.effect(target, card, player, player);
                                    });
                                ('step 1');
                                if (result.bool) {
                                    if (player != game.me && !player.isOnline()) game.delayx();
                                } else event.finish();
                                ('step 2');
                                var targets = result.targets.sortBySeat();
                                trigger.targets.addArray(targets);
                            },
                        },
                        ty_lihuo: {
                            trigger: {
                                player: 'useCard1',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 98,
                            filter(event, player) {
                                if (event.card.name == 'sha') return true;
                                return false;
                            },
                            check(event, player) {
                                return false;
                            },
                            content() {
                                trigger.card.nature = 'fire';
                                player.loseHp();
                            },
                            group: 'ty_lihuo1',
                        },
                        ty_fenpan: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: 'ty_fenpan3',
                            derivation: 'ty_fenpan1',
                            forced: true,
                            _priority: 99,
                            filter(event, player) {
                                return player.isAlive() && event.num > 0 && event.source && event.source != player;
                            },
                            content() {
                                trigger.source.addSkill('ty_fenpan1');
                            },
                        },
                        ty_fenpan1: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            group: 'ty_fenpan2',
                            charlotte: true,
                            forced: true,
                            mark: true,
                            intro: {
                                content: '啊啊啊啊,着火了,啊啊啊啊!',
                            },
                            filter(event, player) {
                                return player.hasSkill('ty_zaiqi3') && player.isAlive;
                            },
                            content() {
                                player.removeSkill('ty_fenpan1');
                                player.removeSkill('ty_zaiqi3');
                            },
                        },
                        ty_fenpan2: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            _priority: 99,
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.source && (event.source == player || event.player == player) && player.isAlive();
                            },
                            content() {
                                trigger.nature = 'fire';
                                if (trigger.source == player) {
                                    player.loseHp();
                                    if (!player.hasSkill('ty_zaiqi3')) {
                                        player.addSkill('ty_zaiqi3');
                                    }
                                }
                            },
                        },
                        不知道: {
                            charlotte: true,
                            trigger: {
                                player: 'useCard1',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.card.name == 'sha' || get.nature(event.card) == 'fire') return false;
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return !trigger.targets.includes(current) && lib.filter.targetEnabled2(trigger.card, player, current) && lib.filter.targetInRange(trigger.card, player, current);
                                });
                                player
                                    .chooseTarget('疬火:是否为' + get.translation(trigger.card) + '增加1到' + get.translation(player.maxHp - player.hp) + '个目标？', [1, Math.min(player.Maxhp - player.hp, num)], function (card, player, target) {
                                        var trigger = _status.event.getTrigger();
                                        var card = trigger.card;
                                        return !trigger.targets.includes(target) && lib.filter.targetEnabled2(card, player, target) && lib.filter.targetInRange(card, player, target);
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        var card = _status.event.getTrigger().card;
                                        return get.effect(target, card, player, player);
                                    });
                                ('step 1');
                                if (result.bool) {
                                    if (player != game.me && !player.isOnline()) game.delayx();
                                } else event.finish();
                                ('step 2');
                                var targets = result.targets.sortBySeat();
                                trigger.targets.addArray(targets);
                            },
                        },
                        ty_fenpan3: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            forced: true,
                            _priority: 100,
                            filter(event, player) {
                                return player.isAlive() && event.num > 0 && event.source && event.source == player && event.nature == 'fire' && event.player != player;
                            },
                            content() {
                                trigger.player.addSkill('ty_fenpan1');
                            },
                        },
                        ty_chunniang1: {
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            init(player) {
                                player.storage.ty_chunniang1_count = 0;
                            },
                            trigger: {
                                player: 'dyingAfter',
                            },
                            filter(event, player) {
                                return player.isAlive() && player.maxHp >= 1;
                            },
                            content() {
                                player.loseMaxHp();
                                player.storage.ty_chunniang1_count++;
                            },
                        },
                        ty_chunniang2: {
                            audio: 'ext:汤圆神将包/audio:true',
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return num + player.storage.ty_chunniang1_count;
                                },
                            },
                        },
                        ty_chunniang: {
                            marktext: '醇',
                            group: ['ty_chunniang1', 'ty_chunniang2', 'ty_chunniang3'],
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'damageEnd',
                            },
                            forced: true,
                            _priority: 3,
                            filter(event, player) {
                                return event.player.countCards('hej') > 0 && event.nature == 'fire' && event.num > 0 && event.player.isAlive();
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.choosePlayerCard('hej', get.prompt('ty_chunniang'), trigger.player).set('ai', function (button) {
                                    return -get.attitude(player, trigger.player) + 1;
                                });
                                ('step 1');
                                if (result.links?.length) {
                                    player.line(player, trigger.player);
                                    player.addToExpansion(result.links, trigger.player, 'give', 'log').gaintag.add('ty_chunniang');
                                }
                            },
                        },
                        ty_chunniang3: {
                            trigger: {
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                var cards = player.getExpansions('ty_chunniang');
                                if (cards.length >= event.player.maxHp) return true;
                                if (cards.length >= 1 && event.player == player) return true;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            prompt() {
                                var player = _status.event.getTrigger().player;
                                var num = game.countPlayer(function (current) {
                                    return current.hasSkill('ty_fenpan1');
                                });
                                return '是否令<' + get.translation(player) + '>获得你所以的<醇>,并回复至' + get.translation(num) + '点体力';
                            },
                            content() {
                                var cards = player.getExpansions('ty_chunniang');
                                if (cards.length) trigger.player.gain(cards, 'draw');
                                trigger.player.recover(
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_fenpan1');
                                    }) - trigger.player.hp
                                );
                            },
                        },
                        仁借鉴: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'useCardAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return (
                                    event.cards &&
                                    event.cards.filterInD().length &&
                                    !player.getHistory('sourceDamage', function (evt) {
                                        return evt.card == event.card; //QQQ
                                    }).length
                                );
                            },
                            content() {
                                var cards = trigger.cards.filterInD();
                                game.log(player, '将', cards, '置于了仁库');
                                game.cardsGotoSpecial(cards, 'toRenku');
                            },
                            init(player) {
                                player.storage.renku = true;
                            },
                            group: 'jishi_draw',
                            subSkill: {
                                draw: {
                                    trigger: {
                                        global: ['gainAfter', 'cardsDiscardAfter'],
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.fromRenku == true && !event.outRange;
                                    },
                                    content() {
                                        player.draw();
                                    },
                                },
                            },
                        },
                        ty_qingnang: {
                            trigger: {
                                global: 'recoverAfter',
                            },
                            group: ['ty_qingnang1', 'ty_qingnang2'],
                            forced: true,
                            _priority: 6,
                            marktext: '青囊',
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            filtetr(event, player) {
                                return (event.player.countCards('hej') > 0 || player.countCards('hej') > 0) && event.num > 0 && player.isAlive();
                            },
                            content() {
                                'step 0';
                                if (trigger.player.countCards('h') == player.countCards('h')) {
                                    player.draw();
                                    trigger.player.draw();
                                    event.goto(4);
                                }
                                ('step 1');
                                if (trigger.player.countCards('h') > player.countCards('h') && trigger.player.countCards('hej') > 0) {
                                    player.choosePlayerCard('hej', 1, trigger.player.countCards('h') - player.countCards('h'), get.prompt('ty_qingnang'), trigger.player, true).set('ai', function (button) {
                                        return -get.attitude(player, trigger.player) + 1;
                                    });
                                    event.goto(2);
                                }
                                ('step 2');
                                if (result.links?.length) {
                                    player.line(player, trigger.player);
                                    player.addToExpansion(result.links, trigger.player, 'give', 'log').gaintag.add('ty_qingnang');
                                    event.goto(4);
                                }
                                ('step 3');
                                if (trigger.player.countCards('h') < player.countCards('h') && player.countCards('hej') > 0) {
                                    trigger.player.gainPlayerCard(player, 'hej', true);
                                    player.draw();
                                    event.goto(4);
                                }
                                ('step 4');
                            },
                        },
                        ty_jixing: {
                            mark: true,
                            zhuanhuanji: true,
                            marktext: '☯',
                            check(card) {
                                var num = get.value(card);
                                if (get.color(card) == 'black') {
                                    if (1) {
                                        return 2 - target.hp;
                                    }
                                } else {
                                    return 7 - num;
                                }
                            },
                            intro: {
                                content(storage, player, skill) {
                                    var ys = player.storage.ty_yisheng_count;
                                    var str = player.storage.ty_jixing ? '刮骨:令一名没有【弥济】效果的角色获得你手牌中的一张红色牌并失去一点体力,并获得<祛毒><br><li>医圣剩余<' + get.translation(ys) + '>次使用次数' : '麻沸:令一名没有【弥济】效果的角色获得手牌或装备区中的一黑色张牌并获得<麻醉>,其无法使用或打出手牌直到其回合开始<br><li>医圣剩余<' + get.translation(ys) + '>次使用次数';
                                    return str;
                                },
                            },
                            filterTarget(card, player, target) {
                                return player != target && !target.hasSkill('ty_mazui') && !target.hasSkill('ty_qudu') && !target.hasMark('ty_mazui') && !target.hasMark('ty_qudu');
                            },
                            filterCard(card, player) {
                                if (player.storage.ty_jixing) {
                                    return get.color(card) == 'red';
                                } else {
                                    return get.color(card) == 'black';
                                }
                            },
                            selectCard: 1,
                            discard: false,
                            lose: false,
                            position: 'h',
                            enable: 'phaseUse',
                            filter(event, player, card) {
                                return player.isAlive();
                                if (
                                    player.storage.ty_jixing &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'red';
                                    }) > 0
                                ) {
                                    return true;
                                } else if (
                                    !player.storage.ty_jixing &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'black';
                                    }) > 0
                                ) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                if (player.storage.ty_jixing) {
                                    target.gain(cards[0], player, 'give');
                                    target.loseHp();
                                    target.addSkill('ty_qudu');
                                    player.storage.ty_yisheng_count++;
                                } else {
                                    target.gain(cards[0], player, 'give');
                                    target.addTempSkill('ty_mazui', { player: 'phaseUseBefore' });
                                    player.storage.ty_yisheng_count++;
                                }
                                player.changeZhuanhuanji('ty_jixing');
                                event.finish();
                            },
                        },
                        ty_qudu: {
                            mark: true,
                            intro: {
                                content: '你的回合开始时回满体力值',
                            },
                            trigger: {
                                player: 'phaseBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            _priority: 199,
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                player.hp = player.maxHp;
                                player.removeSkill('ty_qudu');
                            },
                        },
                        ty_mazui: {
                            mod: {
                                cardEnabled2(card, player) {
                                    if (get.position(card) == 'h') return false;
                                },
                            },
                            charlotte: true,
                            forced: true,
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            _priority: 1,
                            filter(event, player) {
                                return player.isAlive() && player.hasSkill('ty_mazui');
                            },
                            content() {
                                player.removeSkill('ty_qudu');
                            },
                            mark: true,
                            intro: {
                                content: '无法使用或打出手牌',
                            },
                        },
                        ty_yisheng: {
                            init(player) {
                                player.storage.ty_yisheng_count = 0;
                            },
                            trigger: {
                                global: 'damageBegin1',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: 'ty_yisheng2',
                            _priority: 1,
                            prompt() {
                                var player = _status.event.getTrigger().player;
                                return '是否令对即将对<' + get.translation(player) + '>造成的伤害改为回复一点体力？';
                            },
                            filter(event, player) {
                                return player.storage.ty_yisheng_count > 0 && event.source && event.source == player && event.num > 0 && player.isAlive();
                            },
                            content() {
                                trigger.cancel();
                                trigger.player.recover(trigger.num);
                                player.storage.ty_yisheng_count--;
                            },
                            ai: {
                                effect: {
                                    player(card, player, target) {
                                        if (card.name == 'nanman' || card.name == 'wanjian') {
                                            return [1, 1];
                                        }
                                    },
                                },
                            },
                        },
                        ty_qingnang1: {
                            trigger: {
                                player: 'phaseBegin',
                                global: 'dying',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            _priority: 1,
                            forced: true,
                            filter(event, player) {
                                var cards = player.getExpansions('ty_qingnang');
                                return cards.length >= 1 && player.isAlive();
                            },
                            content() {
                                var cards = player.getExpansions('ty_qingnang');
                                if (cards.length) trigger.player.gain(cards, 'draw');
                            },
                        },
                        ty_qingnang2: {
                            trigger: {
                                player: 'phaseDiscardBefore',
                                global: 'dyingAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            _priority: 3,
                            filter(event, player) {
                                return event.player.countCards('hej') > 0 && event.player.isAlive() && player.countCards('h') - player.hp > 0;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.choosePlayerCard('hej', 0, player.countCards('h') - player.hp, get.prompt('ty_qingnang'), trigger.player).set('ai', function (button) {
                                    return -get.attitude(player, trigger.player) + 1;
                                });
                                ('step 1');
                                if (result.links?.length) {
                                    player.line(player, trigger.player);
                                    player.addToExpansion(result.links, trigger.player, 'give', 'log').gaintag.add('ty_qingnang');
                                }
                            },
                        },
                        ty_yisheng2: {
                            trigger: {
                                global: 'dying',
                            },
                            logTarget: 'player',
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (
                                    !player.hasSha() &&
                                    player.hasUsableCard(function (card) {
                                        return get.tag(card, 'damage');
                                    })
                                )
                                    return false;
                                return player.storage.ty_yisheng_count > 0 && event.player != player && event.player.isAlive();
                            },
                            content() {
                                'step 0';
                                event.target = trigger.player;
                                ('step 1');
                                player
                                    .chooseToUse('医圣:是否对' + get.translation(event.target) + '使用一张带有【伤害】标签的牌？', function (card, player, event) {
                                        if (!get.tag(card, 'damage')) return false;
                                        return lib.filter.cardEnabled.apply(this, arguments);
                                    })
                                    .set('complexSelect', true)
                                    .set('filterTarget', function (card, player, target) {
                                        if (target != _status.event.sourcex && !ui.selected.targets.includes(_status.event.sourcex)) return false;
                                        return lib.filter.targetEnabled.apply(this, arguments);
                                    })
                                    .set('sourcex', event.target)
                                    .set('addCount', false);
                            },
                        },
                        医圣音效1: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        医圣音效2: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        医圣音效3: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        弥济音效1: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        弥济音效2: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        ty_xiezhan: {
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return num + 1;
                                },
                                maxHandcard(player, num) {
                                    return num + player.hujia + player.countMark('ty_xiezhan1');
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.players.length > 1 && (event.name != 'phase' || game.phaseNumber == 0);
                            },
                            content() {
                                player.addMark('ty_xiezhan1', player.hp);
                            },
                        },
                        ty_shuangxiong: {
                            mark: true,
                            zhuanhuanji: true,
                            marktext: '☯',
                            audio: 'ext:汤圆神将包/audio:true',
                            viewAs(cards, player) {
                                if (!player.hasSkill('ty_zaiqi3')) {
                                    return { name: 'juedou' };
                                } else {
                                    return { name: 'sha' };
                                }
                            },
                            intro: {
                                content(storage, player, skill) {
                                    var str = player.storage.ty_shuangxiong ? '文丑<li><br>将一张黑色牌作为杀使用或打出,切换为【颜良】<li><br>受到伤害后,若伤害牌为红色或锦囊牌,你摸一张牌并切换为【颜良】<li><br>使用一张牌/造成一点伤害后,若触发牌为红色锦囊牌,你摸一张牌(手牌数超过护甲时不触发)/令【颜良】回复一点体力' : '颜良<li><br>将一张红色牌作为<决斗>使用或打出,切换为【文丑】<li><br>受到伤害后,若伤害牌为黑色或基本牌,你摸一张牌并切换为【文丑】<li><br>使用一张牌(手牌数超过体力值时不触发)/造成一点伤害后,若触发牌为黑色基本牌,你摸一张牌/令【文丑】获得一点护甲';
                                    return str;
                                },
                            },
                            group: ['ty_shuangxiong2', 'ty_shuangxiong3', 'ty_shuangxiong5', 'ty_shuangxiong6'],
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt: '颜良:将一张红色手牌作为决斗使用或打出/文丑:将一张黑色手牌作为杀使用或打出',
                            filter(event, player) {
                                var filter = event.filterCard;
                                if (
                                    player.storage.ty_shuangxiong &&
                                    filter({ name: 'sha' }, player, event) &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'black';
                                    }) > 0
                                ) {
                                    return true;
                                } else if (
                                    !player.storage.ty_shuangxiong &&
                                    filter({ name: 'juedou' }, player, event) &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'red';
                                    }) > 0
                                ) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            filterCard(card, player) {
                                if (player.storage.ty_shuangxiong) {
                                    return get.color(card) == 'black';
                                } else {
                                    return get.color(card) == 'red';
                                }
                            },
                            ai: {
                                order(name, player) {
                                    if (!player.storage.ty_shuangxiong) {
                                        return get.order({ name: 'juedou' }) + 1;
                                    } else {
                                        return get.order({ name: 'sha' }) + 1;
                                    }
                                },
                                skillTagFilter(player) {
                                    player.countCards('h') > 0;
                                },
                                respondSha(storage, player) {
                                    if (player.storage.ty_shuangxiong) {
                                        return true;
                                    } else {
                                        return false;
                                    }
                                },
                                result: {
                                    player: 3,
                                    target: -4,
                                },
                            },
                        },
                        ty_shuangxiong5: {
                            forced: true,
                            trigger: {
                                player: 'damageAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                if (player.storage.ty_shuangxiong && event.card && (get.type(event.card) == 'trick' || get.color(event.card) == 'red') && event.num > 0) {
                                    return true;
                                } else if (!player.storage.ty_shuangxiong && event.card && (get.type(event.card) == 'basic' || get.color(event.card) == 'black') && event.num > 0) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                'step 0';
                                if (!player.storage.ty_shuangxiong) {
                                    player.addSkill('ty_zaiqi3');
                                    player.changeHujia(player.countMark('ty_xiezhan1'));
                                    event.goto(1);
                                } else if (player.storage.ty_shuangxiong && player.hujia < 1) {
                                    player.removeSkill('ty_zaiqi3');
                                    player.removeMark('ty_shuangxiong');
                                    event.goto(3);
                                } else {
                                    player.removeSkill('ty_zaiqi3');
                                    player.addMark('ty_xiezhan1', player.hujia);
                                    event.goto(2);
                                }
                                ('step 1');
                                player.removeMark('ty_xiezhan1', player.countMark('ty_xiezhan1'));
                                event.goto(3);
                                ('step 2');
                                player.changeHujia(-player.hujia);
                                event.goto(3);
                                ('step 3');
                                player.draw(trigger.num);
                                player.changeZhuanhuanji('ty_shuangxiong');
                                event.finish();
                            },
                        },
                        ty_shuangxiong6: {
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            forced: true,
                            filter(event, player) {
                                var evt = event;
                                return ['sha', 'juedou'].includes(evt.card.name) && evt.skill == 'ty_shuangxiong' && evt.cards;
                            },
                            content() {
                                'step 0';
                                if (!player.storage.ty_shuangxiong) {
                                    player.addSkill('ty_zaiqi3');
                                    player.changeHujia(player.countMark('ty_xiezhan1'));
                                    event.goto(1);
                                } else if (player.storage.ty_shuangxiong && player.hujia < 1) {
                                    player.removeSkill('ty_zaiqi3');
                                    player.removeMark('ty_shuangxiong');
                                    event.goto(3);
                                } else {
                                    player.removeSkill('ty_zaiqi3');
                                    player.addMark('ty_xiezhan1', player.hujia);
                                    event.goto(2);
                                }
                                ('step 1');
                                player.removeMark('ty_xiezhan1', player.countMark('ty_xiezhan1'));
                                event.goto(3);
                                ('step 2');
                                player.changeHujia(-player.hujia);
                                event.goto(3);
                                ('step 3');
                                player.changeZhuanhuanji('ty_shuangxiong');
                                event.finish();
                            },
                        },
                        ty_xiezhan1: {
                            mark: true,
                            marktext: '文丑',
                            intro: {
                                content(storage, player) {
                                    return '文丑现在有' + get.translation(player.countMark('ty_xiezhan1')) + '点护甲';
                                },
                            },
                        },
                        ty_shuangxiong2: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                if (player.storage.ty_shuangxiong && event.card && get.type(event.card) == 'trick' && get.color(event.card) == 'red' && event.num > 0 && event.source && event.source == player && event.player != player) {
                                    return true;
                                } else if (!player.storage.ty_shuangxiong && event.card && get.type(event.card) == 'basic' && get.color(event.card) == 'black' && event.num > 0 && event.source && event.source == player && event.player != player) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                if (!player.storage.ty_shuangxiong) {
                                    player.addMark('ty_xiezhan1', 1);
                                } else {
                                    player.recover();
                                }
                            },
                        },
                        ty_shuangxiong3: {
                            trigger: {
                                player: ['useCardToBegin', 'respondAfter'],
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            _priority: 9,
                            filter(event, player) {
                                if (player.storage.ty_shuangxiong && event.card && get.type(event.card) == 'trick' && get.color(event.card) == 'red' && player.countCards('h') <= player.hujia + player.countMark('ty_xiezhan1')) {
                                    return true;
                                } else if (!player.storage.ty_shuangxiong && event.card && get.type(event.card) == 'basic' && get.color(event.card) == 'black' && player.countCards('h') <= player.hp) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                player.draw();
                            },
                        },
                        ty_zhu: {
                            mark: true,
                            intro: {
                                content(storage, player) {
                                    var numm = player.countMark('ty_zhu');
                                    return '敢欺负我的,都叫我爷爷把你们夷三族!(受到与造成的伤害加' + get.translation(numm) + ',摸牌数减' + get.translation(numm) + ')';
                                },
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            trigger: {
                                global: 'damageBegin1',
                            },
                            group: ['ty_zhu1', 'ty_zhu2', 'ty_zhu3', 'ty_zhu4'],
                            charlotte: true,
                            _priority: 99,
                            forced: true,
                            filter(event, player) {
                                return (event.source && event.source == player && event.num > 0) || (event.source && event.player == player && event.num > 0);
                            },
                            content() {
                                trigger.num += player.countMark('ty_zhu');
                            },
                        },
                        ty_zhu1: {
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            charlotte: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                trigger.num -= player.countMark('ty_zhu');
                            },
                        },
                        ty_zhu2: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            filter(event, player) {
                                return event.source && event.source == player && event.num > 0 && event.player.countMark('ty_lian') > 0 && player.isAlive();
                            },
                            content() {
                                'step 0';
                                if (trigger.player.countCards('he') >= trigger.num) {
                                    player.gainPlayerCard(trigger.player, trigger.num, 'he', true);
                                    event.goto(1);
                                } else {
                                    trigger.num -= trigger.player.countCards('he');
                                    event.goto(2);
                                }
                                ('step 1');
                                trigger.cancel();
                                event.finish();
                                ('step 2');
                                player.gainPlayerCard(trigger.player, trigger.player.countCards('he'), 'he', true);
                                event.finish();
                            },
                        },
                        ty_lian2: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            forced: true,
                            charlotte: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.source && event.source == player && event.num > 0 && event.player.countMark('ty_zhu') > 0 && player.isAlive();
                            },
                            content() {
                                'step 0';
                                if (trigger.player.countCards('he') >= trigger.num) {
                                    player.gainPlayerCard(trigger.player, trigger.num, 'he', true);
                                    event.goto(1);
                                } else {
                                    trigger.num -= trigger.player.countCards('he');
                                    event.goto(2);
                                }
                                ('step 1');
                                trigger.cancel();
                                event.finish();
                                ('step 2');
                                player.gainPlayerCard(trigger.player, trigger.player.countCards('he'), 'he', true);
                                event.finish();
                            },
                        },
                        ty_lian: {
                            mark: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            intro: {
                                content(storage, player) {
                                    var numm = player.countMark('ty_lian');
                                    return '嗯哼~嗯~啊,服侍的不错嘛,这是本小姐赏你的(摸牌数增加' + get.translation(numm) + '张,手牌上限减少' + get.translation(numm) + ')';
                                },
                            },
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            group: ['ty_lian1', 'ty_lian2', 'ty_lian3', 'ty_lian4'],
                            charlotte: true,
                            _priority: 99,
                            forced: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                trigger.num += player.countMark('ty_lian');
                            },
                        },
                        ty_lian1: {
                            charlotte: true,
                            mod: {
                                maxHandcard(player, num) {
                                    return num - player.countMark('ty_lian');
                                },
                            },
                        },
                        ty_lian3: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            _priority: 9,
                            filter(event, player) {
                                return event.source && event.source.hasSkill('ty_lian') && !event.player.hasSkill('ty_lian') && event.num > 0;
                            },
                            content() {
                                player.draw();
                            },
                        },
                        ty_zhu3: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            _priority: 8,
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            filter(event, player) {
                                return event.source && event.source.hasSkill('ty_zhu') && !event.player.hasSkill('ty_zhu') && event.player.hp <= 0;
                            },
                            content() {
                                player.recover();
                            },
                        },
                        ty_zhu4: {
                            trigger: {
                                global: 'loseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_zhu') && event.player.countCards('h') == 0 && player.countCards('he') > 0;
                            },
                            content() {
                                player.discard(player.getCards('he').randomGet());
                            },
                        },
                        ty_lian4: {
                            trigger: {
                                global: 'loseAfter',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_lian') && event.player.countCards('h') == 0;
                            },
                            content() {
                                player.loseHp();
                            },
                        },
                        ty_zhulian: {
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_zhulian2', 'ty_zhulian3'],
                            filterCard: true,
                            discard: false,
                            lose: false,
                            delay: false,
                            position: 'he',
                            enable: 'phaseUse',
                            check(card) {
                                var num = get.value(card);
                                if (get.color(card) == 'black') {
                                    if (num >= 6) return 0;
                                    return 9 - num;
                                } else {
                                    return 7 - num;
                                }
                            },
                            filter(event, player, card) {
                                var num = Math.max(1, player.hp);
                                if (player.getStat().skill.ty_zhulian >= num) return false;
                                return true;
                            },
                            content() {
                                'step 0';
                                target.gain(cards, player, 'give');
                                ('step 1');
                                if (get.color(cards[0], player) == 'red') {
                                    target.addSkill('ty_lian');
                                    target.addMark('ty_lian', target.countMark('ty_zhu') + 1);
                                    event.goto(2);
                                } else {
                                    target.addSkill('ty_zhu');
                                    target.addMark('ty_zhu', target.countMark('ty_lian') + 1);
                                    event.goto(3);
                                }
                                ('step 2');
                                target.removeMark('ty_zhu', target.countMark('ty_zhu'));
                                target.removeSkill('ty_zhu');
                                event.goto(4);
                                ('step 3');
                                target.removeMark('ty_lian', target.countMark('ty_lian'));
                                target.removeSkill('ty_lian');
                                event.goto(4);
                                ('step 4');
                                player.draw();
                                if (
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_lian');
                                    }) <
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_zhu');
                                    })
                                ) {
                                    player.chooseToDiscard(1, 'he', true);
                                }
                                event.finish();
                            },
                            ai: {
                                order: 4,
                                expose: 0.2,
                                threaten: 1.1,
                                result: {
                                    target(player, target, card) {
                                        if (get.color(card) == 'black') {
                                            return -1;
                                        } else {
                                            return 1;
                                        }
                                    },
                                    player: 0,
                                },
                            },
                        },
                        ty_zhulian2: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            prompt(event, player) {
                                return '是否令<' + get.translation(event.source) + '>的<诛>或<连>加一并转换为另一种标记(若没有<诛>或<连>标记则改为获得一枚<诛>标记)';
                            },
                            filter(event, player) {
                                return event.source && event.source != player && event.num > 0;
                            },
                            content() {
                                'step 0';
                                if (trigger.source.hasSkill('ty_zhu') && trigger.source.countMark('ty_zhu') >= 1) {
                                    trigger.source.addSkill('ty_lian');
                                    trigger.source.addMark('ty_lian', trigger.source.countMark('ty_zhu') + 1);
                                    event.goto(1);
                                } else if (trigger.source.hasSkill('ty_lian') && trigger.source.countMark('ty_lian') >= 1) {
                                    trigger.source.addSkill('ty_zhu');
                                    trigger.source.addMark('ty_zhu', trigger.source.countMark('ty_lian') + 1);
                                    event.goto(2);
                                } else {
                                    trigger.source.addSkill('ty_zhu');
                                    trigger.source.addMark('ty_zhu', 1);
                                    event.goto(3);
                                }
                                ('step 1');
                                trigger.source.removeMark('ty_zhu', trigger.source.countMark('ty_zhu'));
                                trigger.source.removeSkill('ty_zhu');
                                event.goto(3);
                                ('step 2');
                                trigger.source.removeMark('ty_lian', trigger.source.countMark('ty_lian'));
                                trigger.source.removeSkill('ty_lian');
                                event.goto(3);
                                ('step 3');
                                player.draw();
                                if (
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_lian');
                                    }) <
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_zhu');
                                    })
                                ) {
                                    player.chooseToDiscard(1, 'he', true);
                                }
                                event.finish();
                            },
                        },
                        ty_zhulian3: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            charlotte: true,
                            filter(event, player) {
                                return (event.player.hasSkill('ty_zhu') && event.player.countMark('ty_zhu') > 0) || (event.player.hasSkill('ty_lian') && event.player.countMark('ty_lian') > 0 && event.num > 0);
                            },
                            content() {
                                'step 0';
                                if (trigger.player.hasSkill('ty_zhu') && trigger.player.countMark('ty_zhu') > 1) {
                                    trigger.player.removeMark('ty_zhu', 1);
                                    event.finish();
                                } else if (trigger.player.hasSkill('ty_lian') && trigger.player.countMark('ty_lian') > 1) {
                                    trigger.player.removeMark('ty_lian', 1);
                                    event.finish();
                                } else {
                                    trigger.player.removeMark('ty_zhu', trigger.player.countMark('ty_zhu'));
                                    trigger.player.removeSkill('ty_zhu');
                                    trigger.player.removeMark('ty_lian', trigger.player.countMark('ty_lian'));
                                    trigger.player.removeSkill('ty_lian');
                                    event.goto(1);
                                }
                                ('step 1');
                                player.draw();
                                if (
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_lian');
                                    }) <
                                    game.countPlayer(function (current) {
                                        return current.hasSkill('ty_zhu');
                                    })
                                ) {
                                    player.chooseToDiscard(1, 'he', true);
                                }
                                event.finish();
                            },
                        },
                        ty_xiahui: {
                            trigger: {
                                player: 'damageBegin1',
                            },
                            group: ['ty_zhu3', 'ty_lian3'],
                            forced: true,
                            lastDo: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            derivation: ['ty_zhu', 'ty_lian'],
                            filter(event, player) {
                                return event.num > 1;
                            },
                            content() {
                                'step 0';
                                player.turnOver();
                                if (player.maxHp < 5) {
                                    player.gainMaxHp();
                                }
                                player.draw(trigger.num - 1);
                                ('step 2');
                                trigger.num -= trigger.num - 1;
                            },
                        },
                        ty_zhengrong: {
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            group: ['ty_zhengrong1', 'ty_zhongjia'],
                            forced: true,
                            filter(event, player) {
                                if (!event.isFirstTarget) return false;
                                if (!['basic', 'trick'].includes(get.type(event.card))) return false;
                                if (event.target != player && (get.distance(player, event.target) > 1 || event.targets.length > 1 || game.players.length <= 3))
                                    return game.hasPlayer(function (current) {
                                        return event.targets.includes(current) && current.countCards('he') > 0;
                                    });
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('ty_zhengrong'), '将一名目标角色的一张牌置于你的武将牌上,成为「荣」', function (card, player, target) {
                                        return _status.event.targets.includes(target) && target.countCards('he') > 0;
                                    })
                                    .set('ai', function (target) {
                                        return (1 - get.attitude(_status.event.player, target)) / target.countCards('he');
                                    })
                                    .set('targets', trigger.targets);
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    event.target = result.targets[0];
                                    player.choosePlayerCard(target, 'he', true).ai = get.buttonValue;
                                } else event.finish();
                                ('step 2');
                                if (result.links?.length) {
                                    var card = result.links[0];
                                    player.addToExpansion(card, 'give', 'log', target).gaintag.add('ty_zhengrong');
                                }
                                ('step 3');
                                if (player.getExpansions('ty_zhengrong').length <= player.hp) {
                                    player.draw();
                                } else if (player.getExpansions('ty_zhengrong').length > player.hp) {
                                    player.draw();
                                    player.chooseToDiscard(1, 'hej', true);
                                }
                            },
                            onremove(player, skill) {
                                var cards = player.getExpansions(skill);
                                if (cards.length) player.loseToDiscardpile(cards);
                            },
                            marktext: '荣',
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                        },
                        ty_weijiang: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            _priority: 7,
                            check(event, player) {
                                return (get.attitude(player, event.player) >= 0 && get.attitude(player, event.source) <= 0 && get.distance(player, event.source) > 1) || (get.attitude(player, event.source) < 0 && event.source.countCards('h') <= 1 && event.source.hp <= 1 && get.attitude(player, event.player) >= 0) || (event.player == player && get.attitude(player, event.source) <= 0) || (get.attitude(player, event.player) > 0 && event.player.countCards('h') <= 2 && get.attitude(player, event.source) <= 0);
                            },
                            prompt(event, player) {
                                return '是否令<' + get.translation(event.player) + '>获得 <' + get.translation(event.cards) + '>并选择你<荣>上的一张牌获得之,若如此做,你视为对' + get.translation(event.source) + '使用一张实体【杀】';
                            },
                            filter(event, player) {
                                var cards = player.getExpansions('ty_zhengrong');
                                if ((cards.length >= 1 && event.source && event.source != player && event.card && event.player.isAlive() && get.distance(player, event.player) <= 1 && event.num > 0) || (cards.length >= 1 && event.source && event.source != player && event.card && event.player == player && event.num > 0)) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                'step 0';
                                trigger.player.chooseCardButton(get.translation('ty_weijiang'), player.getExpansions('ty_zhengrong'), true);
                                ('step 1');
                                if (result.bool) {
                                    trigger.player.gain(result.links, 'draw');
                                    trigger.player.gain(trigger.cards, 'gain2');
                                    event.goto(2);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                player.useCard({ name: 'sha' }, trigger.source);
                            },
                        },
                        借鉴急袭: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            audioname: ['xin_chengpu'],
                            filter(event, player) {
                                return player.countCards('h') > 0 && (_status.connectMode || player.countCards('h', 'sha') > 0) && !player.getExpansions('chunlao').length;
                            },
                            intro: {
                                content: 'expansion',
                                markcount: 'expansion',
                            },
                            content() {
                                'step 0';
                                player.chooseCard([1, Math.max(1, player.countCards('h', 'sha'))], get.prompt('chunlao'), { name: 'sha' }).set('ai', function () {
                                    return 1;
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.addToExpansion(result.cards, player, 'giveAuto').gaintag.add('chunlao');
                                }
                            },
                            ai: {
                                effect: {
                                    player(card, player, target) {
                                        if (_status.currentPhase != player) return;
                                        if (card.name == 'sha' && !player.needsToDiscard() && !player.getExpansions('chunlao').length && target.hp > 1) {
                                            return 'zeroplayertarget';
                                        }
                                    },
                                },
                                threaten: 1.4,
                            },
                            group: 'chunlao2',
                        },
                        ty_juyi: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'phaseUse',
                            group: ['ty_juyi2', 'ty_juyi3'],
                            filter(event, player) {
                                return player.getExpansions('ty_zhengrong').length && player.countCards('h') > 0;
                            },
                            chooseButton: {
                                dialog(event, player) {
                                    return ui.create.dialog('请选择要获得的「荣」', player.getExpansions('ty_zhengrong'), 'hidden');
                                },
                                backup(links, player) {
                                    return {
                                        card: links[0],
                                        filterTarget(card, player, target) {
                                            return !target.hasSkill('ty_juyi1') && target != player && !target.hasSkill('ty_cuanzei');
                                        },
                                        delay: false,
                                        audio: 'ty_juyi',
                                        content: lib.skill.ty_juyi.contentx,
                                    };
                                },
                                prompt(links, player) {
                                    return '令一名角色获得' + get.translation(links[0]) + ',你与其各从牌堆底摸一张牌,直到你的下个回合开始,你与其距离视为一';
                                },
                            },
                            contentx() {
                                'step 0';
                                var card = lib.skill.ty_juyi_backup.card;
                                target.gain(card, 'gain2', 'log');
                                ('step 1');
                                target.draw('bottom');
                                player.draw('bottom');
                                target.addSkill('ty_juyi1');
                            },
                            ai: {
                                order: 8,
                                result: {
                                    player(player) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                var att = get.attitude(player, current);
                                                if ((att > 0 && current.countCards('j') > 0) || (att < 0 && current.countCards('e') > 0)) return true;
                                                return false;
                                            })
                                        )
                                            return 1;
                                        return 0;
                                    },
                                },
                            },
                        },
                        ty_juyi2: {
                            trigger: {
                                player: ['phaseBegin', 'dieBegin'],
                            },
                            silent: true,
                            charlotte: true,
                            forced: true,
                            content() {
                                for (var i = 0; i < game.players.length; i++) {
                                    if (game.players[i].hasSkill('ty_juyi1')) {
                                        game.players[i].removeSkill('ty_juyi1');
                                    }
                                }
                            },
                        },
                        ty_juyi3: {
                            mod: {
                                globalFrom(from, to) {
                                    if (to.hasSkill('ty_juyi1')) return -Infinity;
                                },
                            },
                        },
                        ty_juyi1: {
                            mark: true,
                            marktext: '义士',
                            intro: {
                                content: '世受魏恩,还望各位义士随我举兵为主清侧,共讨司马!',
                            },
                            group: 'ty_juyi4',
                            prompt(event, player) {
                                return '<' + get.translation(event.player) + '>意图篡夺曹魏,是否对其使用一张杀,讨伐之？(使用后失去义士标记)';
                            },
                            charlotte: true,
                            trigger: {
                                global: ['recoverEnd', 'phaseEnd'],
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.player.hasSkill('ty_cuanzei') && event.player.hp > 0 && event.player != player;
                            },
                            content() {
                                'step 0';
                                player.removeSkill('ty_juyi1');
                                ('step 1');
                                player.useCard({ name: 'sha' }, trigger.player);
                            },
                        },
                        ty_zhengrong1: {
                            trigger: {
                                player: ['phaseUseBegin', 'dying'],
                            },
                            _priority: 2,
                            audio: 'ext:汤圆神将包/audio:1',
                            forced: true,
                            filter(event, player) {
                                var cards = player.getExpansions('ty_zhengrong');
                                return player.countCards('h') > 0 && player.isAlive() && cards.length;
                            },
                            content() {
                                'step 0';
                                var dialog = ['请选择要交换的手牌和「荣」,或点「取消」', '<div class="text center">「征荣」牌</div>', player.getExpansions('ty_zhengrong'), '<div class="text center">手牌区</div>', player.getCards('h')];
                                var next = player.chooseButton(dialog);
                                next.set('filterButton', function (button) {
                                    var ss = _status.event.player.getExpansions('ty_zhengrong');
                                    var hs = _status.event.player.getCards('h');
                                    var sn = 0;
                                    var hn = 0;
                                    var ub = ui.selected.buttons;
                                    for (var i = 0; i < ub.length; i++) {
                                        if (ss.includes(ub[i].link)) sn++;
                                        else hn++;
                                    }
                                    return !((sn >= hs.length && ss.includes(button.link)) || (hn >= ss.length && hs.includes(button.link)));
                                });
                                next.set('selectButton', function () {
                                    if (ui.selected.buttons.length == 0) return 2;
                                    var ss = _status.event.player.getExpansions('ty_zhengrong');
                                    var hs = _status.event.player.getCards('h');
                                    var sn = 0;
                                    var hn = 0;
                                    var ub = ui.selected.buttons;
                                    for (var i = 0; i < ub.length; i++) {
                                        if (ss.includes(ub[i].link)) sn++;
                                        else hn++;
                                    }
                                    if (sn != hn) return 2 * Math.max(sn, hn);
                                    else {
                                        if (sn == ss.length || hn == hs.length || sn == hs.length || hn == ss.length) return ub.length;
                                        return [ub.length, ub.length + 1];
                                    }
                                });
                                next.set('ai', function () {
                                    return -1;
                                });
                                ('step 1');
                                if (result.bool) {
                                    var gains = [];
                                    var pushs = [];
                                    var expansions = player.getExpansions('ty_zhengrong');
                                    for (var i = 0; i < result.links.length; i++) {
                                        var card = result.links[i];
                                        if (expansions.includes(card)) gains.push(card);
                                        else pushs.push(card);
                                    }
                                    player.addToExpansion(pushs, player, 'give').gaintag.add('ty_zhengrong');
                                    player.gain(gains, 'gain2');
                                }
                                ('step 2');
                                event.finish();
                            },
                        },
                        ty_cuanzei: {
                            charlotte: true,
                            mark: true,
                            intro: {
                                content: '你现在<司马>了',
                            },
                        },
                        ty_facuan: {
                            limited: true,
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:汤圆神将包/audio:true',
                            group: ['ty_facuan1', 'ty_facuan2'],
                            _priority: 3,
                            AnimationColour: 'legend',
                            filter(event, player) {
                                var cards = player.getExpansions('ty_zhengrong');
                                return cards.length > player.hp && !player.hasSkill('ty_zaiqi3');
                            },
                            filterTarget(card, player, target) {
                                return !target.hasSkill('ty_cuanzei') && !target.hasSkill('ty_juyi1') && target != player;
                            },
                            content() {
                                target.addSkill('ty_cuanzei');
                                player.addSkill('ty_zaiqi3');
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                            ai: {
                                order: 9,
                                expose: 0.7,
                                threaten: 2,
                                result: {
                                    target: -9,
                                },
                            },
                        },
                        ty_facuan1: {
                            trigger: {
                                global: ['phaseEnd', 'recoverEnd'],
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            charlotte: true,
                            forced: true,
                            filter(event, player) {
                                var cards = player.getExpansions('ty_zhengrong');
                                return cards.length >= 1 && event.player.hasSkill('ty_cuanzei');
                            },
                            content() {
                                'step 0';
                                var cards = player.getExpansions('ty_zhengrong');
                                if (cards.length > player.hp) {
                                    player.chooseCardButton(get.translation('ty_facuan'), player.getExpansions('ty_zhengrong'), true);
                                } else {
                                    trigger.player.removeSkill('ty_cuanzei');
                                    event.finish();
                                }
                                ('step 1');
                                if (result.bool) {
                                    var card = result.links;
                                    player.loseToDiscardpile(card);
                                    event.goto(2);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                player.useCard({ name: 'sha' }, trigger.player);
                            },
                        },
                        ty_hongju: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            juexingji: true,
                            derivation: ['ty_facuan', 'ty_juyi'],
                            filter(event, player) {
                                return player.getExpansions('ty_zhengrong').length >= player.hp;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('ty_hongju');
                                player.draw(player.getExpansions('ty_zhengrong').length);
                                player.addSkill('ty_juyi');
                                player.addSkill('ty_facuan');
                                game.log(player, '获得了技能', '#g【伐篡】,【聚义】');
                                player.loseMaxHp();
                                player.recover();
                            },
                        },
                        ty_facuan2: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            _priority: 3,
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            forced: true,
                            filter(event, player) {
                                var cards = player.getExpansions('ty_zhengrong');
                                return cards.length >= 1 && event.source && event.source.hasSkill('ty_cuanzei');
                            },
                            content() {
                                'step 0';
                                var cards = player.getExpansions('ty_zhengrong');
                                if (cards.length > player.hp) {
                                    player.chooseCardButton(get.translation('ty_facuan'), player.getExpansions('ty_zhengrong'), true);
                                } else {
                                    trigger.source.removeSkill('ty_cuanzei');
                                    event.finish();
                                }
                                ('step 1');
                                if (result.bool) {
                                    var card = result.links;
                                    player.loseToDiscardpile(card);
                                    event.goto(2);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                player.useCard({ name: 'sha' }, trigger.source);
                            },
                        },
                        ty_juyi4: {
                            prompt(event, player) {
                                return '<' + get.translation(event.player) + '>意图篡夺曹魏,是否对其使用一张杀,讨伐之？(使用后失去义士标记)';
                            },
                            _priority: 3,
                            audio: 'ext:汤圆神将包/audio:true',
                            charlotte: true,
                            trigger: {
                                global: 'damageEnd',
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            filter(event, player) {
                                return event.source && event.source.hasSkill('ty_cuanzei') && event.source.hp > 0 && event.source != player;
                            },
                            content() {
                                'step 0';
                                player.removeSkill('ty_juyi1');
                                ('step 1');
                                player.useCard({ name: 'sha' }, trigger.source);
                            },
                        },
                        ty_huogang: {
                            trigger: {
                                global: 'useCard1',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            prompt(event, player) {
                                return '是否发现一张牌替代' + get.translation(event.card) + '的效果？';
                            },
                            usable: 2,
                            filter(event, player) {
                                if (event._huogang) return false;
                                if (event.player == player) return false;
                                if (event.player.countCards('h') < player.countCards('h') && event.player.countCards('e') >= player.countCards('e')) return false;
                                var target = event.targets[0];
                                for (var i = 0; i < lib.inpile.length; i++) {
                                    var info = lib.card[lib.inpile[i]];
                                    if (event.type != 'wuxie' && event.type != 'respondShan' && event.type != 'respondShan') {
                                        return true;
                                    }
                                }
                                return false;
                            },
                            autodelay: true,
                            content() {
                                'step 0';
                                var list = [],
                                    list1 = [],
                                    list2 = [];
                                for (var i = 0; i < lib.inpile.length; i++) {
                                    var info = lib.card[lib.inpile[i]];
                                    if (event.type != 'wuxie' && event.type != 'respondShan' && event.type != 'respondShan') {
                                        var cardinfo = [trigger.card.suit || '', trigger.card.number || '', lib.inpile[i]];
                                        list1.push(cardinfo);
                                        if (info.type != 'equip') {
                                            list2.push(cardinfo);
                                        }
                                    }
                                }
                                var equipped = false;
                                for (var i = 0; i < 3; i++) {
                                    if (equipped && list2.length) {
                                        list.push(list2.randomRemove());
                                    } else {
                                        equipped = true;
                                        list.push(list1.randomRemove());
                                    }
                                }
                                var eff1 = get.effect(trigger.targets[0], trigger.card, trigger.player, player);
                                var val1 = get.value(trigger.card, player, 'raw');
                                player.chooseButton(['祸纲', [list, 'vcard']]).ai = function (button) {
                                    var card = { suit: trigger.card.suit, number: trigger.card.number, name: button.link[2] };
                                    var eff2 = get.effect(trigger.targets[0], card, trigger.player, player);
                                    var val2 = get.value(card, player, 'raw');
                                    if (eff1 > 0) {
                                        if (eff2 <= 0) return 0;
                                        return val2 - val1;
                                    } else if (eff1 < 0) {
                                        if (eff2 >= 0) return val2;
                                        return 0;
                                    } else if (eff1 == 0) {
                                        if (eff2 > 0) return val2;
                                        return 0;
                                    }
                                };
                                ('step 1');
                                if (result.bool) {
                                    var stat = player.stat[player.stat.length - 1].card;
                                    if (stat[trigger.card.name]) {
                                        stat[trigger.card.name]--;
                                    }
                                    var card = game.createCard({
                                        suit: trigger.card.suit || lib.suit.randomGet(),
                                        number: trigger.card.number || Math.ceil(Math.random() * 13),
                                        name: result.links[0][2],
                                    });
                                    event.card = card;
                                    game.log(player, '将', trigger.card, '变为', card);
                                    trigger.card = card;
                                    trigger.cards = [card];
                                    trigger.card.cards = trigger.cards;
                                    game.cardsGotoOrdering(card).relatedEvent = trigger;
                                    trigger._ty_huogang = true;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                player.$throw(event.card, null, null, true);
                                if (player == trigger.player) {
                                    player.line(trigger.targets[0], 'green');
                                } else {
                                    player.line(trigger.player, 'green');
                                }
                                ('step 3');
                                var stat = player.stat[player.stat.length - 1].card;
                                if (!stat[trigger.card.name]) {
                                    stat[trigger.card.name] = 1;
                                } else {
                                    stat[trigger.card.name]++;
                                }
                                ('step 4');
                                if (trigger.targets[0] && trigger.targets[0].countCards('e')) {
                                    player.gainPlayerCard(trigger.targets[0], 'e', true);
                                }
                            },
                            draw() {
                                player.draw();
                            },
                            ai: {
                                threaten: 5,
                            },
                        },
                        ty_taoluan: {
                            audio: 'ext:汤圆神将包/audio:true',
                            enable: 'chooseToUse',
                            group: ['ty_taoluan2'],
                            filter(event, player) {
                                var num = Math.max(1, player.countCards('e'));
                                if (player.getStat().skill.ty_taoluan >= num) return false;
                                return event.type != 'wuxie' && event.type != 'respondShan' && player.countCards('e') > 0;
                            },
                            hiddenCard(player, name) {
                                return !player.getStorage('ty_taoluan').includes(name) && player.countCards('e') > 0 && lib.inpile.includes(name);
                            },
                            init(player) {
                                if (!player.storage.ty_taoluan) player.storage.ty_taoluan = [];
                            },
                            chooseButton: {
                                dialog(event, player) {
                                    var list = [];
                                    for (var i = 0; i < lib.inpile.length; i++) {
                                        var name = lib.inpile[i];
                                        if (player.storage.taoluan && player.storage.ty_taoluan.includes(name)) continue;
                                        if (name == 'sha') {
                                            list.push(['基本', '', 'sha']);
                                            for (var j of lib.inpile_nature) list.push(['基本', '', 'sha', j]);
                                        } else if (get.type(name) == 'trick') list.push(['锦囊', '', name]);
                                        else if (get.type(name) == 'basic') list.push(['基本', '', name]);
                                    }
                                    if (list.length == 0) {
                                        return ui.create.dialog('滔乱已无可用牌');
                                    }
                                    return ui.create.dialog('滔乱', [list, 'vcard']);
                                },
                                filter(button, player) {
                                    return _status.event.parent.filterCard({ name: button.link[2] }, player, _status.event.parent);
                                },
                                check(button) {
                                    var player = _status.event.player;
                                    if (player.countCards('hs', button.link[2]) > 0) return 0;
                                    if (button.link[2] == 'wugu') return 0;
                                    var effect = player.getUseValue(button.link[2]);
                                    if (effect > 0) return effect;
                                    return 0;
                                },
                                backup(links, player) {
                                    return {
                                        audio: 'taoluan',
                                        filterCard: true,
                                        selectCard: 1,
                                        popname: true,
                                        check(card) {
                                            return 6 - get.value(card);
                                        },
                                        position: 'e',
                                        viewAs: { name: links[0][2], nature: links[0][3] },
                                        onuse(result, player) {
                                            player.storage.ty_taoluan.add(result.card.name);
                                        },
                                    };
                                },
                                prompt(links, player) {
                                    return '将一张装备牌当做' + (get.translation(links[0][3]) || '') + get.translation(links[0][2]) + '使用';
                                },
                            },
                            ai: {
                                skillTagFilter(player) {
                                    if (!player.countCards('e')) return false;
                                    if (!player.storage.ty_taoluan.includes('tao')) {
                                    } else if (player.isDying() && !player.storage.ty_taoluan.includes('jiu')) {
                                    } else return false;
                                },
                                order: 4,
                                result: {
                                    player(player) {
                                        var allshown = true,
                                            players = game.filterPlayer();
                                        for (var i = 0; i < players.length; i++) {
                                            if (players[i].ai.shown == 0) {
                                                allshown = false;
                                            }
                                            if (players[i] != player && players[i].countCards('h') && get.attitude(player, players[i]) > 0) {
                                                return 1;
                                            }
                                        }
                                        if (allshown) return 1;
                                        return 0;
                                    },
                                },
                                threaten: 1.9,
                            },
                        },
                        ty_taoluan1: {
                            trigger: {
                                player: 'useCard',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                var evt = event;
                                return evt.skill == 'ty_taoluan';
                            },
                            content() {
                                player.draw();
                            },
                        },
                        ty_taoluan2: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            audio: 'ext:汤圆神将包/audio:true',
                            forced: true,
                            filter(event, player) {
                                var num = player.getStat().skill.ty_taoluan;
                                return num > 0 && player.isAlive();
                            },
                            content() {
                                'step 0';
                                var num = player.getStat().skill.ty_taoluan;
                                player
                                    .chooseTarget('请选择1到' + get.translation(num) + '名其他角色作为目标,你获得他们各一张牌', [1, num], false, function (card, player, target) {
                                        return target != player && target.countCards('hej') > 0;
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(player, target);
                                    }).animate = false;
                                ('step 1');
                                if (result.bool) {
                                    player.gainMultiple(result.targets, 'hej', true);
                                } else {
                                    event.finish();
                                }
                            },
                        },
                        ty_taoluan3: {
                            audio: 'ext:汤圆神将包/audio:true',
                        },
                        ty_taoluan4: {
                            audio: 'ext:汤圆神将包/audio:2',
                        },
                        ty_taoluan5: {
                            audio: 'taoluan',
                            enable: 'chooseToUse',
                            prompt: '将一张牌当做无懈可击使用',
                            filter(event, player) {
                                var num = player.getStat().skill.ty_taoluan + player.getStat().skill.ty_taoluan5 + player.getStat().skill.ty_taoluan6;
                                return player.countCards('e') && !_status.dying.length && num < player.countCards('e');
                            },
                            viewAsFilter(player) {
                                return player.countCards('e') && !_status.dying.length;
                            },
                            onuse(result, player) {
                                var evt = _status.event.getParent('phase');
                                if (evt && evt.name == 'phase' && !evt.ty_taoluan) {
                                    evt.xintaoluan = true;
                                    var next = game.createEvent('ty_taoluan_clear');
                                    _status.event.next.remove(next);
                                    evt.after.push(next);
                                    next.player = player;
                                    next.setContent(function () {
                                        player.storage.ty_taoluan = [];
                                        delete player.storage.ty_taoluan;
                                    });
                                }
                            },
                            filterCard: true,
                            position: 'e',
                            selectCard: 1,
                            viewAs: {
                                name: 'wuxie',
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (player.isPhaseUsing()) return 0;
                                if (!player.storage.xintaoluan2) player.storage.ty_taoluan = 0;
                                var allshown = true,
                                    players = game.filterPlayer();
                                for (var i = 0; i < players.length; i++) {
                                    if (players[i].ai.shown == 0) {
                                        allshown = false;
                                    }
                                    if (players[i] != player && players[i].countCards('e') > (player.storage.ty_taoluan2 + 1) * 2 && get.attitude(player, players[i]) > 0) {
                                        return 6 - get.value(card);
                                    }
                                }
                                return 0;
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4, 3],
                                    value: [6, 4, 3],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        ty_taoluan6: {
                            audio: 'taoluan',
                            prompt: '将一张牌当做闪使用',
                            enable: 'chooseToUse',
                            filter(event, player) {
                                var num = player.getStat().skill.ty_taoluan + player.getStat().skill.ty_taoluan5 + player.getStat().skill.ty_taoluan6;
                                return player.countCards('e') && !_status.dying.length && num < player.countCards('h');
                            },
                            onuse(result, player) {
                                var evt = _status.event.getParent('phase');
                                if (evt && evt.name == 'phase' && !evt.ty_taoluan) {
                                    var next = game.createEvent('ty_taoluan_clear');
                                    _status.event.next.remove(next);
                                    evt.after.push(next);
                                    evt.xintaoluan = true;
                                    next.player = player;
                                    next.setContent(function () {
                                        player.storage.ty_taoluan = [];
                                        delete player.storage.ty_taoluan;
                                    });
                                }
                            },
                            filterCard: true,
                            position: 'e',
                            selectCard: 1,
                            viewAs: {
                                name: 'shan',
                            },
                            check(card) {
                                var player = _status.event.player;
                                if (!player.storage.ty_taoluan) player.storage.ty_taoluan = 0;
                                var allshown = true,
                                    players = game.filterPlayer();
                                for (var i = 0; i < players.length; i++) {
                                    if (players[i].ai.shown == 0) {
                                        allshown = false;
                                    }
                                    if (players[i] != player && players[i].countCards('e') > (player.storage.ty_taoluan + 1) * 2 && get.attitude(player, players[i]) > 0) {
                                        return 6 - get.value(card);
                                    }
                                }
                                return 0;
                            },
                            ai: {
                                skillTagFilter(player) {
                                    return player.countCards('e');
                                },
                                threaten: 1.5,
                                respondShan: true,
                                order: 3,
                                basic: {
                                    useful: [7, 5.1, 2],
                                    value: [7, 5.1, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        ty_taoluan7: {
                            trigger: {
                                global: 'phaseBefore',
                                player: 'enterGame',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.players.length > 1 && (event.name != 'phase' || game.phaseNumber == 0);
                            },
                            audio: 'ext:汤圆神将包/audio:6',
                            content() {
                                player.storage.ty_taoluan.add('wuxie');
                                player.storage.ty_taoluan.add('shan');
                            },
                        },
                        ty_fanglei: {
                            getAuto(player) {
                                var hs = player.getCards('he');
                                var ss = player.getExpansions('xinfu_jijun');
                                var bool = false,
                                    max = Math.pow(2, ss.length),
                                    index,
                                    i;
                                for (var i = 0; i < hs.length; i++) {
                                    for (var j = 1; j < max; j++) {
                                        var num = hs[i].number;
                                        index = j.toString(2);
                                        while (index.length < ss.length) {
                                            index = '0' + index;
                                        }
                                        for (var k = 0; k < ss.length; k++) {
                                            if (index[k] == '1') num += ss[k].number;
                                        }
                                        if (num == 36) {
                                            bool = true;
                                            break;
                                        }
                                    }
                                    if (bool) break;
                                }
                                if (!bool) return [];
                                var list = [hs[i]];
                                for (var k = 0; k < ss.length; k++) {
                                    if (index[k] == '1') list.push(ss[k]);
                                }
                                return list;
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseUseBegin',
                            },
                            filter(event, player) {
                                return player.countCards('he') > 0 && player.getExpansions('xinfu_jijun').length;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var info = ['是否发动【方雷】？'];
                                info.push('<div class="text center">' + get.translation(player) + '的<方></div>');
                                info.push(player.getExpansions('xinfu_jijun'));
                                if (player.countCards('h')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的手牌区</div>');
                                    info.push(player.getCards('h'));
                                }
                                if (player.countCards('e')) {
                                    info.push('<div class="text center">' + get.translation(player) + '的装备区</div>');
                                    info.push(player.getCards('e'));
                                }
                                var next = player.chooseButton();
                                next.set('createDialog', info);
                                next.set('selectButton', function () {
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    if (num == 36) return ui.selected.buttons.length;
                                    return ui.selected.buttons.length + 2;
                                });
                                next.set('filterButton', function (button) {
                                    var player = _status.event.player,
                                        cards = player.getExpansions('xinfu_jijun');
                                    if (ui.selected.buttons.length) {
                                        if (!cards.includes(button.link)) return false;
                                    } else if (cards.includes(button.link)) return false;
                                    var num = 0;
                                    for (var i = 0; i < ui.selected.buttons.length; i++) {
                                        num += ui.selected.buttons[i].number;
                                    }
                                    return button.link.number + num <= 36;
                                });
                                next.set('autolist', lib.skill.xinfu_fangtong.getAuto(player));
                                next.set('processAI', function () {
                                    if (_status.event.autolist && _status.event.autolist.length) {
                                        return {
                                            bool: true,
                                            links: _status.event.autolist,
                                        };
                                    }
                                    return { bool: false };
                                });
                                next.set('complexSelect', true);
                                ('step 1');
                                if (result.bool) {
                                    var tothrow = [];
                                    var cards = result.links.slice(0);
                                    for (var i = 0; i < cards.length; i++) {
                                        if (get.position(cards[i]) == 'x') {
                                            tothrow.push(cards[i]);
                                        } else {
                                            player.discard(cards[i]).delay = false;
                                        }
                                    }
                                    player.loseToDiscardpile(tothrow);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var players = game.players.slice(0).sortBySeat();
                                player.line(players);
                                for (var i = 0; i < players.length; i++) {
                                    if (players[i] != player) players[i].damage('thunder');
                                }
                            },
                        },
                        ty_jishigai: {
                            trigger: {
                                global: 'dying',
                            },
                            forced: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            content() {
                                'step 0';
                                player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.player.recover();
                                        player.recover();
                                        trigger.player.draw();
                                        break;
                                    case 'diamond':
                                        trigger.player.draw();
                                        player.draw();
                                        trigger.player.draw();
                                        player.draw();
                                        player.gainMaxHp();
                                        break;
                                    case 'club':
                                        trigger.player.draw();
                                        player.draw();
                                        player.loseMaxHp();
                                        break;
                                    case 'spade':
                                        trigger.player.draw();
                                        player.draw();
                                        player.loseMaxHp();
                                        break;
                                }
                            },
                        },
                        ty_beifa1: {
                            forced: true,
                            charlotte: true,
                            trigger: {
                                player: 'useCardToTarget',
                            },
                            filter(event, player) {
                                return event.skill == 'ty_beifa3' || event.skill == 'ty_beifa3_backup';
                            },
                            content() {
                                player.addMark('ty_beifa3', 1);
                            },
                        },
                        ty_beifa3: {
                            enable: 'phaseUse',
                            usable: 6, //QQQ
                            mark: true,
                            audio: 'ext:汤圆神将包/audio:2',
                            intro: {
                                content(storage, player) {
                                    return '<li>北伐现在需要' + get.translation(player.countMark('ty_beifa3') + 1) + '张牌来使用';
                                },
                            },
                            filter(event, player) {
                                return player.countCards('hes') >= player.countMark('ty_beifa3') + 1 && player.countCards('hes') > 0 && player.countMark('ty_beifa3') < 9;
                            },
                            content() {
                                'step 0';
                                if (player.countCards('hes') >= (player.countMark('ty_beifa3') + 1 && player.countCards('hes') > 0)) {
                                    game.broadcastAll(function (num) {
                                        lib.skill.ty_beifa3_backup.selectCard = player.countMark('ty_beifa3') + 1;
                                    }, cards.length);
                                    var next = player.chooseToUse();
                                    next.set('openskilldialog', '将' + get.translation(player.countMark('ty_beifa3') + 1) + '张牌当做【火杀】使用');
                                    next.set('norestore', true);
                                    next.set('addCount', false);
                                    next.set('_backupevent', 'ty_beifa3_backup');
                                    next.set('custom', {
                                        add: {},
                                        replace: { window() { } },
                                    });
                                    next.backup('ty_beifa3_backup');
                                } else event.finish();
                                ('step 1');
                                if (result.bool) {
                                    player.addMark('ty_beifa3', 1);
                                }
                            },
                            ai: {
                                order(name, player) {
                                    return get.order({ name: 'sha' }) + 1;
                                },
                                skillTagFilter(player) {
                                    player.countCards('h') > player.countMark('ty_beifa3') + 1 && !player.hasSkill('ty_zaiqi3');
                                },
                                result: {
                                    player: 2,
                                    target: -2,
                                },
                            },
                            subSkill: {
                                backup: {
                                    filterCard(card, player) {
                                        return get.itemtype(card) == 'card';
                                    },
                                    viewAs: {
                                        name: 'sha',
                                        nature: 'fire',
                                    },
                                    position: 'hes',
                                    filterTarget(card, player, target) {
                                        if (!card) return false;
                                        var info = get.info(card);
                                        var filter = info.filterTarget;
                                        if (!info.singleCard || ui.selected.targets.length == 0) {
                                            var mod = game.checkMod(card, player, target, 'unchanged', 'playerEnabled', player);
                                            if (mod == false) return false;
                                            var mod = game.checkMod(card, player, target, 'unchanged', 'targetEnabled', target);
                                            if (mod != 'unchanged') return mod;
                                        }
                                        if (typeof filter == 'boolean') return filter;
                                        if (typeof filter == 'function') return filter(card, player, target);
                                    },
                                    check: (card) => 9 - get.value(card),
                                    log: false,
                                    precontent() { },
                                    ai: {
                                        yingbian(card, player, targets, viewer) {
                                            if (get.attitude(viewer, player) <= 0) return 0;
                                            var base = 0,
                                                hit = false;
                                            if (get.cardtag(card, 'yingbian_hit')) {
                                                hit = true;
                                                if (
                                                    targets.filter(function (target) {
                                                        return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            if (get.cardtag(card, 'yingbian_all')) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            if (get.cardtag(card, 'yingbian_damage')) {
                                                if (
                                                    targets.filter(function (target) {
                                                        return (
                                                            get.attitude(player, target) < 0 &&
                                                            (hit ||
                                                                !target.mayHaveShan() ||
                                                                player.hasSkillTag(
                                                                    'directHit_ai',
                                                                    true,
                                                                    {
                                                                        target: target,
                                                                        card: card,
                                                                    },
                                                                    true
                                                                )) &&
                                                            !target.hasSkillTag('filterDamage', null, {
                                                                player: player,
                                                                card: card,
                                                                jiu: true,
                                                            })
                                                        );
                                                    })
                                                )
                                                    base += 5;
                                            }
                                            return base;
                                        },
                                        canLink(player, target, card) {
                                            if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                            if (
                                                target.mayHaveShan() &&
                                                !player.hasSkillTag(
                                                    'directHit_ai',
                                                    true,
                                                    {
                                                        target: target,
                                                        card: card,
                                                    },
                                                    true
                                                )
                                            )
                                                return false;
                                            if (player.hasSkill('jueqing') || player.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                            return true;
                                        },
                                        basic: {
                                            useful: [5, 3, 1],
                                            value: [5, 3, 1],
                                        },
                                        order(item, player) {
                                            if (player.hasSkillTag('presha', true, null, true)) return 10;
                                            if (lib.linked.includes(get.nature(item))) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        return current != player && current.isLinked() && player.canUse(item, current, null, true) && get.effect(current, item, player, player) > 0 && lib.card.sha.ai.canLink(player, current, item);
                                                    }) &&
                                                    game.countPlayer(function (current) {
                                                        return current.isLinked() && get.damageEffect(current, player, player, get.nature(item)) > 0;
                                                    }) > 1
                                                )
                                                    return 3.1;
                                                return 3;
                                            }
                                            return 3.05;
                                        },
                                        result: {
                                            target(player, target, card, isLink) {
                                                var eff = (function () {
                                                    if (!isLink && player.hasSkill('jiu')) {
                                                        if (
                                                            !target.hasSkillTag('filterDamage', null, {
                                                                player: player,
                                                                card: card,
                                                                jiu: true,
                                                            })
                                                        ) {
                                                            if (get.attitude(player, target) > 0) {
                                                                return -7;
                                                            } else {
                                                                return -4;
                                                            }
                                                        }
                                                        return -0.5;
                                                    }
                                                    return -1.5;
                                                })();
                                                if (
                                                    !isLink &&
                                                    target.mayHaveShan() &&
                                                    !player.hasSkillTag(
                                                        'directHit_ai',
                                                        true,
                                                        {
                                                            target: target,
                                                            card: card,
                                                        },
                                                        true
                                                    )
                                                )
                                                    return eff / 1.2;
                                                return eff;
                                            },
                                        },
                                        tag: {
                                            respond: 1,
                                            respondShan: 1,
                                            damage(card) {
                                                if (card.nature == 'poison') return;
                                                return 1;
                                            },
                                            natureDamage(card) {
                                                if (card.nature) return 1;
                                            },
                                            fireDamage(card, nature) {
                                                if (card.nature == 'fire') return 1;
                                            },
                                            thunderDamage(card, nature) {
                                                if (card.nature == 'thunder') return 1;
                                            },
                                            poisonDamage(card, nature) {
                                                if (card.nature == 'poison') return 1;
                                            },
                                        },
                                    },
                                    selectCard: 4,
                                },
                            },
                        },
                        ty_cuijiao: {
                            audio: 'ext:汤圆神将包/audio:2',
                            group: 'ty_cuijiao1',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                return (
                                    event.card.name == 'sha' &&
                                    event.card.nature == 'fire' &&
                                    !player.hasSkill('ty_zaiqi3') &&
                                    (event.target.countGainableCards(player, 'he') > 0 ||
                                        player.countCards('e') > 0 ||
                                        (player.maxHp > 1 && player.countMark('ty_beifa3') > 0) ||
                                        player.hasCard(function (i) {
                                            return _status.connectMode || (get.type(i, player) == 'trick' && lib.filter.cardDiscardable(i, player, 'ty_cuijiao'));
                                        }, 'h'))
                                );
                            },
                            content() {
                                'step 0';
                                var target = trigger.target;
                                event.target = target;
                                var list = [];
                                if (target.countGainableCards(player, 'he') > 0) list.push('选项一');
                                if (
                                    player.hasCard(function (i) {
                                        return get.type(i, player) == 'trick' && lib.filter.cardDiscardable(i, player, 'ty_cuijiao');
                                    }, 'h')
                                )
                                    list.push('选项二');
                                if (player.maxHp > 1 && player.countMark('ty_beifa3') > 0) list.push('选项三');
                                if (player.countCards('e') > 0) list.push('背水!');
                                list.push('cancel2');
                                player
                                    .chooseControl(list)
                                    .set('choiceList', ['失去一点体力并获得' + get.translation(target) + '的两张牌', '弃置一张普通锦囊牌并令' + get.translation(trigger.card) + '伤害+1', '失去一点体力上限并减少一枚<北伐>标记', '背水!弃置你所以装备牌使' + get.translation(trigger.card) + '伤害额外+' + get.translation(player.countCards('e')) + '并执行所有选项'])
                                    .set('prompt', get.prompt('ty_cuijiao', target))
                                    .set('ai', function () {
                                        var evt = _status.event.getTrigger(),
                                            player = evt.player,
                                            target = evt.target,
                                            card = evt.card;
                                        if (get.attitude(player, target) > 0) return 'cancel2';
                                        var bool1 = target.countGainableCards(player, 'h') > 0;
                                        var bool2 =
                                            player.hasCard(function (i) {
                                                return get.type(i, player) == 'trick' && lib.filter.cardDiscardable(i, player, 'ty_cuijiao') && get.value(card, player) < 5;
                                            }, 'h') &&
                                            !target.hasSkillTag('filterDamage', null, {
                                                player: player,
                                                card: card,
                                            });
                                        var bool3 = player.maxHp > 1 && player.countMark('ty_beifa3') > 0;
                                        if (bool1 && bool2 && player.countCards('e') > 0 && bool3(target.hp <= 2 + player.countCards('e') || (player.isDamaged() && player.maxHp > 3))) return '背水!';
                                        if (bool1) return '选项一';
                                        if (bool2) return '选项二';
                                        if (bool3) return '选项三';
                                        return 'cancel2';
                                    });
                                ('step 1');
                                if (result.control != 'cancel2') {
                                    event.control = result.control;
                                    if (event.control == '背水!') {
                                        trigger.parent.baseDamage += player.countCards('e');
                                        player.chooseToDiscard('e', player.countCards('e'), true);
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if ((event.control == '选项一' || event.control == '背水!') && target.countGainableCards(player, 'he') > 0) {
                                    player.gainPlayerCard(target, 2, true, 'he');
                                    player.loseHp();
                                }
                                ('step 3');
                                if ((event.control == '选项三' || event.control == '背水!') && player.countMark('ty_beifa3') > 0) {
                                    player.loseMaxHp();
                                    player.removeMark('ty_beifa3', 1);
                                }
                                ('step 4');
                                if (
                                    (event.control == '选项二' || event.control == '背水!') &&
                                    player.hasCard(function (i) {
                                        return get.type(i, player) == 'trick' && lib.filter.cardDiscardable(i, player, 'ty_cuijiao');
                                    }, 'h')
                                ) {
                                    player.chooseToDiscard('h', '弃置一张锦囊牌', { type: 'trick' }, true);
                                } else event.finish();
                                ('step 5');
                                if (result.bool) trigger.parent.baseDamage++;
                            },
                            ai: {
                                treaten: 1.8,
                                directHit_ai: true,
                                skillTagFilter(player, tag, arg) {
                                    if (!arg || !arg.card || !arg.target || arg.card.name != 'sha') return false;
                                    if (player.getStat('triggerSkill').dbquedi && player.getStat('triggerSkill').dbquedi > 0) return false;
                                    if (
                                        arg &&
                                        arg.target.countCards('h') == 1 &&
                                        (arg.card.name != 'sha' ||
                                            !arg.target.getEquip('bagua') ||
                                            player.hasSkillTag('unequip', false, {
                                                name: arg.card ? arg.card.name : null,
                                                target: arg.target,
                                                card: arg.card,
                                            }) ||
                                            player.hasSkillTag('unequip', false, {
                                                name: arg.card ? arg.card.name : null,
                                                target: arg.target,
                                                card: arg.card,
                                            }))
                                    )
                                        return true;
                                    return false;
                                },
                            },
                        },
                        ty_cuijiao1: {
                            charlotte: true,
                            forced: true,
                            trigger: {
                                source: 'dieBegin',
                            },
                            filter(event, player) {
                                return player.isAlive();
                            },
                            content() {
                                'step 0';
                                player.gainMaxHp();
                                player.recover();
                                player.draw(player.countMark('ty_beifa3') + 1);
                                ('step 1');
                                if (player.countMark('ty_beifa3') > 0) {
                                    player.removeMark('ty_beifa3', 1);
                                }
                                player.addTempSkill('ty_zaiqi3', { player: ['phaseEnd', 'phaseBegin'] });
                            },
                        },
                        //觉醒技,准备阶段开始或你濒死时,若你的体力上限为1或你的手牌数为0,你选择一名手牌数最大的角色,令其增加x点体力上限并摸x张牌,你将体力上限调整到x并将体力回复至x-1,并从牌堆中装备五张不同的种类的装备牌,最后失去【北伐】并获得【战孤】.(x为你<北伐>标记数加1)
                        ty_yongge: {
                            trigger: {
                                player: ['dying', 'phaseBegin'],
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            derivation: 'ty_zhangu',
                            forced: true,
                            juexingji: true,
                            limited: true,
                            filter(event, player) {
                                return player.maxHp == 1 || player.countCards('h') == 0;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                const result = await player.chooseTarget('请选择【恿戈】的目标,其增加' + get.translation(player.countMark('ty_beifa3')) + '点体力上限并摸等量的牌', true, (card, player, target) => target != player && !game.hasPlayer((current) => current != target && current.countCards('h') > target.countCards('h'))).set('ai', (target) => get.attitude(player, target)).forResult();
                                if (result.targets?.length) {
                                    result.targets[0].gainMaxHp(player.countMark('ty_beifa3'));
                                    result.targets[0].draw(player.countMark('ty_beifa3'));
                                    player.gainMaxHp(player.countMark('ty_beifa3') - player.maxHp + 1);
                                    player.recover(player.countMark('ty_beifa3') - player.hp);
                                    player.removeSkill('ty_beifa3');
                                    player.removeMark('ty_beifa3', player.countMark('ty_beifa3'));
                                    player.addSkill('ty_zhangu');
                                    player.awakenSkill('ty_yongge');
                                    for (var i = 1; i < 6; i++) {
                                        if (player.countCards('e', { subtype: 'equip' + i }) < 1 && !player.isDisabled('equip' + i)) {
                                            var sub = 'equip' + i,
                                                card = get.cardPile((card) => get.subtype(card, false) == sub && !get.cardtag(card, 'gifts'));
                                            if (card) {
                                                await player.equip(card);
                                            }
                                        }
                                    }
                                }
                            },
                            mark: true,
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                            ai: {
                                treaten: 2.2,
                                save: true,
                            },
                        },
                        ty_zhangu: {
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseEnd'],
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            forced: true,
                            filter(event, player) {
                                return player.maxHp > 1 && (player.countCards('h') == 0 || player.countCards('e') == 0);
                            },
                            content() {
                                var cards = [],
                                    types = [];
                                for (var i = 0; i < 3; i++) {
                                    var card = get.cardPile2(function (card) {
                                        return !cards.includes(card) && !types.includes(get.type2(card, false));
                                    });
                                    if (card) {
                                        cards.push(card);
                                        types.push(get.type2(card, false));
                                    } else break;
                                }
                                if (cards.length) player.gain(cards, 'gain2');
                                if (player.isDamaged()) {
                                    player.loseMaxHp();
                                } else {
                                    player.loseHp();
                                }
                            },
                        },
                        ty_zhujian: {
                            group: ['ty_zhujian1', 'ty_zhujian2', 'ty_zhujian3'],
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            filter(event, player) {
                                return !event.numFixed && player.countCards('e') < 5 && player.countCards('e') < player.maxHp;
                            },
                            prompt(event, player) {
                                return '筑坚:是否失去一点体力上限依次装备' + get.translation(player.maxHp) + '张类别不同的装备牌？';
                            },
                            content() {
                                'step 0';
                                trigger.changeToZero();
                                player.loseMaxHp();
                                ('step 1');
                                if (player.countDisabled() > 0) {
                                    player.enableEquip(player.countDisabled());
                                }
                                ('step 2');
                                for (var i = 1; i < 7; i++) {
                                    if (player.countCards('e', { subtype: 'equip' + i }) < 1 && !player.isDisabled('equip' + i)) {
                                        var sub = 'equip' + i,
                                            card = get.cardPile(function (card) {
                                                return get.subtype(card, false) == sub && !get.cardtag(card, 'gifts');
                                            });
                                        if (card) {
                                            player.$gain2(card);
                                            player.equip(card);
                                            break;
                                        }
                                    }
                                }
                                if (
                                    get.cardPile(function (card) {
                                        return get.subtype(card, false) == 5;
                                    }) &&
                                    player.countCards('e') == 4
                                ) {
                                    event.finish();
                                }
                                if (player.countCards('e') < 5 - player.countDisabled() && card && player.maxHp >= 5) {
                                    event.goto(1);
                                } else if (player.maxHp < 5 && player.countCards('e') < player.maxHp - player.countDisabled() && card) {
                                    event.goto(1);
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 3.5,
                            },
                        },
                        ty_zhujian1: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'dying',
                            },
                            filter(event, player) {
                                return player.countCards('e') < 5 && player.countCards('e') < player.maxHp && !player.hasSkill('ty_zhujian5');
                            },
                            prompt(event, player) {
                                return '筑坚:是否失去一点体力上限依次装备' + get.translation(player.maxHp) + '张类别不同的装备牌？';
                            },
                            content() {
                                'step 0';
                                player.loseMaxHp();
                                player.addSkill('ty_zhujian5');
                                ('step 1');
                                if (player.countDisabled() > 0) {
                                    player.enableEquip(player.countDisabled());
                                }
                                ('step 2');
                                for (var i = 1; i < 7; i++) {
                                    if (player.countCards('e', { subtype: 'equip' + i }) < 1 && !player.isDisabled('equip' + i)) {
                                        var sub = 'equip' + i,
                                            card = get.cardPile(function (card) {
                                                return get.subtype(card, false) == sub && !get.cardtag(card, 'gifts');
                                            });
                                        if (card) {
                                            player.$gain2(card);
                                            player.equip(card);
                                            break;
                                        }
                                    }
                                }
                                if (
                                    get.cardPile(function (card) {
                                        return get.subtype(card, false) == 5;
                                    }) &&
                                    player.countCards('e') == 4
                                ) {
                                    event.finish();
                                }
                                if (player.countCards('e') < 5 - player.countDisabled() && card && player.maxHp >= 5) {
                                    event.goto(1);
                                } else if (player.maxHp < 5 && player.countCards('e') < player.maxHp - player.countDisabled() && card) {
                                    event.goto(1);
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                threaten: 2.2,
                            },
                        },
                        ty_zhujian2: {
                            trigger: {
                                player: 'loseAfter',
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter', 'addToExpansionAfter'],
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            filter(event, player) {
                                var evt = event.getl(player);
                                if (event.name == 'equip' && event.player == player) return true;
                                return evt && evt.es.length;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                if (player.countCards('e') >= player.hp) {
                                    player.recover(player.countCards('e') - player.hp);
                                } else {
                                    player.loseHp(player.hp - player.countCards('e'));
                                }
                                ('step 1');
                                player
                                    .chooseTarget('请选择一名角色,其将手牌数控制到' + get.translation(player.countCards('e')) + '张牌', false, function (card, player, target) {
                                        return target.isAlive();
                                    })
                                    .set('ai', function (target) {
                                        var num = Math.min(5, player.countCards('e')) - target.countCards('h');
                                        var att = get.attitude(player, target);
                                        return num * att;
                                    });
                                ('step 2');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    if (target.countCards('h') > player.countCards('e')) {
                                        target.chooseToDiscard('h', target.countCards('h') - player.countCards('e'), true);
                                    } else if (target.countCards('h') < player.countCards('e')) {
                                        target.draw(player.countCards('e') - target.countCards('h'));
                                    } else {
                                        event.finish();
                                    }
                                }
                            },
                            ai: {
                                maixie: true,
                                expose: 0.2,
                            },
                        },
                        ty_zhujian3: {
                            forced: true,
                            trigger: {
                                player: 'damageBegin4',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            filter(event, player) {
                                return player.countCards('e') > 0 && event.num;
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                if (player.countCards('e') >= trigger.num) {
                                    player.chooseToDiscard('e', trigger.num, true);
                                    trigger.cancel();
                                } else {
                                    trigger.num -= player.countCards('e');
                                    player.chooseToDiscard('e', player.countCards('e'), true);
                                }
                            },
                        },
                        ty_zhujian4: {
                            audio: 'ext:汤圆神将包/audio:2',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') < player.countCards('e');
                            },
                            content() {
                                player.draw(player.countCards('e') - player.countCards('h'));
                            },
                            ai: {
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh' && player.countCards('e') < player.countCards('h')) {
                                        return false;
                                    }
                                },
                            },
                        },
                        ty_zhujian5: {
                            charlotte: true,
                            mark: true,
                            marktext: '筑坚',
                            intro: {
                                content: '已发动过濒死【筑坚】',
                            },
                        },
                        ty_zhengu: {
                            trigger: {
                                global: 'damageBegin',
                            },
                            audio: 'ext:汤圆神将包/audio:2',
                            group: ['ty_zhengu2', 'ty_zhengu3'],
                            prompt(event, player) {
                                return '是否移动一张牌将' + get.translation(event.card) + '的伤害转移给你,并令' + get.translation(event.player) + '摸一张牌？';
                            },
                            filter(event, player) {
                                return ((event.card && get.type(event.card) == 'trick') || (event.nature && event.nature == 'fire')) && event.player.isAlive() && event.num > 0 && event.player != player && get.distance(player, event.player) <= 1 && !event.player.hasSkill('ty_zhengu1');
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) > 0;
                            },
                            content() {
                                'step 0';
                                trigger.player.addSkill('ty_zhengu1');
                                trigger.player.draw();
                                ('step 1');
                                player.moveCard();
                                trigger.player = player;
                            },
                            ai: {
                                threaten: 4.2,
                                expose: 0.7,
                            },
                        },
                        ty_zhengu1: {
                            mark: true,
                            marktext: '镇',
                            intro: {
                                content: '孔明之计,吾亦能参破一二!',
                            },
                            charlotte: true,
                            ai: {
                                treaten: 2.2,
                            },
                        },
                        ty_zhengu2: {
                            trigger: {
                                global: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return ((event.card && get.type(event.card) == 'trick') || (event.nature && event.nature == 'fire')) && event.player.hasSkill('ty_zhengu1');
                            },
                            content() {
                                'step 0';
                                if (trigger.card) {
                                    player.gain(trigger.cards, 'gain2');
                                } else {
                                    player.draw();
                                }
                                trigger.player.removeSkill('ty_zhengu1');
                                ('step 1');
                                player.chooseToDiscard('e', 1, true);
                            },
                        },
                        ty_zhengu3: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('ty_zhengu1');
                            },
                            content() {
                                trigger.player.changeHujia();
                                trigger.player.removeSkill('ty_zhengu1');
                                if (trigger.player.maxHp >= player.maxHp && player.maxHp < 6) {
                                    player.gainMaxHp();
                                }
                            },
                        },
                        ty_longnu: {
                            mark: true,
                            zhuanhuanji: true,
                            marktext: '☯',
                            audio: 'ext:汤圆神将包/audio:4',
                            mod: {
                                targetInRange(card) {
                                    if ((card.nature == 'fire' || card.nature == 'thunder') && card.name == 'sha') return true;
                                },
                                cardUsable(card) {
                                    if (card.name == 'sha' && (card.nature == 'fire' || card.nature == 'thunder')) return Infinity;
                                },
                            },
                            viewAs(cards, player) {
                                if (!player.hasSkill('ty_longnu2')) {
                                    return { name: 'sha', nature: 'fire' };
                                } else {
                                    return { name: 'sha', nature: 'thunder' };
                                }
                            },
                            intro: {
                                content(storage, player, skill) {
                                    var str = player.storage.ty_longnu ? '龙怒:阴<li><br>将一张黑色手牌作为<雷杀>使用或打出<li><br>受到伤害后,若伤害牌为锦囊牌或此伤害为雷属性,你转换此技能<li><br>你受到火焰伤害时改为回复等量体力并摸等量张牌,场上被横置的角色造成的伤害为火焰伤害' : '龙怒:阳<li><br>将一张红色手牌作为<火杀>使用或打出<li><br>受到伤害后,若伤害牌为基本牌或此伤害为火属性,你转换此技能<li><br>你受到雷电伤害时改为回复等量体力并摸等量牌,场上被横置的角色造成的伤害为雷电伤害';
                                    return str;
                                },
                            },
                            group: ['ty_longnu1', 'ty_longnu3', 'ty_longnu4', 'ty_longnu5'],
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt: '阴:将一张黑色手牌作为<雷杀>使用或打出/阳:将一张红色手牌作为<火杀>使用或打出',
                            filter(event, player) {
                                var filter = event.filterCard;
                                var num = Math.max(
                                    1,
                                    game.countPlayer(function (current) {
                                        return current.isLinked();
                                    })
                                );
                                if (player.getStat().skill.ty_longnu >= num) return false;
                                if (
                                    player.storage.ty_longnu &&
                                    filter({ name: 'sha', nature: 'thunder' }, player, event) &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'black';
                                    }) > 0
                                ) {
                                    return true;
                                } else if (
                                    !player.storage.ty_longnu &&
                                    filter({ name: 'sha', nature: 'fire' }, player, event) &&
                                    player.countCards('h', function (card) {
                                        return get.color(card) == 'red';
                                    }) > 0
                                ) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            filterCard(card, player) {
                                if (player.storage.ty_longnu) {
                                    return get.color(card) == 'black';
                                } else {
                                    return get.color(card) == 'red';
                                }
                            },
                            ai: {
                                order(name, player) {
                                    if (!player.storage.ty_longnu) {
                                        return get.order({ name: 'sha' }) + 1;
                                    } else {
                                        return get.order({ name: 'sha' }) + 1;
                                    }
                                },
                                skillTagFilter(player) {
                                    player.countCards('h') > 0;
                                },
                                respondSha: true,
                                result: {
                                    player: 3,
                                    target: -4,
                                },
                            },
                        },
                        ty_longnu1: {
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            forced: true,
                            filter(event, player) {
                                var evt = event;
                                return ['sha'].includes(evt.card.name) && evt.skill == 'ty_longnu' && evt.cards;
                            },
                            content() {
                                'step 0';
                                if (!player.storage.ty_longnu) {
                                    player.loseHp();
                                    player.draw();
                                    player.addSkill('ty_longnu2');
                                    event.goto(1);
                                } else {
                                    player.loseHp();
                                    player.draw();
                                    player.removeSkill('ty_longnu2');
                                    event.goto(1);
                                }
                                ('step 1');
                                player.changeZhuanhuanji('ty_longnu');
                                event.finish();
                            },
                        },
                        ty_lianying: {
                            trigger: {
                                player: ['linkBefore', 'enterGame'],
                                global: 'phaseBefore',
                            },
                            audio: 'ext:汤圆神将包/audio:4',
                            group: ['ty_lianying1', 'ty_lianying2', 'ty_lianying3', 'ty_lianying5'],
                            forced: true,
                            filter(event, player) {
                                if (event.name == 'link') return player.isLinked();
                                return (event.name != 'phase' || game.phaseNumber == 0) && !player.isLinked();
                            },
                            content() {
                                if (trigger.name != 'link') player.link(true);
                                else trigger.cancel();
                            },
                            ai: {
                                effect: {
                                    target(card) {
                                        if (card.name == 'tiesuo') return 'zeroplayertarget';
                                    },
                                },
                            },
                        },
                        ty_lianying1: {
                            trigger: {
                                player: ['useCardToTarget', 'respondAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                return (
                                    event.card.name == 'sha' &&
                                    (get.nature(event.card) == 'fire' || get.nature(event.card) == 'thunder') &&
                                    game.hasPlayer(function (current) {
                                        return current != player && !current.isLinked();
                                    })
                                );
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(false, '请选择一名角色横置', function (card, player, target) {
                                        return target != player && !target.isLinked();
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(player, target);
                                    });
                                ('step 1');
                                if (result.bool) {
                                    player.line(result.targets);
                                    result.targets[0].link(true);
                                } else {
                                    event.finish();
                                }
                            },
                        },
                        ty_lianying2: {
                            trigger: {
                                global: ['dieBefore'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player.isLinked() && player.isAlive();
                            },
                            async content(event, trigger, player) {
                                //QQQ
                                player.addTempSkill('ty_lianying4', 'phaseBegin');
                            },
                        },
                        ty_lianying3: {
                            trigger: {
                                global: 'phaseAfter',
                            },
                            forced: true,
                            charlotte: true,
                            animationColour: 'legend',
                            filter(event, player) {
                                return player.hasSkill('ty_lianying4') && player.isAlive();
                            },
                            content() {
                                player.loseMaxHp();
                                player.phase('nodelay');
                            },
                        },
                        ty_lianying4: {
                            charlotte: true,
                        },
                        ty_longnu2: {
                            charlotte: true,
                        },
                        ty_longnu3: {
                            forced: true,
                            charlotte: true,
                            audio: 'ext:汤圆神将包/audio:4',
                            trigger: {
                                player: 'damageBegin1',
                            },
                            filter(event, player) {
                                return ((event.nature == 'fire' && player.storage.ty_longnu) || (event.nature == 'thunder' && !player.storage.ty_longnu)) && event.num > 0 && player.isAlive();
                            },
                            content() {
                                trigger.cancel();
                                player.recover(trigger.num);
                                player.draw(trigger.num);
                            },
                        },
                        ty_longnu4: {
                            _priority: 2,
                            forced: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                if (player.storage.ty_longnu && ((event.card && get.type(event.card) == 'trick') || event.nature == 'tunder') && event.num > 0) {
                                    return true;
                                } else if (!player.storage.ty_longnu && ((event.card && get.type(event.card) == 'basic') || event.nature == 'fire') && event.num > 0) {
                                    return true;
                                } else {
                                    return false;
                                }
                            },
                            content() {
                                'step 0';
                                if (!player.storage.ty_longnu) {
                                    player.loseHp();
                                    player.draw();
                                    player.addSkill('ty_longnu2');
                                    event.goto(1);
                                } else {
                                    player.loseHp();
                                    player.draw();
                                    player.removeSkill('ty_longnu2');
                                    event.goto(1);
                                }
                                ('step 1');
                                player.changeZhuanhuanji('ty_longnu');
                                event.finish();
                            },
                        },
                        ty_lianying5: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source && event.source.isAlive() && player.isAlive();
                            },
                            content() {
                                if (!trigger.source.isLinked()) {
                                    trigger.source.link(true);
                                } else {
                                    event.finish();
                                }
                            },
                            ai: {
                                maixie_defend: true,
                            },
                        },
                        ty_longnu5: {
                            trigger: {
                                global: 'damageBegin1',
                            },
                            _priority: 1,
                            forced: true,
                            charlotte: true,
                            audio: 'ext:汤圆神将包/audio:true',
                            filter(event, player) {
                                return event.source && event.source != player && event.source.isLinked() && player.isAlive();
                            },
                            content() {
                                if (player.storage.ty_longnu) {
                                    trigger.nature = 'fire';
                                } else {
                                    trigger.nature = 'thunder';
                                }
                            },
                        },
                    },
                };
                lib.config.all.characters.add('汤圆神将包');
                lib.config.characters.add('汤圆神将包');
                for (var i in QQQ.character) {
                    QQQ.character[i][4].add(`ext:汤圆神将包/image/${i}.jpg`)
                }
                lib.translate['汤圆神将包_character_config'] = `汤圆神将包`;
                return QQQ;
            });
        },
        package: {
            intro: "<br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br></span>",
            author: '无名玩家',
            version: '1.0',
        },
    };
});
