import { lib, game, ui, get, ai, _status } from '../../noname.js';
game.import('extension', function (lib, game, ui, get, ai, _status) {
    return {
        name: '斗破苍穹',
        content(config, pack) {
            lib.group.push('斗破苍穹');
            lib.translate.斗破苍穹 = '穹<br><img src=extension/斗破苍穹/qiong.png width="80" height="16">';
            /*十周年UI武将名背景*/
            var tenUi = document.createElement('style');
            tenUi.innerHTML = ".player>.camp-zone[data-camp='斗破苍穹']>.camp-back {background: linear-gradient(to bottom, rgb(51,161,201), rgb(51,161,201));}";
            /*十周年UI武将势力名*/
            tenUi.innerHTML += ".player>.camp-zone[data-camp='斗破苍穹']>.camp-name {text-shadow: 0 0 5px rgb(51,161,201), 0 0 10px rgb(51,161,201), 0 0 15px rgb(51,161,201);}";
            document.head.appendChild(tenUi);
            lib.translate.ice = '冰';
            lib.nature.set('ice', 90);
            lib.linked.add('ice');
            lib.translate.light = '光';
            lib.nature.set('light', 90);
            lib.linked.add('light');
            lib.translate.dark = '暗';
            lib.nature.set('dark', 90);
            lib.linked.add('dark');
            lib.translate.wind = '风';
            lib.nature.set('wind', 90);
            lib.linked.add('wind');
            lib.translate.gold = '金';
            lib.nature.set('gold', 90);
            lib.linked.add('gold');
            lib.translate.wood = '木';
            lib.nature.set('wood', 90);
            lib.linked.add('wood');
            lib.translate.water = '水';
            lib.nature.set('water', 90);
            lib.linked.add('water');
            lib.translate.soil = '土';
            lib.nature.set('soil', 90);
            lib.linked.add('soil');
        },
        precontent() {
            game.import('character', function (lib, game, ui, get, ai, _status) {
                const QQQ = {
                    name: '斗破苍穹',
                    connect: true,
                    character: {
                        dpcq_xiaoxuner: ['female', '斗破苍穹', 4, ['dpcq_guazhang', 'dpcq_yanfan', 'dpcq_mifa'], ['des:萧薰儿,天蚕土豆所著异世大陆类玄幻小说<斗破苍穹>及其衍生作品的女主角之一.其为古族千金,天之骄女,古族近千年内斗帝血脉觉醒最完美者,拥有异火榜排名第四的金帝焚天炎.萧薰儿个性冷漠但不失温柔,善良不失执着,实力强横,对待他人态度疏离清冷,唯对萧炎温柔体贴,善解人意<br>从小在萧家长大,父亲想给她一个温暖平和的童年,同时派遣她来到了萧家查找并设法取得陀舍古帝玉.有着庞大而神秘的背景——古族.在远古时期其家族(古族)与萧炎的家族(萧族)有着密切的联系.身为古族千金,天之骄女,实力强横,是古族有史以来斗帝血脉觉醒得最完美者.拥有古族神品血脉,异火金帝焚天炎(异火榜排名第四),以及净莲妖火的部分本源.  因小时候被萧炎温养过骨骼经脉,对他不离不弃,并倾心于他.对待他人态度疏离清冷;唯对萧炎温柔体贴,百依百顺,极为亲热.  在乌坦城时与萧炎共进退,在后者沦为废柴的三年中始终安慰和鼓励他,此后陪伴他通过成人礼、经历乌坦城商战、参加迦南学院招生.在迦南学院等待萧炎两年,其间凭借容貌气质与修炼天赋成为学院风云人物.与萧炎等人经历内院选拔赛、火能猎捕赛,在迦南学院内院组建势力磐门;强榜大赛后完胜林修崖,并已实现斗气化翼,晋入斗王,当时年仅十七岁.  后因家族血脉等问题被召回古族.不能在萧炎身边时,便让凌影带回有关他的消息,并陷入长时间深层闭关,一度阻止长老院提出的吞并萧族计划.其间血脉晋入神品,并降服金帝焚天炎,成为当之无愧、没有悬念的古族少主(<少主>一词仅在漫画版中出现,原著中称<小姐>).  在叶城营救萧炎,施展金帝焚天炎,举手投足间击杀和重创多名斗宗、斗尊强者,逼退魂殿、冰河谷众人.  萧炎来古族后,与其进天墓历练.作为此行中实力最强者,率领古、雷、炎甚至魂族众人来到天墓第三层.其间差点击杀魂厉、魂崖.成功阻击魂刁两位斗圣,迎接萧玄现身.与萧炎一同闭关三年,其间因助萧炎修炼萧族族纹而献出自身部分血脉.  多次现身帮助萧炎,先后助其夺得菩提三宝、净莲妖火,并与魂族周旋,削弱其攻击萧炎的力度.在炼化净莲妖火时,自愿用身体承担满溢的能量,实力也得以破格精进.  在古族之难中指挥黑湮军护族,试图夺回古玉,未果.后参加葬天山脉之战、古帝洞府之战、双帝之战.  在大结局时与萧炎举行了一场旷世婚礼,有天地和无数生灵瞩目和见证.  在<武动乾坤>末尾出现,在<大主宰>中已前往大千世界,担任无尽火域主母.  在抗击域外邪族时镇守火域总部以及前敌指挥总部']],
                        dpcq_xiaoyan: ['male', '斗破苍穹', 4, ['dpcq_zhongchi', 'dpcq_huolian', 'dpcq_lianyao', 'dpcq_shiyou'], ['des:萧炎(自称<炎帝>)是天蚕土豆所著小说<斗破苍穹>的男主角(以及衍生作品中的客串角色)他是家族百年内最年轻的斗者,加玛帝国黑岩城最年轻的二品炼药师,而立之年晋升斗帝. 萧炎四岁练气,十二岁成为斗者,却因药尘灵魂在母亲的遗物古戒中吸收他的斗气,导致连续三年功力倒退.后拜药尘为师,双帝之战中击败魂天帝,封印他千载万世,拯救天下苍生<br>前世<br> 萧炎的灵魂并不属于斗气大陆这个世界,其实他是来自一个名叫地球的蔚蓝星球,至于为什么会来到这里,这种离奇经过,他也无法解释,不过在生活了一段时间后他还是后知后觉的明白了过来,他穿越了.<br><br>  今生<br> 萧炎穿越斗气大陆,成为西北大陆加玛帝国中乌坦城萧家的三少爷.资质卓绝,四岁练气,十岁拥有九段斗之气,十一岁突破十段斗之气,成功凝聚斗之气旋,一跃成为家族百年之内最年轻的斗者!<br>  与青梅竹马萧薰儿一起长大,两小无猜,两人实力皆是家中的绝无仅有的佼佼者.  然而天才的道路,总是曲折的.  三年前这名声望达到巅峰的天才少年却突兀接到了有生以来最残酷的打击,他辛辛苦苦修炼十数载方才凝聚的斗之气旋,一夜之间,化为乌有,而且体内的斗之气,也是随着时间的流逝,诡异地退为三段斗之气.  斗之气消失的直接结果,导致其实力不断地后退.从天才的神坛,一夜跌落到了连普通人都不如的地步,沉重的打击,让得少年从此失魂落魄,天才之名,被突如其来的变故剥夺而去.  而天才也是逐渐的被不屑与嘲讽所替代.一夜间,沦落成了路人口中嘲笑的废物!  整整三年时间,家族冷遇,旁人轻视,被纳兰嫣然退婚,种种打击接踵而至.就在他即将绝望的时候,他手上的戒指里浮现出一位苍老灵魂体,一扇全新的大门在面前开启!  三年里斗之气消失的原因竟是母亲唯一留下的遗物戒指从中吸收他的斗气,在药尘灵魂停止吸收萧炎的斗气后,萧炎拜药老为师后,萧炎终于天赋重展,一年时间连连突破,震惊全城.<br>  萧炎重新成为家族年轻一辈中的最强斗者,重新受到众人的仰慕,然而他却不满足于此.在乌坦城中最大的拍卖会行结识了米特尔·雅妃.为了一雪退婚带来的耻辱,与纳兰嫣然定下三年之约,而来到了纳兰家,在药老的帮助下,进一步提升自己的实力.<br>  在魔兽山脉相继结识了小医仙(厄难毒体)、云芝(云岚宗宗主云韵),之后挺进塔戈尔大沙漠后,遇到以丹王古河为首的异火抢夺队伍,在其混战期间混入宫殿,遇见正在吞噬青莲地心火的美杜莎女王(彩鳞),在进化为上古异兽<七彩吞天蟒>(小彩)后,因灵魂被小彩压制,被萧炎收养为宠物.后收服属于自己的第一个本源异火青莲地心火.后又在药老的教导下,成为加玛帝国黑岩城最年轻的二品炼药师.<br>  三年如期而至,负尺践约来到云岚宗,三年之约结果以萧炎胜利告终,之后虽有小风波,但最终也解决了.下云岚宗回到家后,本应该是喜悦庆祝的场景,但噩耗却接踵而至,家族被毁,父亲萧战被云岚宗掳走,族人被打伤.<br>  安顿好萧家,再上云岚宗,与云山大战,绝望之际药老附身对战云山逃离了云岚宗.期间得知云芝姐姐是云岚宗宗主云韵,也心灰意冷.最终,云韵让萧炎躲过云岚宗追击,离开了加玛帝国.  萧炎展开了大逃亡生活,进迦南,收陨落,清门户,灭逆徒,助萧门,建炎盟.三上云岚宗,得知父亲其实在魂殿手里,击杀云山后,解散了云岚宗,可是亲如父的药尘却被魂殿抓去,发誓一定会将药尘救出,从此与魂殿(魂族)不死不休.<br>  自此为着他的执着与信念以及各种的理由,闯荡大陆,在一次次的生死之间,承受着常人所无法承受的痛苦,疯狂的增强着实力,向着大陆巅峰强者迈进.在此期间救药尘、入天墓、活血脉,收服陨落心炎、三千焱炎火、骨灵冷火、海心焰、净莲妖火五种异火.在收服净莲妖火后,青莲地心火、陨落心炎、三千焱炎火、骨灵冷火、海心焰、净莲妖火六种异火融合成具有灵智的火灵(异火凝灵)小伊.  建天府,斗魂族,灭魂殿.与魂天帝大战前受陀舍古帝传承,近而立之年便晋级斗帝境界并自封<炎帝>.随后萧炎依靠异火广场集齐天下二十二种异火,凝聚出异火恒古尺与魂天帝对战,令其处于下风,但仍无法打败他.见此萧炎不得不身化异火,将魂天帝封印于异火广场.<br>  所幸只是肉身毁了而已,两年之后便修炼出了肉身.萧炎履行曾经的承诺,与萧薰儿、彩鳞举办了一场异常盛大的婚礼,那次的婚礼,有着天地以及无数人的见证.之后邀请云韵、雅妃、小医仙等人回到加玛帝国.  在斗气大陆上已拥有二十二种异火(融合后为<帝炎>的雏形). 为了破解远古斗帝失踪之谜,和萧薰儿、彩鳞、古元、烛坤前往大千世界,在位面穿越通道遇到林动一行人.<br>  后遭遇位面乱流,五人不幸分开,萧炎被传送到小西天界遇到洛神族族长洛天神.在洛天神帮助下使斗气同化为灵力,后离开小西天界去寻找妻友.<br>  数十年后独自前往大千世界庞然大物的火灵族,以<炎帝>之名讨要其族内一种异火,以一己之力对抗整个火灵族,最后逼的火灵族毫无还手之力,只能将该族沉睡数万载的火灵老祖唤醒.两人展开一场惊天大战,滔天之炎将一块废弃的大陆都烧成一片虚无,但火灵老祖依然无法取得上风,丝毫奈何不得萧炎,只能拱手认输,任萧炎要了其镇族之火而去.此战之后<炎帝>之名响彻大千世界,最终,萧炎找到两位妻子后,携妻子前往极北之域创立了无尽火域.萧炎初入圣品后摩诃天试图攻占无尽火域,被萧炎击退,此战后无尽火域名动大千世界.数百年后,萧炎踏入圣品后期,无尽火域登顶大千世界最强四大势力之一,镇守大千北面边境,以自身形成屏障,将那域外邪族牢牢钉在大千世界之外.  在天帝陵园中灭掉吞天魔帝一道魔心,后召唤天帝灵影彻底抹杀吞天魔帝.结识牧尘,非常欣赏牧尘并看好其潜力.送给牧尘一道<灯盏>(如果牧尘遇到无法解决的问题,只需点燃此灯,萧炎会感应到,以此来庇护牧尘)以庇护他顺利成长.  牧尘在西天大陆用其赠送信物召唤萧炎相助,一招将西天战皇击败,战皇震惊萧炎实力,加上萧炎给予一枚天至尊都心动的龙凤天尊丹为牧尘争取到上位地至尊战场的大陆之子争夺参赛名额.  在牧尘和摩诃族对战时传话威慑摩诃天,因域外邪族欲解救天邪神,被三位三十二大族的族长拖在无尽火域,数百年前看出了刚从域外闯回大千的秦天被邪族的心魔族族长心天魔帝烙下心魔种子,故而赠送秦天一颗帝炎火珠让其时刻佩戴于身上,数百年后现今的盟约大战中解救了被心天魔帝控制的秦天焚毁其体内的心魔种子,挽救了大千危机.  第四十九次大千盟约时被域外邪族三位三十二大族的族长拖在无尽火域,击败擒住他们后赶到北荒之丘,和武祖联手对抗天邪神,以帝炎配合武祖的八符手挡下了天邪神的黑暗陨星拯救了北荒大陆.  捏死三位天魔帝后与武祖一同召唤世界意志<苍穹榜>,两人在榜上留下姓氏,达到半步超脱圣品的境界(牧尘留下全名后将完全超脱圣品的境界命名为<主宰境>).之后与武祖联手抗衡五目全开的天邪神(在上古时天邪神与不朽大帝大战都只是开了四目),又从天邪神口中得知天邪神最高战力为九目邪神,后来天邪神更是在萧林牧三人的强烈攻势中牺牲自己的血液开启了十目.决战中,牧尘晋入主宰境,最终天邪神被牧尘斩杀,一年修整后参加牧尘婚礼.二十八年后,萧炎与林动荣登苍穹榜,晋升<主宰境>.与林动、牧尘一起成为大千世界的守护者']],
                        dpcq_yunyun: ['female', '斗破苍穹', 3, ['dpcq_fenghua', 'dpcq_fenggang', 'dpcq_xuanwu', 'dpcq_yunsha'], ['des:云韵是玄幻小说<斗破苍穹>中的角色,为云岚宗第九代宗主、纳兰嫣然的老师.云韵于魔兽山脉邂逅萧炎并产生好感,因在萧家与云岚宗的争斗中偏向萧炎而被云卸去宗主之位,宗门被萧炎灭后离开了加玛帝国.萧炎曾多次救她于水火之中,使其彻底放下了萧炎毁掉云岚宗的仇怨,后率领花宗加入天府联盟,与萧炎共同抵抗魂殿<br>云韵秀雅绝俗,自一股轻灵之气,美目流盼,含辞未吐,气若幽兰,就如冰山雪莲般纯洁清丽、素雅高洁.  这个堪称完美卓绝的女子,却因为毫无线索的身世,羁绊不已的身份,命运多舛.  她曾是三星斗皇强者(现为八星斗尊),曾任云岚宗第九代宗主,纳兰嫣然的老师,是萧炎认识的第一个斗皇强者,在与六阶紫晶翼狮王的战斗中被封印实力并且受创昏迷后坠入河中,被萧炎救起.后与萧炎误食春药,自从差点被萧炎做了那事,渐渐的在接触,交往之中对萧炎芳心暗许,情根深种,并在第一次离开之时将陪伴自己多年的贴身内甲赠与萧炎,此内甲曾两次救萧炎于危难之中.  而在塔戈尔大沙漠之时,受古河的邀请前往助其夺取美杜莎女王手中的异火青莲地心火.确实在追到萧炎之后,将珍贵的异火送与萧炎.  因在萧家与云岚宗的争斗中偏向萧炎而被云山卸去宗主之位,并被云山强迫许配给丹王古河,云山希望借此来激怒萧炎,同时拉拢古河.但在举办婚礼时萧炎突然出现,在十招之内击败古河,令古河放弃婚礼并且不再插于萧炎与云岚宗之间的争斗.宗门被灭后,内心挣扎下离开了加玛帝国去到中州.  偶然得到上任花宗宗主花婆婆毕生斗气传承和宗主之位,在萧炎帮助下从花婆婆养女手中夺回宗主之位,现为花宗宗主并完全炼化花婆婆留下的斗气,成为八星斗尊.在菩提古树出世时,她所率领的花宗等人在莽荒古域遭到天冥宗的人偷袭,在关键时候被萧炎一行人救起,并帮助萧炎击败处于九星斗尊巅峰的远古天魔蟒,使得萧炎能在远古天魔蟒的血池中淬炼筋骨.在净莲妖火出世的地方和主角萧炎再次相遇,后花宗加入天府联盟势力,共抵抗魂殿']],
                        dpcq_xiaoyixian: ['female', '斗破苍穹', 3, ['dpcq_yixian', 'dpcq_dusan', 'dpcq_enan', 'dpcq_dujin'], ['des:小医仙是天蚕土豆所著玄幻小说<斗破苍穹>的女主角之一,萧炎的红颜知己之一,体质为厄难毒体,修炼<七彩毒经>,食毒修炼、万毒不侵、通体毒气.小医仙是萧炎在魔兽山脉历练时认识的女孩,因为<厄难毒体>遭追杀,后被萧炎救出并帮其结成毒丹,大结局时独自回到青山镇行医,后被萧炎接到乌坦城一起居住<br>小医仙,萧炎在魔兽山脉历练时认识的女孩,关系极其暧昧,后修炼<七彩毒经>,体格为<厄难毒体>,食毒修炼,万毒不侵,全身是毒,碰谁谁死,白发紫瞳,后前往出云帝国历练.后创立毒宗,绰号<天毒女>,实力已至四星斗宗境界,解开厄难毒体后可与六星斗宗抗衡.收取厄难毒体爆发时产生的毒气,已经进阶到五星斗宗. 后于萧炎一起前往中州,在空间虫洞传送中走散. 因为<厄难毒体>遭冰河谷等势力追杀,后被萧炎、天火尊者等人在落神涧找到,后被萧炎救出并帮其结成毒丹摆脱了厄难毒体.  之后陪同萧炎参加丹塔丹会,丹会结束后萧炎开始收服三千焱炎火,萧炎收服三千焱炎火与小医仙再见面时确认小医仙实力已达三星斗尊(至尊).后来在去古族之前,药老让小医仙去了一处古墓,古墓原主人也同样是厄难毒体的拥有者,并在频临死亡的关头,创造出彻底控制厄难毒体的办法,但是因为厄难毒体已经彻底爆发,最终依然没能成功.小医仙在古墓中找到彻底掌控厄难毒体的方法,从而修炼成功,实力亦达到七星斗尊,并且成为斗气大陆有史以来第一个真正控制厄难毒体的人']],
                        dpcq_yafei: ['female', '斗破苍穹', 4, ['dpcq_paimai', 'dpcq_zhangquan', 'dpcq_chiyi', 'dpcq_yaomei'], ['des:雅妃(全名:米特尔·雅妃,外号<金之女皇>),天蚕土豆所著玄幻小说<斗破苍穹>以及衍生作品中的重要人物,配音是祝俊.萧炎的红颜知己之一,米特尔家族拍卖行首席拍卖师、族长,借助丹药将修为提升到了斗皇<br>米特尔家族拍卖行首席拍卖师,妖娆妩媚,美丽动人,风华绝代.有着将一件废物拍卖成极品商品的高超技术,是个加玛帝国无人不晓的超级拍卖师.  平日笑容满面,看似容易接近,其实对男人都有一定的排斥,许多有钱有势的人不知道在她身上砸了多少钱,可却得不到那些男人们想要的东西.可是却对萧炎有着特殊的好感.在海波东的扶持下已成为家族的掌权人.  原自身实力不强,但精明能干,曾经认出伪装的萧炎,对萧炎有特殊的好感,在萧炎躲避云岚宗追杀时冒生命危险施以援手.  后期,借助丹药提升到斗皇,人称金之女皇.在大结局中,接受萧炎的邀请,跟随萧炎回到了乌坦城,萧炎的红颜知己之一']],
                        dpcq_qinglin: ['female', '斗破苍穹', 3, ['dpcq_qitong', 'dpcq_sheyi', 'dpcq_tianshe', 'dpcq_laoying'], ['des:青鳞是著名的玄幻小说<斗破苍穹>中的人物,石漠城中的小侍女,为人类与蛇人之后,身具<碧蛇三花瞳>可收服蛇形魔兽,被墨家大长老墨承觊觎双眼而抓获,萧炎为了她大闹墨家并击杀墨承,后被天蛇府斗皇强者绿蛮和六阶魔兽八翼黑蛇皇白牙联手自萧炎、海波东手中劫下带回天蛇府培养.其与萧炎在斗圣所留远古遗址相遇.身上含有远古天蛇灵魂(而且还是远古天蛇中最为凶悍的九头天蛇)在太虚古龙龙墓已被炼化,为萧炎一大助力,实力为一星斗圣']],
                        dpcq_nalanyanran: ['female', '斗破苍穹', 4, ['dpcq_feixv', 'dpcq_nijian', 'dpcq_jiaoman', 'dpcq_luoyao'], ['des:纳兰嫣然,玄幻小说<斗破苍穹>及其衍生作品中的女主角之一,云岚宗少宗主. 纳兰嫣然养尊处优,傲气十足.她曾与萧炎指腹为婚,自作主张前往萧家退婚,在三年之约中知晓了萧炎便是岩枭后爱上了萧炎,后来追随老师云韵率花宗强者前往蛮荒古域寻求菩提古树,遭遇天冥宗,几乎被灭,为萧炎所救<br>纳兰嫣然,<斗破苍穹>女主角之一.倾国倾城,傲气十足.曾与萧炎指腹为婚.为了拥有选择自己命运的权利,纳兰嫣然违背爷爷的承诺,毅然去萧家解除婚约.亲自登门毁约.此举使得萧家颜面大失,被萧炎一怒之下休妻,并发誓三年之后上云岚宗一洗当日之辱,但在与萧炎的三年之约时被萧炎打败,在治疗纳兰桀到炼药师大会这段过程中爱上萧炎(岩枭),在三年之约中知晓了萧炎便是岩枭后爱上了萧炎.  败北后进入云岚宗生死门中修炼使实力提升到斗王巅峰.云岚宗被萧炎灭后与云韵一起出游离开加玛帝国.后来在天目山脉遇到萧炎,透露了她和云韵呆在中州的花宗的消息, 如今和云韵留在花宗.药老重掌星陨阁后来向萧炎求助,帮忙云韵控制花宗.后来追随老师云韵率花宗强者前往蛮荒古域寻求菩提古树,遭遇天冥宗,几乎被灭,为萧炎所救.大结局时向云韵传达萧炎的邀请']],
                        dpcq_guhe: ['male', '斗破苍穹', 3, ['dpcq_liandan', 'dpcq_danwang', 'dpcq_qianhe', 'dpcq_minwang'], ['des:古河,天蚕土豆所著玄幻小说<斗破苍穹>中的人物 .号称丹王,六品炼药师(后为七品高级),云岚宗的长老(后为炎盟丹堂堂主),喜欢云韵<br>云韵的追求者,曾深入沙漠蛇人领地寻取异火(青莲地心火)反被萧炎所夺,有一兄长名为古特.已于萧炎结盟.号称丹王.曾经为三星斗皇,六品炼药师(后为七品高级,但无法独自接丹雷),伽玛帝国炼药界第一人']],
                        dpcq_cailing: ['female', '斗破苍穹', 3, ['dpcq_shehuang', 'dpcq_shiyao'], ['des:彩鳞,天蚕土豆<斗破苍穹>女主角之一,美艳无双,加玛帝国塔戈尔大沙漠中蛇人部落女王,因得到异火青莲地心火招来古河为首的队伍与萧炎前来抢夺,在进化为上古异兽<七彩吞天蟒>后被萧炎收养,灵魂被压制.曾因萧炎炼化异火失控而失身于萧炎,失身于萧炎以后,多次帮助萧炎脱离死亡边境,渐渐地对萧炎有复杂的感情,后坐镇炎盟.已为萧炎生有一女,名为萧潇.在解决炎盟危机后与萧炎办了一场简单的婚礼,之后和萧炎返回星陨阁.在斗破苍穹中,最后和萧炎,萧薰儿一同来到大千世界<br>加玛帝国塔戈尔大沙漠中蛇人部落女王,因得到青莲地心火招来古河为首的队伍与萧炎前来抢夺,在进化为上古异兽<七彩吞天蟒>后,被萧炎<收养>,灵魂被压制.萧炎前往云岚宗赴三年之约时现身将云山惊退,后为取得丹药而作为萧炎的保命符.曾因萧炎炼化异火失控而失身于萧炎,失身于萧炎以后,常常将<你的命是我的.>挂在嘴边,多次帮助萧炎脱离死亡边境,后坐镇炎盟.但与萧炎长期相处日久生情,萧炎对其感情也十分复杂.已为萧炎生有一女,名为萧潇(现八星斗圣实力,本体应该是七彩吞天蟒).在解决炎盟危机后与萧炎办了一场简单的婚礼,之后和萧炎返回星陨阁.和萧炎等人前往空间交易所,交易到八彩原石(后来变成九彩原石),与蝎魔三鬼大战,将他们击杀,且负伤,得最后一块古图残片(与净莲妖火有关).前往莽荒古域,帮萧炎围剿天魔蟒并与青鳞收服天魔蟒,到达古域台后,进入菩提古树,陷入幻境,后被萧炎所救.萧炎闭关时,和小医仙,青鳞大战魂殿三天尊,负伤,被闭关出来的萧炎所救.前往九幽黄泉,与妖啸天大战,负伤,萧炎从九幽黄泉出来,将妖啸天击败.得黄泉妖圣的精血和菩提大还丹后,进入九幽黄泉提升实力.一出来就显示恐怖实力,将凰天击成重伤,实力为四星斗圣,在萧炎击败魂天帝后与其完婚.随后在萧炎晋及斗帝后随萧炎进入大千世界,成为无尽火域主母']],
                        dpcq_qicaituntianmang: ['female', '斗破苍穹', 7, ['dpcq_shiyao', 'dpcq_tuntian', 'dpcq_guyi'], ['boss', 'bossallowed', 'des:(此为真身形态)彩鳞,天蚕土豆<斗破苍穹>女主角之一,美艳无双,加玛帝国塔戈尔大沙漠中蛇人部落女王,因得到异火青莲地心火招来古河为首的队伍与萧炎前来抢夺,在进化为上古异兽<七彩吞天蟒>后被萧炎收养,灵魂被压制.曾因萧炎炼化异火失控而失身于萧炎,失身于萧炎以后,多次帮助萧炎脱离死亡边境,渐渐地对萧炎有复杂的感情,后坐镇炎盟.已为萧炎生有一女,名为萧潇.在解决炎盟危机后与萧炎办了一场简单的婚礼,之后和萧炎返回星陨阁.在斗破苍穹中,最后和萧炎,萧薰儿一同来到大千世界<br>加玛帝国塔戈尔大沙漠中蛇人部落女王,因得到青莲地心火招来古河为首的队伍与萧炎前来抢夺,在进化为上古异兽<七彩吞天蟒>后,被萧炎<收养>,灵魂被压制.萧炎前往云岚宗赴三年之约时现身将云山惊退,后为取得丹药而作为萧炎的保命符.曾因萧炎炼化异火失控而失身于萧炎,失身于萧炎以后,常常将<你的命是我的.>挂在嘴边,多次帮助萧炎脱离死亡边境,后坐镇炎盟.但与萧炎长期相处日久生情,萧炎对其感情也十分复杂.已为萧炎生有一女,名为萧潇(现八星斗圣实力,本体应该是七彩吞天蟒).在解决炎盟危机后与萧炎办了一场简单的婚礼,之后和萧炎返回星陨阁.和萧炎等人前往空间交易所,交易到八彩原石(后来变成九彩原石),与蝎魔三鬼大战,将他们击杀,且负伤,得最后一块古图残片(与净莲妖火有关).前往莽荒古域,帮萧炎围剿天魔蟒并与青鳞收服天魔蟒,到达古域台后,进入菩提古树,陷入幻境,后被萧炎所救.萧炎闭关时,和小医仙,青鳞大战魂殿三天尊,负伤,被闭关出来的萧炎所救.前往九幽黄泉,与妖啸天大战,负伤,萧炎从九幽黄泉出来,将妖啸天击败.得黄泉妖圣的精血和菩提大还丹后,进入九幽黄泉提升实力.一出来就显示恐怖实力,将凰天击成重伤,实力为四星斗圣,在萧炎击败魂天帝后与其完婚.随后在萧炎晋及斗帝后随萧炎进入大千世界,成为无尽火域主母']],
                        dpcq_haibodong: ['male', '斗破苍穹', 3, ['dpcq_bingwu', 'dpcq_bingjia', 'dpcq_bingbao', 'dpcq_bingfeng'], ['des:小说<斗破苍穹>中的人物,是前一代加玛帝国十大强者之一,为人性子孤僻自傲,极其擅长冰系斗气,曾经一怒之下,冰封了整整一座城市,在当年地十大强者之中,他是为数不多的斗皇强者,后来曾与云岚宗上任宗主决战云岚山巅,虽然最后落败,可对方也依然胜得不轻松,在上一届地加玛帝国与出云帝国举办的强者大会之上,一人独战对方一名斗皇以及一名斗王,而未落败,艺惊全场.后来到了塔戈尔大沙漠,在偶然间,得到了一块残图.可却因此引来了沙漠中蛇族的皇者,美杜莎女王的追杀,中了她的蛇之封印咒,不仅身体急速衰老,而且连实力,也是被封印在了斗灵级别<br>海波东:冰皇,前一代加玛帝国十大强者之一,现为米特尔家族太上长老,为人性子孤僻自傲,极其擅长冰系斗气.因为得罪美杜莎女王被封印,与萧炎一番误会后,与主角达成交易,让主角去沙漠给他寻找能解他封印的药并且若能成功解除封印就给他一种异火的地图,萧炎和药老为其解除封印.后来萧炎用复灵子丹诱惑海波东为他做一年的免费打手.在萧炎与云岚宗冲突期间多次出手相助,后更在魂殿,云岚宗屠杀萧家时出手救下幸存者.与萧炎关系不错.实力为斗皇巅峰.天赋极佳,有望成为斗宗']],
                        dpcq_yaolao: ['male', '斗破苍穹', 3, ['dpcq_xvling', 'dpcq_lenghuo', 'dpcq_moding', 'dpcq_gujie'], ['des:本名药尘,通称药老.实力斗尊时被称为药尊者,后进阶斗圣被称为药圣.小说<斗破苍穹>中重要人物,可以说是整部小说的引子,主角萧炎的师傅<br>本为远古八大种族之一药族的族人,因受药万归陷害被逐出药族,凭借自己的努力,打出中州第一炼药师的名号,且实力达到九转斗尊巅峰,因炼药师身份交友不少,萧炎眼中药老年轻时情债也不少,如丹塔三巨头之一的玄衣、花宗太上长老青仙子,热爱自由,不愿依附组织,也因此加上炼药术高超被魂殿盯上,后因自己从小养大的弟子韩枫的背叛出卖而陨落,幸亏灵魂强大加上骨灵冷火得以保全灵魂,沉睡在戒指中,直至遇上萧炎,吸收了萧炎三年斗之气后灵魂修复,看好萧炎而收萧炎为徒,在萧炎未成长起来的时候一直帮助萧炎修炼、传授知识、收复异火,视萧炎为子,是萧炎修炼道路上极为重要的人,为了帮萧炎报复云岚宗,在云岚山被魂殿鹜护法抓走关在魂殿分殿,成为萧炎在解散云岚宗后不断努力、疯狂修炼的极大动力,几年后被萧炎等成功救出并复活,因复活材料极为上等,复活后一举冲到半圣层次,被救出后为避免重蹈覆辙决定正式管理星陨阁,后成为天府联盟盟主,达到斗圣层次.  小说描述药老有一挚友为风尊者古灵(本名风闲,被药老用骨灵冷火救了以后为了纪念二人的友谊改名为古灵)为星陨阁副阁主,四星斗尊,药老曾用骨灵冷火救其性命,风尊者一直视其为生死之交,即便药老在其弟子韩枫对外宣称所谓炼丹反噬的情况下依然不曾放弃,四处寻找药老踪迹,实力为斗尊.  在萧炎,风尊者,铁剑尊者(曾受药老大恩),天火尊者(曜天火),小医仙,紫研合力之下被从魂殿救出,且现已获得身体(身体为被风尊者斩杀的四星斗尊,右臂为斗圣遗骸),获得肉体后实力达到高级半圣,后炼化黄泉妖圣的精血,实力达到一星斗圣.将在<大主宰>客串']],
                        dpcq_ziyan: ['female', '斗破苍穹', 4, ['dpcq_manli', 'dpcq_yinling', 'dpcq_longxie', 'dpcq_longyin'], ['des:紫妍(绰号:蛮力王)是中国网络小说<斗破苍穹>中的人物,是内院强榜第一高手,实力斗王,太虚古龙皇的女儿,后成为太虚古龙第一代龙皇,本体乃太虚古龙,因误食化形草而变成人身,与萧炎很是亲密.她对天地灵物有特殊感应,能召唤屠龙剑,并可以短时间内使身体变大<br>内院强榜第一高手,实力斗王,本体乃太虚古龙,是太虚古龙皇的女儿.因误食化形草而变成人身,绰号<蛮力王>,与萧炎很是亲密.与萧炎一同前往中州(书中说为解开其身世之谜), 在空间虫洞中遭遇空间风暴而分离,后感应到族人,留书回家了!因受不了族中提升实力的方式,在萧炎丹会期间出现在丹界与萧炎重逢,并且帮助萧炎取得三千焱炎火.在协助萧炎从魂殿手中救出药尘,并获得魂婴果后跟随黑擎返回太虚古龙族.后于萧炎前往远古遗址,得到龙凤本源果.被家族中高手带回.现在因为服用龙凰本源果,导致能量实体化,化成了一个没有一丝生机的晶体人,后被萧炎用异火所救.现在王族血脉已大成,成为太虚古龙族新一代的龙皇']],
                        dpcq_xiaoding: ['male', '斗破苍穹', 4, ['dpcq_motie', 'dpcq_muling'], ['des:萧鼎是天蚕土豆作品<斗破苍穹>人物之一,萧炎的长兄,漠铁城漠铁佣兵团团长.萧炎大哥,漠铁佣兵团团长,木属斗气,与萧炎感情深厚,三年前离开萧家为失去斗气的萧炎开创了漠铁佣兵团,被青鳞当做大哥看待. 在漠铁佣兵团时曾与萧炎一起寻找青莲地心火,由于属性是木系,极容易察觉木气浓厚的沙漠中的火性气息<br>在加玛帝国内率领萧家残存族人逃过云岚宗追杀.六百八十章与云岚宗展开决战时证实晋级斗灵,逃亡时被一支附毒的冷箭射伤导致双腿瘫痪,之后经萧炎治疗双腿已回复能行动了,而且实力更进一步.后期修为精进至斗皇巅峰,三弟萧炎晋升斗帝后激活了他的斗帝血脉,修为更进一步']],
                        dpcq_xiaoli: ['male', '斗破苍穹', 4, ['dpcq_leiming', 'dpcq_shisheng'], ['des:萧厉,天蚕土豆作品<斗破苍穹>中的人物之一,萧炎的二哥,漠铁佣兵团副团长,黑角域萧门门主<br>与萧炎感情深厚,在萧炎被陨落心炎拖入地底岩浆后以为萧炎死了,为了报复,机缘巧合下通过服用噬生丹而使实力暴涨到斗王级别,但通过噬生丹增强实力的副作用是生命力(只能活三年),命不久矣.通过服用萧炎炼制的青冥寿丹延长了十年寿命,并在此期间突破斗皇与噬生丹的药力反噬,活了下来.  在黑角域创建<萧门>,与迦南学院的<磐门>组成联盟,磐门的学生可进入萧门进行历练,给萧门注入新鲜血液,最终经过与老牌势力的争斗,萧门成为黑角域的顶尖势力.同时萧门与珈玛帝国的炎盟遥相呼应.  参与剿灭魔炎谷,得地阶功法及地阶斗技各一卷']],
                        dpcq_yunshan: ['male', '斗破苍穹', 4, ['dpcq_yunlan'], ['des:云山,天蚕土豆所著玄幻小说<斗破苍穹>中的重要配角,云岚宗第八代宗主,云韵的师父,闭关多年在魂殿的帮助下成为斗宗强者. 闭关期间因云棱被打败而出手对付萧炎,更派人配合魂殿追杀萧家.后被前来复仇的萧炎击杀,魂魄被魂殿护法吞噬引爆,尸身被萧炎收取作为给药老炼制躯体的主材料,后来炼制了天火尊者的躯体<br>云岚宗前任宗主,云韵师父,后来闭关多年在魂殿的帮助下成为斗宗强者,云棱被杀而出手对付萧炎,更派人配合魂殿追杀萧家.后被前来复仇的萧炎击杀,魂魄被魂殿护法吞噬引爆,尸身被萧炎收取作为给药老炼制躯体的主材料,后来炼制了天火尊者的躯体']],
                        dpcq_xiaozhan: ['male', '斗破苍穹', 4, ['dpcq_shigang', 'dpcq_jueduan'], ['des:由于漫画原著的萧战图片作者实在是接受不了,这里引用了药老的图(有句话叫做:<一日为师终身为父>,既然萧战等于萧炎他爹,药老等于萧炎他爹,那么药老等于萧战,嗯,逻辑成立,完美!)<br>萧战,天蚕土豆所著玄幻小说<斗破苍穹>中的人物,萧炎的父亲.大斗师修为,后晋升至斗皇.非常宠爱萧炎,萧炎被认为是废物的那一段时间给萧炎很大鼓励<br>萧炎的父亲,在三年之约后失踪,实为被云山勾结魂殿掳走,被关在魂界,魂族怕其死于非命,所以喂其大量丹药,以致在魂天帝以萧战性命作威胁讨要陀舍古帝玉,萧炎以陀舍古帝玉换回萧战时萧战修为晋升至斗皇,后居住于星陨阁.在萧炎晋升斗帝后体内斗帝血脉被激活,修为大涨']],
                        dpcq_ruoling: ['female', '斗破苍穹', 4, ['dpcq_mantuo', 'dpcq_yvshui'], ['des:出自小说天蚕土豆的<斗破苍穹>中的人物之一,是主角萧炎,以及萧薰儿等迦南学院的导师,为人亲和,主角萧炎在请假时与她交过手<br>使用的武器是一条镶嵌有水属性蛇魔兽的魔核长鞭,本身斗气为水属性<br>(易错知识:鞭为一种由金属制的棒型打击武器,有像刀剑一样的握柄,打击部有节状且最前端有尖.在中国被归类为十八般兵器中的一种冷兵器.中国的<鞭>分为两种,其一为策,用以驱马,驾车,其二为鞭,用以行刑,或当作武器使用.作为武器用的鞭有棱有节,与之相似的锏则无棱无节)']],
                        dpcq_wuhao: ['male', '斗破苍穹', 3, ['dpcq_xuesha', 'dpcq_xiuluo'], ['des:吴昊,别名血剑吴昊&血修罗,天蚕土豆所著玄幻小说<斗破苍穹>中的人物,迦南学院执法队成员.修炼血色斗气,嗜血,对萧炎的实力心服口服并发誓有一天要战胜萧炎,也是个光明磊落的主.进入内院后与萧炎、萧薰儿以及琥嘉结为一个团体,关系不错. 手持血色重剑. 实力:最后为斗宗巅峰']],
                        dpcq_liuqing: ['male', '斗破苍穹', 4, ['dpcq_baqiang', 'dpcq_lieyan'], ['des:霸枪柳擎——内院强榜前十的顶尖高手,内院之中能胜过他的学员,屈指可数,另外,他在竞技场中,是为数不多曾经保持了八连胜的强悍家伙,除内院魔兽化身紫妍外,曾惜败林修崖.因表妹柳菲与萧炎结怨,强榜大赛中与萧炎死拼到最后不分胜负,最终裁定并列强榜第十.目前为内院长老,与萧炎内榜大战后关系缓和.后跟随萧炎前往云岚宗,帮萧炎复仇后回到中州柳家继承柳家家主.经萧炎帮助下,3年内掌管中州天黄城空间虫洞.与萧炎的关系从刚开始的敌人最后变成了好友']],
                        dpcq_hanfeng: ['male', '斗破苍穹', 3, ['dpcq_xinyan', 'dpcq_shishi'], ['des:天蚕土豆的小说<斗破苍穹>中的人物,六品炼药师,药尘的大弟子,与主角萧炎为同门师兄弟. 后三次与萧炎较量,皆被其以佛怒火莲击败,后因将自己的海心焰贡献给魂殿尊老,得到一具斗宗躯体将灵魂融入其中因而晋入了斗宗(四星左右),现已被再度击杀并捕获灵魂,海心焰为慕骨老人所有(现已归萧炎所有)<br>在小的时候受慕骨老人挑拨让其夺取<焚决>,在魂殿的帮助下成功暗杀药尘,但在骨灵冷火的帮助下让药尘的灵魂逃脱.并对外宣称药尘死在炼药时遭受反噬而死.但因风尊者不相信韩枫的话,持续逼问韩枫,为了不暴露出药尘死在自己手上从而离开中州,躲在黑角域.  到后来六品颠峰炼药师,拥有异火< 海心焰>,可异火实体化.<陨落心炎>爆发期间纠集大批强者入侵内院却被萧炎重伤击退,后在黑角域组建黑盟与迦南学院相对峙.在与萧炎二度交手肉身死亡后,其灵魂被魂殿吸走,身家则被萧炎获取,后因将自己的海心焰贡献给魂殿尊老,得到一具斗宗躯体将灵魂融入其中因而晋入了斗宗(四星左右).现已被再度击杀并捕获灵魂,海心焰为慕骨老人所有(现已归萧炎所有)']],
                        dpcq_xiaomei: ['female', '斗破苍穹', 4, ['dpcq_qingwu', 'dpcq_yisui'], ['des:萧媚,萧家之女,人如其名,十分妩媚,而又十分清纯,这种矛盾的美,却不让人感到不适,反而让人感到如莲花一般的美.幼年因萧炎天才之名关系极好,萧炎斗气消失之后,慢慢疏远了他,萧炎斗气回复,萧媚想努力修复关系,去无法修复那宛如鸿沟般的裂痕,萧媚感到极其后悔.萧媚的天资较为出众一些,进入迦南学院修炼,后进入磐门,成为磐门的一份子<br>萧媚 　　 <斗破苍穹>人物之一. 　　萧炎表妹,容貌清纯中带妩媚,矛盾之美使其称得上美女一名. 　　在萧炎三年废物时期之前喜欢萧炎,与萧炎的关系不下于萧熏儿,萧炎沦为废物后疏远了萧炎,在萧炎回复天才之名后想要与萧炎回复关系,但因已伤害了萧炎,被萧炎冷落不屑.后萧炎心中看开,对其温和许多,但却比不上从前亲密']],
                        dpcq_linxiuya: ['male', '斗破苍穹', 4, ['dpcq_lianren', 'dpcq_qianchan'], ['des:林修崖,迦南学院内院强榜前第二高手,在内院组建了势力<狼牙>,在萧炎初入内院时,林修崖和<狼牙>(内院学生势力之一)是人人忌惮的极强大的存在.<狼牙>以成员少而精著称,萧炎也曾因为见到<狼牙>中人个个实力不弱而赞叹不已.林修崖外貌十分俊朗,在内院极具个人魅力.在强榜大赛之后的表演赛中被萧薰儿在十分钟内击败,进而对薰儿暗生情愫.曾跟随萧炎去云岚宗复仇.大约为七八星斗皇强者(根据柳擎的实力推断出来的),和萧炎之间关系不错']],
                        dpcq_linyan: ['male', '斗破苍穹', 4, ['dpcq_baoyan', 'dpcq_xinxi'], ['des:林焱,天蚕土豆所著玄幻小说<斗破苍穹>中的人物,内院强榜前五的顶尖高手,内院之中能胜过他的学员,屈指可数<br>内院强榜前五高手,萧炎曾为其驱除火毒从而换取青木仙藤,现已成为萧炎的追随者兼好友.曾跟随萧炎前往云岚宗复仇,后来参加四方阁大会与萧炎相遇.实力为四星斗皇(现应为斗宗),与萧炎一起前往丹域.现被留在柳家']],
                        dpcq_qinlong_huanling: ['female', 'shen', 4, ['qinlong_huanling', 'qinlong_zhendong'], ['des:生日纪念武将<br>镇东圣兽——青龙<br>青龙是中国古代神话中的天之四灵之一,源于远古星宿崇拜,是代表太昊与东方七宿的东方之神,于八卦为震、巽,于五行主木,象征四象中的少阳,四季中的春季.汉时谶纬学说兴起,它的象征含义又多了生机、甲乙、仁德,汉后道教将其吸纳为护法神,称孟章神君. <淮南子>卷三 记载:天神之贵者,莫贵于青龙.故而青龙或为四象之首']],
                        dpcq_baihu_huanling: ['female', 'shen', 4, ['baihu_huanling', 'baihu_zhenxi'], ['des:生日纪念武将<br>镇南圣兽——白虎<br>白虎在中国传统文化中是道教西方七宿星君四象之一,被称为西方之神和战伐之神,是中国远古时代神话传说中的四大神兽之一,出自<淮南子>中的五兽之一. 它具有避邪、禳灾、祈丰及惩恶扬善、发财致富、喜结良缘等多种神力,是权势、尊贵的象征.根据五行学说,它是代表西方的灵兽,因西方属金,色白,故称白虎,代表的季节是秋季']],
                        dpcq_zhuque_huanling: ['female', 'shen', 3, ['zhuque_huanling', 'zhuque_zhennan'], ['des:生日纪念武将<br>镇西圣兽——朱雀<br>朱雀是中国古代神话中的天之四灵之一,源于远古星宿崇拜,是代表炎帝与南方七宿的南方之神,于八卦为离,于五行主火,象征四象中的老阳,四季中的夏季. 在先秦被认为能接引死者灵魂上升于天,后世认为其能予人长生.汉时谶纬学说大兴,它的象征含义又多了典藏、丙丁、礼德,汉后道教将其吸纳为护法神,称陵光神君. <淮南子>中的五兽之一,即青龙、白虎、朱雀、玄武,黄龙,又称天官五兽.现代很多人将其认为是凤凰或是凤凰的一种,但实际上作为天之四灵与四方星宿之一的朱雀与礼记四灵之一的凤凰存在极大的不同,汉代认为朱雀生下了凤凰. 亓鑫铭所著<泛亚论>称古越国以朱雀为图腾,在甘肃等地区至今仍有祭祀朱雀等四象的民俗存在']],
                        dpcq_xuanwu_huanling: ['female', 'shen', 5, ['xuanwu_huanling', 'xuanwu_zhenbei'], ['des:生日纪念武将<br>镇北圣兽——玄武<br>玄武是中国古代神话中的天之四灵之一,源于远古星宿崇拜,是二十八宿按东南西北分为四象中的北方玄武七宿.形象是龟和蛇组合成的一种灵物,于八卦为坎,于五行主水,象征四象中的老阴,四季中的冬季.汉时谶纬学说兴起,它的象征含义又多了幽冥、壬癸、智德,汉后道教将其吸纳为护法神,称执明神君,后为真武大帝']],
                    },
                    skill: {
                        zbjn: {
                            subSkill: {
                                haizhixinjiaA: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    _priority: 7,
                                    filter(event, player) {
                                        if (event.player.hujia < 1) return true;
                                    },
                                    content() {
                                        player.changeHujia(Math.round(player.maxHp - player.hp));
                                        player.draw(Math.round(player.hp));
                                    },
                                    forced: true,
                                },
                                haizhixinjiaB: {
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    _priority: 3,
                                    filter(event, player) {
                                        if (event.player.hujia > 0) return true;
                                    },
                                    content() {
                                        player.chooseToDiscard(player.hujia, true).ai = function (card) {
                                            return 8 - get.value(card);
                                        };
                                        player.changeHujia(-player.hujia);
                                    },
                                    forced: true,
                                },
                                shijiu: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    _priority: -1,
                                    filter(event, player) {
                                        if (player.countCards('he') >= player.hp) return true;
                                    },
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = player.maxHp;
                                        var C = event.num;
                                        if (C < A && A > 2) return false;
                                        if (A > 2 && A == B) return false;
                                        if (B - A < 4 && A > 2) return false;
                                        if (B < 4) return true;
                                        return true;
                                    },
                                    prompt: '是否发动:狮鹫',
                                    content() {
                                        'step 0';
                                        player.chooseToDiscard(player.hp, 'he').ai = function (card) {
                                            return 8 - get.value(card);
                                        };
                                        ('step 1');
                                        if (result.bool) {
                                            player.loseMaxHp();
                                            player.changeHujia();
                                            trigger.cancel();
                                            if (trigger && trigger.source) {
                                                trigger.source.damage(player, trigger.num);
                                            }
                                        }
                                    },
                                },
                                xuanzhongchi: {
                                    trigger: {
                                        player: 'shaBegin',
                                    },
                                    filter(event, player) {
                                        if (player.countCards('h') > 0) return true;
                                    },
                                    check(event, player) {
                                        if (get.attitude(player, event.player) > 0) return true;
                                    },
                                    prompt: '是否发动:玄重尺',
                                    logTarget: 'target',
                                    content() {
                                        'step 0';
                                        player.chooseToDiscard('h').ai = function (card) {
                                            return 8 - get.value(card);
                                        };
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.target.addTempSkill('qinggang2');
                                            var next = trigger.target.chooseToRespond({ name: 'shan' });
                                            next.autochoose = lib.filter.autoRespondShan;
                                            next.ai = function (card) {
                                                if (trigger.target.countCards('h', 'shan') > 1) {
                                                    return ai.get.unuseful2(card);
                                                }
                                                return -1;
                                            };
                                            player.addTempSkill('zbjn_xuanzhongchiB');
                                        }
                                        ('step 2');
                                        if (result.bool == false) {
                                            trigger.untrigger();
                                            trigger.directHit = true;
                                        }
                                    },
                                    group: ['zbjn_xuanzhongchiA'],
                                },
                                xuanzhongchiA: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha';
                                    },
                                    content() {
                                        player.changeHujia();
                                    },
                                },
                                xuanzhongchiB: {
                                    trigger: {
                                        source: 'dieAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha';
                                    },
                                    content() {
                                        player.gainMaxHp();
                                    },
                                },
                                qicaidujing: {
                                    trigger: {
                                        player: 'loseHpBegin',
                                    },
                                    _priority: 958658,
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                        player.hp = player.hp + 1;
                                        player.update();
                                    },
                                    group: ['zbjn_qicaidujingA', 'zbjn_qicaidujingB', 'zbjn_qicaidujingC'],
                                },
                                qicaidujingA: {
                                    trigger: {
                                        player: 'recoverBegin',
                                    },
                                    _priority: 9656355,
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                        player.hp = player.hp - 1;
                                        player.update();
                                    },
                                },
                                qicaidujingB: {
                                    trigger: {
                                        player: 'phaseAfter',
                                    },
                                    _priority: 9588635,
                                    forced: true,
                                    content() {
                                        player.gain(game.createCard('du'))._triggered = null;
                                    },
                                },
                                qicaidujingC: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    _priority: 563865,
                                    forced: true,
                                    content() {
                                        trigger.player.chooseToDiscard('he', true, Math.abs(player.countCards - player.hp));
                                        if (trigger.player.countCards('h') == 0) {
                                            trigger.player.gainMaxHp(-1);
                                            trigger.player.recover();
                                            trigger.player.update();
                                        }
                                    },
                                },
                            },
                        },
                        spjn: {
                            subSkill: {
                                douqigongfa: {
                                    content() {
                                        'step 0';
                                        player.draw();
                                        player.recover();
                                        var num = get.rand(1, 100);
                                        if (num <= 100 && num > 47) {
                                            event.goto(1);
                                        }
                                        if (num <= 47 && num > 17) {
                                            event.goto(2);
                                        }
                                        if (num <= 17 && num > 5) {
                                            event.goto(3);
                                        }
                                        if (num <= 5) {
                                            event.goto(4);
                                        }
                                        ('step 1');
                                        if (num <= 100 && num > 72) {
                                            var numDA = get.rand(1, 1);
                                            if (numDA == 1) {
                                                player.addSkill('dj_DAtieshanquan');
                                            }
                                        }
                                        if (num <= 72 && num > 38) {
                                            var numDB = get.rand(1, 1);
                                            if (numDB == 1) {
                                                player.addSkill('dj_DBsanshaci');
                                            }
                                        }
                                        if (num <= 38) {
                                            var numDC = get.rand(1, 1);
                                            if (numDC == 1) {
                                                player.addSkill('dj_DCsuishizhang');
                                            }
                                        }
                                        event.finish();
                                        ('step 2');
                                        if (num <= 100 && num > 79) {
                                            var numCA = get.rand(1, 1);
                                            if (numCA == 1) {
                                                player.addSkill('dj_CAxizhang');
                                            }
                                        }
                                        if (num <= 79 && num > 49) {
                                            var numCB = get.rand(1, 1);
                                            if (numCB == 1) {
                                                player.addSkill('dj_DAtieshanquan');
                                            }
                                        }
                                        if (num <= 49) {
                                            var numCC = get.rand(1, 1);
                                            if (numCC == 1) {
                                                player.addSkill('dj_DBsanshaci');
                                            }
                                        }
                                        event.finish();
                                        ('step 3');
                                        if (num <= 100 && num > 71) {
                                            var numBA = get.rand(1, 1);
                                            if (numBA == 1) {
                                                player.addSkill('dj_DCsuishizhang');
                                            }
                                        }
                                        if (num <= 71 && num > 38) {
                                            var numBB = get.rand(1, 1);
                                            if (numBB == 1) {
                                                player.addSkill('dj_CAxizhang');
                                            }
                                        }
                                        if (num <= 38) {
                                            var numBC = get.rand(1, 1);
                                            if (numBC == 1) {
                                                player.addSkill('dj_DAtieshanquan');
                                            }
                                        }
                                        event.finish();
                                        ('step 4');
                                        if (num <= 100 && num > 80) {
                                            var numAA = get.rand(1, 1);
                                            if (numAA == 1) {
                                                player.addSkill('dj_DBsanshaci');
                                            }
                                        }
                                        if (num <= 80 && num > 50) {
                                            var numAB = get.rand(1, 1);
                                            if (numAB == 1) {
                                                player.addSkill('dj_DAtieshanquan');
                                            }
                                        }
                                        if (num <= 50) {
                                            var numAC = get.rand(1, 1);
                                            if (numAC == 1) {
                                                player.addSkill('dj_CAxizhang');
                                            }
                                        }
                                        event.finish();
                                    },
                                },
                            },
                        },
                        dj: {
                            subSkill: {
                                DCsuishizhang: {
                                    init(player) {
                                        player.storage.DCsuishizhang;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '黄阶·低级<br>碎石掌',
                                        content: '非锁定技<br>你即将造成伤害时,可弃置两张牌令此伤害加一(不足则全弃)',
                                    },
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        if (player.countCards('he') > 0) return true;
                                    },
                                    check(event, player) {
                                        if (get.attitude(player, event.player) >= 0) return false;
                                    },
                                    prompt: '是否发动:碎石掌',
                                    content() {
                                        'step 0';
                                        var A = ['碎石掌!'].randomGet();
                                        player.say(A);
                                        player.chooseToDiscard(2, 'he', true);
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.num++;
                                        }
                                    },
                                },
                                DBsanshaci: {
                                    init(player) {
                                        player.storage.DBsanshaci;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '黄阶·中级<br>三鲨刺',
                                        content: '非锁定技<br>回合内限一次,你可以获得两张杀并选择一名角色,视为对其使用一张决斗',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    prompt: '是否发动:三鲨刺',
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        'step 0';
                                        var A = ['受死吧!', '三鲨刺!'].randomGet();
                                        player.say(A);
                                        player.gain(game.createCard('sha'))._triggered = null;
                                        player.gain(game.createCard('sha'))._triggered = null;
                                        ('step 1');
                                        player.useCard({ name: 'juedou' }, event.target, false).animate = false;
                                    },
                                    ai: {
                                        order: 358,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                DAtieshanquan: {
                                    init(player) {
                                        player.storage.DAtieshanquan;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '黄阶·高级<br>铁山拳',
                                        content: "非锁定技 蓄力技<br>你每使用一张牌可弃置一张牌并获得一个'拳'标记,当你即将造成伤害时,若你的标记数量不小于其当前体力值,你可令此伤害加一且目标需弃置等同于你标记数量的牌,若其没有牌则再令此伤害加一;不论结果如何,你在结算后移去所有标记并获得一点护甲",
                                    },
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        if (player.storage.dj_DAtieshanquanA >= event.player.hp) return true;
                                    },
                                    check(event, player) {
                                        if (get.attitude(player, event.player) >= 0) return false;
                                    },
                                    prompt: '是否发动:铁山拳',
                                    content() {
                                        'step 0';
                                        var A = ['铁山拳!', '看我蓄力一击!'].randomGet();
                                        player.say(A);
                                        trigger.num++;
                                        trigger.player.chooseToDiscard(player.storage.dj_DAtieshanquanA, 'he', true);
                                        if (trigger.player.countCards('he') == 0) {
                                            trigger.num++;
                                        }
                                        ('step 1');
                                        player.removeMark('dj_DAtieshanquanA', player.storage.dj_DAtieshanquanA);
                                        player.changeHujia();
                                    },
                                    group: ['dj_DAtieshanquanA'],
                                },
                                DAtieshanquanA: {
                                    init(player) {
                                        player.storage.DAtieshanquanA = 0;
                                    },
                                    marktext: '拳',
                                    intro: {
                                        name: '铁山拳',
                                        content: '蓄劲层数:#层',
                                    },
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    filter(event, player) {
                                        if (player.countCards('he') > 0) return true;
                                    },
                                    prompt: '是否发动:铁山拳',
                                    content() {
                                        'step 0';
                                        player.chooseToDiscard('he', true).ai = function (card) {
                                            return 8 - get.value(card);
                                        };
                                        ('step 1');
                                        if (result.bool) {
                                            player.addMark('dj_DAtieshanquanA');
                                        }
                                    },
                                },
                                CAxizhang: {
                                    init(player) {
                                        player.storage.CAxizhang;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌(初学乍练)',
                                        content: '非锁定技<br>回合内限一次,你可以选择一名角色,视为对其使用一张过河拆桥',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        player.addMark('dj_CAxizhangE', 5);
                                        player.useCard({ name: 'guohe' }, event.target, false).animate = false;
                                    },
                                    ai: {
                                        order: 321,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                    group: ['dj_CAxizhangE'],
                                },
                                CAxizhangA: {
                                    init(player) {
                                        player.storage.CAxizhangA;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌(至极天衍)',
                                        content: '非锁定技<br>回合内限一次,你可以选择一名角色,选择弃置或获得该角色,等同于你已损体力值加一张牌,若此时你已受伤,你回复一点体力,否则该角色流失一点体力',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseControl('拿牌', '弃牌');
                                        ('step 1');
                                        var A = '拿牌';
                                        var B = '弃牌';
                                        if (result.control == A) {
                                            player.gainPlayerCard(Math.max(1, player.maxHp - player.hp + 1), event.target, 'he');
                                            if (player.maxHp > player.hp) {
                                                player.recover();
                                            } else {
                                                event.target.loseHp();
                                            }
                                        }
                                        if (result.control == B) {
                                            player.discardPlayerCard(Math.max(1, player.maxHp - player.hp + 1), event.target, 'he');
                                            if (player.maxHp > player.hp) {
                                                player.recover();
                                            } else {
                                                event.target.loseHp();
                                            }
                                        }
                                    },
                                    ai: {
                                        order: 369,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                CAxizhangB: {
                                    init(player) {
                                        player.storage.CAxizhangB;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌(登峰造极)',
                                        content: '非锁定技<br>回合内限一次,你可以选择一名角色,至多获得其等同于你已损体力值加一张牌',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        player.gainPlayerCard(Math.max(1, player.maxHp - player.hp + 1), event.target, 'he');
                                        player.addMark('dj_CAxizhangE', 5);
                                    },
                                    ai: {
                                        order: 357,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                CAxizhangC: {
                                    init(player) {
                                        player.storage.CAxizhangC;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌(略有所成)',
                                        content: '非锁定技<br>回合内限一次,你可以选择一名角色,至多弃置其等同于你已损体力值加一张牌',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        player.discardPlayerCard(Math.max(1, player.maxHp - player.hp + 1), event.target, 'he');
                                        player.addMark('dj_CAxizhangE', 4);
                                    },
                                    ai: {
                                        order: 321,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                CAxizhangD: {
                                    init(player) {
                                        player.storage.CAxizhangD;
                                    },
                                    marktext: '技',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌(登堂入室)',
                                        content: '非锁定技<br>回合内限一次,你可以选择一名角色,视为对其使用一张顺手牵羊',
                                    },
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (player.maxHp >= player.hp) return false;
                                        return true;
                                    },
                                    content() {
                                        player.useCard({ name: 'shunshou' }, event.target, false).animate = false;
                                        player.addMark('dj_CAxizhangE', 6);
                                    },
                                    ai: {
                                        order: 321,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                CAxizhangE: {
                                    init(player) {
                                        player.storage.CAxizhangE = 0;
                                    },
                                    marktext: '吸',
                                    mark: true,
                                    intro: {
                                        name: '玄阶·低级<br>吸掌',
                                        content: '熟练度#%',
                                    },
                                    trigger: {
                                        player: 'useSkillAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.parent.skill == 'dj_CAxizhang') return true;
                                        if (event.parent.skill == 'dj_CAxizhangD') return true;
                                        if (event.parent.skill == 'dj_CAxizhangC') return true;
                                        if (event.parent.skill == 'dj_CAxizhangB') return true;
                                        if (event.parent.skill == 'dj_CAxizhangA') return true;
                                    },
                                    content() {
                                        if (player.storage.CAxizhangE == 20) {
                                            player.addSkill('dj_CAxizhangD');
                                            player.removeSkill('dj_CAxizhang');
                                        }
                                        if (player.storage.CAxizhangE == 50) {
                                            player.addSkill('dj_CAxizhangC');
                                            player.removeSkill('dj_CAxizhangD');
                                        }
                                        if (player.storage.CAxizhangE == 70) {
                                            player.addSkill('dj_CAxizhangB');
                                            player.removeSkill('dj_CAxizhangC');
                                        }
                                        if (player.storage.CAxizhangE == 100) {
                                            player.addSkill('dj_CAxizhangA');
                                            player.removeSkill('dj_CAxizhangB');
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_zhongchi: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBegin',
                            },
                            round: 3,
                            forced: true,
                            _priority: 90,
                            filter(event, player) {
                                if (!event.player.hasSkill('dpcq_zhongchi_A')) return true;
                                return false;
                            },
                            content() {
                                player.addSkill('dpcq_zhongchi_A');
                                player.removeSkill('dpcq_zhongchi_B');
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'shaBegin',
                                    },
                                    nobracket: true,
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = player.maxHp;
                                        if (A > 2) return true;
                                        if (B > 3) return true;
                                        return !get.attitude(player, event.player) > 0;
                                    },
                                    logTarget: 'target',
                                    content() {
                                        var A = ['焰分噬浪尺!'].randomGet();
                                        player.say(A);
                                        player.loseMaxHp();
                                        trigger.target.damage('fire');
                                        player.addSkill('dpcq_zhongchi_B');
                                        player.removeSkill('dpcq_zhongchi_A');
                                        player.addMark('dpcq_lianyao', 1);
                                        player.changeHujia();
                                    },
                                    ai: {
                                        order: 9,
                                    },
                                    init(player) {
                                        player.storage.A;
                                    },
                                    mark: true,
                                    marktext: '尺',
                                    intro: {
                                        name: '玄重尺',
                                        content: "非锁定技<br>每当你使用杀指定目标后,你可减一点体力上限,令其额外受到一点火焰伤害,将此技能转化为'极'",
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    _priority: 9,
                                    check(event, player) {
                                        if (get.attitude(player, event.player) >= 0) return false;
                                    },
                                    prompt: '是否发动:八极崩',
                                    content() {
                                        var A = ['八极崩!'].randomGet();
                                        trigger.source.say(A);
                                        trigger.player.addMark('dpcq_zhongchi_C', trigger.num * trigger.source.hp);
                                        trigger.player.addSkill('dpcq_zhongchi_C');
                                    },
                                    init(player) {
                                        player.storage.B;
                                    },
                                    mark: true,
                                    marktext: '极',
                                    intro: {
                                        name: '八极崩',
                                        content: "非锁定技<br>你每造成一次伤害,目标获得等同于此次伤害量与你体力值之积的'劲'标记<br>拥有'劲'标记的角色,在其回合开始阶段需进行一次判定<br>如果判定点数大于'劲'标记,其需弃置与'劲'标记相同数量的牌,你摸一张牌;若目标没有手牌,则受到来自你的一点伤害,你获得一点护甲<br>如果判定点数小于'劲'标记,其受到来自你的一点伤害并减少一点体力上限,你回复一点体力(未受伤则增加一点体力上限)<br>如果判定点数等于'劲'标记,其摸两张牌<br>(不论结果如何,其在结算后移除所有'劲'标记)",
                                    },
                                },
                                C: {
                                    _priority: 7,
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_zhongchi_C > 0) return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.judge();
                                        ('step 1');
                                        game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_zhongchi')) {
                                                if (result.card.number > player.storage.dpcq_zhongchi_C) {
                                                    if (player.countCards('h') > 0) {
                                                        player.chooseToDiscard(player.storage.dpcq_zhongchi_C, 'he', true);
                                                        current.draw();
                                                    } else {
                                                        player.damage(current);
                                                        current.changeHujia();
                                                    }
                                                } else if (result.card.number < player.storage.dpcq_zhongchi_C) {
                                                    player.damage(current);
                                                    current.recover();
                                                    if (current.maxHp == current.hp) {
                                                        current.gainMaxHp();
                                                    }
                                                    player.loseMaxHp();
                                                } else if (result.card.number == player.storage.dpcq_zhongchi_C) {
                                                    player.draw(2);
                                                }
                                            }
                                        });
                                        player.removeMark('dpcq_zhongchi_C', player.storage.dpcq_zhongchi_C);
                                        player.removeSkill('dpcq_zhongchi_C');
                                    },
                                    init(player) {
                                        player.storage.C;
                                    },
                                    marktext: '劲',
                                    intro: {
                                        name: '暗劲',
                                        content: '层数:#',
                                    },
                                },
                            },
                            group: ['dpcq_zhongchi_roundcount'],
                        },
                        dpcq_huolian: {
                            nobracket: true,
                            group: ['dpcq_huolian_A', 'dpcq_huolian_B', 'dpcq_huolian_C', 'dpcq_huolian_D', 'dpcq_huolian_E'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    _priority: 13,
                                    filter(event, player) {
                                        return event.nature == 'fire' && event.notLink();
                                    },
                                    content() {
                                        var A = ['异火!现!'].randomGet();
                                        player.say(A);
                                        trigger.num++;
                                    },
                                    forced: true,
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    popup: false,
                                    _priority: -6,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        player.recover();
                                    },
                                    forced: true,
                                },
                                C: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 72,
                                    content() {
                                        trigger.source.addMark('dpcq_huolian_C', trigger.num);
                                    },
                                    init(player) {
                                        player.storage.C;
                                    },
                                    marktext: '莲',
                                    intro: {
                                        name: '火莲印记',
                                        content: '数量:#',
                                    },
                                },
                                D: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    _priority: 18,
                                    filter(event, player) {
                                        if (player.storage.dpcq_huolian_C >= 5 && player.storage.dpcq_huolian_C < 9) return true;
                                        return false;
                                    },
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = player.storage.dpcq_huolian_C;
                                        if (A >= 2) return true;
                                        return false;
                                    },
                                    content() {
                                        'step 0';
                                        player
                                            .chooseTarget(function (card, player, target) {
                                                return target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) < 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            target = result.targets[0];
                                            var A = ['佛怒火莲!', '<font color=#FF0000>嘿嘿嘿嘿…</font>'].randomGet();
                                            player.say(A);
                                            target.damage(2, 'fire');
                                            player.removeMark('dpcq_huolian_C', player.storage.dpcq_huolian_C);
                                            player.loseHp();
                                            player.gainMaxHp();
                                            player.turnOver();
                                            player.$fullscreenpop('<font color=#FF0000>佛怒火莲</font>');
                                        }
                                    },
                                },
                                E: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    _priority: 98,
                                    filter(event, player) {
                                        if (player.storage.dpcq_huolian_C >= 9) return true;
                                        return false;
                                    },
                                    content() {
                                        'step 0';
                                        var HP = player.maxHp - player.hp;
                                        player
                                            .chooseTarget([1, HP], true, function (card, player, target) {
                                                return target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) < 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            var A = result.targets[0];
                                            A.damage('fire');
                                            event.targets = result.targets.slice(0).sortBySeat();
                                            event.list = event.targets.slice(0);
                                        }
                                        ('step 2');
                                        if (event.targets.length) {
                                            var A = ['佛怒火莲!', '<font color=#FF0000>嘿嘿嘿嘿…</font>'].randomGet();
                                            player.say(A);
                                            var target = event.targets.shift();
                                            target.damage(1, 'fire');
                                            player.removeMark('dpcq_huolian_C', player.storage.dpcq_huolian_C);
                                            player.loseHp(2);
                                            player.gainMaxHp();
                                            player.$fullscreenpop('<font color=#FF0000>佛怒火莲</font>');
                                            event.redo();
                                        }
                                    },
                                    forced: true,
                                },
                            },
                        },
                        dpcq_lianyao: {
                            init(player) {
                                player.storage.dpcq_lianyao;
                            },
                            trigger: {
                                player: 'phaseEnd',
                            },
                            _priority: -3,
                            forced: true,
                            nobracket: true,
                            content() {
                                player.addMark('dpcq_lianyao');
                            },
                            marktext: '丹',
                            intro: {
                                name: '练药',
                                content: '数量:#',
                            },
                            group: ['dpcq_lianyao_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (player.hp < player.maxHp && player.storage.dpcq_lianyao >= 3) return true;
                                        return false;
                                    },
                                    content() {
                                        'step 0';
                                        player.removeMark('dpcq_lianyao', 3);
                                        player.recover();
                                        ('step 1');
                                        if (result.bool) {
                                            if (player.hp < player.maxHp && player.storage.dpcq_lianyao >= 3) {
                                                event.goto(0);
                                            } else {
                                                event.finish();
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_shiyou: {
                            init(player) {
                                player.storage.dpcq_shiyou = 0;
                            },
                            marktext: '佑',
                            intro: {
                                name: '师佑',
                                content: '数量:#',
                            },
                            trigger: {
                                player: 'changeHp',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                player.draw(player.storage.dpcq_shiyou);
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.storage.dpcq_shiyou;
                                },
                            },
                            group: ['dpcq_shiyou_A', 'dpcq_shiyou_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    _priority: -7,
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_shiyou >= 3) return true;
                                    },
                                    content() {
                                        player.loseHp();
                                        player.gainMaxHp();
                                        player.removeMark('dpcq_shiyou', player.storage.dpcq_shiyou);
                                    },
                                    ai: {
                                        order: 1,
                                        result: {
                                            player(player) {
                                                if (player.hp > 1) return 1;
                                            },
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    _priority: 10,
                                    filter(event, player, source) {
                                        if ((event.num > 1 && event.player.storage.dpcq_shiyou < 3) || (event.player.hp <= event.source.hp && event.player.storage.dpcq_shiyou < 3)) return true;
                                        return false;
                                    },
                                    content() {
                                        var A = ['药老:小家伙,看好了', '药老:有点棘手啊…', '药老:有点东西……'].randomGet();
                                        player.say(A);
                                        trigger.num--;
                                        player.addMark('dpcq_shiyou', 1);
                                        player.addMark('dpcq_huolian_C', 1);
                                    },
                                    forced: true,
                                },
                            },
                        },
                        dpcq_yanfan: {
                            trigger: {
                                player: 'damageBegin',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                'step 0';
                                if (player.hujia <= 0) {
                                    player.judge('dpcq_yanfan', function (card) {
                                        return get.color(card) == 'red' ? 1 : -1;
                                    });
                                }
                                ('step 1');
                                if (result.judge > 0) {
                                    trigger.cancel();
                                    if (trigger && trigger.source) {
                                        trigger.source.damage();
                                    }
                                } else {
                                    player.addMark('dpcq_tianyan', 1);
                                }
                            },
                        },
                        dpcq_guazhang: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            nobracket: true,
                            check(event, player) {
                                if (get.attitude(player, event.player) >= 0) return false;
                            },
                            content() {
                                'step 0';
                                trigger.player.judge();
                                ('step 1');
                                switch (result.suit) {
                                    case 'heart':
                                        trigger.source.recover() && trigger.player.damage();
                                        break;
                                    case 'diamond':
                                        trigger.source.draw() && trigger.player.chooseToDiscard('he', true);
                                        break;
                                    case 'spade':
                                        trigger.player.recover() && trigger.player.goMad({ player: 'phaseEnd' });
                                        break;
                                    case 'club':
                                        trigger.player.draw() && trigger.player.turnOver();
                                        break;
                                }
                            },
                        },
                        dpcq_mifa: {
                            trigger: {
                                player: 'dying',
                            },
                            derivation: ['dpcq_tianyan'],
                            nobracket: true,
                            _priority: 10,
                            forced: true,
                            filter(event, player) {
                                return !player.storage.dpcq_mifa;
                            },
                            content() {
                                'step 0';
                                player.$fullscreenpop('<font color=#FF00FF>秘法</font>');
                                ('step 1');
                                if (player.storage.dpcq_tianyan < player.maxHp) {
                                    player.loseMaxHp();
                                    player.hp = player.maxHp;
                                    player.addMark('dpcq_tianyan', 3);
                                } else if (player.storage.dpcq_tianyan >= player.maxHp) {
                                    player.removeMark('dpcq_tianyan', player.storage.dpcq_tianyan);
                                    player.hp = player.maxHp;
                                }
                                ('step 2');
                                player.addSkill('dpcq_tianyan');
                                player.awakenSkill('dpcq_mifa');
                            },
                            init(player) {
                                player.storage.dpcq_mifa;
                            },
                            mark: true,
                            intro: {
                                name: '秘法',
                                content: '未发动',
                            },
                            group: ['dpcq_mifa_A'],
                            subSkill: {
                                A: {
                                    enable: 'phaseUse',
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_tianyan >= event.player.maxHp + event.player.hp) return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.$fullscreenpop('<font color=#FF00FF>秘法</font>');
                                        player.gainMaxHp();
                                        ('step 1');
                                        player.recover(player.storage.dpcq_tianyan - (player.maxHp + player.hp - 1));
                                        ('step 2');
                                        player.removeMark('dpcq_tianyan', player.storage.dpcq_tianyan);
                                        player.addSkill('dpcq_tianyan');
                                        player.awakenSkill('dpcq_mifa');
                                    },
                                    ai: {
                                        order: 9,
                                        result: {
                                            player(player, target, card) {
                                                if (player.hp == 1) return 1;
                                                if (player.maxHp > player.hp && player.storage.dpcq_tianyan >= player.maxHp - player.hp) return 1;
                                                return 0;
                                            },
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                            },
                        },
                        dpcq_tianyan: {
                            init(player) {
                                player.storage.dpcq_tianyan;
                            },
                            trigger: {
                                player: 'phaseEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_tianyan > 0) return true;
                            },
                            check(event, player) {
                                var A = player.hp;
                                var B = player.maxHp;
                                if (A >= 1) return true;
                                else if (A == B) return true;
                                return false;
                            },
                            prompt: '选择一名角色对其连续两次造成一点火焰伤害<br>(此技能先造成伤害后流失体力,觉得自己运气好的话可配合卦掌使用)',
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    var A = ['金帝焚天炎!', '哼!<br> ╯^╰ ', '萧炎哥哥…熏儿……尽力了……'].randomGet();
                                    player.say(A);
                                    target.damage(1, 'fire');
                                    target.damage(1, 'fire');
                                    player.removeMark('dpcq_tianyan', 1);
                                    if (player.hp > 1) {
                                        player.loseHp();
                                        player.gainMaxHp();
                                    } else if (player.hp < 2) {
                                        player.addMark('dpcq_tianyan', 1);
                                    }
                                }
                            },
                            marktext: '炎',
                            intro: {
                                name: '天炎',
                                content: '#枚天炎印记',
                            },
                            group: ['dpcq_tianyan_A'],
                            subSkill: {
                                A: {
                                    mod: {
                                        maxHandcard(player, num) {
                                            return num + player.storage.dpcq_tianyan;
                                        },
                                    },
                                },
                            },
                            ai: {
                                order: 9,
                            },
                        },
                        dpcq_fenghua: {
                            trigger: {
                                player: ['useCard', 'respondAfter'],
                            },
                            forced: true,
                            nobracket: true,
                            _priority: -7,
                            filter(event, player) {
                                return get.color(event.card) == 'black';
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'black' ? 1 : -1;
                                });
                                ('step 1');
                                if (result.bool) {
                                    if (player.hp == player.maxHp) {
                                        var A = ['不知他现在…还好吗', '风华绝代倾城色<br>心系他方盼归乡', '…药…岩………', '怎么到哪都有这个小混蛋……'].randomGet();
                                        player.say(A);
                                        player.draw();
                                    } else if (player.hp < player.maxHp) {
                                        var A = ['不知他现在…还好吗', '风华绝代倾城色<br>心系他方盼归乡', '…药…岩………', '怎么到哪都有这个小混蛋……'].randomGet();
                                        player.say(A);
                                        player.recover();
                                        player.removeMark('dpcq_xuanwu', 1);
                                    }
                                }
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return (num = player.hp + 2);
                                },
                            },
                        },
                        dpcq_fenggang: {
                            audio: 'ext:斗破苍穹/audio:true',
                            nobracket: true,
                            enable: ['chooseToUse', 'chooseToRespond'],
                            filterCard(card, player) {
                                return get.color(card) == 'black';
                            },
                            viewAs: {
                                name: 'sha',
                                nature: 'thunder',
                            },
                            position: 'he',
                            viewAsFilter(player) {
                                if (!player.countCards('he', { color: 'black' })) return false;
                            },
                            prompt: '将一张黑色牌当雷杀打出',
                            check() {
                                return 1;
                            },
                            ai: {
                                respondShan: true,
                                skillTagFilter(player) {
                                    if (!player.countCards('h', { color: 'black' })) return false;
                                },
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'respondSha') && current < 0) return 0.6;
                                    },
                                },
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                    target(player, target) {
                                        if (
                                            player.hasSkill('jiu') &&
                                            !target.hasSkillTag('filterDamage', null, {
                                                player: player,
                                                card: { name: 'sha' },
                                            })
                                        ) {
                                            if (get.attitude(player, target) > 0) {
                                                return -7;
                                            } else {
                                                return -4;
                                            }
                                        }
                                        return -1.5;
                                    },
                                },
                                order() {
                                    if (_status.event.player.hasSkillTag('presha', true, null, true)) return 10;
                                    return 3;
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                            },
                            group: ['dpcq_fenggang_A'],
                            subSkill: {
                                A: {
                                    mod: {
                                        targetInRange(card, player) {
                                            if (card.name == 'sha' && get.color(card) == 'black') return true;
                                        },
                                    },
                                },
                            },
                        },
                        dpcq_xuanwu: {
                            enable: 'phaseUse',
                            nobracket: true,
                            _priority: 10,
                            content() {
                                var A = ['烈风旋疾,风灵剑舞!'].randomGet();
                                player.say(A);
                                player.loseHp();
                                player.addMark('dpcq_xuanwu', 1);
                                player.draw(Math.min(2, player.maxHp - player.hp + 1));
                            },
                            init(player) {
                                player.storage.dpcq_xuanwu = 0;
                            },
                            marktext: '旋',
                            intro: {
                                name: '旋舞',
                                content: '数量:#',
                            },
                            ai: {
                                order: 2,
                                result: {
                                    player(player) {
                                        var A = player.hp;
                                        var B = player.maxHp;
                                        var C = player.storage.dpcq_xuanwu;
                                        if (C < 2) return 1;
                                        if (B == A && C >= 2 && A > 1) return 1;
                                        if (A - 1 <= 2 * (C + 1) && A > 1) return 1;
                                        return 0;
                                    },
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                            group: ['dpcq_xuanwu_A', 'dpcq_xuanwu_B'],
                            subSkill: {
                                A: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return num + player.storage.dpcq_xuanwu;
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    _priority: -6,
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_xuanwu >= 2 * player.hp) return true;
                                    },
                                    content() {
                                        player.recover();
                                        if (player.hujia < 2) {
                                            player.changeHujia();
                                        }
                                        player.draw();
                                    },
                                },
                            },
                        },
                        dpcq_yunsha: {
                            trigger: {
                                player: 'dyingBegin',
                            },
                            audio: 'ext:斗破苍穹/audio:true',
                            nobracket: true,
                            _priority: 10,
                            forced: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_xuanwu >= event.player.maxHp) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        var A = target.hp;
                                        var B = target.hujia;
                                        var C = A + B;
                                        if (2 >= A && B == 0) return 9;
                                        if (C - 2 < 0) return 6;
                                        if (C - 2 == 0) return 5;
                                        if (B >= 2) return 1;
                                        return get.attitude(player, target) <= 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    player.removeMark('dpcq_xuanwu', player.maxHp);
                                    target.damage(2, 'thunder');
                                    player.recover();
                                    player.loseMaxHp();
                                    player.$fullscreenpop('风之极·陨杀', 'thunder');
                                    var A = ['风之极·陨杀!'].randomGet();
                                    player.say(A);
                                }
                            },
                            group: ['dpcq_yunsha_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'dieBegin',
                                    },
                                    forced: true,
                                    audio: 'ext:斗破苍穹/audio:true',
                                    content() {
                                        event.finish();
                                    },
                                },
                            },
                        },
                        dpcq_yixian: {
                            chat: ['别担心,很快就不痛了'],
                            nobracket: true,
                            enable: 'phaseUse',
                            filterCard: {
                                color: 'red',
                            },
                            filter(event, player) {
                                return player.countCards('he', { color: 'red' }) > 0;
                            },
                            position: 'he',
                            usable: 1,
                            check(card) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            content() {
                                player.chat(lib.skill.dpcq_yixian.chat[player.countMark('dpcq_yixian')]);
                                target.recover();
                                target.draw();
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        if (target.hp == 1) return 5;
                                        if (player == target && player.countCards('h') > player.hp) return 5;
                                        return 2;
                                    },
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                        },
                        dpcq_dusan: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filterCard: {
                                color: 'black',
                            },
                            filter(event, player) {
                                return player.countCards('he', { color: 'black' }) > 0;
                            },
                            position: 'he',
                            usable: 1,
                            check(card) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp > target.maxHp) return false;
                                return true;
                            },
                            content() {
                                var A = ['不要以为我是女孩子,就好欺负哦', '出门在外,总得有点手段才行啊'].randomGet();
                                player.say(A);
                                player.gain(game.createCard('du'))._triggered = null;
                                target.draw();
                                target.goMad({ player: 'phaseBegin' });
                            },
                            ai: {
                                order: 65,
                                result: {
                                    target: -1,
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                        },
                        dpcq_enan: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                var A = ['呃!', '别碰我!'].randomGet();
                                player.say(A);
                                player.draw();
                                if (player.maxHp < 4) {
                                    player.gainMaxHp();
                                } else if (player.hp == 1) {
                                    player.loseMaxHp();
                                    player.loseHp();
                                }
                            },
                            group: ['dpcq_enan_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    filter(event, player) {
                                        if (player.hp == 1) return true;
                                    },
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                        player.loseMaxHp();
                                        player.loseHp();
                                    },
                                },
                            },
                        },
                        dpcq_dujin: {
                            nobracket: true,
                            ai: {
                                skillTagFilter(player) {
                                    if (!player.countCards('h', 'du')) return false;
                                },
                                respondSha: true,
                            },
                            audio: 'ext:斗破苍穹/audio:2',
                            trigger: {
                                player: ['useCardBegin'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.card.name == 'du' && event.cards.length == 1) return true;
                                return false;
                            },
                            _priority: 678658,
                            content() {
                                'step 0';
                                player.discard(player.getCards('h', 'du').randomGet());
                                ('step 1');
                                trigger.cancel();
                                player.useCard({ name: 'jiu' }, player, false).animate = false;
                            },
                            group: ['dpcq_dujin_cancel'],
                            subSkill: {
                                cancel: {
                                    trigger: {
                                        player: ['loseHpBegin'],
                                    },
                                    _priority: 65578658,
                                    nobracket: true,
                                    forced: true,
                                    content() {
                                        'step 0';
                                        event.num = Math.min(trigger.num, 9);
                                        ('step 1');
                                        trigger.cancel();
                                        player.recover();
                                        ('step 2');
                                        event.num--;
                                        if (event.num > 0) {
                                            event.goto(1);
                                        }
                                        var A = ['我的功法可是百毒不侵的', '嘻嘻!你的毒对我没有效果哦!', '毒？我可是吃着它长大的呢!'].randomGet();
                                        player.say(A);
                                    },
                                },
                            },
                        },
                        dpcq_paimai: {
                            chat: ['接下来的这件……价高者得……成交!'],
                            nobracket: true,
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.countCards('h') == 0) return false;
                                return game.hasPlayer(function (current) {
                                    return current.countCards('h');
                                });
                            },
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player.canCompare(target);
                            },
                            content() {
                                'step 0';
                                player.chooseToCompare(target);
                                ('step 1');
                                if (result.bool) {
                                    if (
                                        game.hasPlayer(function (player) {
                                            return player != target && target.inRange(player);
                                        })
                                    ) {
                                        player.removeMark('dpcq_zhangquan', 1);
                                        player.chooseToDiscard('he', true);
                                        target.draw(2);
                                        event.finish();
                                    } else {
                                        event.finish();
                                    }
                                } else {
                                    player.chat(lib.skill.dpcq_paimai.chat[player.countMark('dpcq_paimai')]);
                                    player.addMark('dpcq_zhangquan', 1);
                                    player.draw(3);
                                    target.chooseToDiscard('he', true);
                                }
                                ('step 2');
                                if (result.targets?.length) {
                                    target.line(result.targets[0], 'green');
                                    result.targets[0].damage(target);
                                }
                            },
                            ai: {
                                order: 0.5,
                                result: {
                                    player(player) {
                                        if (player.countCards('h') < player.maxHp) return 1;
                                        else if (player.storage.dpcq_zhangquan <= player.maxHp + player.hp) return 1;
                                    },
                                },
                                expose: 0.2,
                            },
                        },
                        dpcq_zhangquan: {
                            init(player) {
                                player.storage.dpcq_zhangquan = 1;
                            },
                            forced: true,
                            trigger: {
                                player: 'phaseEnd',
                            },
                            filter(event, player) {
                                if (event.player.storage.dpcq_zhangquan > 0) return true;
                            },
                            _priority: 6287,
                            content() {
                                player.draw(player.storage.dpcq_zhangquan);
                                var A = ['还真是多亏了萧炎小弟弟呢', '谢谢海老,雅妃一定不辜负您的期望'].randomGet();
                                player.say(A);
                            },
                            nobracket: true,
                            mark: true,
                            marktext: '权',
                            intro: {
                                name: '掌权',
                                content: '管理级别:#级',
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.storage.dpcq_zhangquan;
                                },
                            },
                            group: ['dpcq_zhangquan_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    _priority: 935945,
                                    forced: true,
                                    content() {
                                        if (trigger.player.hp <= trigger.source.storage.dpcq_zhangquan) {
                                            trigger.num++;
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_chiyi: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, player) {
                                if (player.sex == 'female' && event.source.sex == 'male') return true;
                            },
                            _priority: 6285,
                            content() {
                                var A = ['男人可真是种麻烦的生物!', '也不知道萧炎小弟弟,现在怎么样了……'].randomGet();
                                player.say(A);
                                if (trigger.source.countCards('h') > 0) {
                                    trigger.source.chooseToDiscard('he', true);
                                } else {
                                    player.addMark('dpcq_zhangquan', 1);
                                }
                                player.draw();
                            },
                        },
                        dpcq_yaomei: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_zhangquan > 0) return true;
                            },
                            _priority: 635814,
                            check(event, player) {
                                var A = player.hp;
                                var B = player.maxHp;
                                var C = player.storage.dpcq_zhangquan;
                                if (A < B && C > 2) return true;
                                else if (A == B && C > B) return true;
                                else if (A == 1) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    player.removeMark('dpcq_zhangquan', 1);
                                    var A = ['客人,请您先休息一会儿', '客人稍待,雅妃定会给您一个满意的结果!'].randomGet();
                                    player.say(A);
                                    target.turnOver();
                                    target.draw();
                                }
                            },
                        },
                        dpcq_qitong: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            round: 2,
                            nobracket: true,
                            check(event, player) {
                                if (get.attitude(player, event.player) >= 0) return false;
                            },
                            content() {
                                var A = ['乖,听话', '要乖哦,可不要伤了别人', '少爷,它们其实很听话的啦!'].randomGet();
                                trigger.source.say(A);
                                trigger.source.draw();
                                trigger.source.addMark('dpcq_tianshe', 1);
                                trigger.source.recover();
                                trigger.player.draw();
                                trigger.player.goMad({ player: 'damageEnd' });
                            },
                            group: ['dpcq_qitong_roundcount'],
                        },
                        dpcq_sheyi: {
                            nobracket: true,
                            forced: true,
                            mod: {
                                globalTo(from, player, current) {
                                    if (player.hp > 0) return current + (player.maxHp - player.hp);
                                },
                            },
                            ai: {
                                threaten: 0.8,
                            },
                        },
                        dpcq_tianshe: {
                            init(player) {
                                player.storage.dpcq_tianshe = 3;
                            },
                            trigger: {
                                player: 'phaseEnd',
                            },
                            mark: true,
                            nobracket: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_tianshe > 0) return true;
                            },
                            check(event, player) {
                                var A = player.hp;
                                var B = player.maxHp;
                                var C = event.player.hp;
                                if (A > B / 2) return true;
                                else if (C > 1) return true;
                                else if (A + B < C) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    var A = ['要乖哦,可不要伤了别人'].randomGet();
                                    player.say(A);
                                    target.damage();
                                    player.loseHp();
                                    player.changeHujia();
                                    if (target.countCards('he') > 0) {
                                        target.chooseToDiscard(target.maxHp - target.hp, 'he', true);
                                    } else if (target.countCards('he') == 0) {
                                        target.loseMaxHp();
                                    }
                                    player.removeMark('dpcq_tianshe', 1);
                                }
                            },
                            marktext: '蛇',
                            intro: {
                                name: '天蛇',
                                content: '可发动次数:#',
                            },
                            ai: {
                                order: 9,
                            },
                        },
                        dpcq_laoying: {
                            trigger: {
                                player: 'dieBegin',
                            },
                            nobracket: true,
                            _priority: 10,
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    player.$fullscreenpop('<font color=#00FF00>碧蛇三花瞳</font>');
                                    target.goMad();
                                    player.removeSkill('dpcq_laoying');
                                }
                            },
                            ai: {
                                order: 10,
                            },
                        },
                        dpcq_nijian: {
                            enable: 'phaseUse',
                            nobracket: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_feixv_B > 0) return true;
                            },
                            check(event, player) {
                                return get.effect(event.target, { name: 'sha' }, player, player) > 0;
                            },
                            content() {
                                var A = ['风灵·分形剑!'].randomGet();
                                player.say(A);
                                player.getStat().card.sha = 0;
                                player.removeMark('dpcq_feixv_B', 1);
                                player.draw();
                            },
                            ai: {
                                order: 3,
                                result: {
                                    player(player) {
                                        if (player.storage.dpcq_feixv_B > 1) return 1;
                                        else if (player.maxHp == player.hp) return 1;
                                    },
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                        },
                        dpcq_feixv: {
                            nobracket: true,
                            group: ['dpcq_feixv_A', 'dpcq_feixv_B', 'dpcq_feixv_C'],
                            subSkill: {
                                A: {
                                    init(player) {
                                        player.storage.A;
                                    },
                                    trigger: {
                                        player: ['useCard', 'respond'],
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha';
                                    },
                                    content() {
                                        player.addMark('dpcq_feixv_A', 1);
                                    },
                                    marktext: '瞬',
                                    intro: {
                                        name: '瞬',
                                        content: '进攻距离加#',
                                    },
                                    forced: true,
                                },
                                B: {
                                    init(player) {
                                        player.storage.B;
                                    },
                                    marktext: '闪',
                                    intro: {
                                        name: '闪',
                                        content: '防御距离加#',
                                    },
                                    trigger: {
                                        player: ['useCard', 'respond'],
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'shan';
                                    },
                                    content() {
                                        player.addMark('dpcq_feixv_B', 1);
                                    },
                                    forced: true,
                                },
                                C: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    _priority: 999,
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_feixv_A >= 1 && event.player.storage.dpcq_feixv_B >= 1) return true;
                                    },
                                    content() {
                                        player.draw(player.storage.dpcq_feixv_A + player.storage.dpcq_feixv_B);
                                        player.removeMark('dpcq_feixv_A', player.storage.dpcq_feixv_A);
                                        player.removeMark('dpcq_feixv_B', player.storage.dpcq_feixv_B);
                                        player.recover();
                                    },
                                    forced: true,
                                },
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    if (from.storage.dpcq_feixv_A > 0) return distance - from.storage.dpcq_feixv_A;
                                },
                                globalTo(from, to, distance) {
                                    if (to.storage.dpcq_feixv_B > 0) return distance + to.storage.dpcq_feixv_B;
                                },
                            },
                        },
                        dpcq_jiaoman: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                var A = ['哼!', '本小姐的事情,本小姐自己来管!', '你还没那个资格!'].randomGet();
                                trigger.source.say(A);
                                trigger.player.draw();
                                trigger.source.draw();
                                trigger.player.chooseToDiscard('he', true);
                            },
                            group: ['dpcq_jiaoman_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    _priority: 64,
                                    forced: true,
                                    content() {
                                        var A = ['dpcq_feixv_A', 'dpcq_feixv_B'].randomGet();
                                        player.addMark(A);
                                    },
                                },
                            },
                        },
                        dpcq_luoyao: {
                            trigger: {
                                player: 'phaseEnd',
                            },
                            nobracket: true,
                            filter(event, player) {
                                if (event.player.storage.dpcq_feixv_A > 0) return true;
                            },
                            check(event, player) {
                                var A = player.hp;
                                var B = player.maxHp;
                                var C = player.storage.dpcq_feixv_A;
                                var D = player.storage.dpcq_feixv_B;
                                if (A == B) return true;
                                else if (A == 1) return true;
                                else if (C > 1) return true;
                                else if (C > 1 && D > 0) return true;
                                else if (A < B && C < 3 && D > 0) return false;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) <= 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    var A = ['风之极·落日耀!'].randomGet();
                                    player.say(A);
                                    player.$fullscreenpop('<font color=#C0C0C0>落日耀</font>');
                                    player.removeMark('dpcq_feixv_A', 1);
                                    player.addMark('dpcq_feixv_B', 1);
                                    target.damage('thunder');
                                }
                            },
                            ai: {
                                order: 5,
                                expose: 0.5,
                                threaten: 5,
                            },
                        },
                        dpcq_liandan: {
                            nobracket: true,
                            init(player) {
                                player.storage.dpcq_liandan;
                            },
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'h',
                            filterCard: true,
                            selectCard: [1, Infinity],
                            prompt: '弃置任意张牌并获得等量的丹药',
                            check(card) {
                                return 7 - get.value(card);
                            },
                            filter(event, player) {
                                if (!event.player.storage.dpcq_liandan > 0) return true;
                            },
                            content() {
                                var A = cards.length;
                                player.addMark('dpcq_liandan', A);
                            },
                            marktext: '丹',
                            intro: {
                                name: '炼丹',
                                content: '已有#枚丹药',
                            },
                            ai: {
                                order: 6,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        dpcq_danwang: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filterCard: true,
                            filter(event, player) {
                                if (event.player.countCards('he') > 0 && event.player.storage.dpcq_liandan > 0) return true;
                            },
                            position: 'he',
                            check(card) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp >= target.maxHp) return false;
                                return true;
                            },
                            content() {
                                var A = ['某不才,仅有些许疗效不错的丹药', '有阁下这般强者相助,此事定能成功!'].randomGet();
                                player.say(A);
                                player.removeMark('dpcq_liandan', 1);
                                target.recover();
                                target.changeHujia();
                            },
                            ai: {
                                order: 9,
                                result: {
                                    target(player, target) {
                                        if (target.hp == 1) return 5;
                                        if (player == target && player.countCards('h') > player.hp) return 5;
                                        return 2;
                                    },
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                        },
                        dpcq_qianhe: {
                            nobracket: true,
                            mod: {
                                targetEnabled(card, player, target, now) {
                                    if (target.storage.dpcq_liandan == 0) {
                                        if (get.color(card) == 'black' && player != target) return false;
                                    }
                                },
                            },
                        },
                        dpcq_minwang: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            filter(event, player) {
                                if (event.player.storage.dpcq_liandan > 1) return true;
                            },
                            content() {
                                var A = ['呵,在下乃是当王古河!', '不知阁下可愿卖我一个面子!', '阁下愿是助我,报酬什么的好说'].randomGet();
                                player.say(A);
                                player.removeMark('dpcq_liandan', 2);
                                trigger.cancel();
                                player.draw();
                                if (trigger && trigger.source) {
                                    trigger.source.draw(2);
                                }
                            },
                        },
                        dpcq_shehuang: {
                            nobracket: true,
                            group: ['dpcq_shehuang_A', 'dpcq_shehuang_B', 'dpcq_shehuang_C'],
                            mod: {
                                globalFrom(from, to, distance) {
                                    if (from.hp > 0) return distance - (from.hp - 1);
                                },
                                globalTo(from, to, distance) {
                                    if (to.hp > 0) return distance + (to.maxHp - to.hp);
                                },
                            },
                            ai: {
                                threaten: 0.8,
                            },
                            subSkill: {
                                A: {
                                    init(player) {
                                        player.storage.A;
                                    },
                                    trigger: {
                                        player: ['phaseEnd', 'damageEnd'],
                                    },
                                    _priority: 6595,
                                    content() {
                                        var A = ['识相的赶紧滚开!', '看来你们是活腻了!', '给本王等着,一定让你们痛不欲生'].randomGet();
                                        player.say(A);
                                        player.addMark('dpcq_shehuang_A', 1);
                                        if (player.hujia <= player.maxHp - player.hp) {
                                            player.changeHujia();
                                        }
                                    },
                                    marktext: '蟒',
                                    intro: {
                                        name: '蟒',
                                        content: '数量:#',
                                    },
                                    forced: true,
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_shehuang_A >= 7) return true;
                                    },
                                    _priority: 54854,
                                    content() {
                                        var A = ['今天我就要你的命!', '找死!', '看来你是活腻了!'].randomGet();
                                        player.say(A);
                                        player.removeMark('dpcq_shehuang_A', trigger.player.storage.dpcq_shehuang_A);
                                        player.removeSkill('dpcq_shehuang');
                                        player.init('dpcq_qicaituntianmang');
                                        player.maxHp = 4;
                                        player.hp = 4;
                                    },
                                    forced: true,
                                },
                                C: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    check(event, player, source) {
                                        var A = player.storage.dpcq_shehuang_A;
                                        var B = event.player.maxHp;
                                        var C = event.player.hp;
                                        if (A < 5) return true;
                                        if (B == C) return true;
                                        return !get.attitude(player, event.player) >= 0;
                                        return false;
                                    },
                                    content() {
                                        player.removeMark('dpcq_shehuang_A', 1);
                                        trigger.player.loseMaxHp();
                                    },
                                },
                            },
                        },
                        dpcq_shiyao: {
                            trigger: {
                                player: 'shaBegin',
                            },
                            nobracket: true,
                            forced: true,
                            content() {
                                if (trigger.target.hp > player.hp) {
                                    player.recover();
                                    player.draw();
                                } else {
                                    trigger.directHit = true;
                                    player.changeHujia();
                                }
                            },
                        },
                        dpcq_guyi: {
                            group: ['dpcq_guyi_A', 'dpcq_guyi_B', 'dpcq_guyi_C'],
                            nobracket: true,
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            content() {
                                if (player.hp > 1) {
                                    var A = ['本皇乃是七彩吞天蟒!', '做好死的觉悟吧!'].randomGet();
                                    player.say(A);
                                    trigger.num += Math.max(2, Math.floor(player.hp)) - 2;
                                } else {
                                    var A = ['<font color=red>都去死吧!</font>'].randomGet();
                                    player.say(A);
                                    trigger.num += 7 * (Math.max(2, Math.floor(player.hp)) - 2);
                                }
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    if (from.hp > 0) return distance - from.hp;
                                },
                                globalTo(from, to, distance) {
                                    if (to.hp > 0) return distance + (to.maxHp - to.hp);
                                },
                            },
                            ai: {
                                threaten: 0.8,
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (player.hujia > 0) return true;
                                    },
                                    _priority: 5889,
                                    content() {
                                        var A = ['本皇可是七彩吞天蟒!', '犯我疆界者!做好死的觉悟吧!'].randomGet();
                                        var B = player.hujia;
                                        player.say(A);
                                        player.recover(Math.round(B / 2));
                                        player.draw(B);
                                        player.changeHujia(-B);
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseZhunbeiBefore',
                                    },
                                    filter(event, player) {
                                        if (player.maxHp - player.hp) return true;
                                    },
                                    _priority: 3555,
                                    content() {
                                        'step 0';
                                        var A = player.maxHp - player.hp;
                                        player
                                            .chooseTarget([1, A], true, function (card, player, target) {
                                                return target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) < 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            var target = result.targets;
                                            player.useCard({ name: 'sha' }, target, false).animate = false;
                                        }
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseJieshuEnd',
                                    },
                                    filter(event, player) {
                                        return game.roundNumber % 7 == 0;
                                    },
                                    forced: true,
                                    _priority: 68558,
                                    content() {
                                        if (player.maxHp >= 7) {
                                            player.loseMaxHp(7);
                                        }
                                        if (player.maxHp < 7) {
                                            player.gainMaxHp(7);
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_tuntian: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            content() {
                                if (trigger.source.maxHp > trigger.source.hp) {
                                    var A = ['你的命是本王的!', '臣服在远古的威压之下吧!'].randomGet();
                                    player.say(A);
                                    trigger.source.gainMaxHp();
                                } else {
                                    var A = ['你的命是本王的!', '臣服在远古的威压之下!'].randomGet();
                                    player.say(A);
                                    trigger.source.loseHp();
                                    trigger.source.useCard({ name: 'sha' }, trigger.player, false).animate = false;
                                }
                            },
                        },
                        dpcq_bingjia: {
                            group: ['dpcq_bingjia_A'],
                            nobracket: true,
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            filter(event, source) {
                                if (event.source.hujia > 0 && event.source.maxHp > event.source.hp) return true;
                            },
                            content() {
                                trigger.source.recover(trigger.source.hujia);
                                trigger.source.changeHujia(-trigger.source.hujia);
                                var A = ['冰灵甲!'].randomGet();
                                trigger.source.say(A);
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    content() {
                                        player.changeHujia(player.maxHp - player.hp);
                                        var A = ['冰灵甲!'].randomGet();
                                        player.say(A);
                                    },
                                    forced: true,
                                },
                            },
                        },
                        dpcq_bingwu: {
                            nobracket: true,
                            trigger: {
                                player: ['useCard', 'respond'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'shan' || event.card.name == 'wanjian';
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return card.suit == 'spade' ? 1 : -1;
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.changeHujia();
                                } else {
                                    player.draw();
                                }
                            },
                        },
                        dpcq_bingbao: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filterCard(card, player) {
                                return get.color(card) == 'black';
                            },
                            viewAs: {
                                name: 'wanjian',
                            },
                            filter(event, player) {
                                if (player.countCards('h', { color: 'black' }) >= 2) return true;
                            },
                            selectCard: 2,
                            viewAsFilter(player) {
                                if (!player.countCards('h', { color: 'black' })) return false;
                            },
                            prompt: '将两张黑色手牌当万箭齐发打出',
                            ai: {
                                wuxie(target, card, player, viewer) {
                                    if (get.attitude(viewer, target) > 0 && target.countCards('h', 'shan')) {
                                        if (!target.countCards('h') || target.hp == 1 || Math.random() < 0.7) return 0;
                                    }
                                },
                                basic: {
                                    order: 9,
                                    useful: 1,
                                    value: 5,
                                },
                                result: {
                                    target(player, target) {
                                        if (player.hasUnknown(2) && get.mode() != 'guozhan') return 0;
                                        var nh = target.countCards('h');
                                        if (get.mode() == 'identity') {
                                            if (target.isZhu && nh <= 2 && target.hp <= 1) return -100;
                                        }
                                        if (nh == 0) return -2;
                                        if (nh == 1) return -1.7;
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage: 1,
                                    multitarget: 1,
                                    multineg: 1,
                                },
                            },
                        },
                        dpcq_bingfeng: {
                            trigger: {
                                source: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            _priority: 6,
                            content() {
                                if (trigger.player.hp <= trigger.source.hp) {
                                    trigger.player.chooseToDiscard(true);
                                    var A = ['通通变成冰雕吧!', '还想跑!？'].randomGet();
                                    trigger.source.say(A);
                                } else {
                                    if (!trigger.player.isTurnedOver()) {
                                        trigger.player.turnOver();
                                    }
                                    trigger.source.draw();
                                    var A = ['好冷!', '可恶!居然被冻住了'].randomGet();
                                    trigger.player.say(A);
                                }
                            },
                        },
                        dpcq_xvling: {
                            nobracket: true,
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h') == 0 && !event.nature;
                            },
                            _priority: 93451725,
                            content() {
                                trigger.cancel();
                            },
                            group: ['dpcq_xvling_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    filter(event, player) {
                                        return player.countCards('h') > 0;
                                    },
                                    content() {
                                        player.chooseToDiscard(true);
                                    },
                                    forced: true,
                                },
                            },
                        },
                        dpcq_lenghuo: {
                            nobracket: true,
                            group: ['dpcq_lenghuo_A', 'dpcq_lenghuo_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        var A = ['在我面前玩火,你还有些早了!', '哼,你这是在找死!'].randomGet();
                                        player.say(A);
                                        trigger.num--;
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    popup: false,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        trigger.player.turnOver();
                                        var A = ['嘿!这火焰的滋味如何？'].randomGet();
                                        player.say(A);
                                    },
                                },
                            },
                        },
                        dpcq_moding: {
                            init(player) {
                                player.storage.dpcq_moding = 0;
                            },
                            marktext: '鼎',
                            intro: {
                                name: '魔鼎',
                                content: '数量:#',
                            },
                            trigger: {
                                player: 'useCard',
                            },
                            _priority: 5552825882899,
                            forced: true,
                            nobracket: true,
                            content() {
                                'step 0';
                                if (player.storage.dpcq_moding < 12) {
                                    player.addMark('dpcq_moding', 1);
                                    player.draw();
                                }
                                ('step 1');
                                if (player.storage.dpcq_moding > 11) {
                                    var A = player.maxHp - player.hp;
                                    player
                                        .chooseTarget([1, A + 1], true, function (card, player, target) {
                                            return target != player;
                                        })
                                        .set('ai', function (target) {
                                            return get.attitude(player, target) < 0;
                                        });
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    event.targets = result.targets.slice(0).sortBySeat();
                                    event.list = event.targets.slice(0);
                                }
                                ('step 3');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    target.damage('fire');
                                    player.chooseToDiscard(Infinity, true);
                                    player.removeMark('dpcq_moding', player.storage.dpcq_moding);
                                    player.recover();
                                    event.redo();
                                }
                            },
                        },
                        dpcq_gujie: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseDiscardBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.parent.name == 'phaseDiscard' && player.countCards('h', { type: 'basic' }) < player.countCards('h');
                            },
                            content() { },
                            mod: {
                                ignoredHandcard(card, player) {
                                    if (get.type(card) != 'basic') {
                                        return true;
                                    }
                                },
                                cardDiscardable(card, player, name) {
                                    if (name == 'phaseDiscard' && get.type(card) != 'basic') return false;
                                },
                            },
                        },
                        dpcq_manli: {
                            nobracket: true,
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                if (trigger.player.maxHp > trigger.player.hp) {
                                    var A = ['谁再说我是蛮力王,看我不撕烂他的嘴!', '哼!你还想挨揍吗'].randomGet();
                                    trigger.source.say(A);
                                    trigger.num++;
                                } else {
                                    var A = ['谁再说我是蛮力王,看我不撕烂他的嘴!', '哼!你还想挨揍吗'].randomGet();
                                    trigger.source.say(A);
                                    trigger.player.turnOver();
                                }
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    content() {
                                        if (trigger.source.hp < trigger.player.maxHp) {
                                            var A = ['谁再说我是蛮力王,看我不撕烂他的嘴!', '哼!你还想挨揍吗'].randomGet();
                                            trigger.source.say(A);
                                            trigger.source.gainPlayerCard(trigger.player, 'he', true);
                                        } else {
                                            var A = ['谁再说我是蛮力王,看我不撕烂他的嘴!', '哼!你还想挨揍吗'].randomGet();
                                            trigger.source.say(A);
                                            trigger.source.draw(trigger.source.hp - trigger.player.maxHp);
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_yinling: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            _priority: 5586189,
                            forced: true,
                            content() {
                                trigger.num += Math.max(Math.floor(player.maxHp - player.hp));
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return (num = player.maxHp);
                                },
                            },
                        },
                        dpcq_longxie: {
                            group: ['dpcq_longxie_A', 'dpcq_longxie_B', 'dpcq_longxie_C', 'dpcq_longxie_D'],
                            nobracket: true,
                            forced: true,
                            mod: {
                                globalFrom(from, to, distance) {
                                    if (from.storage.dpcq_longyin > 0) return distance - from.storage.dpcq_longyin;
                                },
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    _priority: 9285,
                                    content() {
                                        player.gainMaxHp(trigger.num);
                                        player.draw(trigger.num);
                                    },
                                    forced: true,
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    _priority: 85858,
                                    content() {
                                        trigger.source.recover();
                                        trigger.player.chooseToDiscard('he', true);
                                    },
                                    forced: true,
                                },
                                C: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    _priority: 928548,
                                    filter(event, player) {
                                        if (event.player.storage.dpcq_longyin >= event.num) return true;
                                    },
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = event.num;
                                        if (B >= A) return true;
                                        if (A - B == 1) return true;
                                        return false;
                                    },
                                    content() {
                                        player.removeMark('dpcq_longyin', trigger.num);
                                        trigger.num--;
                                    },
                                },
                                D: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    _priority: 82825,
                                    filter(event, player) {
                                        if (player.storage.dpcq_longyin >= event.num) return true;
                                    },
                                    check(event, player) {
                                        var A = event.player.hp;
                                        var B = event.num;
                                        var C = event.player.maxHp;
                                        var D = player.hp;
                                        var E = player.storage.dpcq_longyin;
                                        if (B + 1 >= A) return true;
                                        if (A == C && D > 2) return true;
                                        if (D >= 2 && E >= 2) return false;
                                        if (B > A) return false;
                                        return !get.attitude(player, event.player) >= 0;
                                    },
                                    content() {
                                        trigger.source.removeMark('dpcq_longyin', trigger.num);
                                        trigger.num++;
                                    },
                                },
                            },
                        },
                        dpcq_longyin: {
                            init(player) {
                                player.storage.dpcq_longyin = 0;
                            },
                            marktext: '虚',
                            intro: {
                                name: '龙印',
                                content: '数量:#',
                            },
                            enable: 'phaseUse',
                            nobracket: true,
                            _priority: -10,
                            filter(event, player) {
                                if (player.maxHp > player.hp) return true;
                            },
                            content() {
                                player.loseMaxHp(player.maxHp - player.hp);
                                player.addMark('dpcq_longyin', player.maxHp - player.hp);
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        if (player.hp == 1) return 0;
                                        if (player.maxHp - player.hp > 1 && player.hp == 2) return 9;
                                        if (player.hp >= 3) return 2;
                                        return 1;
                                    },
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                            group: ['dpcq_longyin_C'],
                            subSkill: {
                                C: {
                                    trigger: {
                                        player: 'dyingBegin',
                                    },
                                    nobracket: true,
                                    _priority: 10,
                                    content() {
                                        'step 0';
                                        player
                                            .chooseTarget(function (card, player, target) {
                                                return !target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) > 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            target = result.targets[0];
                                            player.$fullscreenpop('太虚古龙印', 'thunder');
                                            target.gainMaxHp(player.storage.dpcq_longyin);
                                            target.draw(player.storage.dpcq_longyin);
                                            target.phase('nodelay');
                                            player.removeMark('dpcq_longyin', player.storage.dpcq_longyin);
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_motie: {
                            trigger: {
                                source: 'damageBegin',
                            },
                            nobracket: true,
                            check(event, player, target) {
                                if (get.attitude(player, event.player) > 0) return false;
                            },
                            content() {
                                if (trigger.player.hp >= trigger.source.hp && trigger.source.countCards('h') > 0) {
                                    var A = ['阁下真是好大的胆子,胆敢冒犯我漠铁佣兵团'].randomGet();
                                    player.say(A);
                                    trigger.source.chooseToDiscard(true);
                                    trigger.player.chooseToDiscard(true);
                                    trigger.player.damage();
                                } else if (trigger.player.hp < trigger.source.hp) {
                                    var A = ['出来混,早晚要还的!'].randomGet();
                                    player.say(A);
                                    trigger.source.gainPlayerCard(trigger.source.hp - trigger.player.hp, trigger.player, 'he');
                                    trigger.source.recover();
                                }
                            },
                        },
                        dpcq_muling: {
                            trigger: {
                                player: 'phaseUseAfter',
                            },
                            _priority: 6,
                            nobracket: true,
                            filter(event, player) {
                                if (player.hp >= player.countCards('h')) return true;
                            },
                            forced: true,
                            content() {
                                var A = ['木以养灵,滋以万物'].randomGet();
                                player.say(A);
                                player.recover();
                                player.draw();
                            },
                            group: ['dpcq_muling_A', 'dpcq_muling_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 3,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        var A = ['!!可恶!'].randomGet();
                                        player.say(A);
                                        player.chooseToDiscard(trigger.num, 'he', true);
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    _priority: 9,
                                    filter(event, player) {
                                        if (event.player.hp < event.player.maxHp) return true;
                                    },
                                    content() {
                                        player.draw(player.maxHp - player.hp);
                                    },
                                },
                            },
                        },
                        dpcq_leiming: {
                            nobracket: true,
                            group: ['dpcq_leiming_A', 'dpcq_leiming_B'],
                            mod: {
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return num + (player.maxHp - player.hp);
                                },
                            },
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    _priority: 9,
                                    filter(event, player) {
                                        if (event.player.maxHp > event.player.hp) return true;
                                    },
                                    content() {
                                        var A = ['杀光你们这群渣滓,我一人足矣!'].randomGet();
                                        player.say(A);
                                        player.draw(player.maxHp - player.hp);
                                    },
                                    forced: true,
                                },
                                B: {
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    prompt() {
                                        return '将' + get.cnNumber(Math.max(1, _status.event.player.hp)) + '张♠️️牌当作雷杀使用或打出';
                                    },
                                    position: 'he',
                                    check(card, event) {
                                        if (_status.event.player.hp > 1) return 0;
                                        return 10 - get.value(card);
                                    },
                                    selectCard() {
                                        return Math.max(1, _status.event.player.hp);
                                    },
                                    viewAs: {
                                        name: 'sha',
                                        nature: 'thunder',
                                    },
                                    filter(event, player) {
                                        return player.countCards('he', { suit: 'spade' }) >= player.hp;
                                    },
                                    filterCard(card, player) {
                                        return card.suit == 'spade';
                                    },
                                    ai: {
                                        basic: {
                                            useful: [5, 1],
                                            value: [5, 1],
                                        },
                                        order(item) {
                                            if (_status.event.player.hasSkillTag('presha', true, null, true)) return 10;
                                            if (lib.linked.includes(get.nature(item))) return 3.1;
                                            return 3;
                                        },
                                        result: {
                                            target(player, target, card, isLink) {
                                                if (
                                                    !isLink &&
                                                    player.hasSkill('jiu') &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                ) {
                                                    if (get.attitude(player, target) > 0) {
                                                        return -7;
                                                    } else {
                                                        return -4;
                                                    }
                                                }
                                                return -1.5;
                                            },
                                        },
                                        tag: {
                                            respond: 1,
                                            respondShan: 1,
                                            damage(card) {
                                                if (card.nature == 'poison') return;
                                                return 1;
                                            },
                                            natureDamage(card) {
                                                if (card.nature) return 1;
                                            },
                                            fireDamage(card, nature) {
                                                if (card.nature == 'fire') return 1;
                                            },
                                            thunderDamage(card, nature) {
                                                if (card.nature == 'thunder') return 1;
                                            },
                                            poisonDamage(card, nature) {
                                                if (card.nature == 'poison') return 1;
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        dpcq_shisheng: {
                            nobracket: true,
                            trigger: {
                                source: 'dieAfter',
                            },
                            forced: true,
                            _priority: 15,
                            content() {
                                var A = ['哼!一群鼠辈!'].randomGet();
                                trigger.source.say(A);
                                trigger.source.gainMaxHp();
                            },
                            init(player) {
                                player.storage.dpcq_shisheng = 0;
                            },
                            marktext: '噬',
                            mark: true,
                            intro: {
                                name: '噬生',
                                content: '数量:#',
                            },
                            ai: {
                                threaten: 20,
                            },
                            group: ['dpcq_shisheng_A', 'dpcq_shisheng_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    _priority: 7,
                                    content() {
                                        var A = ['<font color=#FF4500>咳</font> 看来得速战速决了!', '死!也要拉一个垫背的!'].randomGet();
                                        player.say(A);
                                        player.update();
                                        player.draw(player.maxHp - player.hp);
                                    },
                                    forced: true,
                                },
                                B: {
                                    trigger: {
                                        player: 'dying',
                                    },
                                    _priority: 7,
                                    content() {
                                        'step 0';
                                        var A = ['<font color=#FF4500>哈哈哈哈!一起上吧!</font>'].randomGet();
                                        player.say(A);
                                        ('step 1');
                                        player.update();
                                        if (player.storage.dpcq_shisheng <= player.maxHp) {
                                            player.loseMaxHp(player.storage.dpcq_shisheng);
                                        } else if (player.storage.dpcq_shisheng > player.maxHp) {
                                            player.maxHp = 0;
                                        }
                                        player.update();
                                        ('step 2');
                                        player.recover(Math.round(player.maxHp / 2 - player.hp));
                                        player.phase('nodelay');
                                        player.addMark('dpcq_shisheng', 1);
                                    },
                                    forced: true,
                                },
                            },
                        },
                        dpcq_fengfu: {
                            nobracket: true,
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            filterCard: 1,
                            position: 'he',
                            round: 3,
                            check(card, player, target) {
                                return 9 - get.value(card);
                            },
                            filterTarget(card, player, target) {
                                if (target.hp > target.maxHp) return false;
                                if (target.hasSkill('dpcq_fengfu_A')) return false;
                                return true;
                            },
                            content() {
                                target.addSkill('dpcq_fengfu_A');
                                target.draw(2);
                                var A = ['风·缚'].randomGet();
                                player.say(A);
                            },
                            ai: {
                                order: 21,
                                result: {
                                    target: -1,
                                },
                                threaten: 2,
                                expose: 0.2,
                            },
                            subSkill: {
                                A: {
                                    mod: {
                                        cardUsable(card) {
                                            if (get.info(card) && get.info(card).forceUsable) return false;
                                            return 0;
                                        },
                                    },
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    content() {
                                        player.removeSkill('fengfu_A');
                                    },
                                    init(player) {
                                        player.storage.A;
                                    },
                                    mark: true,
                                    marktext: '缚',
                                    intro: {
                                        name: '风缚',
                                        content: '回合内所有牌的使用基数为不可用<br>(例:回合内,使用拟剑刷新你的出杀次数,则杀处于单次可用状态)',
                                    },
                                },
                            },
                            group: ['fengfu_roundcount', 'dpcq_fengfu_roundcount'],
                        },
                        dpcq_yunlan: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseBegin',
                            },
                            derivation: ['dpcq_luoyao', 'dpcq_fenggang', 'dpcq_xuanwu', 'dpcq_fengfu', 'dpcq_feixv', 'dpcq_nijian', 'dpcq_fenghua'],
                            round: 4,
                            forced: true,
                            _priority: 7,
                            filter(event, player) {
                                if (!event.player.hasSkill('dpcq_luoyao')) return true;
                                else if (!player.hasSkill('dpcq_fenggang')) return true;
                                else if (!player.hasSkill('dpcq_xuanwu')) return true;
                                else if (!player.hasSkill('dpcq_fengfu')) return true;
                            },
                            content() {
                                var A = [];
                                if (!player.hasSkill('dpcq_luoyao')) A.push('dpcq_luoyao');
                                if (!player.hasSkill('dpcq_fenggang')) A.push('dpcq_fenggang');
                                if (!player.hasSkill('dpcq_xuanwu')) A.push('dpcq_xuanwu');
                                if (!player.hasSkill('dpcq_fengfu')) A.push('dpcq_fengfu');
                                var B = A.randomGet();
                                player.popup(get.translation(B));
                                player.addSkill(B);
                                player.markSkill(B);
                                player.update();
                            },
                            group: ['dpcq_yunlan_A', 'dpcq_yunlan_B', 'dpcq_yunlan_roundcount'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        global: 'gameStart',
                                        player: 'changeHp',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.num != 0;
                                    },
                                    content() {
                                        'step 0';
                                        if (player.hp <= 1) {
                                            player.draw();
                                            player.addSkill('dpcq_fenghua');
                                            player.update();
                                        }
                                        ('step 1');
                                        if (player.hp <= 2) {
                                            player.draw();
                                            player.addSkill('dpcq_nijian');
                                            player.update();
                                        }
                                        ('step 2');
                                        if (player.hp <= 3) {
                                            player.addSkill('dpcq_feixv');
                                            player.update();
                                        }
                                        ('step 3');
                                        if (player.hp > 1) {
                                            player.removeSkill('dpcq_fenghua');
                                            player.update();
                                        }
                                        ('step 4');
                                        if (player.hp > 2) {
                                            player.removeSkill('dpcq_nijian');
                                            player.update();
                                        }
                                        ('step 5');
                                        if (player.hp > 3) {
                                            player.removeSkill('dpcq_feixv');
                                            player.update();
                                        }
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'gainMaxHpBefore',
                                    },
                                    _priority: 20200.4111545,
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.maxHp >= 4) return true;
                                    },
                                    content() {
                                        trigger.cancel();
                                        player.recover(trigger.num);
                                    },
                                },
                            },
                        },
                        dpcq_shigang: {
                            audio: 'ext:斗破苍穹/audio:2',
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player) {
                                return event.source != undefined && event.num > 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.source) <= 0;
                            },
                            logTarget: 'source',
                            content() {
                                'step 0';
                                event.num = Math.min(trigger.num, 9);
                                ('step 1');
                                player
                                    .judge(function (card) {
                                        if (get.color(card) == 'red') return _status.event.eff;
                                        return 0;
                                    })
                                    .set('eff', get.damageEffect(trigger.source, player, player));
                                ('step 2');
                                if (result.color == 'black') {
                                    var A = ['伤我萧家者!一个不留!', '我萧战就算是战死!你们也休想入我萧家一步!'].randomGet();
                                    player.say(A);
                                    trigger.source.chooseToDiscard('he', true);
                                    player.useCard({ name: 'sha' }, trigger.source, false).animate = false;
                                } else if (trigger.source.isIn()) {
                                    var A = ['狂狮怒罡!', '今日你敢动我萧家,他日我萧家定要讨回来!'].randomGet();
                                    player.say(A);
                                    player.draw();
                                    trigger.source.damage();
                                }
                                event.num--;
                                if (event.num > 0) {
                                    player.chooseBool('是否继续发动？');
                                } else {
                                    event.finish();
                                }
                                ('step 3');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                            ai: {
                                expose: 0.4,
                            },
                        },
                        dpcq_jueduan: {
                            nobracket: true,
                            group: ['dpcq_jueduan_jue'],
                            subSkill: {
                                jue: {
                                    trigger: {
                                        player: 'shaBegin',
                                    },
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = player.maxHp;
                                        var C = event.num;
                                        var D = event.player;
                                        if (A <= B / 2) return true;
                                        if (C >= D) return false;
                                        if (get.attitude(player, event.player)) return false;
                                        return true;
                                    },
                                    logTarget: 'target',
                                    content() {
                                        var A = ['为了萧家今后的基业,只能如此了'].randomGet();
                                        player.say(A);
                                        trigger.cancel();
                                        player.draw();
                                        player.gainPlayerCard(trigger.target, 'he');
                                        player.addSkill('dpcq_jueduan_duan');
                                        player.removeSkill('dpcq_jueduan_jue');
                                    },
                                    init(player) {
                                        player.storage.jue = 0;
                                    },
                                    mark: true,
                                    marktext: '决',
                                    intro: {
                                        name: '决断·决',
                                        content: "使用杀指定目标后,你可以取消之并摸两张牌<br>将技能效果转化为'断'",
                                    },
                                },
                                duan: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    check(event, player) {
                                        var A = player.hp;
                                        var B = player.maxHp;
                                        var C = event.num;
                                        var D = event.player;
                                        if (A <= B / 2) return true;
                                        if (C >= D) return false;
                                        if (get.attitude(player, event.player)) return false;
                                        return true;
                                    },
                                    content() {
                                        var A = ['为了炎儿,不得不如此了'].randomGet();
                                        player.say(A);
                                        trigger.cancel();
                                        trigger.source.recover();
                                        trigger.player.chooseToDiscard('he', true);
                                        trigger.source.addSkill('dpcq_jueduan_jue');
                                        trigger.source.removeSkill('dpcq_jueduan_duan');
                                    },
                                    init(player) {
                                        player.storage.duan = 0;
                                    },
                                    mark: true,
                                    marktext: '断',
                                    intro: {
                                        name: '决断·断',
                                        content: "即将造成伤害时,你可以取消之并令目标摸一张牌,你回复一点体力<br>随后将技能效果转化为'决'",
                                    },
                                },
                            },
                        },
                        dpcq_yvshui: {
                            nobracket: true,
                            forced: true,
                            init(player) {
                                player.storage.dpcq_yvshui;
                            },
                            marktext: '凝',
                            intro: {
                                name: '凝',
                                content: '数量:#',
                            },
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            _priority: 92855,
                            content() {
                                player.addMark('dpcq_yvshui', 1);
                            },
                            group: ['dpcq_yvshui_F'],
                            subSkill: {
                                A: {
                                    enable: 'phaseUse',
                                    _priority: 92,
                                    filter(event, player) {
                                        if (player.hujia == 0) return true;
                                    },
                                    content() {
                                        var B = player.maxHp - player.hp;
                                        var A = ['卸力水镜!', '聚!'].randomGet();
                                        player.say(A);
                                        player.loseHp();
                                        player.changeHujia(2 + B);
                                        player.addMark('dpcq_yvshui', 2 + B);
                                        player.addSkill('dpcq_yvshui_B');
                                        player.addSkill('dpcq_yvshui_E');
                                        player.removeSkill('dpcq_yvshui_A');
                                    },
                                    init(player) {
                                        player.storage.A;
                                    },
                                    mark: true,
                                    marktext: '镜',
                                    intro: {
                                        name: '水镜',
                                        content: "非锁定技<br>回合内如果你没有护甲,你可流失一点体力并获得已损体力值加二点护甲,你的'凝'印记加一并将技能效果转换为[鞭楚]",
                                    },
                                    ai: {
                                        order: 9,
                                        result: {
                                            player(player) {
                                                if (player.maxHp == player.hp) return 1;
                                                else if (player.maxHp > player.hp && player.hp > 1) return 1;
                                            },
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'shaAfter',
                                    },
                                    filter(event, player) {
                                        return event.target.isAlive();
                                    },
                                    _priority: 9285,
                                    logTarget: 'target',
                                    content() {
                                        'step 0';
                                        var cards = get.cards();
                                        player.showCards(cards, get.translation(player) + '发动了[御水·鞭楚]');
                                        event.bool = get.color(cards[0]) == 'black';
                                        ('step 1');
                                        if (event.bool) {
                                            var A = ['你能否躲过接下来这一击呢!', '实在是令人有些拭目以待呢!'].randomGet();
                                            player.say(A);
                                            player.addMark('dpcq_yvshui', 2);
                                            player.useCard({ name: 'sha' }, trigger.target, false).animate = false;
                                        } else {
                                            var A = ['呵呵,果然有些本事啊!', '哈!有点意思!'].randomGet();
                                            player.say(A);
                                            player.addMark('dpcq_yvshui', 1);
                                            player.addTempSkill('dpcq_yvshui_D', { player: 'phaseEnd' });
                                            trigger.target.chooseToDiscard('he', true);
                                        }
                                    },
                                    init(player) {
                                        player.storage.B;
                                    },
                                    mark: true,
                                    marktext: '鞭',
                                    intro: {
                                        name: '鞭楚',
                                        content: "非锁定技<br>你使用杀指定目标后,可亮出牌堆顶的一张牌,若其为黑色,你的'凝'印记加一,且视为对目标再使用一张杀,否则目标需弃置一张牌,且你本回合不能再使用杀,出牌阶段结束后,若你的'凝'印记不小于十,则将技能效果转换为[愈灵]",
                                    },
                                },
                                C: {
                                    enable: 'phaseUse',
                                    filter(event, player) {
                                        if (player.storage.dpcq_yvshui >= 2) return true;
                                    },
                                    filterTarget(card, player, target) {
                                        if (target.hp >= target.maxHp) return false;
                                        return true;
                                    },
                                    content() {
                                        var A = ['呵呵,没事了吧?', '且先休息一下!'].randomGet();
                                        player.say(A);
                                        target.recover();
                                        player.removeMark('dpcq_yvshui', 2);
                                        player.removeSkill('dpcq_yvshui_C');
                                        player.addSkill('dpcq_yvshui_A');
                                    },
                                    init(player) {
                                        player.storage.C;
                                    },
                                    mark: true,
                                    marktext: '愈',
                                    intro: {
                                        name: '愈灵',
                                        content: "非锁定技<br>回合内你可以移除两枚'凝'印记,选择一名角色令其回复一点体力,随后将技能效果转换为[水镜]",
                                    },
                                    ai: {
                                        order: 9,
                                        result: {
                                            target(player, target) {
                                                if (target.hp == 1) return 5;
                                                if (player == target) return 5;
                                                return 2;
                                            },
                                        },
                                    },
                                },
                                D: {
                                    mod: {
                                        cardEnabled(card) {
                                            if (card.name == 'sha') return false;
                                        },
                                    },
                                },
                                E: {
                                    trigger: {
                                        player: 'phaseUseEnd',
                                    },
                                    forced: true,
                                    _priority: 82868,
                                    filter(event, player) {
                                        if (player.storage.dpcq_yvshui > 9) return true;
                                    },
                                    content() {
                                        player.addSkill('dpcq_yvshui_C');
                                        player.removeSkill('dpcq_yvshui_B');
                                        player.removeSkill('dpcq_yvshui_E');
                                    },
                                },
                                F: {
                                    trigger: {
                                        global: 'gameStart',
                                    },
                                    forced: true,
                                    _priority: 9355185285,
                                    content() {
                                        player.addSkill('dpcq_yvshui_A');
                                        player.removeSkill('dpcq_yvshui_F');
                                    },
                                },
                            },
                        },
                        dpcq_mantuo: {
                            nobracket: true,
                            trigger: {
                                player: 'phaseEnd',
                            },
                            _priority: 85825,
                            filter(event, player) {
                                if (event.player.storage.dpcq_yvshui >= 10) return true;
                            },
                            check(event, player) {
                                var A = player.hp;
                                var B = player.maxHp;
                                var C = player.storage.dpcq_yvshui;
                                if (A == 1) return true;
                                else if (A < B / 2) return true;
                                else if (C >= 12) return true;
                                return false;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget([1, 3], function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        return get.attitude(player, target) < 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    var A = result.targets[0];
                                    A.damage(1);
                                    player.recover();
                                    player.draw(2);
                                    player.$fullscreenpop('<font color=#AFEEEE>水曼陀罗</font>');
                                    event.targets = result.targets.slice(0).sortBySeat();
                                    event.list = event.targets.slice(0);
                                }
                                ('step 2');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    target.damage();
                                    var B = ['结束了哦!', '玄阶中级斗技·水曼陀罗!'].randomGet();
                                    player.say(B);
                                    player.removeMark('yvshui', player.storage.dpcq_yvshui);
                                    event.redo();
                                }
                            },
                        },
                        dpcq_xiuluo: {
                            nobracket: true,
                            mod: {
                                selectTarget(card, player, range) {
                                    var A = player.maxHp - player.hp;
                                    if (card.name == 'sha' && Array.isArray(range) && range[1] != -1) range[1] += A;
                                },
                            },
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            _priority: 82,
                            content() {
                                var A = ['你的鲜血真是令人兴奋!', '你的命,我就收下了!'].randomGet();
                                player.say(A);
                                if (player.storage.dpcq_xuesha >= trigger.player.hp) {
                                    trigger.num++;
                                    player.removeMark('dpcq_xuesha', 1);
                                }
                            },
                            group: ['dpcq_xiuluo_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    _priority: 5388,
                                    forced: true,
                                    content() {
                                        player.gainPlayerCard(trigger.player, 'he');
                                    },
                                },
                            },
                        },
                        dpcq_xuesha: {
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            _priority: 92669428,
                            content() {
                                var A = ['嗬!', '不过如此!'].randomGet();
                                player.say(A);
                                if (player.storage.dpcq_xuesha <= player.maxHp) {
                                    player.recover();
                                    if (trigger && trigger.source) {
                                        trigger.source.chooseToDiscard(true, 'he');
                                    }
                                    player.addMark('dpcq_xuesha', trigger.num);
                                } else if (player.storage.dpcq_xuesha > player.maxHp) {
                                    player.useCard({ name: 'juedou' }, trigger.source, false).animate = false;
                                }
                            },
                            init(player) {
                                player.storage.dpcq_xuesha = 2;
                            },
                            mark: true,
                            marktext: '煞',
                            intro: {
                                name: '血煞',
                                content: '数量:#',
                            },
                            group: ['dpcq_xuesha_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseJieshuBegin',
                                    },
                                    filter(event, player) {
                                        if (player.hp <= player.storage.dpcq_xuesha) return true;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        var A = player.storage.dpcq_xuesha;
                                        player
                                            .chooseTarget([1, A], true, function (card, player, target) {
                                                return target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) < 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            var target = result.targets;
                                            player.useCard({ name: 'sha' }, target, false).animate = false;
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_baqiang: {
                            nobracket: true,
                            trigger: {
                                player: 'changeHp',
                            },
                            forced: true,
                            filter(event, player) {
                                var A = player.maxHp;
                                var B = player.hp;
                                if (B <= A / 2) return true;
                            },
                            _priority: 655552,
                            content() {
                                player.draw();
                                if (!player.hasSkill('dpcq_baqiang_A')) {
                                    player.recover();
                                    player.loseMaxHp();
                                    player.addSkill('dpcq_baqiang_A');
                                    var A = ['哈哈哈!不错!', '你!有让我动枪的资格!'].randomGet();
                                    player.say(A);
                                }
                            },
                            group: ['dpcq_baqiang_B'],
                            subSkill: {
                                A: {
                                    enable: 'phaseUse',
                                    usable: 1,
                                    filterTarget(card, player, target) {
                                        if (target.hp > target.maxHp) return false;
                                        return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.chooseControl('使用杀获得护甲', '使用决斗并摸牌');
                                        ('step 1');
                                        var A = '使用杀获得护甲';
                                        var B = '使用决斗并摸牌';
                                        var C = ['大裂岩!', '看你能否挡住这一击!', '败在我的枪下,也算是你的荣幸!'].randomGet();
                                        if (result.control == A) {
                                            player.useCard({ name: 'sha' }, event.target, false).animate = false;
                                            player.changeHujia();
                                            player.say(C);
                                        }
                                        if (result.control == B) {
                                            player.useCard({ name: 'juedou' }, event.target, false).animate = false;
                                            player.draw();
                                            player.say(C);
                                        }
                                    },
                                    ai: {
                                        order: 13,
                                        result: {
                                            target: -1,
                                        },
                                        threaten: 2,
                                        expose: 0.2,
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'shaBegin',
                                    },
                                    logTarget: 'target',
                                    forced: true,
                                    nobracket: true,
                                    content() {
                                        if (trigger.target.hp > player.hp) {
                                            trigger.directHit = true;
                                        } else {
                                            trigger.target.chooseToDiscard('he', true);
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_lieyan: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            filter(event, source) {
                                if (!event.source.hasSkill('dpcq_lieyan_A')) return true;
                            },
                            content() {
                                if (trigger && trigger.source) {
                                    var A = ['你就这点儿能耐？', '就凭这些？再练过吧!'].randomGet();
                                    player.say(A);
                                    trigger.source.addSkill('dpcq_lieyan_A');
                                    player.changeHujia();
                                }
                            },
                            group: ['dpcq_lieyan_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    filter(event, source) {
                                        if (event.source.hasSkill('dpcq_lieyan')) return true;
                                    },
                                    content() {
                                        trigger.num++;
                                        player.removeSkill('dpcq_lieyan_A');
                                    },
                                    init(player) {
                                        player.storage.A;
                                    },
                                    mark: true,
                                    marktext: '裂',
                                    intro: {
                                        name: '裂岩',
                                        content: '',
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return game.hasPlayer(function (current) {
                                            if (current.hasSkill('dpcq_lieyan_A')) return true;
                                        });
                                    },
                                    content() {
                                        var A = game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_lieyan_A')) return true;
                                        });
                                        player.draw(A);
                                    },
                                },
                            },
                        },
                        dpcq_shishi: {
                            nobracket: true,
                            forced: true,
                            trigger: {
                                global: 'gameStart',
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(function (card, player, target) {
                                        return target != player;
                                    })
                                    .set('ai', function (target) {
                                        if (target.maxHp >= 6) return 1;
                                        if (target.maxHp >= 10) return 2;
                                        if (target.name == 'dpcq_yaolao') return 99999;
                                        return 2;
                                        return get.attitude(player, target) <= 0;
                                    });
                                ('step 1');
                                if (result.bool) {
                                    target = result.targets[0];
                                    var A = ['师傅在上,且受弟子一拜', '再造之恩,弟子没齿难忘'].randomGet();
                                    player.say(A);
                                    target.addSkill('dpcq_shishi_C');
                                    target.maxHp = target.maxHp + 1;
                                    target.hp = target.hp + 1;
                                }
                            },
                            group: ['dpcq_shishi_A', 'dpcq_shishi_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        global: ['recoverAfter', 'drawEnd'],
                                    },
                                    filter(event, player) {
                                        if (event.player.hasSkill('dpcq_shishi_C')) return true;
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        if (trigger.player.countCards('h') > 0) {
                                            trigger.player.chooseCard('交给' + get.translation(player) + '一张手牌', 'h', true);
                                        } else {
                                            trigger.player.damage('poison', player);
                                            trigger.finish();
                                        }
                                        var A = ['这老不死的', '哼!总是对我有所隐瞒', '等着吧,总有一天!'].randomGet();
                                        player.say(A);
                                        ('step 1');
                                        if (result.bool) {
                                            trigger.player.give(result.cards, player);
                                        }
                                    },
                                },
                                B: {
                                    trigger: {
                                        global: ['damageEnd', 'loseHpEnd'],
                                    },
                                    filter(event, player) {
                                        if (event.player.hasSkill('dpcq_shishi_C')) return true;
                                    },
                                    forced: true,
                                    content() {
                                        if (player.maxHp > player.hp) {
                                            var A = ['哈哈哈哈哈,大快人心啊', '再来!再来!哈哈哈!'].randomGet();
                                            player.say(A);
                                            player.recover();
                                            player.chooseToDiscard('he', true);
                                        } else {
                                            var A = ['师傅,弟子不孝(老东西!)', '还望师傅责罚(你死期不远了!)'].randomGet();
                                            player.say(A);
                                            trigger.player.draw(2);
                                        }
                                    },
                                },
                                C: {
                                    trigger: {
                                        global: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.hasSkill('dpcq_shishi')) return true;
                                    },
                                    content() {
                                        var A = ['徒儿,你退后!', '你们敢动他,就是不给我面子!', '你们在找死!', '伤我徒者!诛!'].randomGet();
                                        player.say(A);
                                        player.draw(2);
                                    },
                                    init(player) {
                                        player.storage.C;
                                    },
                                    mark: true,
                                    marktext: '师',
                                    intro: {
                                        name: '弑师',
                                    },
                                },
                            },
                        },
                        dpcq_xinyan: {
                            nobracket: true,
                            forced: true,
                            trigger: {
                                source: 'damageBegin',
                            },
                            _priority: 8255,
                            filter(event, player) {
                                if (!event.player.hasSkill('dpcq_xinyan_A') && !event.player.hasSkill('dpcq_xinyan')) return true;
                            },
                            content() {
                                trigger.player.addSkill('dpcq_xinyan_A');
                            },
                            group: ['dpcq_xinyan_B', 'dpcq_xinyan_C', 'dpcq_xinyan_D'],
                            subSkill: {
                                A: {
                                    forced: true,
                                    init(player) {
                                        player.storage.A;
                                    },
                                    mark: true,
                                    marktext: '焰',
                                    intro: {
                                        name: '焰',
                                        content: '已被标记',
                                    },
                                },
                                B: {
                                    trigger: {
                                        global: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.hasSkill('dpcq_xinyan_A')) return true;
                                    },
                                    _priority: 65524,
                                    content() {
                                        if (trigger.player.countCards('he') > 0) {
                                            var A = ['如何？很难受对不对？', '这种感觉就对了!哈哈哈哈哈!', '痛苦吧!我喜欢看你绝望的表情!'].randomGet();
                                            player.say(A);
                                            player.gainPlayerCard(trigger.player, 'he');
                                        } else {
                                            var A = ['一群废物!', '留你何用!'].randomGet();
                                            player.say(A);
                                            if (player.hp < player.maxHp) {
                                                player.recover();
                                            } else {
                                                player.draw();
                                            }
                                        }
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'dieBegin',
                                    },
                                    forced: true,
                                    content() {
                                        var A = game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_xinyan_A')) return true;
                                        });
                                        game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_xinyan_A')) {
                                                current.removeSkill('dpcq_xinyan_A');
                                            }
                                        });
                                        player.update();
                                        player.revive();
                                        player.gainMaxHp();
                                        player.hp = A + 1;
                                        player.update();
                                        player.awakenSkill('dpcq_xinyan');
                                        player.addSkill('dpcq_xvling');
                                        player.chooseToDiscard('he', true, Infinity);
                                        var A = ['哈哈哈!想不到吧!', '你我的恩怨就做个了解吧!', '哼!要不是我献出了海心焰,还真就要栽在你手里!'].randomGet();
                                        player.say(A);
                                        trigger.untrigger();
                                        trigger.finish();
                                    },
                                    forced: true,
                                    notarget: true,
                                },
                                D: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return game.hasPlayer(function (current) {
                                            if (current.hasSkill('dpcq_xinyan_A')) return true;
                                        });
                                    },
                                    content() {
                                        var A = ['你也休想好过!', '哈哈哈哈哈!', '被火焰焚烧的滋味如何!？'].randomGet();
                                        player.say(A);
                                        game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_xinyan_A')) {
                                                if (current.countCards('h') > 0) {
                                                    current.chooseToDiscard('he', true);
                                                } else {
                                                    current.damage('fire', player);
                                                }
                                            }
                                        });
                                    },
                                },
                            },
                        },
                        dpcq_qingwu: {
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            nobracket: true,
                            _priority: 528650,
                            filter(event, player, source) {
                                return event.source && event.source.isIn() && event.source != player && !event.source.hasJudge('lebu');
                            },
                            content() {
                                'step 0';
                                if (trigger && trigger.source) {
                                    trigger.player.judge();
                                } else {
                                    trigger.finish();
                                }
                                ('step 1');
                                var card = get.cardPile('lebu', true);
                                var A = ['废物!垃圾!真他妈碍眼!', '离我远点!'].randomGet();
                                switch (result.suit) {
                                    case 'heart':
                                        player.say(A);
                                        break;
                                    case 'diamond':
                                        trigger.source.addJudge(card);
                                        trigger.source.$draw(card);
                                        break;
                                    case 'spade':
                                        trigger.source.addJudge(card);
                                        trigger.source.$draw(card);
                                        player.say(A);
                                        break;
                                    case 'club':
                                        trigger.source.addJudge(card);
                                        trigger.source.$draw(card);
                                        break;
                                }
                            },
                            group: ['dpcq_qingwu_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        global: ['phaseUseSkipped', 'phaseUseCancelled'],
                                    },
                                    forced: true,
                                    content() {
                                        var A = ['嘁!废物就是废物!'].randomGet();
                                        player.say(A);
                                        player.useCard({ name: 'sha' }, trigger.player, false).animate = false;
                                        player.recover();
                                    },
                                },
                            },
                        },
                        dpcq_yisui: {
                            trigger: {
                                global: 'phaseDrawBegin',
                            },
                            nobracket: true,
                            forced: true,
                            filter(event, player) {
                                if (event.player.isMaxHp() && event.player != player) return true;
                            },
                            content() {
                                'step 0';
                                trigger.cancel();
                                trigger.player.draw(3);
                                var A = ['哥哥!帮帮人家嘛!'].randomGet();
                                player.say(A);
                                ('step 1');
                                trigger.player.chooseCard('交给' + get.translation(player) + '一张手牌', 'h', true);
                                ('step 2');
                                var B = ['哥哥最好了!', '最喜欢哥哥了!', '哥哥真好!嘻嘻!'].randomGet();
                                player.say(B);
                                if (result.bool) {
                                    trigger.player.give(result.cards, player);
                                }
                            },
                            group: ['dpcq_yisui_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        global: 'phaseUseAfter',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (event.player.hp < player.countCards('h') && event.player != player) return true;
                                    },
                                    content() {
                                        var A = ['我当初真是瞎了眼!', '当初我居然会喜欢上你这种废物!', '你这种废物,怎么还不去死？'].randomGet();
                                        player.say(A);
                                        trigger.player.chooseToDiscard('he', player.countCards('h'), true);
                                        if (trigger.player.countCards('h') > player.countCards('h')) {
                                            trigger.player.damage(player);
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_lianren: {
                            nobracket: true,
                            mod: {
                                globalFrom(from, to, distance) {
                                    if (from.getEquip(1)) return distance - 1;
                                },
                                globalTo(from, to, distance) {
                                    if (!to.getEquip(1)) return distance + 1;
                                },
                            },
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.getEquip(1)) return true;
                                return false;
                            },
                            check(event, player) {
                                if (get.attitude(player, event.player) > 0) return true;
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                if (get.color(trigger.card) == 'red') {
                                    player.draw();
                                }
                                if (get.color(trigger.card) == 'black') {
                                    trigger.target.chooseToDiscard('he', true);
                                }
                            },
                            group: ['dpcq_lianren_A', 'dpcq_lianren_B'],
                            subSkill: {
                                A: {
                                    enable: ['chooseToUse', 'chooseToRespond'],
                                    filterCard: {
                                        name: 'sha',
                                    },
                                    viewAs: {
                                        name: 'shan',
                                        suit: 'club',
                                        number: 13,
                                        cards: [{ node: { image: {}, info: {}, name: {}, name2: {}, background: {}, intro: {}, range: {} }, inits: [null], storage: {}, vanishtag: [], _uncheck: [], suit: 'heart', number: 13, name: 'sha', cardid: '6482539351', clone: { name: 'shan', suit: 'heart', number: 13, node: { name: {}, info: {}, intro: {}, background: {}, image: {} }, _transitionEnded: true, timeout: 919 }, timeout: 890, original: 'h' }],
                                    },
                                    filter(event, player) {
                                        if (player.getEquip(1)) return false;
                                        return true;
                                    },
                                    prompt: '将一张杀当闪打出',
                                    check() {
                                        return 1;
                                    },
                                    viewAsFilter(player) {
                                        if (!player.countCards('h', 'sha')) return false;
                                    },
                                    ai: {
                                        respondShan: true,
                                        skillTagFilter(player) {
                                            if (!player.countCards('h', 'sha')) return false;
                                        },
                                        effect: {
                                            target(card, player, target, current) {
                                                if (get.tag(card, 'respondShan') && current < 0) return 0.6;
                                            },
                                        },
                                        order: 4,
                                        useful: -1,
                                        value: -1,
                                        basic: {
                                            useful: [7, 2],
                                            value: [7, 2],
                                        },
                                        result: {
                                            player: 1,
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'shaMiss',
                                    },
                                    forced: true,
                                    prompt: '获得目标一张牌或视为对其使用一张决斗',
                                    logTarget: 'target',
                                    content() {
                                        'step 0';
                                        player.chooseControl('获得其牌', '使用决斗', '取消');
                                        ('step 1');
                                        var A = '获得其牌';
                                        var B = '使用决斗';
                                        var C = '取消';
                                        if (result.control == A) {
                                            player.gainPlayerCard(1, trigger.target, 'he');
                                            var A = ['哦!？躲过了!那么接下来的呢？'].randomGet();
                                            player.say(A);
                                        }
                                        if (result.control == B) {
                                            player.useCard({ name: 'juedou' }, trigger.target, false).animate = false;
                                            var A = ['为了表示对阁下的尊重,我可能也要认真一下了!'].randomGet();
                                            player.say(A);
                                        }
                                        if (result.control == C) {
                                            event.finish();
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_qianchan: {
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('he') > 0) return true;
                                return false;
                            },
                            prompt: '牵缠:弃置一张牌并获得一点护甲',
                            content() {
                                'step 0';
                                player.chooseControl('弃牌', '取消');
                                ('step 1');
                                var A = '弃牌';
                                var B = '取消';
                                if (result.control == A) {
                                    player.chooseToDiscard('he', true).ai = function (card) {
                                        return 8 - get.value(card);
                                    };
                                    player.changeHujia();
                                }
                                if (result.control == B) {
                                    event.finish();
                                }
                            },
                            group: ['dpcq_qianchan_A', 'dpcq_qianchan_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (player.hujia > 0) return true;
                                        return false;
                                    },
                                    content() {
                                        var A = player.hujia;
                                        player.hujia = 0;
                                        player.draw(A);
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    content() {
                                        'step 0';
                                        var A = ['相思缠!', '感到荣幸吧!你很快就会死在这了!!'].randomGet();
                                        player.say(A);
                                        player.getStat().card.sha = 0;
                                        trigger.player.judge();
                                        ('step 1');
                                        switch (result.suit) {
                                            case 'heart':
                                                player.gainPlayerCard(1, trigger.player, 'he');
                                                if (player.hp < player.maxHp) {
                                                    player.recover();
                                                } else {
                                                    player.gain(
                                                        get.cardPile(function (card) {
                                                            return get.type(card, 'equip') == 'equip';
                                                        }),
                                                        'gain2'
                                                    );
                                                }
                                                break;
                                            case 'diamond':
                                                player.gainPlayerCard(1, trigger.player, 'he');
                                                if (player.hp < player.maxHp) {
                                                    player.recover();
                                                } else {
                                                    player.gain(
                                                        get.cardPile(function (card) {
                                                            return get.type(card, 'equip') == 'equip';
                                                        }),
                                                        'gain2'
                                                    );
                                                }
                                                break;
                                            case 'spade':
                                                player.gain(game.createCard('juedou'))._triggered = null;
                                                trigger.player.gain(game.createCard('sha'))._triggered = null;
                                                break;
                                            case 'club':
                                                player.gain(game.createCard('juedou'))._triggered = null;
                                                trigger.player.gain(game.createCard('sha'))._triggered = null;
                                                break;
                                        }
                                    },
                                },
                            },
                        },
                        dpcq_baoyan: {
                            nobracket: true,
                            trigger: {
                                player: 'damageEnd',
                            },
                            filter(event, player, source) {
                                if (!event.source.hasSkill('dpcq_baoyan_A')) return true;
                                return false;
                            },
                            prompt: "令伤害来源获得'焱'标记",
                            check(event, player, source) {
                                if (get.attitude(player, event.source) > 0) return false;
                            },
                            content() {
                                var A = ['等着吧!自不量力的东西!'].randomGet();
                                player.say(A);
                                trigger.source.addSkill('dpcq_baoyan_A');
                            },
                            subSkill: {
                                A: {
                                    init(player) {
                                        player.storage.A;
                                    },
                                    marktext: '焱',
                                    mark: true,
                                    intro: {
                                        name: '焱',
                                        content: '已被[爆焱]标记',
                                    },
                                    forced: true,
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    content() {
                                        game.countPlayer(function (current) {
                                            if (current.hasSkill('dpcq_baoyan')) {
                                                if (player.hp == player.hp) {
                                                    current.recover();
                                                    current.draw();
                                                    if (current.maxHp == current.hp) {
                                                        current.changeHujia();
                                                    }
                                                    var A = ['哈哈哈哈哈!', '再来!再来!'].randomGet();
                                                    current.say(A);
                                                } else {
                                                    player.damage('fire', 1, current);
                                                    if (current.hp < current.maxHp && !current.isTurnedOver()) {
                                                        current.turnOver();
                                                    }
                                                    var A = ['爆!', '嘿嘿!滋味如何？'].randomGet();
                                                    current.say(A);
                                                    var A = ['呃!', '这…什么时候!!'].randomGet();
                                                    player.say(A);
                                                }
                                            }
                                        });
                                        player.removeSkill('dpcq_baoyan_A');
                                    },
                                },
                            },
                        },
                        dpcq_xinxi: {
                            nobracket: true,
                            trigger: {
                                global: 'recoverEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.player == player) return false;
                                return true;
                            },
                            prompt: '额外回复:额外增加一点体力并令其在当前回合结束后进行一个额外的回合<br>共同弃牌:你摸一张牌并与其共同将武将翻至背面<br>使用决斗:你摸两张牌并视为其对你使用一张[决斗]',
                            content() {
                                'step 0';
                                trigger.player.chooseControl('额外回复', '共同翻面', '使用决斗').ai = function (event, player) {
                                    if (get.attitude(player, event.player) >= 0) return '额外回复';
                                    if (get.attitude(player, event.player) < 0) return '共同翻面';
                                };
                                ('step 1');
                                var A = '额外回复';
                                var B = '共同翻面';
                                var C = '使用决斗';
                                if (result.control == A) {
                                    trigger.player.hp = trigger.player.hp + 1;
                                    player.phase('nodelay');
                                    trigger.player.update();
                                    var A = ['哈哈哈!如此我便帮你一把!', '不管别的,现在你是我兄弟!'].randomGet();
                                    player.say(A);
                                }
                                if (result.control == B) {
                                    if (!player.isTurnOver) {
                                        player.turnOver();
                                    }
                                    if (!trigger.player.isTurnOver) {
                                        trigger.player.turnOver();
                                    }
                                    trigger.player.draw();
                                    player.draw();
                                    var A = ['啧!麻烦的家伙!', '烦死人了!得想办法嫩死他!!'].randomGet();
                                    player.say(A);
                                }
                                if (result.control == C) {
                                    trigger.player.draw(2);
                                    player.useCard({ name: 'juedou' }, trigger.player, false).animate = false;
                                    var A = ['嗬嗬!有胆!', '来啊!我早就看你不爽了!'].randomGet();
                                    player.say(A);
                                }
                            },
                        },
                        qinlong_huanling: {
                            nobracket: true,
                            group: ['qinlong_huanling_A', 'qinlong_huanling_B', 'qinlong_huanling_C'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.nature == 'thunder';
                                    },
                                    _priority: 86776,
                                    content() {
                                        trigger.cancel();
                                        trigger.source.damage('thunder', trigger.num, player);
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 758667,
                                    content() {
                                        'step 0';
                                        trigger.player.judge();
                                        ('step 1');
                                        switch (result.suit) {
                                            case 'spade':
                                                trigger.player.damage('thunder', player);
                                                break;
                                        }
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    _priority: 657866,
                                    content() {
                                        player.recover();
                                        game.countPlayer(function (current) {
                                            if (current.isMinHp()) {
                                                current.recover();
                                            }
                                        });
                                    },
                                },
                            },
                        },
                        qinlong_zhendong: {
                            nobracket: true,
                            group: ['qinlong_zhendong_A'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        global: 'recoverEnd',
                                    },
                                    forced: true,
                                    _priority: 57657,
                                    //锁定技,每次有角色回复体力后,你可选择一项①你与其额外增加一点体力并令其将武将翻面②你翻面并令其获得一个"苍"标记.拥有该标记的角色,其回合开始时进行一次判定,若结果为♣️️,则受到一点来自你的雷电伤害且你回复一点体力;若结果为♠️️,则受到两点来自你的雷电伤害;不论结果如何,其在结算后移去一个"苍"标记
                                    content() {
                                        'step 0';
                                        player.chooseControl('额外回复', '获得标记', '取消').ai = function (target) {
                                            if (get.attitude(player, target) > 0) return '额外回复';
                                            if (get.attitude(player, target) <= 0) return '获得标记';
                                        };//QQQ
                                        ('step 1');
                                        var A = '额外回复';
                                        var B = '获得标记';
                                        var C = '取消';
                                        if (result.control == A) {
                                            trigger.player.hp = trigger.player.hp + 1;
                                            player.hp = player.hp + 1;
                                            player.update();
                                            trigger.player.update();
                                            trigger.player.turnOver();
                                        }
                                        if (result.control == B) {
                                            trigger.player.addSkill('qinlong_zhendong_B');
                                            trigger.player.addMark('qinlong_zhendong_B', 1);
                                            player.turnOver();
                                        }
                                        if (result.control == C) {
                                            player.addSkill('qinlong_zhendong_A');
                                        }
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'phaseBegin',
                                    },
                                    forced: true,
                                    _priority: 68665,
                                    filter(event, player) {
                                        if (event.player.storage.qinlong_zhendong_B > 0) return true;
                                    },
                                    content() {
                                        'step 0';
                                        player.judge();
                                        ('step 1');
                                        game.countPlayer(function (current) {
                                            if (current.hasSkill('qinlong_zhendong')) {
                                                switch (result.suit) {
                                                    case 'spade':
                                                        trigger.player.damage('thunder', 2, current);
                                                        break;
                                                    case 'club':
                                                        trigger.player.damage('thunder', current);
                                                        current.recover();
                                                        break;
                                                }
                                            }
                                        });
                                        player.removeMark('qinlong_zhendong_B', 1);
                                        if (player.storage.qinlong_zhendong_B <= 0) {
                                            player.removeSkill('qinlong_zhendong_B');
                                        }
                                    },
                                    init(player) {
                                        player.storage.B;
                                    },
                                    marktext: '苍',
                                    intro: {
                                        name: '苍雷',
                                        content: '次数:#',
                                    },
                                },
                            },
                        },
                        zhuque_huanling: {
                            nobracket: true,
                            group: ['zhuque_huanling_A', 'zhuque_huanling_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 855687,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        trigger.cancel();
                                        player.recover(trigger.num);
                                    },
                                    mod: {
                                        globalFrom(from, to, distance) {
                                            if (from.hp > 0) return distance - from.hp;
                                        },
                                        globalTo(from, to, distance) {
                                            if (to.hp > 0) return distance + to.hp;
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 57758,
                                    filter(event, player, source) {
                                        return event.source != player;
                                    },
                                    content() {
                                        trigger.source.addSkill('zhuque_huanling_C');
                                        trigger.source.addMark('zhuque_huanling_C', 1);
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'recoverBegin',
                                    },
                                    forced: true,
                                    _priority: 575676,
                                    content() {
                                        'step 0';
                                        trigger.num--;
                                        player.removeMark('zhuque_huanling_C', 1);
                                        ('step 1');
                                        if (player.storage.zhuque_huanling_C <= 0) {
                                            player.removeSkill('zhuque_huanling_C');
                                        }
                                    },
                                    init(player) {
                                        player.storage.C;
                                    },
                                    marktext: '灼',
                                    intro: {
                                        name: '幻灵',
                                        content: '下次回复效果减一<br>剩余次数:#',
                                    },
                                },
                            },
                        },
                        zhuque_zhennan: {
                            nobracket: true,
                            group: ['zhuque_zhennan_A', 'zhuque_zhennan_B', 'zhuque_zhennan_C'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 467658,
                                    content() {
                                        game.countPlayer(function (current) {
                                            if (current.maxHp > player.maxHp) {
                                                if (player.countCards('h') > 0 && current.countCards('h') > 0) {
                                                    player.useCard({ name: 'huogong' }, current, false).animate = false;
                                                } else {
                                                    event.finish();
                                                }
                                            }
                                        });
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 467775,
                                    filter(event, player) {
                                        return event.nature == 'fire';
                                    },
                                    content() {
                                        player.recover();
                                        trigger.player.gainMaxHp();
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    _priority: 577557,
                                    filter(event, player) {
                                        if (player.maxHp > player.hp) return true;
                                        return false;
                                    },
                                    content() {
                                        'step 0';
                                        var A = player.maxHp - player.hp;
                                        player
                                            .chooseTarget([1, A], true, function (card, player, target) {
                                                return target != player;
                                            })
                                            .set('ai', function (target) {
                                                return get.attitude(player, target) < 0;
                                            });
                                        ('step 1');
                                        if (result.bool) {
                                            event.targets = result.targets.slice(0).sortBySeat();
                                            event.list = event.targets.slice(0);
                                        }
                                        ('step 2');
                                        if (event.targets.length) {
                                            var target = event.targets.shift();
                                            target.damage('fire', player);
                                            event.redo();
                                        }
                                    },
                                },
                            },
                        },
                        baihu_huanling: {
                            nobracket: true,
                            group: ['baihu_huanling_A', 'baihu_huanling_B', 'baihu_huanling_C'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 757865,
                                    filter(event, player) {
                                        return player.maxHp > player.hp;
                                    },
                                    content() {
                                        var A = player.maxHp - player.hp;
                                        trigger.num += A;
                                    },
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return num + (player.maxHp - player.hp);
                                        },
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'dieBegin',
                                    },
                                    forced: true,
                                    _priority: 756876,
                                    content() {
                                        player.gainMaxHp();
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseDiscardBegin',
                                    },
                                    forced: true,
                                    _priority: 8769876,
                                    filter(event, player) {
                                        game.countPlayer(function (current) {
                                            if (player.maxHp >= current.maxHp) return true;
                                        });
                                    },
                                    content() {
                                        player.loseMaxHp();
                                        player.turnOver();
                                    },
                                },
                            },
                        },
                        baihu_zhenxi: {
                            nobracket: true,
                            group: ['baihu_zhenxi_A', 'baihu_zhenxi_B'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        source: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 568767,
                                    content() {
                                        game.countPlayer(function (current) {
                                            if (current.hp > player.hp) {
                                                if (current.countCards('h') < 0) {
                                                    current.loseMaxHp(2);
                                                } else {
                                                    current.loseMaxHp();
                                                }
                                            }
                                        });
                                    },
                                },
                                B: {
                                    trigger: {
                                        global: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 987787,
                                    filter(event, player) {
                                        return event.source;
                                    },
                                    content() {
                                        if (trigger.source.hp > player.hp) {
                                            trigger.num--;
                                        }
                                    },
                                },
                            },
                        },
                        xuanwu_huanling: {
                            nobracket: true,
                            group: ['xuanwu_huanling_A', 'xuanwu_huanling_B', 'xuanwu_huanling_C'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 668887,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        trigger.cancel();
                                        player.gainMaxHp();
                                    },
                                },
                                B: {
                                    trigger: {
                                        player: 'loseHpBegin',
                                    },
                                    forced: true,
                                    _priority: 865576,
                                    content() {
                                        trigger.cancel();
                                        var A = trigger.num;
                                        if (player.hp < player.maxHp) {
                                            player.hp = player.hp + A;
                                            player.update();
                                        } else {
                                            player.gainMaxHp();
                                        }
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    forced: true,
                                    _priority: 867855,
                                    filter(event, player) {
                                        return player.hp < player.maxHp / 2;
                                    },
                                    content() {
                                        player.loseMaxHp();
                                        player.recover();
                                        player.turnOver();
                                    },
                                },
                            },
                        },
                        xuanwu_zhenbei: {
                            nobracket: true,
                            group: ['xuanwu_zhenbei_A', 'xuanwu_zhenbei_B', 'xuanwu_zhenbei_C', 'xuanwu_zhenbei_D'],
                            subSkill: {
                                A: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    _priority: 477556,
                                    content() {
                                        game.countPlayer(function (current) {
                                            if (current.hp < current.maxHp) {
                                                current.changeHujia();
                                            }
                                        });
                                    },
                                },
                                B: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 36785,
                                    filter(event, player) {
                                        return player.hujia > 0;
                                    },
                                    content() {
                                        player.changeHujia(-player.hujia);
                                        player.gain(game.createCard('du'))._triggered = null;
                                        trigger.num++;
                                    },
                                },
                                C: {
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    forced: true,
                                    _priority: 867855,
                                    filter(event, player) {
                                        return player.hujia > 0;
                                    },
                                    content() {
                                        var A = player.hujia;
                                        trigger.num += A;
                                    },
                                    mod: {
                                        maxHandcard(player, num) {
                                            return num + player.hujia;
                                        },
                                    },
                                },
                                D: {
                                    trigger: {
                                        source: 'damageBegin',
                                    },
                                    forced: true,
                                    _priority: 3678657,
                                    filter(event, player, target) {
                                        return event.player.hujia > 0;
                                    },
                                    content() {
                                        'step 0';
                                        var A = trigger.player.Hujia;
                                        trigger.player.addMark('xuanwu_zhenbei_D', A);
                                        trigger.player.hujia = 0;
                                        trigger.player.update();
                                        ('step 1');
                                        trigger.cancel();
                                        trigger.player.damage(trigger.num, 'thunder', player);
                                        ('step 2');
                                        trigger.player.hujia = trigger.player.storage.xuanwu_zhenbei_D;
                                        trigger.player.removeMark('xuanwu_zhenbei_D', player.storage.xuanwu_zhenbei_D);
                                        trigger.player.update();
                                    },
                                },
                            },
                        },
                    },
                    translate: {
                        zbjn: '<font color=#00FF7F> 装 备 技 能 </font>',
                        zbjn_info: '',
                        spjn: '<font color=#FF4500> 手 牌 技 能 </font>',
                        spjn_info: '',
                        dj: '<font color=orange>斗 技</font>',
                        dj_info: '',
                        dpcq_zhongchi: '重尺',
                        dpcq_zhongchi_info: "非锁定技 转换技<br>回合开始时,如果你的技能效果不是'尺',你将技能效果转换为'尺'并进入冷却状态<br>[尺]:每当你使用杀指定目标后,你可减一点体力上限,令其额外受到一点火焰伤害,你将技能效果转化为'极'并获得一点护甲和一枚丹药<br>(冷却时间:三轮)<br><br>[极]:非锁定技<br>你每造成一次伤害,目标获得等同于此次伤害量与你体力值之积的'劲'标记;<br>拥有'劲'标记的角色,在其回合开始阶段需进行一次判定;<br>如果判定点数大于'劲'标记,其需弃置与'劲'标记相同数量的牌;若目标没有手牌,则受到来自自身的一点伤害;<br>如果判定点数小于'劲'标记,其受到来自自身的一点伤害并减少一点体力上限;<br>如果判定点数等于'劲'标记,其摸两张牌<br>(不论结果如何,其在结算后移除所有'劲'标记)",
                        dpcq_huolian: '火莲',
                        dpcq_huolian_info: "非锁定技<br>你的火属性伤害加一并且造成伤害后回复一点体力<br>每当你造成一点伤害,你获得一个'莲'标记,回合阶段开始时,若你的'莲'标记大于等于五,你可选择一名角色对其造成两点火焰伤害,你流失一点体力并增加一点体力上限,随后移除所有'莲'标记将武将翻面(标记大于等于九时强制发动且效果改为:你可选择至多等同于你当前已损体力值的角色,目标受到一点火焰伤害,并对第一个目标重复造成一点火焰伤害,随后你流失两点体力)",
                        dpcq_lianyao: '炼药',
                        dpcq_lianyao_info: '锁定技<br>回合结束阶段,你获得一枚"丹"标记,准备阶段开始时,若你已受伤且标记数量不小于三,你回复一点体力并移去三枚标记(若效果执行后仍满足条件,则重复此过程)',
                        dpcq_shiyou: '师佑',
                        dpcq_shiyou_info: '锁定技<br>你的体力值每发生一次变化,你摸等同于"佑"印记的牌<br>你即将受到伤害时,若你当前体力值不大于伤害来源的体力值,或此伤害大于一点,你令其伤害减一,获得一枚"佑"印记和"莲"标记<br>当你的"佑"印记大于等于三时,你不能再发动减伤,你可在回合结束阶段流失一点体力,增加一点体力上限,并移除所有"佑"印记<br>你每拥有一枚"佑"印记,你的手牌上限加一',
                        dpcq_yanfan: '燕返',
                        dpcq_yanfan_info: "锁定技<br>每当你即将受到伤害时,如果你没有护甲,进行一次判定,若结果为红色取消之,若此伤害有来源,则对伤害来源造成一点伤害,否则你获得一枚'炎'印记",
                        dpcq_guazhang: '卦掌',
                        dpcq_guazhang_info: '非锁定技<br>你造成伤害后,可进行一次判定<br>♥️️你回复一点体力并对目标造成一点伤害<br>♦️️你摸一张牌且目标弃置一张牌<br>♣️️目标摸一张牌并翻面<br>♠️️目标回复一点体力,并进入混乱状态直到其回合结束',
                        dpcq_mifa: '秘法',
                        dpcq_mifa_info: "觉醒技<br>出牌阶段,如果你的'炎'印记不小于你体力上限与你当前体力值之和,你可以弃置所有印记并增加一点体力上限,回复印记数量与其之差的体力值,随后你获得技能[天炎]并失去此技能<br>当你进入濒死状态时,若你的'炎'印记不大于你的体力上限,你减一点体力上限,并将体力回复至上限,你失去此技能获得技能[天炎],并获得三枚'炎'印记;否则,你移去所有'炎'印记,将体力回复至上限,获得技能[天炎]并失去此技能",
                        dpcq_tianyan: '天炎',
                        dpcq_tianyan_info: "非锁定技<br>回合结束阶段,若你有'炎'印记,你可弃置一枚印记并选择一名目标,对其连续两次造成一点火焰伤害,若你当前体力值不为一,你流失一点体力并增加一点体力上限;否则你获得一枚'炎'印记<br>你每拥有一枚印记,你的手牌上限便加一",
                        dpcq_fenghua: '风华',
                        dpcq_fenghua_info: "非锁定技<br>每当你使用或打出一张黑色牌,你可以进行一次判定,若为黑色你回复一点体力并移去一枚'旋'标记(未受伤时改为摸一张牌且不移去标记)<br>你的手牌上限加二 ",
                        dpcq_fenggang: '风罡',
                        dpcq_fenggang_info: '非锁定技<br>你可以将一张黑色牌当雷杀使用或打出;你的黑色杀无视距离',
                        dpcq_xuanwu: '旋舞',
                        dpcq_xuanwu_info: "非锁定技<br>回合内,你可流失一点体力,并摸等同于已损体力值的牌(最多两张),获得一枚'旋'标记,你每拥有一枚'旋'标记,你的出杀次数加一<br>回合结束阶段,若你的'旋'标记不小于你当前体力值的二倍,你回复一点体力摸一张牌并获得一点护甲(因此获得的护甲值最多等于二)",
                        dpcq_yunsha: '陨杀',
                        dpcq_yunsha_info: "锁定技<br>每当你进入濒死状态后,若你的'旋'标记不小于你的体力上限,你减一点体力上限并回复一点体力,选择一名目标对其造成两点雷电伤害,随后你移去等同于你体力上限的'旋'标记 ",
                        dpcq_yixian: '医仙',
                        dpcq_yixian_info: '非锁定技<br>出牌阶段限一次,你可以弃置一张红色牌,令一名角色回复一点体力并摸一张牌',
                        dpcq_dusan: '毒散',
                        dpcq_dusan_info: '非锁定技<br>出牌阶段限一次,你可以弃置一张黑色牌并获得一张毒,选择一名角色,令其摸一张牌并进入混乱状态,直到其回合开始',
                        dpcq_enan: '厄难',
                        dpcq_enan_info: '锁定技<br>回合结束阶段,你摸一张牌,若你当前体力上限小于四,你增加一点体力上限;若你当前体力值为一,你减少一点体力上限并流失一点体力<br>你即将受到伤害时,若你当前体力值为一,你减少一点体力上限并流失一点体力',
                        dpcq_dujin: '毒经',
                        dpcq_dujin_info: '锁定技<br>你主动使用毒时,视为你使用了酒;你的体力流失均视为回复体力',
                        dpcq_paimai: '拍卖',
                        dpcq_paimai_info: "非锁定技<br>出牌阶段限一次,你可以选择一名角色与其拼点,若你赢,你弃置一张牌,其摸两张牌移除一枚'权'标记;若你没赢,其弃置一张牌,你摸三张牌,获得一枚'权'标记",
                        dpcq_zhangquan: '掌权',
                        dpcq_zhangquan_info: "锁定技<br>你每拥有一枚'权'标记,你回合结束时的摸牌数量及手牌上限加一<br>你对于体力值小于等于你管理权限的角色,造成的伤害加一",
                        dpcq_chiyi: '斥异',
                        dpcq_chiyi_info: "锁定技<br>每当你受到伤害后,若伤害来源是男性,其需弃置一张牌,你摸一张牌,若其没有手牌,则你的'权'标记加一并摸一张牌",
                        dpcq_yaomei: '妖媚',
                        dpcq_yaomei_info: "非锁定技<br>回合结束阶段,你可以移去一枚'权'标记,选择一名角色,使其武将翻面并摸一张牌",
                        dpcq_qitong: '奇瞳',
                        dpcq_qitong_info: "非锁定技<br>每两轮限一次,当你造成伤害后,你可与目标摸一张牌,其进入混乱状态,直到其再次受到伤害,你获得一枚'蛇'印记并回复一点体力",
                        dpcq_sheyi: '蛇裔',
                        dpcq_sheyi_info: '锁定技<br>你的防御距离始终相加你的已损体力值',
                        dpcq_tianshe: '天蛇',
                        dpcq_tianshe_info: "非锁定技<br>游戏开始时你获得三枚'蛇'印记;回合结束阶段,你可以弃置一枚'蛇'印记选择一名角色,对其造成一点伤害并令其弃置等同于其已损体力值的牌,若目标没有牌,则减少一点体力上限,你流失一点体力并获得一点护甲",
                        dpcq_laoying: '烙印',
                        dpcq_laoying_info: '锁定技<br>你死亡时选择一名角色,使其进入混乱状态,直到其死亡或游戏结束,你失去此技能',
                        dpcq_nijian: '拟剑',
                        dpcq_nijian_info: "非锁定技<br>出牌阶段若你拥有'闪'标记,你可弃置一枚'闪'标记并摸一张牌,刷新你本回合的出杀次数",
                        dpcq_feixv: '飞絮',
                        dpcq_feixv_info: "锁定技<br>你每使用一张杀获得一枚'瞬'标记;你每使用一张闪获得一枚'闪'标记<br>你每拥有一枚'瞬'标记攻击距离加一;你每拥有一枚'闪'标记防御距离加一<br>当你即将受到伤害时,若你此时同时拥有这两种标记,你弃置这些标记回复一点体力,并摸与这些标记同数量的牌",
                        dpcq_jiaoman: '娇蛮',
                        dpcq_jiaoman_info: "锁定技<br>每当你造成伤害后,你与目标各摸一张牌,其弃置一张牌<br>你受到伤害后,你随机获得一枚'瞬'或'闪'标记",
                        dpcq_luoyao: '落耀',
                        dpcq_luoyao_info: "非锁定技<br>回合结束阶段,若你至少拥有一枚'瞬'标记,你可弃置一枚'瞬'标记并获得一枚'闪'标记,选择一名角色对其造成一点雷电伤害",
                        dpcq_liandan: '炼丹',
                        dpcq_liandan_info: '非锁定技<br>出牌阶段,若你没有丹药,你可以弃置任意张手牌获得等量的丹药',
                        dpcq_danwang: '丹王',
                        dpcq_danwang_info: '非锁定技<br>回合内,若你有丹药,你可弃置一张牌选择一名角色,令其回复一点体力并获得一点护甲',
                        dpcq_qianhe: '谦和',
                        dpcq_qianhe_info: '锁定技<br>你没有丹药时,不能成为黑色牌的选择目标',
                        dpcq_minwang: '名望',
                        dpcq_minwang_info: '非锁定技<br>当你受到伤害时,若你拥有至少两枚丹药,你可选择失去两枚丹药,令来源摸两张牌,你抵消此伤害并摸一张牌',
                        dpcq_shehuang: '蛇皇',
                        dpcq_shehuang_info: "锁定技<br>你的基础攻击距离等于你当前体力值;你的防御距离相加你已损体力值<br>回合结束阶段或当你受到伤害后,你获得一枚'蟒'标记,若你当前的护甲值不大于你的已损体力值,你获得一点护甲<br>你即将造成伤害时,可移去一枚\"蟒\"标记(不管是否拥有),令目标减少一点体力上限<br>回合开始阶段,如果你的'蟒'标记不小于七,你变身为七彩吞天蟒(体力上限为四)",
                        dpcq_shiyao: '噬咬',
                        dpcq_shiyao_info: '锁定技<br>你用杀指定目标后,若其体力值大于你,你回复一点体力并摸一张牌;否则,你获得一点护甲且此杀不可闪避',
                        dpcq_guyi: '古裔',
                        dpcq_guyi_info: '锁定技<br>准备阶段开始时,你可以选择等同于你已损体力值的目标,视为对其使用一张杀<br>摸牌阶段,你的摸牌数改为你当前体力值(若你当前体力值为一则摸七张)<br>回合开始时,你摸等同于护甲值的牌,并回复护甲值一半的体力值(向上取整)移除所有护甲<br>你的攻击距离始终相加你当前体力值;你的防御距离始终相加你已损体力值<br>结束阶段开始时,如果当前游戏轮数是七的倍数且你的体力上限不小于七,你减少七点体力上限,否则增加七点体力上限',
                        dpcq_tuntian: '吞天',
                        dpcq_tuntian_info: '锁定技<br>每当你造成伤害时,若你已受伤,你增加一点体力上限;否则你流失一点体力,并视为对目标使用一张杀',
                        dpcq_bingjia: '冰甲',
                        dpcq_bingjia_info: '锁定技<br>你造成伤害时,你回复等同于你护甲的体力值,你移除所有护甲<br>你受到伤害时,你获得等同于你已损体力值的护甲',
                        dpcq_bingwu: '冰舞',
                        dpcq_bingwu_info: '非锁定技<br>每当你打出一张闪或万箭齐发,你可以进行一次判定,若结果为♠️️你获得一点护甲;否则你摸一张牌',
                        dpcq_bingbao: '冰爆',
                        dpcq_bingbao_info: '非锁定技<br>出牌阶段,你可以将两张黑色手牌当万箭齐发使用',
                        dpcq_bingfeng: '冰封',
                        dpcq_bingfeng_info: '锁定技<br>每当你造成伤害后,若目标体力值大于你,其武将翻面且你摸一张牌;否则其弃置一张手牌',
                        dpcq_xvling: '虚灵',
                        dpcq_xvling_info: '锁定技<br>你没有手牌时免疫所有非属性伤害;你每受到一次伤害便弃置一张手牌',
                        dpcq_lenghuo: '冷火',
                        dpcq_lenghuo_info: '非锁定技<br>你受到的火属性伤害减一;你造成火属性伤害后目标翻面',
                        dpcq_moding: '魔鼎',
                        dpcq_moding_info: "锁定技<br>每当你使用一张牌,你获得一个'鼎'并摸一张牌;当你累计获得至少十二个'鼎'时,在你下一次主动使用牌后,选择至多等同于你已损体力值加一名角色,并对其造成一点火焰伤害,你弃置所有手牌与'鼎'标记,并回复一点体力",
                        dpcq_gujie: '骨戒',
                        dpcq_gujie_info: '锁定技<br>你的非基本牌不计入手牌上限',
                        dpcq_manli: '蛮力',
                        dpcq_manli_info: '锁定技<br>你即将造成伤害时,若目标已受伤,则伤害加一;否则目标翻面',
                        dpcq_yinling: '应灵',
                        dpcq_yinling_info: '锁定技<br>摸牌阶段,你额外摸等同于你已损体力值的牌;你的手牌上限始终等于你的体力上限',
                        dpcq_longxie: '龙血',
                        dpcq_longxie_info: "锁定技<br>你即将造成伤害时,你可以移去等同于此次伤害值的'虚'标记,令此伤害加一;你即将受到伤害时,你可以移去等同于此次伤害值的'虚'标记,令此伤害减一<br>你每受到一次伤害,增加等同于伤害值的体力上限并摸同数量的牌;你每造成一次伤害,回复一点体力且目标弃置一张牌<br>你每拥有一枚'虚'标记你的攻击距离加一",
                        dpcq_longyin: '龙印',
                        dpcq_longyin_info: "非锁定技<br>出牌阶段,你可以减少等同于已损体力值的体力上限,并获得相应的'虚'标记<br>你处于濒死状态时,可选择一名角色,令其增加等同于你标记的体力上限,并摸同数量的牌,目标在当前回合结束后进行一个额外的回合",
                        dpcq_motie: '漠铁',
                        dpcq_motie_info: '非锁定技<br>每当你即将造成伤害时,若目标体力值大于等于你且你有手牌,你可与其弃置一张手牌,对其额外造成一点伤害;若目标体力值小于你,你获得其你与其体力之差数量的牌,回复一点体力',
                        dpcq_muling: '木灵',
                        dpcq_muling_info: '锁定技<br>出牌阶段结束后,若你的手牌数不大于你当前体力值,你回复一点体力并摸一张牌<br>回合结束阶段,若你已受伤,你摸等同于已损体力值的牌<br>你受到火属性伤害后,弃置等同于伤害值的牌',
                        dpcq_leiming: '雷鸣',
                        dpcq_leiming_info: '锁定技<br>出牌阶段开始时,你摸等同于已损体力值的牌;你的出杀次数相加你的已损体力值<br>你可将等同于你当前体力值数量的♠️️牌当做雷杀使用',
                        dpcq_shisheng: '噬生',
                        dpcq_shisheng_info: "锁定技<br>当你受到伤害后,你摸等同于当前已损体力值的牌<br>每当你进入濒死阶段时,你减少与'噬'标记相同的体力上限,将体力回复至体力上限的一半(向上取整)并获得一枚'噬'标记,在当前回合结束后进行一个额外的回合<br>你每击杀一名角色,增加一点体力上限",
                        dpcq_fengfu: '风缚',
                        dpcq_fengfu_info: '非锁定技<br>每三轮限一次,出牌阶段你可弃置一张牌,选择一名角色令其摸两张牌并进入缚束状态(其回合内,所有牌的使用基数为不可用状态,直到其回合结束) ',
                        dpcq_yunlan: '云岚',
                        dpcq_yunlan_info: '锁定技<br>每四轮限一次,当你的回合开始时从<br>[风缚] [落耀]<br>[风罡] [旋舞]<br>中随机获得一项作为你的技能<br>你的体力发生变化后,若体力值不大于三,视为拥有技能[飞絮],不大于二,摸一张牌并视为拥有技能[拟剑];不大于一,摸一张牌并视为拥有技能[风华]<br>你增加体力上限时,若你当前体力上限大于等于四,则取消之并改为回复相应的体力',
                        dpcq_shigang: '狮罡',
                        dpcq_shigang_info: '非锁定技<br>每当你受到一点伤害,可进行一次判定,若结果为红色,你摸一张牌并对伤害来源造成一点伤害,否则其弃置一张牌并视为你对其使用一张杀',
                        dpcq_jueduan: '决断',
                        dpcq_jueduan_info: '非锁定技 转换技<br>[决]:你使用杀指定目标后,可以取消之并获得目标一张牌,你摸一张牌,将技能效果转化为[断]<br><br>[断]:当你即将造成伤害时,你可以防止此伤害,并令目标弃置一张牌,你回复一点体力,将技能效果转化为[决]',
                        dpcq_yvshui: '御水',
                        dpcq_yvshui_info: "锁定技 转换技<br>准备阶段开始时你的'凝'印记加一<br><br>[水镜]:回合内如果你没有护甲,你可流失一点体力并获得已损体力值加二点护甲(此技能的体力流失不计入范围),你获得等量的'凝'印记并将技能效果转换为[鞭楚]<br><br>[鞭楚]:你使用杀指定目标后,可亮出牌堆顶的一张牌,若其为黑色,你的'凝'印记加二,且视为对目标再使用一张杀,否则目标需弃置一张牌,你的'凝'印记加一且本回合不能再使用杀,出牌阶段结束后,若你的'凝'印记不小于十,将技能效果转换为[愈灵]<br><br>[愈灵]:回合内你可以移除两枚'凝'印记,选择一名角色令其回复一点体力,随后将技能效果转换为[水镜]",
                        dpcq_mantuo: '曼陀',
                        dpcq_mantuo_info: "非锁定技<br>回合结束时,如果你的'凝'印记不小于十,你可以选择至多三名角色,对其各造成一点伤害,并且对于选择的第一名角色额外造成一点伤害,随后你移除所有'凝'印记,回复一点体力并摸两张牌",
                        dpcq_xiuluo: '修罗',
                        dpcq_xiuluo_info: "锁定技<br>你的杀可额外指定等同于你已损体力值的目标;你每造成一次伤害,获得目标的一张牌<br>你即将造成伤害时,若目标角色的体力值不大于你'煞'标记的数量,你移去一个'煞'标记且此伤害加一",
                        dpcq_xuesha: '血煞',
                        dpcq_xuesha_info: "锁定技<br>你每受到一次伤害,回复一点体力并获得等同于此次伤害的'煞'标记,伤害来源弃置一张牌;若你此时的'煞'标记数量大于你的体力上限,则将效果改为,你对来源使用一张决斗<br>回合结束阶段,如果你的'煞'标记不小于你当前体力值,你选择至多等同于'煞'标记数量的角色,视为对其使用一张杀",
                        dpcq_baqiang: '霸枪',
                        dpcq_baqiang_info: '锁定技<br>你使用杀指定目标后,如果目标的体力值大于你,则此杀不可闪避;否则目标角色需弃置一张牌<br>当你受到伤害或体力值发生变动后,若当前体力值小于体力上限的一半(向上取整),你摸一张牌,若你此时未拥有[裂山枪]的效果,你减少一点体力上限并回复一点体力获得之<br><br>[裂山枪]:回合内限一次,你可以选择一名角色并执行以下的一项,对目标角色使用一张杀并获得一点护甲;对目标角色使用一张决斗并摸一张牌',
                        dpcq_lieyan: '裂岩',
                        dpcq_lieyan_info: "锁定技<br>你受到伤害或体力值发生变动后,若目标来源没有'裂'标记,你令其获得一个'裂'标记,你获得一点护甲;你对拥有'裂'标记的角色造成的伤害加一,该角色失去'裂'标记<br>回合结束阶段,你摸等同于场上拥有'裂'标记角色的牌",
                        dpcq_shishi: '弑师',
                        dpcq_shishi_info: "锁定技<br>游戏开始时,你选择一名角色令其增加一点体力上限并回复一点体力,其获得'师'印记,该角色从牌堆摸牌或回复体力后需交给你一张手牌,若其没有手牌则你对其造成一点毒属性伤害;该角色受到伤害或体力流失后,若你已受伤则回复一点体力并弃置一张牌,否则该角色摸两张牌;你受到伤害后,该角色摸两张牌",
                        dpcq_xinyan: '心焰',
                        dpcq_xinyan_info: "锁定技<br>你即将造成伤害时,如果目标角色不拥有此技能,你令其获得一个'焰'标记<br>该角色受到伤害后,你获得其一张牌,若其没有牌改为你回复一点体力(未受伤则改为摸一张牌)<br>你受到伤害后,该角色需弃置一张牌,若其没有手牌则受到你的一点火焰伤害<br>你即将死亡时,移去场上所有'焰'标记并将体力回复至标记数量加一的值,你失去此技能,增加一点体力上限并弃置所有牌,随后获得技能[虚灵]",
                        dpcq_qingwu: '清抚',
                        dpcq_qingwu_info: '锁定技<br>你受到伤害后,进行一次判定,若结果不为♥️️,你将一张乐不思蜀置于伤害来源的判定区内;<br>当一名角色的出牌阶段被跳过后,你回复一点体力并视为你对其使用一张杀',
                        dpcq_yisui: '依随',
                        dpcq_yisui_info: '锁定技<br>场上所有体力值最高的其他角色,其跳过摸牌阶段,改为摸三张牌并需交给你一张牌;<br>体力值小于你手牌数的其他角色,其出牌阶段结束后需弃置等同于你手牌数的牌,若其手牌数大于你,你对其额外造成一点伤害',
                        dpcq_lianren: '敛刃',
                        dpcq_lianren_info: '锁定技<br>你未装备武器时,你的防御距离加一,且可将杀当闪使用或打出;当你装备武器后,你的攻击距离加一,且使用红色杀后摸一张牌,黑色杀目标需弃置一张牌<br>你的杀被闪避后,你可选择一项<br>ⓐ获得目标一张牌;<br>ⓑ视为对其使用一张决斗',
                        dpcq_qianchan: '牵缠',
                        dpcq_qianchan_info: '​锁定技<br>你造成伤害后,重置你本回合内的出杀次数并进行一次判定:若结果为红色,你获得目标的一张牌并回复一点体力(若你未受伤,则将体力回复改为获得一张装备牌),否则你获得一张决斗,其获得一张杀<br>你受到伤害后,可弃置一张牌并获得一点护甲,回合开始时,你移去所有护甲并摸等量的牌',
                        dpcq_baoyan: '爆焱',
                        dpcq_baoyan_info: '非锁定技<br>你受到伤害后,可令伤害来源获得一枚"焱"标记;<br>拥有"焱"标记的角色受到伤害时,若你不为伤害来源,则该角色受到来自你的一点火焰伤害若你当前已受伤则将武将翻至背面;<br>否则你回复一点体力摸一张牌(若未受伤则将回复效果改为获得一点护甲)<br>不论结果如何,其在结算后移去该标记',
                        dpcq_xinxi: '衅隙',
                        dpcq_xinxi_info: '锁定技<br>当其他角色回复体力后,其需选择一项:①额外增加一点体力并令其在当前回合结束后进行一个额外的回合②你与其摸一张牌并共同将武将翻面③你摸两张牌并视为其对你使用一张[决斗]​',
                        qinlong_huanling: '幻灵',
                        qinlong_huanling_info: '锁定技,雷属性伤害对你无效并将此伤害返还给伤害来源.你造成伤害后进行一次判定,若结果为♠️️,则目标受到你的一点雷电伤害.回合结束阶段,你与场上所有体力值最少的角色回复一点体力',
                        qinlong_zhendong: '镇东',
                        qinlong_zhendong_info: '锁定技,每次有角色回复体力后,你可选择一项①你与其额外增加一点体力并令其将武将翻面②你翻面并令其获得一个"苍"标记.拥有该标记的角色,其回合开始时进行一次判定,若结果为♣️️,则受到一点来自你的雷电伤害且你回复一点体力;若结果为♠️️,则受到两点来自你的雷电伤害;不论结果如何,其在结算后移去一个"苍"标记',
                        zhuque_huanling: '幻灵',
                        zhuque_huanling_info: '锁定技,你受到的火属性伤害均视为体力回复.你的攻击与防御距离均相加你当前体力值.你受到伤害后,令伤害来源下次的体力回复值减一(可叠加效果,每层效果单独执行)',
                        zhuque_zhennan: '镇南',
                        zhuque_zhennan_info: '锁定技,每次你造成伤害后,视为对体力上限大于你的角色使用一张[火攻].你造成火焰伤害后回复一点体力且目标增加一点体力上限.结束阶段开始时,你选择等同于你已损体力值的角色并对其造成一点火焰伤害',
                        baihu_huanling: '幻灵',
                        baihu_huanling_info: '锁定技,你的伤害值与出杀次数均相加你的已损体力值.你每击杀一名角色,增加一点体力上限.弃牌阶段开始时,若你的体力值上限为最高或之一,你减少一点体力上限并将武将翻面',
                        baihu_zhenxi: '镇西',
                        baihu_zhenxi_info: '锁定技,每次你造成伤害后,场上体力值大于你的角色减少一点体力上限,若目标角色没有手牌,则该值加一.场上体力值大于你的角色所造成的伤害减一',
                        xuanwu_huanling: '幻灵',
                        xuanwu_huanling_info: '锁定技,你免疫大于一点的伤害,改为增加一点体力上限.你的体力流失均视为增加相应的体力值(未受伤时改为增加一点体力上限).出牌阶段开始时,若你当前体力值小于你体力上限的一半,你减少一点体力上限回复一点体力并翻面',
                        xuanwu_zhenbei: '镇北',
                        xuanwu_zhenbei_info: '锁定技,每次你受到伤害后,场上的所有的已受伤角色获得一点护甲.你即将造成伤害时,若你有护甲,你移去所有护甲获得一张[毒]并令此伤害加一.你摸牌阶段的牌数与手牌上限均相加你的护甲值​​.你对有护甲的角色造成伤害时,将此伤害变为雷属性并无视目标护甲值',
                        dpcq_xiaoxuner: '萧薰儿',
                        dpcq_xiaoyan: '萧炎',
                        dpcq_yunyun: '云韵',
                        dpcq_xiaoyixian: '小医仙',
                        dpcq_yafei: '雅妃',
                        dpcq_qinglin: '青鳞',
                        dpcq_nalanyanran: '纳兰嫣然',
                        dpcq_guhe: '古河',
                        dpcq_cailing: '彩鳞',
                        dpcq_qicaituntianmang: '七彩吞天蟒',
                        dpcq_haibodong: '海波东',
                        dpcq_yaolao: '药老',
                        dpcq_ziyan: '紫妍',
                        dpcq_xiaoding: '萧鼎',
                        dpcq_xiaoli: '萧厉',
                        dpcq_yunshan: '云山',
                        dpcq_xiaozhan: '萧战',
                        dpcq_ruoling: '若琳',
                        dpcq_wuhao: '吴昊',
                        dpcq_liuqing: '柳擎',
                        dpcq_hanfeng: '韩枫',
                        dpcq_xiaomei: '萧媚',
                        dpcq_linxiuya: '林修崖',
                        dpcq_linyan: '林焱',
                        dpcq_qinlong_huanling: '青龙·幻灵',
                        dpcq_baihu_huanling: '白虎·幻灵',
                        dpcq_zhuque_huanling: '朱雀·幻灵',
                        dpcq_xuanwu_huanling: '玄武·幻灵',
                    },
                };
                lib.config.all.characters.add('斗破苍穹');
                lib.config.characters.add('斗破苍穹');
                for (var i in QQQ.character) {
                    QQQ.character[i][4].add(`ext:斗破苍穹/image/${i}.jpg`)
                }
                lib.translate['斗破苍穹_character_config'] = `斗破苍穹`;
                return QQQ;
            });
        },
        package: {
            card: {
                card: {
                    huiqidan: {
                        fullskin: true,
                        type: 'basic',
                        cardcolor: 'red',
                        toself: true,
                        enable(card, player) {
                            return player.hp <= player.maxHp;
                        },
                        savable: true,
                        selectTarget: -1,
                        filterTarget(card, player, target) {
                            return target == player && target.hp <= target.maxHp;
                        },
                        modTarget(card, player, target) {
                            return target.hp <= target.maxHp;
                        },
                        content() {
                            target.recover(event.baseDamage || 1);
                            target.draw(2);
                        },
                        ai: {
                            basic: {
                                order(card, player) {
                                    if (player.hasSkillTag('pretao')) return 5;
                                    return 2;
                                },
                                useful: [8, 6.5, 5, 4],
                                value: [8, 6.5, 5, 4],
                            },
                            result: {
                                target(player, target) {
                                    // if(player==target&&player.hp<=0) return 2;
                                    if (player.hasSkillTag('nokeep')) return 2;
                                    var nd = player.needsToDiscard();
                                    var keep = false;
                                    if (nd <= 0) {
                                        keep = true;
                                    } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                        keep = true;
                                    }
                                    var mode = get.mode();
                                    if (target.hp >= 2 && keep && target.hasFriend()) {
                                        if (target.hp > 2 || nd == 0) return 0;
                                        if (target.hp == 2) {
                                            if (
                                                game.hasPlayer(function (current) {
                                                    if (target != current && get.attitude(target, current) >= 3) {
                                                        if (current.hp <= 1) return true;
                                                        if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                    }
                                                })
                                            ) {
                                                return 0;
                                            }
                                        }
                                    }
                                    if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                    var att = get.attitude(player, target);
                                    if (att < 3 && att >= 0 && player != target) return 0;
                                    var tri = _status.event.getTrigger();
                                    if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                        if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                            var num = game.countPlayer(function (current) {
                                                if (current.identity == 'fan') {
                                                    return current.countCards('h', 'tao');
                                                }
                                            });
                                            if (num > 1 && player == target) return 2;
                                            return 0;
                                        }
                                    }
                                    if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                        if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                            return 0;
                                        }
                                    }
                                    if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                        return 0;
                                    }
                                    return 2;
                                },
                            },
                            tag: {
                                recover: 1,
                                save: 1,
                            },
                        },
                    },
                    haizhixinjia: {
                        fullskin: true,
                        type: 'equip',
                        subtype: 'equip2',
                        ai: {
                            basic: {
                                equipValue: 7.5,
                                order: 1,
                                useful: 2,
                                value: 1,
                            },
                            result: {
                                target(player, target, card) {
                                    return get.equipResult(player, target, card.name);
                                },
                            },
                        },
                        skills: ['zbjn_haizhixinjiaA', 'zbjn_haizhixinjiaB'],
                        enable: true,
                        selectTarget: -1,
                        filterTarget(card, player, target) {
                            return target == player;
                        },
                        modTarget: true,
                        allowMultiple: false,
                        content() {
                            if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
                        },
                        toself: true,
                    },
                    shijiu: {
                        type: 'equip',
                        subtype: ['equip3'],
                        fullskin: true,
                        distance: {
                            globalFrom: -1,
                            globalTo: 2,
                        },
                        enable: true,
                        selectTarget: -1,
                        filterTarget(card, player, target) {
                            return target == player;
                        },
                        modTarget: true,
                        allowMultiple: false,
                        content() {
                            target.gainMaxHp(2);
                            target.recover();
                            if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
                        },
                        skills: ['zbjn_shijiu'],
                        toself: true,
                        ai: {
                            basic: {
                                order: 1,
                                useful: 2,
                                equipValue: 7,
                                value: 1,
                            },
                            result: {
                                target(player, target, card) {
                                    return get.equipResult(player, target, card.name);
                                },
                            },
                        },
                    },
                    doujijuanzhou: {
                        fullskin: true,
                        type: 'basic',
                        enable: true,
                        selectTarget: -1,
                        cardcolor: 'red',
                        toself: true,
                        filterTarget(card, player, target) {
                            return target == player;
                        },
                        modTarget: true,
                        content() {
                            'step 0';
                            player.recover();
                            player.draw();
                            var num = get.rand(1, 100);
                            if (num <= 100 && num > 95) {
                                event.goto(4);
                            }
                            if (num <= 95 && num > 83) {
                                event.goto(3);
                            }
                            if (num <= 83 && num > 53) {
                                event.goto(2);
                            }
                            if (num <= 53) {
                                event.goto(1);
                            }
                            ('step 1');
                            if (num <= 100 && num > 72) {
                                var numDA = get.rand(1, 1);
                                if (numDA == 1) {
                                    player.addSkill('dj_DAtieshanquan');
                                }
                            }
                            if (num <= 72 && num > 38) {
                                var numDB = get.rand(1, 1);
                                if (numDB == 1) {
                                    player.addSkill('dj_DBsanshaci');
                                }
                            }
                            if (num <= 38) {
                                var numDC = get.rand(1, 1);
                                if (numDC == 1) {
                                    player.addSkill('dj_DCsuishizhang');
                                }
                            }
                            event.finish();
                            ('step 2');
                            if (num <= 100 && num > 79) {
                                var numCA = get.rand(1, 1);
                                if (numCA == 1) {
                                    player.addSkill('dj_CAxizhang');
                                }
                            }
                            if (num <= 79 && num > 49) {
                                var numCB = get.rand(1, 1);
                                if (numCB == 1) {
                                    player.addSkill('dj_DAtieshanquan');
                                }
                            }
                            if (num <= 49) {
                                var numCC = get.rand(1, 1);
                                if (numCC == 1) {
                                    player.addSkill('dj_DBsanshaci');
                                }
                            }
                            event.finish();
                            ('step 3');
                            if (num <= 100 && num > 71) {
                                var numBA = get.rand(1, 1);
                                if (numBA == 1) {
                                    player.addSkill('dj_DCsuishizhang');
                                }
                            }
                            if (num <= 71 && num > 38) {
                                var numBB = get.rand(1, 1);
                                if (numBB == 1) {
                                    player.addSkill('dj_CAxizhang');
                                }
                            }
                            if (num <= 38) {
                                var numBC = get.rand(1, 1);
                                if (numBC == 1) {
                                    player.addSkill('dj_DAtieshanquan');
                                }
                            }
                            event.finish();
                            ('step 4');
                            if (num <= 100 && num > 80) {
                                var numAA = get.rand(1, 1);
                                if (numAA == 1) {
                                    player.addSkill('dj_DBsanshaci');
                                }
                            }
                            if (num <= 80 && num > 50) {
                                var numAB = get.rand(1, 1);
                                if (numAB == 1) {
                                    player.addSkill('dj_DAtieshanquan');
                                }
                            }
                            if (num <= 50) {
                                var numAC = get.rand(1, 1);
                                if (numAC == 1) {
                                    player.addSkill('dj_CAxizhang');
                                }
                            }
                            event.finish();
                        },
                        ai: {
                            basic: {
                                order: 7.2,
                                useful: 4.5,
                                value: 9.2,
                            },
                            result: {
                                target: 2,
                            },
                            tag() {
                                'step 0';
                                player.recover();
                                player.draw();
                                var num = get.rand(1, 100);
                                if (num <= 100 && num > 95) {
                                    event.goto(4);
                                }
                                if (num <= 95 && num > 83) {
                                    event.goto(3);
                                }
                                if (num <= 83 && num > 53) {
                                    event.goto(2);
                                }
                                if (num <= 53) {
                                    event.goto(1);
                                }
                                ('step 1');
                                if (num <= 100 && num > 72) {
                                    var numDA = get.rand(1, 1);
                                    if (numDA == 1) {
                                        player.addSkill('dj_DAtieshanquan');
                                    }
                                }
                                if (num <= 72 && num > 38) {
                                    var numDB = get.rand(1, 1);
                                    if (numDB == 1) {
                                        player.addSkill('dj_DBsanshaci');
                                    }
                                }
                                if (num <= 38) {
                                    var numDC = get.rand(1, 1);
                                    if (numDC == 1) {
                                        player.addSkill('dj_DCsuishizhang');
                                    }
                                }
                                event.finish();
                                ('step 2');
                                if (num <= 100 && num > 79) {
                                    var numCA = get.rand(1, 1);
                                    if (numCA == 1) {
                                        player.addSkill('dj_CAxizhang');
                                    }
                                }
                                if (num <= 79 && num > 49) {
                                    var numCB = get.rand(1, 1);
                                    if (numCB == 1) {
                                        player.addSkill('dj_DAtieshanquan');
                                    }
                                }
                                if (num <= 49) {
                                    var numCC = get.rand(1, 1);
                                    if (numCC == 1) {
                                        player.addSkill('dj_DBsanshaci');
                                    }
                                }
                                event.finish();
                                ('step 3');
                                if (num <= 100 && num > 71) {
                                    var numBA = get.rand(1, 1);
                                    if (numBA == 1) {
                                        player.addSkill('dj_DCsuishizhang');
                                    }
                                }
                                if (num <= 71 && num > 38) {
                                    var numBB = get.rand(1, 1);
                                    if (numBB == 1) {
                                        player.addSkill('dj_CAxizhang');
                                    }
                                }
                                if (num <= 38) {
                                    var numBC = get.rand(1, 1);
                                    if (numBC == 1) {
                                        player.addSkill('dj_DAtieshanquan');
                                    }
                                }
                                event.finish();
                                ('step 4');
                                if (num <= 100 && num > 80) {
                                    var numAA = get.rand(1, 1);
                                    if (numAA == 1) {
                                        player.addSkill('dj_DBsanshaci');
                                    }
                                }
                                if (num <= 80 && num > 50) {
                                    var numAB = get.rand(1, 1);
                                    if (numAB == 1) {
                                        player.addSkill('dj_DAtieshanquan');
                                    }
                                }
                                if (num <= 50) {
                                    var numAC = get.rand(1, 1);
                                    if (numAC == 1) {
                                        player.addSkill('dj_CAxizhang');
                                    }
                                }
                                event.finish();
                            },
                        },
                    },
                    xuanzhongchi: {
                        fullskin: true,
                        type: 'equip',
                        subtype: 'equip1',
                        distance: {
                            attackFrom: -2,
                        },
                        ai: {
                            basic: {
                                equipValue: 2,
                                order: 1,
                                useful: 2,
                                value: 1,
                            },
                            result: {
                                target(player, target, card) {
                                    return get.equipResult(player, target, card.name);
                                },
                            },
                        },
                        skills: ['zbjn_xuanzhongchi'],
                        enable: true,
                        selectTarget: -1,
                        filterTarget(card, player, target) {
                            return target == player;
                        },
                        modTarget: true,
                        allowMultiple: false,
                        content() {
                            if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
                        },
                        toself: true,
                    },
                    qicaidujing: {
                        fullskin: true,
                        type: 'equip',
                        subtype: 'equip5',
                        ai: {
                            basic: {
                                equipValue: 7.5,
                                order: 1,
                                useful: 2,
                                value: 1,
                            },
                            result: {
                                target(player, target, card) {
                                    return get.equipResult(player, target, card.name);
                                },
                            },
                        },
                        skills: ['zbjn_qicaidujing'],
                        enable: true,
                        selectTarget: -1,
                        filterTarget(card, player, target) {
                            return target == player;
                        },
                        modTarget: true,
                        allowMultiple: false,
                        content() {
                            if (cards.length && get.position(cards[0], true) == 'o') target.equip(cards[0]);
                        },
                        toself: true,
                    },
                },
                translate: {
                    huiqidan: '回气丹',
                    huiqidan_info: '出牌阶段,对自己使用,回复一点体力并摸两张牌',
                    haizhixinjia: '海之心甲',
                    haizhixinjia_info: '锁定技,每当你受到一次伤害,你获得等同于已损体力值的护甲,摸等同于你当前体力值的牌;出牌阶段开始时,如果你有护甲,你移去所有护甲并弃置等量的手牌',
                    shijiu: '狮鹫',
                    shijiu_info: '你的攻击距离加一,防御距离加二;你装备此装备后,回复一点体力并增加两点体力上限;每当你即将受到伤害时,你可以减少一点体力上限并获得一点护甲,弃置等同于你当前体力值的牌,将此伤害返还给来源',
                    doujijuanzhou: '斗技卷轴',
                    doujijuanzhou_info: '出牌阶段,对自己使用,回复一点体力摸一张牌并随机获得一项斗技(有概率重复获得)',
                    xuanzhongchi: '玄重尺',
                    xuanzhongchi_info: '你使用杀指定目标后​,可弃置一张手牌,令目标的防具失效并需额外使用一张闪来响应此杀<br>你的杀造成伤害后获得一点护甲​,若你因此击杀了该角色,你增加一点体力上限',
                    qicaidujing: '七彩毒经',
                    qicaidujing_info: '锁定技<br>你的体力流失均视为增加体力;你的体力回复均视为减少体力;回合结束阶段,你获得一张毒;你造成伤害后,目标需弃置等同于你手牌数与体力值之差的绝对值的牌,若其没有牌则减少一点体力上限并回复一点体力',
                },
                list: [//牌堆
                    ['heart', '1', 'huiqidan'],
                    ['diamond', '1', 'huiqidan'],
                    ['club', '1', 'huiqidan'],
                    ['spade', '1', 'huiqidan'],
                    ['heart', '13', 'huiqidan'],
                    ['diamond', '13', 'huiqidan'],
                    ['club', '13', 'huiqidan'],
                    ['spade', '13', 'huiqidan'],
                    ['heart', '9', 'shijiu'],
                    ['heart', '5', 'doujijuanzhou'],
                    ['diamond', '5', 'doujijuanzhou'],
                    ['club', '5', 'doujijuanzhou'],
                    ['spade', '5', 'doujijuanzhou'],
                    ['diamond', '7', 'xuanzhongchi'],
                    ['club', '4', 'qicaidujing'],
                    ['club', '5', 'haizhixinjia'],
                ],
            },
            intro: `<br><br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br><br></span>此扩展为测试版<br>图片素材均来源于网络<br><br>整体武将强度及玩法会随着本人实力逐渐翻新<br>技能效果均本萌新与修订大佬自制,为了考虑整体强度以及作者自身的实力,请原著大神不要在意一些细小的细节修改<br><br>感谢以下大佬的帮助:<br>欧尼斯特·渣诚<br><br>有建议或bug请反馈`,
            author: '瞬 Q:2889711580<br>修订:Tiberay Q:1307418981<br>(更新日期:2020.08.08)',
            version: '1.5.6',
        },
    };
});
