import { lib, game, ui, get, ai, _status } from '../../noname.js';
game.import('extension', function (lib, game, ui, get, ai, _status) {
    return {
        name: '神域',
        content(config, pack) {
            lib.group.push('qunII');
            lib.translate.qunII = '异';
            lib.groupnature.qunII = '#A9A9A9';
            lib.rank.rarity.junk.addArray(['哨戒炮']);
            lib.rank.rarity.rare.addArray(['尸群', '鸟身女妖', '博丽灵梦', '真岛吾朗', '力巴尔', '米法', '乌尔波扎', '达尔克尔', '战争机甲', '蜘蛛机甲', '守护者']);
            lib.rank.rarity.epic.addArray(['猎杀者', '暗夜之歌', '异形', '防爆特警', '阿拉贡', '夜魔', '德古拉', '尼奥', '邪念', '艾斯德斯', '桐生一马', '龙裔', '塞尔达', '不动明']);
            lib.rank.rarity.legend.addArray(['北溟巨鲲', '宇文拓', '晓美焰', '祸灵梦', '维吉尔', '真魔人', '恶灵骑士', '地狱少女', '死亡骑士', '武庚', '林克', '杰诺斯', '天启坦克', '机械哥斯拉', '危险流浪者', '魑魅魍魉', '刑天', '黑白无常', '金翅鹏', '牛头马面', '远古巨龙', '幽冥大帝', '应龙', '炼狱龙', '凶恶年兽', '煌黑龙', '利维坦', '僵尸龙', '路西法', '合体年兽', '亡灵龙', '高达一号', '终结者', '克苏鲁', '九天玄女', '死亡女神', '收割者', '飞升吸血鬼', '奎托斯', '天命人', '机械吕布', '歼灭者', '帝王蟹', '毁灭战士', '加农道夫', '雷电', '电锯人', '哨兵坦克', '基洛夫空艇', '炮艇机', '将军刽子手', '追踪者', '澹台烬', '战斗暴龙兽', '库巴', '炽天使', '芬利尔']);
            lib.characterTitle.终结者 = '<span style="color: #AAAAFF">机械杀手</span>';
            lib.characterTitle.高达一号 = '<span style="color: #FFA500">神威如龙</span>';
            lib.characterTitle.魑魅魍魉 = '<span style="color: #7D26CD">鬼蜮</span>';
            lib.characterTitle.牛头马面 = '<span style="color: #7D26CD">冥府双煞</span>';
            lib.characterTitle.黑白无常 = '<span style="color: #7D26CD">勾魂索命</span>';
            lib.characterTitle.合体年兽 = '<span style="color: #FF6600">择魂而噬</span>';
            lib.characterTitle.凶恶年兽 = '<span style="color: #FF6600">凶残暴虐</span>';
            lib.characterTitle.幽冥大帝 = '<span style="color: #458B00">冥府守护神</span>';
            lib.characterTitle.亡灵龙 = '<span style="color: #3366FF">极度深寒</span>';
            lib.characterTitle.僵尸龙 = '<span style="color: #228B22">腐尸剧毒</span>';
            lib.characterTitle.煌黑龙 = '<span style="color: #800000">释放黑光之神</span>';
            lib.characterTitle.炼狱龙 = '<span style="color: #FF6600">毁灭之化身</span>';
            lib.characterTitle.金翅鹏 = '<span style="color: #FFA500">扶摇直上</span>';
            lib.characterTitle.路西法 = '<span style="color: #7A378B">堕落天使</span>';
            lib.characterTitle.北溟巨鲲 = '<span style="color: #3366FF">北海巨影</span>';
            lib.characterTitle.应龙 = '<span style="color: #EA7500">始源之龙</span>';
            lib.characterTitle.刑天 = '<span style="color: #EA7500">神躯化首</span>';
            lib.characterTitle.远古巨龙 = '<span style="color: #707070">虚空投影</span>';
            lib.characterTitle.克苏鲁 = '<span style="color: #800000">混沌之源</span>';
            lib.characterTitle.九天玄女 = '<span style="color: #1874CD">天命之上</span>';
            lib.characterTitle.死亡女神 = '<span style="color: #A757A8">神座之主</span>';
            lib.characterTitle.收割者 = '<span style="color: #AAAAFF">毁灭泰坦</span>';
            lib.characterTitle.战争机甲 = '<span style="color: #AAAAFF">屠杀机器</span>';
            lib.characterTitle.德古拉 = '<span style="color: #FF0000">血之祖</span>';
            lib.characterTitle.飞升吸血鬼 = '<span style="color: #FF0000">不朽君王</span>';
            lib.characterTitle.利维坦 = '<span style="color: #800000">末日堡垒</span>';
            lib.characterTitle.奎托斯 = '<span style="color: #FFA500">战争之神</span>';
            lib.characterTitle.死亡骑士 = '<span style="color: #3366FF">天灾降临</span>';
            lib.characterTitle.天命人 = '<span style="color: #FFE400">斗战胜佛</span>';
            lib.characterTitle.机械吕布 = '<span style="color: #000000">黑曜之斗神</span>';
            lib.characterTitle.歼灭者 = '<span style="color: #5C0000">终焉灭绝</span>';
            lib.characterTitle.帝王蟹 = '<span style="color: #5C0000">钢铁巨钳</span>';
            lib.characterTitle.毁灭战士 = '<span style="color: #EA0000">开膛破肚</span>';
            lib.characterTitle.蜘蛛机甲 = '<span style="color: #104E8B">迅捷之翼</span>';
            lib.characterTitle.加农道夫 = '<span style="color: #FF7F00">绝望之焰</span>';
            lib.characterTitle.力巴尔 = '<span style="color: #AAAAFF">苍穹之风</span>';
            lib.characterTitle.米法 = '<span style="color: #3366FF">波涛之护</span>';
            lib.characterTitle.乌尔波扎 = '<span style="color: #EEEE00">雷霆之迅</span>';
            lib.characterTitle.达尔克尔 = '<span style="color: #8B0000">熔岩之心</span>';
            lib.characterTitle.林克 = '<span style="color: #1874CD">希望之剑</span>';
            lib.characterTitle.雷电 = '<span style="color: #4682B4">行星突击者</span>';
            lib.characterTitle.电锯人 = '<span style="color: #CD3333">链锯恶魔</span>';
            lib.characterTitle.塞尔达 = '<span style="color: #DAA520">三角之力</span>';
            lib.characterTitle.守护者 = '<span style="color: #00CED1">遗迹守卫</span>';
            lib.characterTitle.哨兵坦克 = '<span style="color: #8B1A1A">苏维埃壁垒</span>';
            lib.characterTitle.基洛夫空艇 = '<span style="color: #A52A2A">天降死亡</span>';
            lib.characterTitle.天启坦克 = '<span style="color: #8B2323">钢铁洪流</span>';
            lib.characterTitle.炮艇机 = '<span style="color: #000080">自由恩赐者</span>';
            lib.characterTitle.将军刽子手 = '<span style="color: #008B8B">钢铁巨刃</span>';
            lib.characterTitle.夜魔 = '<span style="color: #8B2500">暗夜猎手</span>';
            lib.characterTitle.追踪者 = '<span style="color: #551A8B">复仇天神</span>';
            lib.characterTitle.阿拉贡 = '<span style="color: #36648B">游侠</span>';
            lib.characterTitle.澹台烬 = '<span style="color: #B22222">万古同悲</span>';
            lib.characterTitle.尸群 = '<span style="color: #8C2500">涌动之潮</span>';
            lib.characterTitle.暗夜之歌 = '<span style="color: #6CA6CD">月光薄纱</span>';
            lib.characterTitle.战斗暴龙兽 = '<span style="color: #EE9A00">勇气传说</span>';
            lib.characterTitle.库巴 = '<span style="color: #EE7600">龙焰暴君</span>';
            lib.characterTitle.地狱少女 = '<span style="color: #B03060">地狱少女</span>';
            lib.characterTitle.哨戒炮 = '<span style="color: #828282">子弹风暴</span>';
            lib.characterTitle.普通人 = '<span style="color: #009ACD">卓尔不凡</span>';
            lib.characterTitle.普通人II = '<span style="color: #DB7093">卓尔不凡</span>';
            lib.characterTitle.不动明 = '<span style="color: #CD2626">恶魔人</span>';
            lib.characterTitle.防爆特警 = '<span style="color: #828282">全副武装</span>';
            lib.characterTitle.武庚 = '<span style="color: #FF7F24">逆天改命</span>';
            lib.characterTitle.炽天使 = '<span style="color: #FFFFFF">至高天使</span>';
            lib.characterTitle.杰诺斯 = '<span style="color: #FF8C00">魔鬼改造人</span>';
            lib.characterTitle.尼奥 = '<span style="color: #0000FF">救世主</span>';
            lib.characterTitle.邪念 = '<span style="color: #CD0000">杀戮神选</span>';
            lib.characterTitle.鸟身女妖 = '<span style="color: #8B475D">魔音扰智</span>';
            lib.characterTitle.芬利尔 = '<span style="color: #53868B">极星魔狼</span>';
            lib.characterTitle.艾斯德斯 = '<span style="color: #00CDCD">冰岚风暴</span>';
            lib.characterTitle.桐生一马 = '<span style="color: #FFC125">堂岛之龙</span>';
            lib.characterTitle.危险流浪者 = '<span style="color: #B0C4DE">钢铁卫士</span>';
            lib.characterTitle.机械哥斯拉 = '<span style="color: #EE0000">质子尖啸</span>';
            lib.characterTitle.龙裔 = '<span style="color: #B4CDCD">伊斯米尔</span>';
            lib.characterTitle.恶灵骑士 = '<span style="color: #FFA54F">汹涌地狱火</span>';
            lib.characterTitle.维吉尔 = '<span style="color: #3A5FCD">恶魔之子</span>';
            lib.characterTitle.真魔人 = '<span style="color: #00008B">漆黑魔剑士</span>';
            lib.characterTitle.猎杀者 = '<span style="color: #C1CDCD">武装无人机</span>';
            lib.characterTitle.祸灵梦 = '<span style="color: #8B2252">终堕天</span>';
            lib.characterTitle.宇文拓 = '<span style="color: #FFB90F">轩辕剑仙</span>';
            lib.characterTitle.异形 = '<span style="color: #006400">深渊梦魇</span>';
            lib.characterTitle.晓美焰 = '<span style="color: #8B008B">时之魔女</span>';
            lib.characterTitle.博丽灵梦 = '<span style="color: #D02090">悠闲的巫女</span>';
        },
        precontent() {
            game.import('character', function (lib, game, ui, get, ai, _status) {
                const QQQ = {
                    name: '神域',
                    connect: true,
                    character: {
                        终结者: ['none', 'shen', '1/1/5', ['机械', '钢骨', '残躯', '扫射', 'boss__baolian', 'musical_T800', 'dierobot'], ['des:来自未来世界的超级机器人,携带手提式转轮机枪.内部的机械骨骼(由超合金打造,极其坚韧)被类似人类外观的可再生皮肤包裹.由于时间机器故障,本应该消灭人类反抗军的机械杀手却被错误的传送到了三国时期,这对当时的人类而言是一场无妄之灾.在搜寻约翰康纳无果后,遇到前来寻衅的魑魅魍魉并轻松将其虐杀,完成物理驱鬼的壮举']],
                        高达一号: ['male', 'shen', 1, ['龙躯', '龙佑', 'gdjuejing', 'gdlonghun', 'gdzhanjiang', 'diedragonIII', 'musical_dragon_gdyh'], ['des:神格化的赵云,获得了远古巨龙的一丝神力,其作为人类的守护灵现世,阻止一切妖魔鬼怪入侵人界,曾大战年兽并将其驱逐']],
                        魑魅魍魉: ['male', 'shen', 6, ['boss__guimei', 'boss__guihuo', 'reenyuan', 'boss__luolei', 'boss__shanbeng'], ['des:四者皆为传说中的鬼怪.单个鬼怪的威胁虽然不足为虑,但四者联起手来却十分难缠.在异界危机爆发前期潜入人界作乱,人类对其避之不及.后来准备袭击被时间机器传送至此的终结者,四者皆被其人类外表欺骗而轻敌以至大败而归.被赶回冥府之后,却发现此地早已变天']],
                        牛头马面: ['male', 'shen', 8, ['boss__guiji', 'boss__taiping', 'refankui', 'olniepan', 'boss__lianyu'], ['des:牛头马面,二者皆为冥府的勾魂使者,充当阎王及判官的下属.冥府沦陷之后,不再受到约束,遂进入人界作乱']],
                        黑白无常: ['male', 'shen', 10, ['boss__suoming', 'boss__xixing', 'boss__didong', 'boss__qiangzheng', 'juece'], ['des:黑无常,名为犯无赦,对违抗法令身负罪过者一概无赦,属阴,对女性吸其阳魂,对男性散其阳魄.白无常,名为谢必安,对恭敬神明之人以好运,属阳,对男性吸其阴魂,对女性散其阴魄.二者在冥府沦陷之后,进入人界作乱']],
                        合体年兽: ['male', 'shen', 12, ['boss__shouyi', 'boss__nbaonu', 'boss__jingjue', 'boss__renxing', 'boss__ruizhi', 'musical_nshou'], ['des:传说中的恶兽,共有四种形态,分别为暴怒,警觉,任性,睿智.为了与人类守护灵对抗,其将四种形态的力量合而为一,相比于普通年兽,合体年兽对人类产生的威胁大得多.在摧毁了多个村庄之后被获得龙之力量的人类守护灵赵云击败并驱逐']],
                        凶恶年兽: ['female', 'shen', 12, ['boss__xiongshou', 'boss__modao', 'boss__moyany', 'boss__leiji', 'boss__zhue', 'musical_xshou'], ['des:来自异界,更为凶恶的年兽,其四周由闪电缠绕,口中也能喷发灼热的吐息.对一切生灵均抱有敌意,对人类的威胁更甚于合体年兽.在异界危机爆发时准备进入人界为祸四方,但运气不好,遇到了通过时空隧道来到此地的煌黑龙,被煌黑龙的能量飓风卷入,身受重伤并逃回自己的世界']],
                        幽冥大帝: ['male', 'shen', 15, ['幽冥', '铁面', '刑判', '震怒', '地府', 'musical_ymdd'], ['zhu', 'des:又称酆都北阴大帝,主管冥司,传说中的冥府之神,阎罗王的顶头上司.在异界危机爆发时,冥府被入侵,幽冥大帝消灭了绝大多数来自其他位面的入侵者,在油尽灯枯之时被龙巫妖偷袭,与其死战不敌被击杀,冥府也随之沦陷,只能化为一缕残魂前往人界寻求帮助']],
                        亡灵龙: ['male', 'shen', 20, ['龙翼', 'boss__suoming', 'boss__xixing', 'wlbingfeng', 'wljihan', 'musical_dragon_wll'], ['des:生活在极寒之地的龙,为了逃避死亡,使用黑魔法令自己舍去肉身,全身化为枯骨,成为不死不灭的龙巫妖.在异界危机爆发时,为了追寻更强的力量而入侵冥府.在幽冥大帝疲于应付其他异界入侵者时,出手偷袭并成功将其击杀.自此,冥府处于无人看管的状态']],
                        僵尸龙: ['male', 'shen', 20, ['龙翼', '积腐', '瘟疫', '瘴气', '尸毒', 'musical_dragon_jsl'], ['des:全身腐烂的龙,原本生活在日本海附近的沼泽地,以路过的大型食草动物为食.由于受到了核废水污染,其身体发生了变异,性格更为凶暴,会自主攻击并吞噬周围的一切活物,对附近的生态坏境危害极大']],
                        煌黑龙: ['male', 'shen', 20, ['神域', '雷鸣', 'boss__fengdong', 'boss__juehong', '劫火', 'musical_dragon_hhl'], ['des:来自异界的龙,全身覆盖逆鳞,虽然对人类没有敌意,但其本身的存在就是破坏的象征,能够操纵所有天灾并夺取一切生命.在异界危机爆发时,无意间进入人界.在自身周围狂暴能量的肆虐之下,其附近绝大多数生物还没来得及逃跑就瞬间化为焦土,而祂所栖息的领域再也不适合其他生命存活']],
                        炼狱龙: ['male', 'shen', 20, ['龙翼', '旋风', '无间', '龙魂', '龙息', 'diedragonIV', 'musical_dragon_lyl'], ['des:来自地狱的龙,即使是地狱领主也要对其避让三分.据说炼狱龙通过时空隧道来到人界后,一直生活在火山之下,以岩浆为食.炼狱龙能够释放非常可怕的火焰吐息,毁灭力极强.一旦出现在地表,将带来不可估量的破坏与灾难']],
                        金翅鹏: ['male', 'shen', 15, ['神羽', 'fengqi', 'boss__biantian', 'boss__fentian', 'boss__tianyun', 'musical_jcp'], ['des:传说中的神鸟,火焰的化身,所过之处皆为一片火海']],
                        路西法: ['male', 'shen', 20, ['魔躯', '魔甲', 'mwhuangwei', 'mwshawei', 'mwjiuchi', 'diedragonII'], ['zhu', 'des:路西法原名萨麦尔,是上帝所创造的天使之一.因出于狂妄,企图篡夺上帝之位而被上帝驱逐,堕落成为恶魔,但其仍具备超人的本领对抗上帝,并时常引诱人类抛弃生命与救赎走向毁灭.路西法是前任地狱领主,异界危机爆发后,地狱陷入战争状态,各方势力都想一统九狱并向人界发起进攻,包括路西法.路西法在混战中消灭了绝大多数敌人,随后却因太大意,被掌握旧日支配者之力的死亡女神击败,不知所踪,有传言称其已经逃往人界并正在进行新一轮的复仇计划']],
                        北溟巨鲲: ['female', 'shen', 25, ['北溟', '巨浪', '风暴', 'boss__lingqu', 'boss__lingyu', 'musical_beimjq'], ['des:传说中的大鱼,生活在极北地区幽深的大海 - 北溟,具有强大的生命力,能轻易引发足以淹没世界的滔天巨浪,给人类带来灭顶之灾']],
                        应龙: ['male', 'shen', 30, ['龙翼', '劫云', '龙怒', 'wzlongyan', '地震', 'musical_dragon_ylong', 'diedragonIV'], ['des:传说中的创世神龙,龙族的始祖.应龙助黄帝争帝位而于南极杀蚩尤、夸父;助大禹治水而以尾画地成江、开辟龙门、擒无支祁.具有创世之威,灭世之能']],
                        刑天: ['male', 'shen', '3/30/15', ['神勇', '化首', '洪荒', '破天II', '堕天', 'musical_xt', 'diedragonII'], ['des:干戚之舞,猛志常在.胸腹代首,天刑何有于我哉!']],
                        远古巨龙: ['male', 'shen', 0, ['降临', '龙魂', '龙心', '投影', '湮灭', 'diedragonIV'], ['des:来自未知世界,极其神秘的存在.据说祂在遥远的无尽虚空中观察着一切,那里不存在任何基础法则,所以不受时间和空间的限制.因此,祂可能早已见识过宇宙的诞生与灭亡.推测其对人类无敌意,曾以投影的方式降临在人界并给予一位人类英雄超凡的力量.然而,祂的降临破坏了世界的基础法则,造成了时空紊乱,无意间开启了不同维度之间的时空隧道,使得全人类陷入未知的危险,世人称之为异界危机']],
                        克苏鲁: ['male', 'shen', 30, ['神域', '沉眠', '梦魇', 'kslbingyuan', 'kslduanhun', 'musical_ctl'], ['des:伟大的旧日支配者,由于受到了古神的诅咒,沉睡于南太平洋的海底都市 - 拉莱耶城.克苏鲁偶尔会使用精神感应与远处不特定的人类接触,进入其梦境并授予知识和魔法.但与其接触的人类,大多因承受不了世界的可怕真相而发狂,只有极少数人具备足够的精神力量以承载其传授的知识,甚至掌控魔法.即使克苏鲁依然处于沉睡状态,其散发出的不详精神波动也使得没有任何生物敢踏足拉莱耶城']],
                        九天玄女: ['female', 'shen', 9, ['仙体', 'boss__nbaonuVI', 'boss__nbaonuIII', 'boss__nbaonuV', 'boss__nbaonuIV', 'musical_jtxn', 'dieghostII'], ['des:九天玄女者,黄帝之师圣母元君弟子也.九天为乾金之象,性刚好动.九天之方,可以扬兵布阵.有<九天玄女治心消孽真经>等经书传世,以教化世人.九天玄女在民俗信仰中的地位崇高显赫,是一位深谙军事韬略,法术神通的正义之神.在异界危机爆发时,也曾亲自下凡帮助人类抵挡来自其他维度的入侵者']],
                        死亡女神: ['female', 'shen', 6, ['王座', '血咒', 'kslbingyuanII', '幻术', '梦魇II', 'dieghost', 'musical_swns'], ['zhu', 'des:原名霍普,是中世纪一个领主的女儿,她的父亲是恶魔崇拜者,经常发动战争,老百姓苦不堪言,但她却和父亲不同,是个善良纯洁的少女.后来民众造反,将其父亲杀害,她也受牵连被判火刑,在受刑时,她不堪忍受痛苦,诵念从父亲那听来地狱咒语,被传送至地狱.在地狱,她发现父亲已经成为一方霸主,和路西法对立,她拒绝加入任何一方.在一位旧日支配者的帮助下,她获得了巨量的禁忌知识,学会了操纵魔力.在父亲打倒路西法后,霍普与父亲进行对决,最后打倒了父亲以及诈败并附身于父亲的路西法,成为新的地狱领主.但霍普深知,若不是路西法处于虚弱状态,自己绝非对手,所以其一直在尝试主动联系那位伟大的旧日支配者以获取更强大的力量并阻止路西法复仇,然而却从未得到回应']],
                        收割者: ['none', 'shen', '1/1/10', ['机械', '钢骨', '禁闭', '强击', '巨炮', 'musical_sgz', 'dierobot'], ['des:巨型非人形终结者,巨大的机器手可以抓捕人类并送到天网做实验以研制渗透型终结者.收割者是俘虏人类的机器,身上配备了很多钢臂和电子眼,头部是极具杀伤力的巨炮.灵活而多动的爪子可以肆意抓捕猎物并把人类从任何可能的地方抓到运输车里送往天网,头部的巨炮可以轻易毁灭一切胆敢反抗或逃跑的人类']],
                        战争机甲: ['none', 'qunII', '1/1/4', ['装甲', '扫射', '飞弹', 'musical_bfrbt', 'dierobot'], ['des:T-1猎杀型机器人,也称为T-1地面攻击车,是一种完全自主的地面攻击系统,同时也是第一代T系列机器人和猎杀坦克原型,由赛博研究系统开发和生产.系列1设计用于极端战斗,是天网的首代装甲战斗坦克.系列1安装在一个可旋转的360度平台上,具有广泛的攻击视野,内部<头部>单元配备了各种光学传感器和激光瞄准系统.通过原始的瞄准系统(以未来世界的先进标准),利用听觉、热量和运动传感器,系列1能够识别和消灭多个目标.然而,这种基本的传感器配置也意味着系列1存在一些弱点.如果人类目标保持静止和安静,并通过将自己置于热源(如篝火,营火,燃烧的残骸等等)前方来掩盖其热量特征,则可能无法被检测到.系列1的结构经过加固,以提供强大的力量和耐久性,但即便如此,依然无法抵挡重型火炮.并且它的所有内部机械并未被此结构覆盖,极易受到攻击.特别是T-1的头部和颈部组件相对脆弱和暴露,其延展的手臂和裸露的电缆也容易受到攻击.通常,T-1以蹲伏的紧凑姿态部署,当其起立并展开武器时,高度约为八英尺 - 这在战场上极具威慑力.与后来的渗透型终结者不同,T-1没有与人类相似的外观,而是专门为了在最短时间内提供最大火力而设计,其配备的转轮机枪和火箭发射器能够凭借快速而强大的火力和高超的机动性迅速消灭大量敌军.尽管是过时的型号,系列1仍然非常危险,其在<救世主>时间线里的未来战争中由天网部署,用于保护有宽阔暴露通道的综合设施,并在开阔地带巡逻']],
                        德古拉: ['male', 'qunII', 5, ['血祖', '化雾', '不朽', '飞行', 'dclfeisheng', 'musical_dclI', 'diedragon'], ['zhu', 'des:德古拉是最古老的吸血鬼领主,也是一位匈奴阿提拉后裔的特兰西瓦尼亚贵族,是当地的一位伯爵,住在喀尔巴阡山脉的一座城堡里.作为吸血鬼始祖,德古拉具有各种各样的超自然能力.他拥有数十个强壮男子的力量,可以浮空飞行,使用催眠、心灵感应和幻觉等能力,指挥老鼠、猫头鹰、蝙蝠、飞蛾、狐狸和狼等动物,还可以操纵天气,引发风暴和迷雾,他能随意改变外形,变成蝙蝠、狼人和雾气.德古拉英俊而富有绅士魅力,时常引诱人类并将其转化为吸血鬼眷属,被转化的人类不可避免地对鲜血有永无止境的渴望,这导致了严重的暴乱和更多吸血鬼的诞生.数百年来,被德古拉转化为吸血鬼的人类不计其数,有传闻称他正在自己的古堡内举行一场鲜血派对引诱各地的吸血鬼前来,其真实目的很有可能是为了完成自己的亵渎飞升仪式而献祭到场的所有眷属.仪式的举行过程需要消耗德古拉的所有体力和资源,此时正是击杀他的大好时机.一旦仪式完成,德古拉将获得无可匹敌的力量,成为前所未有的强大怪物']],
                        飞升吸血鬼: ['male', 'shen', 6, ['血祖', 'dclxuanfeng', 'dclqiangxi', 'dclkuanggu', 'dclkuangyan', 'musical_dcl', 'diedragon'], ['zhu', 'des:德古拉是最古老的吸血鬼领主,也是一位匈奴阿提拉后裔的特兰西瓦尼亚贵族,是当地的一位伯爵,住在喀尔巴阡山脉的一座城堡里.作为吸血鬼始祖,德古拉具有各种各样的超自然能力.他拥有数十个强壮男子的力量,可以浮空飞行,使用催眠、心灵感应和幻觉等能力,指挥老鼠、猫头鹰、蝙蝠、飞蛾、狐狸和狼等动物,还可以操纵天气,引发风暴和迷雾,他能随意改变外形,变成蝙蝠、狼人和雾气.德古拉英俊而富有绅士魅力,时常引诱人类并将其转化为吸血鬼眷属,被转化的人类不可避免地对鲜血有永无止境的渴望,这导致了严重的暴乱和更多吸血鬼的诞生.数百年来,被德古拉转化为吸血鬼的人类不计其数,有传闻称他正在自己的古堡内举行一场鲜血派对引诱各地的吸血鬼前来,其真实目的很有可能是为了完成自己的亵渎飞升仪式而献祭到场的所有眷属.仪式的举行过程需要消耗德古拉的所有体力和资源,此时正是击杀他的大好时机.一旦仪式完成,德古拉将获得无可匹敌的力量,成为前所未有的强大怪物']],
                        利维坦: ['none', 'shen', '1/1/20', ['重甲', '重炮', 'boss__baolianII', '扫射', '飞弹', 'musical_lvthan', 'dierobot'], ['des:来自未来世界的超重型坦克,牺牲了机动性和隐密性换来最强的火力和最厚的装甲.没人怀疑利维坦的开发计划不是一项为了敛财而推动的白象工程,但其在实战测试中给了所有人一个惊喜 - 它很有效,而且不只是在恐吓敌人的方面,对于战斗也同样如此.利维坦作为坦克不单巨大,而且高得离谱,不过那群随意纳入开发计划以务求项目准时完成的工程师却交付了一件杰作.一个从刚开始就完全错误的概念,却实现出超越所有人期望的结果:他们造出了一台比所有坦克更高大,装甲更厚重,火力更强的坦克.利维坦不仅仅在大型阅兵巡游时行驶过,它已经参与了好几次实战,并且展现出对战场的绝对统治力,其30mm链炮可以像热刀切黄油一般撕裂拦路的所有敌人,而顶部炮塔装备的双联140mm重型坦克炮和导弹发射器更是能够轻松炸毁一整个街区.有传言称利维坦的生产数量不足五十台,这也是无可厚非的 - 它是最恐怖,最高效,也是最昂贵的屠杀机器']],
                        奎托斯: ['male', 'shen', 6, ['boss__shenyi', 'em_shenqvII', 'boss__nbaonu', '极武', '无极', 'musical_krts', 'diedragon'], ['des:出身自希腊的战斗民族 - 斯巴达,在族人里担任指挥官,后来得知自己是希腊主神宙斯之子.因为将灵魂出卖给战神阿瑞斯而得到了缠绕着不灭狱炎的武器混沌之刃,后来因被阿瑞斯设计误杀妻女而与其决裂,妻女的骨灰附着在他身上永不褪去,因而得名<斯巴达的亡魂>.之后一路披荆斩棘,消灭阿瑞斯,成为了新的战神,但又因遭宙斯忌讳而被其夺去神力并击杀,随后被泰坦一族所拯救,重新燃起复仇的怒火,最后成功击杀宙斯,推翻奥林匹斯的统治,而自己也选择自尽.自尽未能击杀奎托斯,他辗转来到北欧,与女巨人劳菲相爱并育有一子 - 阿特柔斯.再次成为父亲后的奎托斯平静了许多,不再狂暴易怒,而是尝试着放下过去并学习如何成为一个好父亲.奎托斯拥有如同古希腊雕像般的肌肉,右眼角曾被阿瑞斯打伤,并留下一个疤痕.腹部有个竖着的伤疤,来源为被宙斯算计而失去神力,随后用奥林匹斯神剑刺穿身体所留下.身上纹刻了一个鲜红色,并与双胞胎弟弟一模一样的标记.其腹部和背上的伤痕则是为了将体内的希望之力留给人类,用奥林匹斯之剑捅穿自己留下的']],
                        天命人: ['male', 'shen', 6, ['boss__shenyi', '飞行', '金身', 'boss__nbaonuII', '破天', 'musical_wukong', 'diedragon'], ['des:由开天辟地产生的仙石孕育而生,出生地位于东胜神洲的花果山上,因带领猴群进入水帘洞而被尊为<美猴王>.为了学艺而漂洋过海拜师于须菩提祖师,得名<孙悟空>,学会大品天仙诀、七十二变、筋斗云等高超的法术.出师的孙悟空未得兵器,从四海龙王处取得如意金箍棒、凤翅紫金冠、锁子黄金甲、藕丝步云履,后大闹地府勾去生死簿,惊动上天而被玉皇大帝招安,封为弼马温.得知职位低卑后怒返花果山,并战胜李天王和哪吒三太子的讨伐,迫使玉帝封其为齐天大圣,并在天宫建有府邸,奉旨管理蟠桃园.因搅乱王母的蟠桃盛会、偷吃太上老君的金丹,炼成了金钢之躯,在太上老君的八卦炉中被熏成火眼金睛.之后大闹天宫,十万天兵天将、四大天王、二十八星宿等对其围剿亦不能将其击败,后来在与如来佛祖的打赌斗法中失利,被压在如来用五指化作的五行山下悔过自新.五百余年后经观音点化,被唐僧救出,法号行者,保护唐僧西天取经,一路降妖除魔,不畏艰难困苦,历经九九八十一难,最后取得真经修成正果,封为斗战胜佛']],
                        歼灭者: ['none', 'shen', '1/1/25', ['重甲', '重炮', '脉冲', '维修', '歼灭', 'musical_anh', 'dierobot'], ['des:来自未来世界的超重型机甲,虽然与利维坦来自不同时空,但二者在各自的世界有相似的特性:最强的火力、最厚的装甲、最慢的移动速度,而歼灭者的火力和护甲甚至更胜一筹.这款来自31世纪的机甲装备了数十吨重的超合金装甲(具有自适应设计,可自动修复)和一套旨在同时恐吓和打击敌人的武器系统 - 其主要武器是四门LB10-X自动加农炮,这些武器可以发射标准弹药或散射弹药,后者类似于<机甲尺寸的霰弹枪>,可以将伤害分散到敌方机甲上;除此之外,歼灭者还配备了四门MPL脉冲激光炮,使其能够在穿过敌方火力网后,对任何近距离目标造成毁灭性打击.在火力与防护性能达到巅峰的同时,移动速度却成为歼灭者的软肋:它是有史以来最慢的机甲,几乎无法通过机动性来回避炮火.然而,驾驶员对此毫不在意 - 歼灭者的超合金装甲在实战中足以抵挡所有来袭的火力,至今从未被击穿']],
                        帝王蟹: ['none', 'shen', '1/1/15', ['机甲', '重炮', '扫射', '飞弹', 'boss__baolian', 'musical_kingcrab', 'dierobot'], ['des:来自未来世界的双足战斗机甲,与同为超重型机甲的歼灭者相比,略微加强了机动性,被描述为<恶名昭彰的机库女王>.帝王蟹的主要武器为两门强大的AC20自动加农炮,这是有史以来最巨大的战斗机甲武器之一.每只手臂上各装备一门,并由分布在侧躯干的弹药供给,这些武器的火力足以在一轮射击中摧毁一台常规战斗机甲.为了保护这些自动加农炮,工程师为帝王蟹设计了简单的手部执行器,这些执行器在外观和动作上非常类似于真实螃蟹的钳子,这也是机甲名称的由来.为了补充自动加农炮的火力,帝王蟹还配备了一具SRM6导弹巢,安装在左躯干或右躯干上;以及数挺HMG重机枪,安装在钳子或驾驶舱附近.尽管帝王蟹的装甲防护不是最好的,却仍然非常耐打,其配备了十数吨的铁纤维装甲以保护弹药架.然而,手臂是帝王蟹最易受损的部件,其内部结构被命中可能会导致武器失灵']],
                        毁灭战士: ['male', 'shen', '6/6/2', ['焰甲', '血拳', '扫射', '飞弹', 'boss__baolian', 'musical_doom'], ['des:Rip... and... tear!']],
                        蜘蛛机甲: ['none', 'qunII', '1/1/4', ['机甲', '脉冲', '飞行', 'musical_spider', 'dierobot'], ['des:一种快速且灵活的侦察型机甲,具有令人惊叹的速度与无与伦比的跳跃能力.作为轻型机甲,载重有限,仅装备两门MKIII激光炮,这些武器安装在中央躯干的位置.虽然比其他机甲上常见的激光炮更昂贵,但它们质量更高,维护需求也非常低.武器射击产生的废热由安装在中央躯干的散热器处理.三吨左右的装甲只能提供一定程度的保护,所以大多数蜘蛛机甲的驾驶员都认为速度才是最好的防御.蜘蛛机甲前方的独特装甲排列赋予了它<蜘蛛>这一名称,而这种蜘蛛网图案在装甲板之间的缝隙中进一步通过明亮的红色玻璃纤维密封剂得到了强调.蜘蛛机甲配备了总共八个跳跃喷气器,其中四个安装在左躯干,四个安装在右躯干,使其具有令人惊叹的跳跃距离.利用最先进的组件,跳跃喷气器可以在空中旋转机甲,同时借助先进的计算机跟踪系统仍能准确落在原始着陆点.蜘蛛机甲在空中能够<抖动>的能力为其提供了更大的保护,因为即便是最先进的瞄准计算机也很难锁定抖动的目标.蜘蛛机甲的通信系统和瞄准跟踪系统完全集成,这意味着口头通信和传感器读数都可以传回指挥部.这个先进的计算机系统甚至包括一套娱乐系统,以应对那些在侦察任务中漫长孤独的夜晚.然而,它也有一个严重的缺点:系统和头部装甲布局的结合使得没有空间安装合适的弹射系统 - 驾驶员必须到下部舱口才能离开机甲.因此,许多蜘蛛机甲的驾驶员会在空闲时间里练习如何快速离开机甲,尤其是那些装载易燃弹药的变体型号']],
                        加农道夫: ['male', 'shen', 6, ['魔躯', 'boss__modao', '无极', 'dclxuanfeng', 'dclqiangxi', 'musical_ganon', 'diedragon'], ['zhu', 'des:前格鲁德族长,还处于人类形态,未成气候.在不远的未来,盖侬会得到全新的力量并致力于毁灭海拉鲁,但最终将被林克一行人击败并封印']],
                        力巴尔: ['male', 'qunII', 4, ['英杰', '飞行', 'boss__nbaonuII', 'musical_lber'], ['des:四英杰之一,利特族战士,拥有着在族人当中出类拔萃的能力.因能力受到高度评价而被选为神兽瓦·梅德的操纵者.虽然性格高傲,但确实拥有与之匹配的实力']],
                        米法: ['female', 'qunII', 3, ['英杰', 'boss__lingqu', 'boss__lingyu', 'musical_mipha'], ['des:四英杰之一,卓拉族公主,具有治愈他人伤痛的能力.因能力受到高度评价而被选为神兽瓦·露塔的操纵者.是林克从小开始便关系很好的朋友']],
                        乌尔波扎: ['female', 'qunII', 4, ['英杰', 'boss__luolei', '歼灭', 'musical_urbz'], ['des:四英杰之一,格鲁德族长,能够操纵雷电,也是一位优秀的战士.因能力受到高度评价而成为神兽瓦·娜波力斯的操纵者.与已故的海拉鲁王妃是挚友']],
                        达尔克尔: ['male', 'qunII', 5, ['英杰', '火盾', 'boss__shanbeng', 'musical_darker'], ['des:四英杰之一,鼓隆族豪杰,拥有能够防护一切冲击的守护之力.因能力受到高度评价而成为神兽瓦·鲁达尼亚的操纵者.是一位深爱着故乡死亡之山的豁达战士']],
                        林克: ['male', 'shen', '4/4/2', ['神勇', 'boss__luolei', '火盾', '飞行', 'boss__lingyu', 'musical_link'], ['des:侍奉海拉鲁王族的青年,出身于近卫世家,是最强的王国骑士.虽然有着强大的身体素质与卓越的剑术才能,但平常的锻炼也从不会有所懈怠.在<荒野之息>时间线里,林克通过了所有神庙试炼并成功获得四英杰之力']],
                        雷电: ['none', 'shen', '1/1/8', ['机甲', 'boss__baolianII', '扫射', '脉冲', '飞弹', 'musical_tdrbot', 'dierobot'], ['des:一种早期的突击型战斗机甲,是当时技术尚不成熟时所能生产的最重机甲之一.雷电的主武器并不唯一,其射程最远的武器是安装在右躯干上的LRM15阵列导弹,通过位于中央躯干的两吨弹药补给仓供弹.接下来是其远程武器库中的Sunglow大型激光炮(或ExoStar大型激光炮),安装在右臂上,为雷电提供了可观的中远程火力.随着距离的缩短,雷电能够启动其三门Type18中型激光炮和一门SL小型激光炮.这三门中型激光炮均安装在左躯干,而小型激光炮以及一吨弹药则安装在右侧.最后,在反步兵作战中,雷电还配备了两挺V200机枪(或Browning机枪),弹药量为一吨,安装在左臂上.尽管武器库令人印象深刻,但雷电的致命弱点在于其仅有十五个散热器,这无法应对如此多高热量武器的射击.雷电的驾驶员必须格外注意管理热量,以免机甲停机或导致弹药过热,许多驾驶员倾向于在水中作战,以便更好地冷却机甲.事实上,大多数指挥官会在战斗开始时指挥雷电进入水源,以便能够比平时更快速地开火.虽然雷电十吨左右的装甲不再是机甲中最厚重的,但考虑到许多现代突击型机甲的保护水平低于这一古老设计,该数据仍然令人印象深刻']],
                        电锯人: ['male', 'shen', '4/4/2', ['魔躯', '钢骨', 'dclkuangguII', '链锯', '强击', 'musical_csm', 'dierobot'], ['des:原名电次,是来自异世界的恶魔猎人.母亲早亡,父亲欠了黑帮很多外债,时常家暴年幼的电次,后来被电次误杀.黑帮为了让电次还钱将他父亲之死隐瞒,替父还债的电次成为恶魔猎人,与链锯恶魔波奇塔共同生活以及对抗恶魔.而后黑帮被丧尸恶魔操控,电次被引导诱杀,波奇塔为救电次,自愿成为电次的心脏,令其复活.复活后的电次拥有各种各样的能力:作为链锯恶魔,当拉动心脏处的链锯拉条时,双臂和头部会伸出能轻易碎肉断骨的链锯刀刃;武器恶魔体质赋予电次比一般恶魔和魔人更强的再生能力,通过饮血可以快速再生肢体,具有强大的不死性.电次的外观为金色短发,深色瞳孔,牙齿像锯齿一样尖锐,与波奇塔融合前带有眼罩.工作时穿着公安恶魔猎人的制服白衬衫,黑领带和黑色长裤,日常穿着白色T恤']],
                        塞尔达: ['female', 'qunII', 4, ['boss__shenyi', '光箭', '光刃', '格挡', '重击', 'musical_zelda'], ['zhu', 'des:海拉鲁王国公主,继承了来自遥远祖先的神圣女神血脉.正在对散布在世界各处的古代遗迹进行调查.自母亲去世之后,为了能让封印之力觉醒,每天都在坚持着严酷的修行']],
                        守护者: ['none', 'qunII', '1/1/4', ['装甲', '脉冲', '旋转', 'musical_gdan', 'dierobot'], ['des:最强的古物,是远古时期为了守护海拉鲁遗迹而被制造出来的,身上的伤痕诉说着它与强敌激烈对抗的历史,拥有其他守护者无法比拟的强大力量,或许是某种特殊个体']],
                        哨兵坦克: ['none', 'shen', '1/1/10', ['装甲', '重炮', '飞弹', '反导', 'boss__baolian', 'musical_stnl', 'dierobot'], ['des:来自近未来的重型坦克,由平行世界中未解体的苏联研制.该坦克编号为HT-28,西里尔字母HT代表<新坦克>.在苏联发生政变后,哨兵坦克进行了全面重新设计,但保留了原有的名称,以象征旧苏联与新苏联之间的过渡.HT-28配备了坚固的重型底盘和标志性的160mm火炮,使该车辆成为坦克歼击车与突击炮的独特结合体,其最新型号还预装了竞技场主动防御系统和监视者导弹发射器,并且配备了220mm大口径火炮.M1型号在其在高加索、东欧和非洲的服役中获得了良好反响,成为未来所有改型的基础:改进型M2在苏欧战争爆发前夕投入使用,最新的M3型则是独特原型版本的最终生产型号,曾由著名的<黑熊>坦克组进行实地测试,他们是整个战争中最成功的坦克乘员,其传奇至今仍在这款骄傲的战争机器上延续']],
                        基洛夫空艇: ['none', 'shen', '1/1/12', ['装甲', '飞行', '轰炸', '维修', '殉爆', 'musical_kirov', 'dierobot'], ['des:冷战时期苏联武器库中最具威胁性和破坏力的空中单位,凭借其巨大的载弹量和坚固的装甲,在战场上展现出无与伦比的优势.它可以携带重型炸弹,轻松摧毁敌方基地和关键设施.然而,基洛夫空艇的速度较慢,容易受到敌方防空武器的攻击.因此,在使用时需谨慎规划,优先摧毁敌方的防空设施,以确保其安全投放炸弹.尽管在防守任务中表现不佳,但基洛夫空艇的自我修复能力和死亡撞击特性,使其在战斗中仍具备强大的威慑力']],
                        天启坦克: ['none', 'shen', '1/1/10', ['装甲', '重炮', 'tqfensui', '维修', 'boss__baolian', 'musical_apoc', 'dierobot'], ['des:来自平行世界的重型坦克,由冷战时期的苏联研制,以其卓越的火力和防御能力闻名.车体上方装备强大的双管125mm加农炮,车体前方则配备粉碎机以碾碎一切胆敢接近的敌军.天启坦克能够精准地打击地面和空中目标,造成巨大的毁灭性伤害.其厚重的装甲与可自动修复设计使其在战场上具备极高的生存能力,能够抵御大多数攻击.尽管机动性相对较低,但它的耐久性和火力使其成为突破敌方防线和占领战略要地的理想选择.在战术运用中,若苏联指挥官能合理部署天启坦克,则可显著提升军队战斗力,确保胜利的最终实现']],
                        炮艇机: ['none', 'shen', '1/1/8', ['装甲', '重炮', '飞行', '扫射', '脉冲', 'musical_ac130', 'dierobot'], ['des:来自源世界的多用途轰炸机,由美国洛克希德公司研制,专门用于对地支援和近空支援任务.基于运输机的改装平台,AC-130配备了先进的火控系统和重型武器,包括30mm机炮、激光武器和105mm重型榴弹炮,能够在夜间和恶劣天气条件下精确打击敌方目标.其独特的低空飞行能力使其能够进行长时间的持续打击,为地面部队提供强大的火力支援,厚重的装甲为机组成员提供强有力的生存保障.凭借其强大的火力与护甲,以及出色的侦察能力,AC-130在现代战争中发挥了至关重要的作用,成为美军在战场上不可或缺的空中力量']],
                        将军刽子手: ['none', 'shen', '1/1/18', ['机甲', 'boss__baolianII', '震荡', '践踏', '强击', 'musical_exec', 'dierobot'], ['des:来自近未来的巨型战斗机器人,由升阳帝国研制.武器方面,装备三把巨刃,可以轻易粉碎胆敢接近的敌人,还能将三把巨刃插入地面释放欧米伽震荡波,破坏周围的一切.防护方面,配备纳米装甲,提供强大的生存能力.唯一的缺点是机动性弱,需要靠近敌人才能造成有效杀伤']],
                        夜魔: ['none', 'qunII', '4/4/1', ['刺甲', '潜伏', 'dclkuangguII', '残虐', '重击', 'musical_vlt'], ['des:从无数尸体中诞生的超级丧尸,由大量人类被僵尸病毒感染进化而来.这种凶残的丧尸在夜间活动,以敏捷和隐蔽性著称,通常躲藏在阴暗的角落,利用快速移动和强大的跳跃能力对人类幸存者发动突然袭击.夜魔具有超凡的感知能力,能够侦测附近的幸存者,并以极高的速度接近他们,给其极大的心理压力.和普通僵尸相比,它们的攻击更加迅猛且致命(其中,高级夜魔甚至进化出骨刺与坚甲),幸存者在夜晚探索时必须保持警惕.面对夜魔的威胁,幸存者必须灵活运用策略和环境,避免与其正面冲突,才能在这股黑暗势力的侵袭中生存下去']],
                        追踪者: ['none', 'shen', '6/6/3', ['重甲', '扫射', '飞弹', '焚化', 'boss__baolian', 'musical_nemesis'], ['des:一种高度危险的生物武器,源自T病毒与Nemesis寄生虫的融合实验,追踪者是最成功的实验结果.它们体型庞大,四肢强壮,具备极高的敏捷性和适应能力,能够迅速追踪并捕捉猎物.追踪者的外形特征包括粗糙的皮肤和突出的肌肉线条,令人毛骨悚然.作为战斗力的体现,追踪者配备重型护甲,刀枪不入;手持转轮机枪、火箭筒或焚化器等致命武器,能够对幸存者造成毁灭性打击.它们不仅拥有强大的攻击力,还具备一定的智力,能够使用环境进行潜伏和伪装.作为实验室意图控制人类的产物,追踪者成为幸存者在末世中最大的噩梦之一']],
                        阿拉贡: ['male', 'qunII', 4, ['boss__shenyi', '精锐', 'algyingzi', '精防', '强击', 'musical_alg'], ['zhu', 'des:拥有王族血统,是人族的领袖之一,也是伊西尔杜尔的后裔,注定要继承刚铎的王位.阿拉贡性格坚定勇敢,忠诚于自己的朋友和信念,始终致力于抵抗索伦的黑暗势力.在故事中,他不仅是游侠,还担任了护戒小队的领袖,展现出卓越的战斗技巧和领导才能.随着旅程的推进,阿拉贡逐渐接受了自己的命运,勇敢地迈向王位的责任,他与精灵公主阿尔温的深厚爱情更为他的角色增添了人性化的一面.阿拉贡的形象象征着希望与复兴,展现了在绝望中坚持正义与勇气的力量']],
                        澹台烬: ['male', 'shen', 9, ['邪骨', '破天III', '斩天', '洗髓', '同悲', 'musical_ttj', 'diedragonII'], ['zhu', 'des:由于身世太过悲惨,被魔神选中并植入邪骨,作为魔神转生的容器而存在,称作魔胎.澹台烬外表冷峻,气质孤傲,常常给人一种难以接近的感觉.他曾是人类与魔族之间的桥梁,却因权力与背叛而逐渐沉沦于黑暗之中.尽管他心中藏有不为人知的秘密,经历了常人难以想象的痛苦,但澹台烬依然坚定追求自己的理想,力图改变这个动荡的世界,并阻止自己体内的魔神复生.魔神诞生自虚无世界,是一切恶念的集合体,具有无上的智慧和深不可测的力量,一直致力于毁灭全世界并回归虚无.祂拥有三个致命的法器,包括<魔神之眼屠神弩>:一把能发射强大魔法箭矢的巨弩,精准而致命;<魔神之手斩天剑>:一把漆黑的剑,具备无与伦比的破坏力,能够轻松切断任何敌人;<魔神之心洗髓印>:一件强大的魔器,能够进行灵魂的净化与魔力的腐化.此外,祂还掌握了神秘的<同悲道>阵法,施展阵法时需要献祭屠神弩、斩天剑和洗髓印,并需要自身邪骨控阵,其效果可怕至极,一旦施法完成,整个世界将灰飞烟灭.但其施展阵法之时尤为脆弱,上一世的魔神就是在施展<同悲道>时,因邪骨离体,被上古十二神明以性命为代价联合击杀.神明全部陨落后,由于邪骨尚存,魔神并未消亡,而是在等待时机卷土重来,若其成功夺舍澹台烬,世界将陷入万劫不复']],
                        死亡骑士: ['male', 'shen', '5/5/1', ['血盾', '瘟疫', '瘴气', 'wlbingfeng', 'wljihan', 'musical_dk'], ['des:死亡骑士曾经是人类的正义捍卫者.然而,他们当中的一些被亡灵天灾蛊惑而叛变,一些在死后被转化成了亡灵.尽管死亡骑士依然拥有思考能力,但他们的思维永远被绑定在巫妖王的意志之下.死亡骑士被巫妖王赐予了符文剑和死灵军马坐骑,是天灾军团强大的将军.死亡骑士拥有鲜血、冰霜、邪恶三种特殊符文:鲜血强化其体魄,霜冻锐化其攻击,不死之身令其在激烈的战斗中迸发出邪恶怒气']],
                        机械吕布: ['male', 'shen', 6, ['魔躯', '武羲', '武煌', '天武', '幻爆', 'diemech', 'musical_lvbu'], ['des:天下闻名,以一敌百的豪杰']],
                        尸群: ['none', 'qunII', 5, ['zhfenshi', 'dclkuangguII', '残虐', 'musical_horde'], ['des:丧尸病毒的直接产物,由大量人类被感染转化而来,具备强烈的攻击性和极高的数量.尸潮通常成群结队地涌向幸存者,试图以数量优势将其淹没,它们的出现标志着病毒的蔓延和社会的崩溃.尸群的行为本能且无情,能够在感知到声音和动静后迅速聚集,人类幸存者不得不寻找策略来应对这无尽的威胁.面对尸群,生存者们需要团结一致,利用环境与武器,进行智慧与力量的较量,才能在这场生死考验中找到一线生机']],
                        暗夜之歌: ['female', 'qunII', '4/4/1', ['仙体', '光箭', '光刃', '光耀', '极意', 'musical_aylin'], ['des:Feel my voice rattle your bones as I proclaim our victory!']],
                        战斗暴龙兽: ['male', 'shen', '5/5/1', ['装甲', '飞行', '龙卷', '巨炮', '无极', 'musical_wargm'], ['des:最具代表性的究极体数码宝贝,亚古兽的最终进化形态.它属于病毒克星型数码宝贝,外形像一只巨大的机械化恐龙,身披厚重的铠甲,展现出强大的力量与攻击性.战斗暴龙兽以其招牌技能<盖亚能量炮>著称,也能够快速旋转自身并化为强力的龙卷风攻击敌人,具备毁灭性的破坏力.它不仅拥有极强的物理力量,还兼具高超的战斗技巧,善于在战场上进行突袭或防御.作为正义与力量的象征,战斗暴龙兽常常站在数码世界的最前线,保护同伴、抵御黑暗势力,是数码世界中不可忽视的强大战士']],
                        库巴: ['male', 'shen', '6/6/3', ['刺甲', '焚化', '旋转', '不朽', '强击', 'musical_bowser'], ['zhu', 'des:强大的库巴族领袖,体型庞大,拥有锋利的尖刺和喷火能力,具有极高的破坏力.库巴经常策划绑架桃花公主并试图统治蘑菇王国,成为马里奥和路易吉等英雄们的主要对手.尽管性格傲慢且狡猾,但他也展现出不容小觑的智谋和力量,尤其是在各种战斗中.他的座驾是飞行的<库巴飞船>,可以从空中发动进攻.库巴不仅象征着压倒性的力量和统治欲望,也以独特的魅力和幽默感赢得了大家的喜爱']],
                        地狱少女: ['female', 'shen', '2/2/4', ['尸玉', '心毒', '魂牢', '狂罚', '净罪', 'musical_enmaai'], ['des:来自地狱的使者,长发及肩,身穿独特的红黑色服饰.阎魔爱以无比冷静和坚定的态度,守护着一项特殊的职责:为饱受痛苦的人们提供复仇的机会.每当有人通过<地狱网站>向她求助,爱便会在夜幕降临时,带着她那宛如梦魇般的微笑,带领复仇目标乘上地狱之舟,缓缓驶向地狱,为求助者完成复仇.然而,她的每一次行动都伴随着深重的代价,求助者在得到解脱的同时,自己死后也将永坠地狱.每当爱伸出手,给予求助者复仇的机会时,眼神中却总是透露出无尽的悲伤,似乎在诉说着她背负的命运与无法逃避的责任']],
                        哨戒炮: ['none', 'qunII', '1/1/2', ['装甲', '炮台', '炮台IV', 'dierobot'], ['des:方便携带的支援火力,深受士兵喜爱']],
                        普通人: ['male', 'qunII', 3, ['平凡', '普通', '伟大'], ['des:来自源世界的人群,在街头随处可见.他们来自各行各业,承担着社会运转的基础工作,维持着经济、文化和家庭的平稳发展.普通人可能是教师、工人、店员、农民或公司职员,他们的生活虽然看似平凡,但却构成了社会的核心.他们的追求多为简单而真实:幸福的家庭、稳定的收入、健康的生活.普通人往往在困境中展现出坚韧与韧性,默默承受生活中的压力与挑战,在追求平凡生活中,体现出社会中最本质的力量与价值']],
                        普通人II: ['female', 'qunII', 3, ['平凡', '普通', '伟大II'], ['des:来自源世界的人群,在街头随处可见.他们来自各行各业,承担着社会运转的基础工作,维持着经济、文化和家庭的平稳发展.普通人可能是教师、工人、店员、农民或公司职员,他们的生活虽然看似平凡,但却构成了社会的核心.他们的追求多为简单而真实:幸福的家庭、稳定的收入、健康的生活.普通人往往在困境中展现出坚韧与韧性,默默承受生活中的压力与挑战,在追求平凡生活中,体现出社会中最本质的力量与价值']],
                        不动明: ['male', 'qunII', 5, ['魔躯', 'zhfenshi', 'dclkuangguII', '残虐', '极意', 'musical_devil'], ['des:原本是一名普通的少年,因一次意外与恶魔合体,变身为<恶魔人>.在与恶魔的融合过程中,获得了超凡的力量,但也将他推入人类与恶魔之间的冲突漩涡']],
                        防爆特警: ['male', 'qunII', '4/4/1', ['装甲', '强固', '精锐', '部署', 'boss__baolian', 'musical_trt'], ['des:支援型高科技士兵,战场中的精锐.配备单兵防弹衣,携带哨戒炮(部署式),可随时为战友提供火力支援']],
                        武庚: ['male', 'shen', '4/4/2', ['boss__shenyi', '神力II', 'algyingzi', '无色', '无极', 'musical_wugengji'], ['zhu', 'des:<我想哭 但眼睛没了><br>\n<我想喊 但下颚骨碎了><br>\n<我想听 但耳朵聋了><br>\n<我想呼吸 但肺里全是土>']],
                        炽天使: ['none', 'shen', 30, ['神域', '圣躯', 'boss__fengdongII', '神罚', '曙光', 'musical_agl'], ['des:天界至高天使,最接近神的存在.根据史书记载,炽天使拥有六翼,常在神的宝座前伺立,以彰显神的荣耀与圣洁.他们用两翼遮脸,以表示对神的敬畏,用两翼遮脚,象征谦卑,并用两翼飞翔,展现他们在天界的行动能力.炽天使的职责是颂扬神的圣洁,并在需要时净化罪人的灵魂.作为天使等级中最高阶的存在,炽天使不仅代表神的荣耀,还象征着至高无上的神性力量.祂的名字来源于希伯来语<烧灼>,这意味着祂具备灼热、净化的力量.炽天使能轻松驾驭神圣之火,这种火焰不仅是象征意义上的净化,还能驱散一切邪恶与黑暗.炽天使的六翼也赋予了祂无与伦比的速度与机动性,能迅速穿梭于天界和人间,执行神的命令.炽天使在面对任何威胁时,具备绝对的压倒性力量,祂能以神圣之火消灭敌人,并以神的力量镇压邪恶,展现出不可撼动的神圣威严']],
                        杰诺斯: ['male', 'shen', '3/3/3', ['机械', '钢骨', '焚化', 'boss__baolianII', '巨炮', 'musical_cyborg', 'dierobot'], ['des:来自平行世界的半机械人,15岁时家园被一名暴走改造人毁灭,自己也几乎身死,在库斯诺博士的帮助下活了下来且成为改造人,并决心要报仇雪恨.在19岁时结识埼玉并与其一起成为职业英雄,即使在S级英雄里实力也属于较强等级.杰诺斯的脑部为原装货,面容也会随着时间变老,但身体的其余部分均由机械零件组成']],
                        尼奥: ['male', 'qunII', '3/4', ['矩阵', '删除', '飞行', '格挡', '入侵', 'musical_hacker'], ['zhu', 'des:原本是一名计算机程序员,但一些不寻常的现象引起了尼奥对现实世界的质疑,这让他踏上了一条探索真相的道路.随着调查的深入,他逐渐意识到自己所处的并非真实世界,也发现自己是<预言中的救世主>,肩负着拯救人类、对抗机器统治的使命.尼奥不仅拥有卓越的黑客技能,还能在虚拟世界中掌握各种超自然力量,展现出惊人的战斗技巧.他的成长历程充满了选择与牺牲,在经历了重重困难之后,他成为人类与机器斗争的关键人物,从一个普通人蜕变为拯救人类的英雄.最终以无畏的姿态面对挑战,展现出信念与希望的力量']],
                        邪念: ['male', 'qunII', 5, ['龙躯', '龙佑', 'zhfenshi', '残暴', 'darkurge', 'musical_durge'], ['des:谋杀之神的子嗣,同时也具有龙族血脉,是一个被深渊中的黑暗欲望和血腥冲动所折磨的灵魂.内心深处潜藏的暴力本性无时无刻不在涌动,驱使他向更深的堕落迈进.他的生活被这些无法控制的冲动所主宰,仿佛有一股看不见的力量在操纵他去实施残忍的暴行.尽管如此,邪念依然背负着一段隐秘而复杂的过去,这段历史逐渐浮现,揭示出他内心的挣扎与痛苦.他不仅要与外界的敌人对抗,更要与自己内心的黑暗进行搏斗.最终,他必须在拥抱这股毁灭力量或寻找救赎之间做出抉择']],
                        鸟身女妖: ['female', 'qunII', 3, ['飞行', '忘忧', '拾忧', 'musical_harpy'], ['des:一种危险的掠食者,她们结合了美丽与恐怖,头部和上身是女性,身体却覆盖着鸟类的羽毛,手脚长有锐利的爪子.鸟身女妖以其引人入胜的歌声著称,这种魔法般的旋律能诱惑猎物进入她们的陷阱,让受害者在不知不觉中步入死亡边缘.她们常居住在偏远的海岸、山洞或荒野中,以冒险者和无辜的孩童为食.鸟身女妖不仅以狡诈与残忍著称,还是自然界中的可怕威胁,任何靠近她们巢穴的人都可能无法幸免']],
                        芬利尔: ['male', 'shen', 18, ['boss__xiongshou', '狼袭', 'zhfenshi', 'dclkuangguII', '无极', 'musical_Fenrir'], ['des:传说中的魔兽,巨狼的化身,以狂暴和毁灭力著称.芬利尔从幼年起便展现出巨大的力量与危险,令众神对其感到恐惧.后来,众神用魔法链条<格莱普尼尔>将他束缚,尽管他咬断了战神提尔的一只手.预言中,芬利尔将在诸神黄昏中挣脱枷锁,吞噬众神之父奥丁,标志着旧世界的终结和新纪元的开启']],
                        艾斯德斯: ['female', 'qunII', 5, ['王座', 'wlbingfeng', '冰岚', 'wljihan', '极意', 'musical_esdeath'], ['des:帝国最年轻且最强的将军,<狩猎者>组织的首领,拥有难以匹敌的恐怖实力,持有的冰之帝具<魔神显现·恶魔之粹>被认为是最强帝具般的存在.出身于北方边境地区,是专门狩猎危险种的种族 - 巴鲁特斯族族长的女儿,从小弱肉强食的思想根深蒂固.在一次单独狩猎归来后发现全族被北方异族所灭,从此更加认定若要生存只有成为强者.艾斯德斯对待敌人和战俘十分残忍,曾经转眼间平定了被认为无论如何也至少需要一年才能击败的北方异族,并将四十万人活埋,不仅击溃敌人肉体,也将对方的心智破坏殆尽.她也是个战斗狂人,经常为了尽情享受战斗而故意放对手一马.与此同时,艾斯德斯对待部下和平民百姓却十分宽厚,总是将皇帝赐予的赏金分发给部下并且从不收受贿赂,因此她所率领的军队士气极为高昂']],
                        桐生一马: ['male', 'qunII', 4, ['极道', '快攻', '打虎', '精防', '强击', 'musical_KiryuKazuma', 'diedragon'], ['des:来自平行世界,充满传奇色彩的人物,因其在黑道的经历而闻名.他曾是东城会旗下著名组织 - 堂岛组的一员,从年轻时便展现出过人的勇气与忠诚.桐生凭借其不屈不挠的精神,以及强烈的正义感,在复杂的黑帮斗争中挣扎求生,最终成为了东城会的四代目会长.尽管身处黑道,他内心始终坚守原则,不愿参与滥杀无辜.他的战斗能力极强,被称为<堂岛之龙>,但桐生始终力求将暴力限制在保护弱者的范围内.他的人生充满了险恶的挑战和复杂的情感纠葛,但无论遭遇何种困境,他始终追求赎罪与平凡的生活']],
                        危险流浪者: ['none', 'shen', '2/2/15', ['机甲', 'boss__baolianII', '焚化', 'wljihan', '强击', 'musical_danger', 'dierobot'], ['des:来自平行世界的战斗机甲,由两名驾驶员同步操作,专门用于消灭各种各样入侵人界的巨型怪物.机甲头部的驾驶舱可以跟机体分离,驾驶员能借此逃生;胸口内部有一个核反应堆,用于驱动机甲以及喷射高温核废料灼烧怪物;手部装备充能链锯剑,使用时可伸出并锁紧斩杀怪兽;腋下装备干冰喷射口,可喷射气化干冰,冷冻怪兽;肘部装备火箭推进装置,可提升机体的出拳速度,增大对怪兽的伤害;膝关节装备超扭矩驱动器,每条电肌纤维装备40台发动机,提升机体的机动性;腿部装备陀螺稳定器,用于修正重心,确保机体的平衡']],
                        机械哥斯拉: ['none', 'shen', '1/1/30', ['重甲', '巨兽', '旋风', '龙啸', '龙殛', 'musical_mechag', 'dierobot'], ['des:来自平行世界的巨型机械怪兽,由人类借助外星怪兽残骸打造,专为对抗哥斯拉这样的巨大生物威胁而设计.拥有和哥斯拉相似的体型,但以坚硬的金属装甲覆盖全身,具备更强大的火力和防御能力.机械哥斯拉配备了各种各样的高科技武器,能够从远程发动毁灭性攻击,并在近战中凭借强大的力量与精准的操控进行格斗']],
                        龙裔: ['male', 'qunII', 5, ['龙躯', '龙佑', '神力', '精防', '强击', 'musical_dgb', 'diedragon'], ['des:一位拥有龙之血和龙之灵魂的勇士,肩负着摧毁黑暗巨龙奥杜因的使命']],
                        恶灵骑士: ['male', 'shen', '4/4/2', ['邪骨', '焚化', '追猎', '审判', '无极', 'musical_ghost'], ['des:本名乔纳森·布雷泽,原是一位摩托车特技车手.为了拯救患癌养父,和魔鬼墨菲斯托做了交易,从此被邪神扎坦诺斯附身,成为替无辜者复仇的恶灵骑士,拥有控制地狱火的力量和令罪恶感受到痛苦的审判之眼']],
                        维吉尔: ['male', 'shen', '4/4/2', ['魔躯', 'boss__modao', '践踏', '精防', '变身', 'musical_deviltrigger', 'diedragon'], ['des:但丁的双胞胎哥哥,传奇魔剑士斯巴达与人类女性伊娃的长子,尼禄的生父.维吉尔同样拥有恶魔的力量,以魔剑士的身份自居而孤傲,居合之术作为其战斗风格,阎魔刀为主要武器并且不喜欢使用枪械.维吉尔与选择以人类方式生活的但丁不同,他常常将自己看作成一个恶魔,因为他认为人类的一面会使他变得懦弱.直到与弟弟但丁多次交手后,该想法才有一定程度改观']],
                        真魔人: ['male', 'shen', 6, ['魔躯', '臂刃', '冲撞', '强击', '力竭', 'musical_deviltrigger'], ['des:维吉尔的终极形态 - 真魔人.在该形态中,阎魔刀成为维吉尔的臂刃,身后的翅膀也可以使维吉尔在高速飞行的同时进行破坏性的冲撞攻击.在魔人化时,维吉尔拥有攻击力提升,速度提升,体力回复,招式强化等各种效果.但此形态无法维持太长时间,需要速战速决']],
                        猎杀者: ['none', 'qunII', '1/1/3', ['装甲', '飞行', '扫射', '飞弹', 'boss__baolian', 'musical_hunterkiller'], ['des:猎杀者无人机是一种小型的空中火力支援平台,由天网研制,配备机枪和飞弹,装甲薄弱但数量众多.在战场上通常伴随终结者一起行动,善于搜寻落单的人类以及猎杀漏网之鱼']],
                        祸灵梦: ['female', 'shen', 12, ['血鬼', '神忌', '皇祸', '堕天II', '死神', 'musical_apple', 'dieghost'], ['des:一个充满强烈恶意与扭曲力量的存在,集愤怒与悲伤,憎恶与怨恨,杀意与绝望等各种负面情绪于一身,神秘且充满危险.她的出现给幻想乡带来了极大的混乱与不安,似乎是从平行世界诞生的实体.祸灵梦的外表与博丽灵梦有些相似,穿着类似巫女的服饰,但却散发着阴冷与邪恶的气息.她的力量源于未知的黑暗力量,操纵着强大的灵力与诡异的结界.她的灵力被黑暗腐化,所制造的结界也不再是保护与治愈,而是用来虐杀或折磨敌人.祸灵梦的真实起源仍然是个谜,或许是博丽灵梦的一部分被黑暗侵蚀,也可能是某种外界力量的具象化']],
                        宇文拓: ['male', 'shen', '4/4/2', ['boss__shenyi', '神力II', '剑气', '践踏', '轩辕', 'musical_ywt'], ['des:昆仑镜转世,拥有褐蓝双瞳之<阴阳妖瞳>以及古铜色之发.身上佩带一把金色上古神器 - 轩辕剑,只需一击便能顷刻间斩杀万人大军.拥有轩辕剑的宇文拓比上古凶兽饕餮还强十倍有余,即使是仙界也没几人能与之抗衡']],
                        异形: ['none', 'qunII', 5, ['骨甲', '酸血', '潜伏', '残暴', '残虐', 'musical_alien'], ['des:一种极具攻击性的内寄生虫类外星物种,是凶猛的掠食性生物,具有强大的生存能力和攻击力.异形的身体结构独特,外骨骼坚硬,行动敏捷,体内的血液能轻松融毁最坚硬的金属.其繁殖方式极为恐怖,通过寄生其他生物来繁衍后代 - 它们的后代通过口腔植入活体宿主内部,从宿主胸部破体而出并残忍击杀宿主']],
                        晓美焰: ['female', 'shen', '2/2/4', ['魔躯', '魂牢', '扫射', '飞弹', '轮回', 'musical_akemihomura'], ['des:表面上冷漠而难以接近,其实原本是一个胆怯的病弱少女,后在第一个时间轴被热情的鹿目圆救助后,变得开朗起来.为了小圆无数次重复一个时间,用冷漠伪装起自己,这一世再也没碰过小圆的手,她想让小圆看到做魔法少女的后果,为了小圆愿意坠入深渊.拥有黑色飘逸的长直发、紫色的眼睛、白暂的皮肤,头上戴着黑色的发带,身穿朴素的校服;签订契约成为魔法少女后,其外观为淡紫色连衣荷花边裙、白色外套、淡紫色披肩、黑色高跟及膝长靴.签订契约时的愿望一定程度影响成为魔法少女后的能力,晓美焰的愿望是<希望能和鹿目圆的相遇重新来过,并且这次要由自己保护她而不是被她保护>,其愿望使时间倒流,可以控制从与鹿目圆相遇至魔女之夜决战之间一个月的时间.晓美焰变身后紫色的灵魂宝石会成为手背上的饰品,无攻击性魔法.防具是左手臂的盾牌与沙漏,盾牌可以防御、收纳大量物品,晓美焰以此收纳了多种非魔法武器,如手榴弹、烟雾弹、爆破装置、枪械、迫击炮、火箭发射器、自走多管火箭车、甚至还有日本陆上自卫队所使用的88式陆基反舰飞弹等.沙漏有限量的时间干涉,止住沙漏中渐渐流逝的沙子就可以发动停止时间的能力,所有事物的时间都会暂停,只有与自己接触的东西不会受时间暂停影响.但是里面的沙只有回溯到跟小圆相遇之前的分量.她也能进行时间旅行,可以不断从魔女之夜到来日回到跟小圆相遇之前.晓美焰为了守护圆的幸福将一部分圆环之理夺去了,圆作为人的一部分被抽离圆环之理,因对圆的爱超越绝望与希望而化成了反叛世界的恶魔.外观为头上系着小圆的红色丝带、黑色的羽毛恶魔礼服、裙面为青色的地狱、黑白相间的羽翼、黑白相间的丝袜']],
                        博丽灵梦: ['female', 'qunII', 3, ['飞行', 'boss__nbaonuVI', '入侵', 'musical_reimu', 'dieghostII'], ['des:幻想乡境内博丽神社的现有巫女,负责解决在幻想乡中发生的各种异变,退治妖怪是她的日常工作.因为神社没什么参拜客,所以整天过着喝茶扫地的闲日子.博丽灵梦厌恶修炼(无论是体术还是法术),因而实力平平,但天生的判断力总能助其化险为夷']],
                    },
                    translate: {
                        终结者: '终结者',
                        高达一号: '高达一号',
                        魑魅魍魉: '魑魅魍魉',
                        牛头马面: '牛头马面',
                        黑白无常: '黑白无常',
                        幽冥大帝: '幽冥大帝',
                        合体年兽: '合体年兽',
                        凶恶年兽: '凶恶年兽',
                        亡灵龙: '亡灵龙',
                        僵尸龙: '僵尸龙',
                        煌黑龙: '煌黑龙',
                        炼狱龙: '炼狱龙',
                        金翅鹏: '金翅鹏',
                        路西法: '路西法',
                        北溟巨鲲: '北溟巨鲲',
                        应龙: '应龙',
                        刑天: '刑天',
                        远古巨龙: '远古巨龙',
                        克苏鲁: '克苏鲁',
                        九天玄女: '九天玄女',
                        死亡女神: '死亡女神',
                        收割者: '收割者',
                        战争机甲: '战斗机甲',
                        德古拉: '德古拉',
                        飞升吸血鬼: '德古拉',
                        利维坦: '利维坦',
                        奎托斯: '奎托斯',
                        天命人: '孙悟空',
                        歼灭者: '歼灭者',
                        帝王蟹: '帝王蟹',
                        毁灭战士: '毁灭战士',
                        蜘蛛机甲: '蜘蛛机甲',
                        加农道夫: '灾厄盖侬',
                        力巴尔: '力巴尔',
                        米法: '米法',
                        乌尔波扎: '乌尔波扎',
                        达尔克尔: '达尔克尔',
                        林克: '林克',
                        雷电: '雷电',
                        电锯人: '电锯人',
                        塞尔达: '塞尔达',
                        守护者: '守护者',
                        哨兵坦克: '哨兵坦克',
                        基洛夫空艇: '基洛夫空艇',
                        天启坦克: '天启坦克',
                        炮艇机: '空中要塞',
                        将军刽子手: '将军刽子手',
                        夜魔: '夜魔',
                        追踪者: '追踪者',
                        阿拉贡: '阿拉贡',
                        澹台烬: '澹台烬',
                        死亡骑士: '死亡骑士',
                        机械吕布: '神鬼无双',
                        尸群: '尸群',
                        暗夜之歌: '暗夜之歌',
                        战斗暴龙兽: '战斗暴龙兽',
                        库巴: '库巴',
                        地狱少女: '阎魔爱',
                        哨戒炮: '哨戒炮',
                        普通人: '普通人',
                        普通人II: '普通人',
                        不动明: '不动明',
                        防爆特警: '特种部队',
                        武庚: '武庚',
                        炽天使: '炽天使',
                        杰诺斯: '杰诺斯',
                        尼奥: '尼奥',
                        邪念: '邪念',
                        鸟身女妖: '鸟身女妖',
                        芬利尔: '芬利尔',
                        艾斯德斯: '艾斯德斯',
                        桐生一马: '桐生一马',
                        危险流浪者: '危险流浪者',
                        机械哥斯拉: '机械哥斯拉',
                        龙裔: '龙裔',
                        恶灵骑士: '恶灵骑士',
                        维吉尔: '维吉尔',
                        真魔人: '真魔人',
                        猎杀者: '猎杀者',
                        祸灵梦: '祸灵梦',
                        宇文拓: '宇文拓',
                        异形: '异形',
                        晓美焰: '晓美焰',
                        真岛吾朗: '真岛吾朗',
                        博丽灵梦: '博丽灵梦',
                        死神: '死神',
                        死神_info: '每轮限一次,其他角色濒死时,你可以令其立即死亡',
                        绝弑: '绝弑',
                        绝弑_info: '锁定技,其他角色濒死时,你令其立即死亡',
                        破天: '破天',
                        破天_info: '每当你使用【杀】指定一名角色为目标时,你可以令此【杀】不可被【闪】响应且该角色所有技能全部失效,直到回合结束',
                        破天II: '破天',
                        破天II_info: '每当你使用【杀】指定一名角色为目标时,你可以令此【杀】不可被【闪】响应且该角色所有技能全部失效,直到回合结束',
                        破天III: '魔眼',
                        破天III_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合;每当你使用【杀】指定一名角色为目标时,你可以令此【杀】不可被【闪】响应且该角色所有技能全部失效,直到回合结束;锁定技,你使用【杀】造成的伤害+1且无次数限制',
                        龙躯: '龙躯',
                        龙躯_info: '锁定技,你的武将牌始终正面向上;准备阶段,你回复所有被废除的装备栏',
                        北溟: '北溟',
                        北溟_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转;准备阶段,你回复所有被废除的装备栏',
                        龙翼: '龙翼',
                        龙翼_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转;你与其他角色距离-1,其他角色与你距离+1;准备阶段,你回复所有被废除的装备栏',
                        投影: '投影',
                        投影_info: '出牌阶段,你可以弃置一张牌,获得以下一项技能直到回合结束:〖旋风〗、〖地震〗、〖龙啸〗、〖龙殛〗',
                        龙魂: '龙魂',
                        龙魂_info: '你可将至多两张同花色的牌按以下规则使用或打出:♥️️当【桃】;♦️️当火【杀】;♣️️当【闪】;♠️️当【无懈可击】.若你以此法使用了两张红色牌,则此牌回复值或伤害值+1.若你以此法使用了两张黑色牌,则你弃置当前回合角色一张牌;锁定技,当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至1点,强制结束当前回合且立即进行一个额外的出牌阶段',
                        龙魂_sha: '龙魂·火杀',
                        龙魂_sha_info: '',
                        龙魂_shan: '龙魂·闪',
                        龙魂_shan_info: '',
                        龙魂_tao: '龙魂·桃',
                        龙魂_tao_info: '',
                        龙魂_wuxie: '龙魂·无懈',
                        龙魂_wuxie_info: '',
                        龙心: '龙心',
                        龙心_info: '锁定技,摸牌阶段,你不摸牌;出牌阶段开始时,你增加1点体力上限并回复所有被废除的装备栏,若你没有手牌,你摸四张牌;你的手牌数始终为4,你的手牌上限为0;当你即将受到伤害或扣减体力上限时,取消之,改为失去1点体力;你免疫翻面、混乱、技能失效、跳过阶段、强制更换武将牌且不会被移出游戏',
                        降临: '降临',
                        降临_info: '其他角色回合开始时,你可以立即进行一个额外的出牌阶段,该角色结束当前回合',
                        dclxuanfeng: '旋风',
                        dclxuanfeng_info: '当你一次性失去至少两张牌后,或当你失去装备区里的牌后,则你可以弃置至多两名其他角色的共计两张牌.若此时处于你的回合内,你可以对其中一名目标角色造成1点伤害',
                        dclqiangxi: '强袭',
                        dclqiangxi_info: '出牌阶段对每名其他角色限一次,你可以选择一项:1. 失去1点体力并对你攻击范围内的一名其他角色造成1点伤害;2. 弃置一张武器牌并对你攻击范围内的一名其他角色造成1点伤害',
                        旋风: '旋风',
                        旋风_info: '当你一次性失去至少两张牌后,或当你失去装备区里的牌后,则你可以弃置至多两名其他角色的共计两张牌.若此时处于你的回合内,你可以对其中一名目标角色造成1点伤害',
                        强袭: '强袭',
                        强袭_info: '出牌阶段对每名其他角色限一次,你可以选择一项:1. 失去1点体力并对你攻击范围内的一名其他角色造成1点伤害;2. 弃置一张武器牌并对你攻击范围内的一名其他角色造成1点伤害;你与其他角色距离-1',
                        龙啸: '龙啸',
                        龙啸_info: '出牌阶段限一次,你可以选择一名其他角色,该角色失去所有技能,直到回合结束.锁定技,你对其他角色使用牌无距离和次数限制',
                        longxiao1: '龙啸',
                        longxiao1_info: '',
                        longxiao2: '龙啸',
                        longxiao2_info: '',
                        龙殛: '龙殛',
                        龙殛_info: '出牌阶段限一次,你可以弃置X张牌,对一名其他角色造成X点火焰伤害(若X不小于2,则该角色翻至背面且所受伤害改为X^2)',
                        臂刃: '臂刃',
                        臂刃_info: '出牌阶段限一次,你可以对一名其他角色造成1点伤害,该角色失去所有技能,直到回合结束',
                        快攻: '快攻',
                        快攻_info: '出牌阶段限一次,你可以对你攻击范围内的一名其他角色造成1点伤害;锁定技,你的攻击范围+1',
                        龙卷: '龙卷',
                        龙卷_info: '出牌阶段限一次,你可以对一名与你距离为1的其他角色造成1点伤害且该角色失去所有技能,直到回合结束',
                        焚化: '焚化',
                        焚化_info: '出牌阶段限一次,你可以对你攻击范围内的一名其他角色造成1点火焰伤害且该角色失去所有技能,直到回合结束;锁定技,你的攻击范围+1',
                        龙怒: '龙怒',
                        龙怒_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合;出牌阶段限一次,你可以弃置所有手牌(至少一张)并回复等量体力,对一名其他角色造成等量火焰伤害,令其弃置所有牌且失去所有技能,直到回合结束',
                        删除: '入侵',
                        删除_info: '准备阶段,你可以失去1点体力,令一名与你距离为1的其他角色流失1点体力,弃置所有牌且失去所有技能,直到回合结束',
                        无色: '无色',
                        无色_info: '出牌阶段限一次,你可以弃置所有装备区内的牌(至少一张),对一名其他角色造成1点伤害,令其弃置所有牌且失去所有技能,直到回合结束',
                        光耀: '光耀',
                        光耀_info: '出牌阶段限一次,你可以弃置所有装备区内的牌(至少一张),对一名其他角色造成1点火焰伤害,令其弃置所有牌且失去所有技能,直到回合结束',
                        震荡: '震荡',
                        震荡_info: '出牌阶段限一次,你可以弃置所有装备区内的牌(至少一张),对一名其他角色造成1点雷电伤害,令其弃置所有牌且失去所有技能,直到回合结束;锁定技,你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        龙息: '龙息',
                        龙息_info: '结束阶段,若你没有被废除的装备栏,你可以废除你的所有装备栏,弃置所有手牌(至少一张),对一名其他角色造成等量火焰伤害且该角色失去所有技能,直到回合结束',
                        diedragon: '',
                        diedragon_info: '',
                        diedragonII: '',
                        diedragonII_info: '',
                        diemech: '',
                        diemech_info: '',
                        diedragonIII: '',
                        diedragonIII_info: '',
                        diedragonIV: '',
                        diedragonIV_info: '',
                        dierobot: '',
                        dierobot_info: '',
                        dieghost: '',
                        dieghost_info: '',
                        dieghostII: '',
                        dieghostII_info: '',
                        musical_spider: '',
                        musical_spider_info: '',
                        musical_lber: '',
                        musical_lber_info: '',
                        musical_mipha: '',
                        musical_mipha_info: '',
                        musical_urbz: '',
                        musical_urbz_info: '',
                        musical_darker: '',
                        musical_darker_info: '',
                        musical_link: '',
                        musical_link_info: '',
                        musical_ganon: '',
                        musical_ganon_info: '',
                        musical_tdrbot: '',
                        musical_tdrbot_info: '',
                        musical_akemihomura: '',
                        musical_akemihomura_info: '',
                        musical_alien: '',
                        musical_alien_info: '',
                        musical_jcp: '',
                        musical_jcp_info: '',
                        musical_dragon: '',
                        musical_dragon_info: '',
                        musical_dragon_ylong: '',
                        musical_dragon_ylong_info: '',
                        musical_dragon_gdyh: '',
                        musical_dragon_gdyh_info: '',
                        musical_dragon_wll: '',
                        musical_dragon_wll_info: '',
                        musical_dragon_jsl: '',
                        musical_dragon_jsl_info: '',
                        musical_dragon_lyl: '',
                        musical_dragon_lyl_info: '',
                        musical_dragon_hhl: '',
                        musical_dragon_hhl_info: '',
                        musical_jtxn: '',
                        musical_jtxn_info: '',
                        musical_swns: '',
                        musical_swns_info: '',
                        musical_sgz: '',
                        musical_sgz_info: '',
                        musical_bfrbt: '',
                        musical_bfrbt_info: '',
                        musical_lvthan: '',
                        musical_lvthan_info: '',
                        musical_krts: '',
                        musical_krts_info: '',
                        musical_dcl: '',
                        musical_dcl_info: '',
                        musical_apoc: '',
                        musical_apoc_info: '',
                        musical_vlt: '',
                        musical_vlt_info: '',
                        musical_alg: '',
                        musical_alg_info: '',
                        musical_nemesis: '',
                        musical_nemesis_info: '',
                        musical_exec: '',
                        musical_exec_info: '',
                        musical_ac130: '',
                        musical_ac130_info: '',
                        musical_ttj: '',
                        musical_ttj_info: '',
                        musical_doom: '',
                        musical_doom_info: '',
                        musical_kingcrab: '',
                        musical_kingcrab_info: '',
                        musical_anh: '',
                        musical_anh_info: '',
                        musical_csm: '',
                        musical_csm_info: '',
                        musical_zelda: '',
                        musical_zelda_info: '',
                        musical_gdan: '',
                        musical_gdan_info: '',
                        musical_stnl: '',
                        musical_stnl_info: '',
                        musical_kirov: '',
                        musical_kirov_info: '',
                        musical_beimjq: '',
                        musical_beimjq_info: '',
                        musical_nshou: '',
                        musical_nshou_info: '',
                        musical_T800: '',
                        musical_T800_info: '',
                        musical_xt: '',
                        musical_xt_info: '',
                        musical_enmaai: '',
                        musical_enmaai_info: '',
                        musical_agl: '',
                        musical_agl_info: '',
                        musical_hacker: '',
                        musical_hacker_info: '',
                        musical_Fenrir: '',
                        musical_Fenrir_info: '',
                        musical_apple: '',
                        musical_apple_info: '',
                        musical_hunterkiller: '',
                        musical_hunterkiller_info: '',
                        musical_deviltrigger: '',
                        musical_deviltrigger_info: '',
                        musical_ghost: '',
                        musical_ghost_info: '',
                        musical_majima: '',
                        musical_majima_info: '',
                        musical_ywt: '',
                        musical_ywt_info: '',
                        musical_dgb: '',
                        musical_dgb_info: '',
                        musical_mechag: '',
                        musical_mechag_info: '',
                        musical_danger: '',
                        musical_danger_info: '',
                        musical_KiryuKazuma: '',
                        musical_KiryuKazuma_info: '',
                        musical_esdeath: '',
                        musical_esdeath_info: '',
                        musical_harpy: '',
                        musical_harpy_info: '',
                        musical_durge: '',
                        musical_durge_info: '',
                        musical_dclI: '',
                        musical_dclI_info: '',
                        musical_reimu: '',
                        musical_reimu_info: '',
                        musical_cyborg: '',
                        musical_cyborg_info: '',
                        musical_wugengji: '',
                        musical_wugengji_info: '',
                        musical_trt: '',
                        musical_trt_info: '',
                        musical_devil: '',
                        musical_devil_info: '',
                        musical_bowser: '',
                        musical_bowser_info: '',
                        musical_wargm: '',
                        musical_wargm_info: '',
                        musical_lvbu: '',
                        musical_lvbu_info: '',
                        musical_aylin: '',
                        musical_aylin_info: '',
                        musical_horde: '',
                        musical_horde_info: '',
                        musical_dk: '',
                        musical_dk_info: '',
                        musical_wukong: '',
                        musical_wukong_info: '',
                        musical_xshou: '',
                        musical_xshou_info: '',
                        musical_ymdd: '',
                        musical_ymdd_info: '',
                        musical_ctl: '',
                        musical_ctl_info: '',
                        焚云: '焚云',
                        焚云_info: '出牌阶段限一次,你可以弃置X张牌,令一名其他角色翻至背面,受到X点火焰伤害',
                        tqfensui: '粉碎',
                        tqfensui_info: '出牌阶段限一次,你可以弃置X张牌,令一名与你距离为1的其他角色弃置X张牌(不足则全弃),受到X点伤害;锁定技,你与其他角色距离-1',
                        扫射: '扫射',
                        扫射_info: '出牌阶段限一次,你可以弃置X张【杀】,令一名其他角色弃置X张牌(不足则全弃),受到X点伤害;锁定技,你的武器牌均视为【杀】',
                        剑气: '剑气',
                        剑气_info: '出牌阶段限一次,你可以弃置X张【杀】,令一名你攻击范围内的其他角色弃置X张牌(不足则全弃)并受到X点伤害,失去所有技能直到回合结束;锁定技,你的武器牌均视为【杀】',
                        链锯: '链锯',
                        链锯_info: '出牌阶段限一次,你可以弃置X张【杀】,令一名你攻击范围内的其他角色弃置X张牌(不足则全弃)并受到X点伤害,失去所有技能直到回合结束;锁定技,你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        钢骨: '钢骨',
                        钢骨_info: '锁定技,当你即将受到大于1点的伤害、失去体力、失去体力上限时,取消之,改为受到1点伤害;准备阶段,若你没有护甲,你获得1点护甲;每当你的护甲抵消一次伤害,你摸一张牌',
                        魔眼II: '魔眼',
                        魔眼II_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合',
                        龙怒II: '龙怒',
                        龙怒II_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合',
                        重甲II: '重甲',
                        重甲II_info: '',
                        刺甲II: '刺甲',
                        刺甲II_info: '',
                        血盾II: '血盾',
                        血盾II_info: '',
                        血盾III: '血盾',
                        血盾III_info: '',
                        焰甲II: '焰甲',
                        焰甲II_info: '',
                        焰甲III: '焰甲',
                        焰甲III_info: '',
                        机甲II: '机甲',
                        机甲II_info: '',
                        装甲II: '装甲',
                        装甲II_info: '',
                        钢骨II: '钢骨',
                        钢骨II_info: '',
                        炮台II: '炮台',
                        炮台II_info: '',
                        炮台III: '炮台',
                        炮台III_info: '',
                        冲撞II: '冲撞',
                        冲撞II_info: '',
                        冲撞III: '冲撞',
                        冲撞III_info: '',
                        力竭II: '力尽',
                        力竭II_info: '',
                        力竭: '力尽',
                        力竭_info: '锁定技,结束阶段,你失去变身效果',
                        炮台IV: '回收',
                        炮台IV_info: '出牌阶段结束时,你可以回收哨戒炮;锁定技,当你即将死亡前,你拒绝死亡并回收哨戒炮',
                        炮台V: '回收',
                        炮台V_info: '出牌阶段结束时,你可以回收哨戒炮',
                        剑气II: '剑气',
                        剑气II_info: '',
                        扫射II: '扫射',
                        扫射II_info: '',
                        火盾II: '火盾',
                        火盾II_info: '',
                        魔甲: '魔甲',
                        魔甲_info: '锁定技,每名角色的准备阶段,若你没有护甲,你获得1点护甲',
                        神力II: '神力',
                        神力II_info: '每名角色的准备阶段,你可以视为使用一张没有距离限制的【杀】',
                        神力: '神力',
                        神力_info: '每名角色的准备阶段,你可以视为使用一张没有距离限制的【杀】',
                        光箭: '光箭',
                        光箭_info: '每名角色的结束阶段,你可以视为使用一张没有距离限制的【杀】',
                        光刃: '光刃',
                        光刃_info: '当你使用【杀】指定第一个目标后,你可以选择任意项:1.摸一张牌;2.弃置其中一个目标角色一张牌.若你均选择,当此【杀】被无效后或被抵消后,该角色弃置你一张牌',
                        机械: '机械',
                        机械_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上;你的手牌上限+X(X等于你的护甲值)',
                        火盾: '火盾',
                        火盾_info: '每轮限一次,当你受到伤害时,你可以对伤害来源造成1点火焰伤害且获得1点护甲;锁定技,你的手牌上限+2X(X等于你的护甲值)',
                        重甲: '重甲',
                        重甲_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上;当你即将失去体力、失去体力上限时,取消之,改为受到1点伤害;当你受到伤害时,获得1点护甲;当你即将受到大于2点的伤害时,取消之,改为受到2点伤害;你的手牌上限+X(X等于你的护甲值)',
                        骨甲: '骨甲',
                        骨甲_info: '锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上;当你即将受到大于1点的伤害时,取消之,改为受到1点伤害',
                        机甲: '机甲',
                        机甲_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上;当你即将受到大于1点的伤害、失去体力、失去体力上限时,取消之,改为受到1点伤害;你的手牌上限+X(X等于你的护甲值)',
                        装甲: '装甲',
                        装甲_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上;当你即将失去体力、失去体力上限时,取消之,改为受到1点伤害;你的手牌上限+X(X等于你的护甲值)',
                        刺甲: '刺甲',
                        刺甲_info: '每轮限一次,当你受到伤害时,你可以对伤害来源造成1点伤害且获得1点护甲;锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上',
                        酸血: '血蚀',
                        酸血_info: '锁定技,当你受到伤害后,你令伤害来源废除武器栏且失去1点体力;若其武器栏已废除,则改为失去2点体力',
                        打虎: '虎落',
                        打虎_info: '每轮限一次,当你即将受到伤害前,你可以取消之,对伤害来源造成1点伤害且令其翻至背面',
                        鬼炎: '鬼炎',
                        鬼炎_info: '每轮限一次,当你即将受到伤害前,你可以取消之,对伤害来源依次造成1点伤害和1点火焰伤害',
                        血盾: '血盾',
                        血盾_info: '每轮限一次,当你受到伤害时,你可以对伤害来源造成1点伤害且获得1点护甲;锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上;你的手牌上限+X(X等于你的护甲值)',
                        焰甲: '焰甲',
                        焰甲_info: '每轮限一次,当你受到伤害时,你可以对伤害来源造成1点火焰伤害且获得1点护甲;锁定技,你不能成为其他角色延迟锦囊牌的目标;你的武将牌始终正面向上',
                        魔躯: '魔躯',
                        魔躯_info: '锁定技,你不能成为【乐不思蜀】的目标;你与其他角色距离-1;你的武将牌始终正面向上;你的手牌上限+X(X等于你的体力值);你视为拥有技能〖不朽〗(结束阶段开始前,若你已受伤,你回复1点体力;锁定技,当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至1点)',
                        邪骨: '邪骨',
                        邪骨_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你与其他角色距离-2;你的武将牌始终正面向上;你的手牌上限+X(X等于你的体力上限);你视为拥有技能〖绝弑〗(锁定技,其他角色濒死时,你令其立即死亡)',
                        仙体: '仙体',
                        仙体_info: '锁定技,你与其他角色距离-1,其他角色与你距离+1;你的武将牌始终正面向上;你视为拥有技能〖不朽〗(结束阶段开始前,若你已受伤,你回复1点体力;锁定技,当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至1点)',
                        圣躯: '圣躯',
                        圣躯_info: '锁定技,你不能成为其他角色延迟锦囊牌的目标;你与其他角色距离-2,其他角色与你距离+2',
                        飞行: '飞行',
                        飞行_info: '锁定技,你与其他角色距离-1,其他角色与你距离+1',
                        血祖: '血祖',
                        血祖_info: '锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上;准备阶段,你回复所有被废除的装备栏',
                        尸玉: '尸玉',
                        尸玉_info: '每轮限一次,其他角色的回合结束后,你可以摸一张牌并进行一个额外的回合;锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上;回合开始阶段,你回复所有被废除的装备栏;当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至上限;你的手牌上限+2X(X等于你的体力值)',
                        王座: '王座',
                        王座_info: '锁定技,你不能成为【乐不思蜀】的目标;其他角色与你距离+1;你的武将牌始终正面向上',
                        积腐: '积腐',
                        积腐_info: '出牌阶段限一次,你可以弃置两张牌并获得2点护甲,获得技能〖强固〗直到下个回合开始',
                        维修: '维修',
                        维修_info: '出牌阶段限一次,你可以弃置两张牌并获得2点护甲,获得技能〖强固〗直到下个回合开始',
                        部署: '部署',
                        部署_info: '出牌阶段限一次,你可以弃置两张牌部署哨戒炮',
                        变身: '魔化',
                        变身_info: '出牌阶段限一次,你可以弃置两张牌变身为真魔人',
                        神域: '神域',
                        神域_info: '锁定技,【南蛮入侵】、【万箭齐发】和普通杀对你无效,你的武将牌始终正面向上;当你即将受到伤害或扣减体力上限时,取消之,改为失去1点体力',
                        心毒: '心毒',
                        心毒_info: '准备阶段,你可以令一名未进入混乱状态的其他角色进入混乱状态',
                        雷鸣: '雷鸣',
                        雷鸣_info: '准备阶段,你可以对一名其他角色造成3点雷电伤害',
                        幽冥: '幽冥',
                        幽冥_info: '锁定技,你与其他角色的距离视为1,你的武将牌始终正面向上',
                        gdjuejing: '绝境',
                        gdjuejing_info: '锁定技,你始终跳过摸牌阶段,你的手牌数始终为4',
                        gdlonghun: '龙魂',
                        gdlonghun_info: '你可将至多两张同花色的牌按以下规则使用或打出:♥️️当【桃】;♦️️当火【杀】;♣️️当【闪】;♠️️当【无懈可击】.若你以此法使用了两张红色牌,则此牌回复值或伤害值+1.若你以此法使用了两张黑色牌,则你弃置当前回合角色一张牌',
                        gdlonghun_sha: '龙魂·火杀',
                        gdlonghun_sha_info: '',
                        gdlonghun_shan: '龙魂·闪',
                        gdlonghun_shan_info: '',
                        gdlonghun_tao: '龙魂·桃',
                        gdlonghun_tao_info: '',
                        gdlonghun_wuxie: '龙魂·无懈',
                        gdlonghun_wuxie_info: '',
                        gdzhanjiang: '斩将',
                        gdzhanjiang_info: '结束阶段,若你没有被废除的装备栏,你可以废除你的所有装备栏,对一名体力不小于你的其他角色造成1点火焰伤害并令其翻至背面',
                        刑判: '刑判',
                        刑判_info: '锁定技,你的回合开始时,你对所有距离为1的其他角色造成1点火焰伤害;你受到大于等于2的伤害时,令此伤害-1',
                        地府: '地府',
                        地府_info: '锁定技,你进入游戏时额外摸三张牌;结束阶段开始时,你摸两张牌;你的回合开始时,若你当前体力小于3,则回复至3',
                        铁面: '铁面',
                        铁面_info: '锁定技,每当你成为其他角色黑色牌的目标时,你令此牌无效并获得之',
                        龙佑: '龙佑',
                        龙佑_info: '锁定技,当你失去一张装备区内的牌后,你获得1点护甲;当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至1点',
                        不朽: '不朽',
                        不朽_info: '结束阶段开始前,若你已受伤,你回复1点体力;锁定技,当你即将死亡前,若你没有被废除的装备栏,则你废除所有装备栏,拒绝死亡并回复体力至1点',
                        不朽II: '不朽',
                        不朽II_info: '',
                        堕天II: '堕天',
                        堕天II_info: '结束阶段,你可以对任意名其他角色造成2点伤害',
                        巨浪: '巨浪',
                        巨浪_info: '出牌阶段限一次,若你没有被废除的装备栏,你可以废除所有装备栏,令所有其他角色受到1点伤害并弃置所有牌',
                        风暴: '风暴',
                        风暴_info: '当你失去装备区里的牌时,你可以选择一项:1.视为使用一张【杀】(无距离限制且不计入出牌阶段内的使用次数限制);2.对距离为1的一名角色造成1点伤害',
                        瘴气: '瘴气',
                        瘴气_info: '出牌阶段限一次,你可令除你外的所有角色依次对与其距离最近的另一名角色使用一张【杀】,否则失去1点体力',
                        瘟疫: '瘟疫',
                        瘟疫_info: '出牌阶段限一次,你可以令所有其他角色各选择一项:弃置至少X张牌(X等于该角色的上家以此法弃置牌的数量+1);失去2点体力',
                        尸毒: '尸毒',
                        尸毒_info: '结束阶段,你可以令任意名未进入混乱状态的其他角色进入混乱状态,直到其下一回合结束',
                        堕天: '堕天',
                        堕天_info: '结束阶段,你可以对任意名其他角色造成2点伤害',
                        斩天: '斩天',
                        斩天_info: '准备阶段,你可以对任意名其他角色造成2点伤害',
                        洪荒: '洪荒',
                        洪荒_info: '出牌阶段,你可以弃置一张牌,获得以下一项技能直到回合结束:〖旋风〗、〖神戟〗、〖武圣〗、〖狂骨〗',
                        梦魇: '梦魇',
                        梦魇_info: '每当你失去最后一张手牌,你令手牌数不为0的角色失去全部手牌,手牌数为0的角色进入混乱状态,直到其下一回合结束(不触发技能)',
                        梦魇II: '梦魇',
                        梦魇II_info: '每当你失去最后一张手牌,你令手牌数不为0的角色失去全部手牌,手牌数为0的角色进入混乱状态,直到其下一回合结束(不触发技能)',
                        沉眠: '沉眠',
                        沉眠_info: '每轮限一次,其他角色回合开始时,你可以令其直接跳过该回合;锁定技,准备阶段或你进入濒死状态时,你弃置所有手牌并回复等量体力,解除混乱状态',
                        震怒: '震怒',
                        震怒_info: '出牌阶段,你可以弃置一张牌,获得以下一项技能直到回合结束:〖强袭〗、〖铁骑〗、〖旋风〗、〖绝策〗',
                        极武: '极武',
                        极武_info: '出牌阶段,你可以弃置一张牌,获得以下一项技能直到回合结束:〖强袭〗、〖铁骑〗、〖旋风〗、〖完杀〗',
                        wzlongyan: '龙炎',
                        wzlongyan_info: '结束阶段,你可以对任意名其他角色造成2点火焰伤害',
                        血鬼: '血鬼',
                        血鬼_info: '回合开始阶段,你可以令一名其他角色失去所有技能,直到回合结束;锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上;当你即将失去体力、失去体力上限时,取消之,改为受到1点伤害',
                        禁闭: '禁闭',
                        禁闭_info: '回合开始阶段,你可以令一名其他角色失去所有技能,直到回合结束;锁定技,你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        审判: '审判',
                        审判_info: '每轮限一次,出牌阶段,你可以令一名与你距离为1且有手牌的其他角色弃置所有手牌并受到等量火焰伤害',
                        冰岚: '冰岚',
                        冰岚_info: '出牌阶段限一次,你可以令一名有手牌的其他角色弃置所有手牌并受到等量伤害',
                        狂罚: '狂罚',
                        狂罚_info: '出牌阶段限一次,你可以令一名有手牌的其他角色弃置所有手牌并失去等量体力',
                        kslbingyuan: '冰渊',
                        kslbingyuan_info: '出牌阶段限一次,你可以选择一名其他角色,该角色失去所有技能且翻至背面,直到回合结束',
                        kslbingyuanII: '血渊',
                        kslbingyuanII_info: '出牌阶段限一次,你可以选择一名其他角色并失去X点体力(X等于该角色体力值减去你的体力值,不小于0),该角色流失所有体力并失去所有技能,直到回合结束',
                        魂牢: '魂牢',
                        魂牢_info: '出牌阶段限一次,你可以令一名其他角色失去所有技能,直到回合结束',
                        wlbingfeng: '冰封',
                        wlbingfeng_info: '出牌阶段限一次,你可以令一名其他角色失去所有技能,直到回合结束',
                        wljihan: '极寒',
                        wljihan_info: '结束阶段开始前,你可以令一名其他角色失去2点体力',
                        净罪: '净罪',
                        净罪_info: '结束阶段,你可以令一名没有手牌的其他角色失去1点体力上限',
                        kslduanhun: '断魂',
                        kslduanhun_info: '结束阶段,你可以令一名没有手牌的其他角色失去所有体力上限',
                        湮灭: '湮灭',
                        湮灭_info: '出牌阶段结束时,若你没有被废除的装备栏,你可以废除你的所有装备栏,令一名其他角色死亡',
                        mwshawei: '杀威',
                        mwshawei_info: '结束阶段,你可以对一名没有手牌的其他角色造成2点伤害且该角色失去所有技能,直到回合结束',
                        mwhuangwei: '皇威',
                        mwhuangwei_info: '出牌阶段限一次,你可以获得一名其他角色的所有手牌',
                        mwjiuchi: '血海',
                        mwjiuchi_info: '出牌阶段限一次,你可以弃置一张牌并对自己1点伤害,获得技能〖灭绝〗直到回合结束',
                        dclfeisheng: '飞升',
                        dclfeisheng_info: '出牌阶段,你可以弃置所有牌(至少四张)、失去所有体力(至少3点)并开始举行亵渎飞升仪式,你的下个回合开始将永久进化为飞升吸血鬼:增加1点体力上限并回复体力至上限,获得技能〖旋风〗、〖强袭〗、〖狂骨〗、〖狂宴〗,失去技能〖化雾〗、〖不朽〗、〖飞行〗、〖飞升〗',
                        dclfeishengII: '飞升',
                        dclfeishengII_info: '你正在举行亵渎飞升仪式,下个回合开始将永久进化为飞升吸血鬼:增加1点体力上限并回复体力至上限,获得技能〖旋风〗、〖强袭〗、〖狂骨〗、〖狂宴〗,失去技能〖化雾〗、〖不朽〗、〖飞行〗、〖飞升〗',
                        dclfeishengIII: '飞升',
                        dclfeishengIII_info: '你已进化为飞升吸血鬼,获得技能〖旋风〗、〖强袭〗、〖狂骨〗、〖狂宴〗',
                        zhfenshi: '狂噬',
                        zhfenshi_info: '锁定技,当你回复体力后,你摸2X张牌(X等于回复量)',
                        dclkuangyan: '狂宴',
                        dclkuangyan_info: '锁定技,当你回复体力后,你摸2X张牌(X等于回复量);你的手牌上限为0;你与其他角色距离-1;你视为拥有技能〖化雾〗(当你失去最后一张手牌时,可以进入潜行状态直到你的回合开始)',
                        洪荒II: '洪荒',
                        洪荒II_info: '',
                        灭绝: '灭绝',
                        灭绝_info: '锁定技,你造成的非传导伤害+1',
                        地震: '地震',
                        地震_info: '锁定技,你造成的非传导伤害+1',
                        歼灭: '歼灭',
                        歼灭_info: '锁定技,你造成的非传导伤害+1',
                        沉眠II: '沉眠',
                        沉眠II_info: '',
                        鏖战: '鏖战',
                        鏖战_info: '锁定技,若你装备区内有:武器牌,你可以多使用一张【杀】;防具牌,防止你受到的超过1点的伤害;坐骑牌,摸牌阶段多摸一张牌;宝物牌,跳过你的判定阶段',
                        化首: '化首',
                        化首_info: '出牌阶段限一次,你可以失去任意点体力,摸X张牌,本回合你计算与其他角色的距离-X且你可以多使用X张【杀】(X等于你以此法失去的体力数)',
                        boss__baolian: '装填',
                        boss__baolian_info: '结束阶段,你摸两张牌,若你没有手牌,则改为摸三张牌',
                        boss__baolianII: '充能',
                        boss__baolianII_info: '回合开始阶段,你摸两张牌,若你没有手牌,则改为摸三张牌',
                        boss__guihuo: '鬼火',
                        boss__guihuo_info: '结束阶段,你可以对一名其他角色造成1点火焰伤害',
                        巨炮: '巨炮',
                        巨炮_info: '结束阶段,你可以对一名其他角色造成3点火焰伤害',
                        重炮: '重炮',
                        重炮_info: '准备阶段,你可以对一名其他角色造成2点火焰伤害且该角色失去所有技能,直到回合结束',
                        狼袭: '狼袭',
                        狼袭_info: '准备阶段,你可以对一名其他角色造成2点伤害且该角色失去所有技能,直到回合结束',
                        血拳: '血拳',
                        血拳_info: '准备阶段,你可以对你攻击范围内的一名其他角色造成1点伤害且你回复1点体力,该角色弃置装备区内的所有牌并失去所有技能,直到回合结束;锁定技,你的攻击范围+1;你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        残虐: '残虐',
                        残虐_info: '结束阶段,你可以失去1点体力,对你攻击范围内的一名其他角色造成1点伤害且该角色失去所有技能,直到回合结束;锁定技,你的攻击范围+1',
                        darkurge: '屠杀',
                        darkurge_info: '结束阶段,你可以失去1点体力,对你攻击范围内的一名其他角色造成2点伤害,该角色弃置所有牌并失去所有技能,直到回合结束;锁定技,你的攻击范围+1;你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        脉冲: '镭射',
                        脉冲_info: '每名角色的结束阶段,你可以对一名其他角色造成1点雷电伤害',
                        践踏: '斩击',
                        践踏_info: '每名角色的结束阶段,你可以对你攻击范围内的一名其他角色造成1点伤害;锁定技,你的攻击范围+2',
                        神罚: '神罚',
                        神罚_info: '每轮限一次,一名角色的结束阶段,你可以流失3点体力,对一名与你距离为1的其他角色依次造成2点伤害、2点雷电伤害和2点火焰伤害',
                        轰炸: '轰炸',
                        轰炸_info: '每名角色的结束阶段,你可以对一名与你距离为1的其他角色造成1点火焰伤害且该角色失去所有技能,直到本回合结束',
                        boss__luolei: '落雷',
                        boss__luolei_info: '准备阶段,你可以对一名其他角色造成1点雷电伤害',
                        boss__guimei: '鬼魅',
                        boss__guimei_info: '锁定技,你不能成为延时类锦囊的目标',
                        boss__shanbeng: '山崩',
                        boss__shanbeng_info: '锁定技,当你死亡时,你令所有其他角色弃置其装备区内的所有牌',
                        boss__guiji: '诡计',
                        boss__guiji_info: '锁定技,准备阶段结束时,若你的判定区内有牌,你随机弃置其中一张牌',
                        boss__taiping: '太平',
                        boss__taiping_info: '锁定技,摸牌阶段摸牌时,你的摸牌数量+2',
                        尸玉II: '尸玉',
                        尸玉II_info: '',
                        尸玉III: '尸玉',
                        尸玉III_info: '每轮限一次,其他角色的回合结束后,你可以摸一张牌并进行一个额外的回合',
                        尸玉IV: '尸玉',
                        尸玉IV_info: '',
                        血祖II: '血祖',
                        血祖II_info: '',
                        boss__xiaoshou: '枭首',
                        boss__xiaoshou_info: '结束阶段,对体力不大于你的一名其他角色造成3点火焰伤害',
                        boss__suoming: '索命',
                        boss__suoming_info: '结束阶段,将任意名未被横置的其他角色的武将牌横置',
                        boss__xixing: '吸星',
                        boss__xixing_info: '准备阶段,对任意一名横置的其他角色造成1点雷电伤害,回复1点体力',
                        boss__didong: '地动',
                        boss__didong_info: '结束阶段,你可以选择一名敌方角色将其武将牌翻面',
                        boss__qiangzheng: '强征',
                        boss__qiangzheng_info: '锁定技,结束阶段开始前,你获得每个敌方角色的一张手牌',
                        极道II: '极道',
                        极道II_info: '每轮限一次,一名角色的准备阶段,你可以视为使用一张没有距离限制的【杀】',
                        极道: '极道',
                        极道_info: '每轮限一次,一名角色的准备阶段,你可以视为使用一张没有距离限制的【杀】;锁定技,你不能成为【乐不思蜀】的目标;你的武将牌始终正面向上',
                        矩阵: '矩阵',
                        矩阵_info: '锁定技,你的武将牌始终正面向上',
                        神勇: '神勇',
                        神勇_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转;你视为拥有技能〖精防〗(每当你即将受到伤害,你摸一张牌,可弃置一张红色手牌令伤害-1)和〖强击〗(每当你即将造成伤害,你摸一张牌,可弃置一张黑色手牌令伤害+1)',
                        英杰: '英杰',
                        英杰_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转;你视为拥有技能〖格挡〗(每当你即将受到伤害,可弃置一张红色手牌令伤害-1)和〖重击〗(每当你即将造成伤害,可弃置一张黑色手牌令伤害+1)',
                        boss__shenyi: '神裔',
                        boss__shenyi_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转',
                        悟道: '悟道',
                        悟道_info: '锁定技,你的武将牌始终正面向上;你的判定区内的牌效果反转;你免疫混乱、技能失效、跳过阶段、强制更换武将牌且不会被移出游戏',
                        神羽: '神羽',
                        神羽_info: '锁定技,其他角色与你距离+5,你的武将牌始终正面向上,你的判定区内的牌效果反转',
                        boss__shouyi: '兽道',
                        boss__shouyi_info: '锁定技,你的武将牌始终正面向上,你使用牌无距离限制',
                        boss__nbaonu: '暴怒',
                        boss__nbaonu_info: '锁定技,摸牌阶段,你摸X张牌(X等于你的体力值,且不低于3,不超过10);若你的体力值不大于3,则你使用【杀】造成的伤害+1且无次数限制;你的手牌上限不小于3',
                        boss__nbaonuII: '劫云',
                        boss__nbaonuII_info: '锁定技,摸牌阶段,你摸X张牌(X等于你已损失的体力值+3,且不超过10);你使用【杀】造成伤害时,可以失去1点体力(若体力值不大于1则无需失去体力)令该伤害+1;你使用【杀】无次数限制',
                        劫云: '劫云',
                        劫云_info: '锁定技,摸牌阶段,你摸X张牌(X等于你已损失的体力值+3,且不超过10);你使用【杀】造成伤害时,可以失去1点体力(若体力值不大于1则无需失去体力)令该伤害+1;你使用【杀】无次数限制',
                        boss__nbaonuIII: '九天',
                        boss__nbaonuIII_info: '锁定技,摸牌阶段,你摸九张牌,你的手牌上限+9',
                        boss__nbaonuIV: '玄烈',
                        boss__nbaonuIV_info: '当你造成非传导伤害时,你可以失去1点体力,令伤害+1;你使用【杀】无次数限制',
                        boss__nbaonuV: '帝师',
                        boss__nbaonuV_info: '每当你使用或打出一张♥️️牌,你可以令一名角色回复1点体力.锁定技,你的♠️️牌视为♥️️牌',
                        boss__nbaonuVI: '仙术',
                        boss__nbaonuVI_info: '每当一名角色回复体力后,你可以令其摸一张牌;每当你失去装备区里的一张牌时,你摸一张牌',
                        boss__jingjue: '警觉',
                        boss__jingjue_info: '每当你于回合外失去牌时,你可以进行一次判定,若结果为红色,你回复1点体力',
                        boss__renxing: '任性',
                        boss__renxing_info: '锁定技,你的回合外,一名角色受到1点伤害后或回复1点体力时,你摸一张牌',
                        boss__ruizhi: '睿智',
                        boss__ruizhi_info: '锁定技,其他角色的准备阶段开始时,其选择一张手牌和一张装备区里的牌,弃置其余的牌',
                        boss__xiongshou: '凶兽',
                        boss__xiongshou_info: '锁定技,你使用【杀】对体力值小于你的角色造成的伤害+1;你与其他角色距离-1;你不能被翻面',
                        boss__zhue: '极恶',
                        boss__zhue_info: '你可以将一张黑色牌当作【无懈可击】使用;锁定技,你区域内的♥️️牌和♥️️判定牌均视为♠️️',
                        boss__modao: '魔道',
                        boss__modao_info: '锁定技,准备阶段,你摸两张牌',
                        入侵: '源界',
                        入侵_info: '锁定技,结束阶段,你回复X点体力并摸X张牌(X等于你已损失的体力值);你的手牌上限等于你的体力上限',
                        轮回: '轮回',
                        轮回_info: '每轮限一次,其他角色的回合结束后,你可以摸两张牌并进行一个额外的回合',
                        曙光: '曙光',
                        曙光_info: '锁定技,准备阶段,你回复X点体力并摸X张牌(X等于你已损失的体力值)',
                        boss__moyany: '魔炎',
                        boss__moyany_info: '每当你于回合外失去牌时,你可以进行一次判定,若结果为红色,你对一名其他角色造成2点火焰伤害',
                        boss__leiji: '阴雷',
                        boss__leiji_info: '当你的判定结果确定后,若结果为:♠️️,你对一名其他角色造成2点雷电伤害;♣️️,你摸一张牌,你对一名其他角色造成1点雷电伤害',
                        boss__fengdong: '封冻',
                        boss__fengdong_info: '锁定技,你的回合内,其他角色的非锁定技失效',
                        boss__fengdongII: '神临',
                        boss__fengdongII_info: '锁定技,你的回合内,其他角色的所有技能失效',
                        boss__juehong: '决洪',
                        boss__juehong_info: '锁定技,准备阶段开始前,你令所有敌方角色弃置装备区内的牌,若其装备区内没有牌,则改为你弃置其一张手牌',
                        boss__lianyu: '炼狱',
                        boss__lianyu_info: '结束阶段,你可以对所有敌方角色造成1点火焰伤害',
                        劫火: '劫火',
                        劫火_info: '结束阶段,你可以摸两张牌并对所有敌方角色造成1点火焰伤害',
                        fengqi: '风起',
                        fengqi_info: '准备阶段和结束阶段,你可以视为使用任意普通锦囊牌',
                        boss__biantian: '变天',
                        boss__biantian_info: '锁定技,回合开始阶段,你进行一次判定,若为红色,直到下个回合开始前,令所有其他角色处于<狂风>状态,若为黑色,直到下个回合开始前,令自己处于<大雾>状态',
                        boss__biantian2: '大雾',
                        boss__biantian3: '狂风',
                        boss__fentian: '焚天',
                        boss__fentian_info: '锁定技,你造成的伤害视为火焰伤害;你使用红色牌无距离和次数限制,且不可被其他角色使用【闪】或【无懈可击】响应',
                        boss__fentian2: '焚天',
                        boss__tianyun: '天陨',
                        boss__tianyun_info: '结束阶段开始前,你可以对自己造成1点火焰伤害,对一名其他角色造成2点火焰伤害并弃置其装备区里的所有牌',
                        boss__lingqu: '灵躯',
                        boss__lingqu_info: '锁定技,当你受到伤害后,你摸一张牌且手牌上限+1.当你即将受到大于1点的伤害时,取消之,改为受到1点伤害',
                        boss__lingyu: '灵愈',
                        boss__lingyu_info: '结束阶段,你可以摸两张牌并回复1点体力',
                        血咒: '血咒',
                        血咒_info: '回合开始阶段,你可以选择一项效果直到下一回合开始:1. 每当一名其他角色在一个回合中首次受到伤害,该角色失去1点体力,你回复1点体力;2. 每当一名其他角色在一个回合中首次造成伤害,该角色失去1点体力,你(若不是受伤害角色)回复1点体力',
                        幻术: '幻术',
                        幻术_info: '出牌阶段限一次,你可以将所有的手牌(至少一张)当做任意普通锦囊牌使用',
                        龙佑III: '龙佑',
                        龙佑III_info: '',
                        龙魂II: '龙魂',
                        龙魂II_info: '',
                        龙佑II: '龙佑',
                        龙佑II_info: '',
                        boss__tiandao: '天道',
                        boss__tiandao_info: '任意一名角色的判定生效前,你可以打出一张牌替换之',
                        em_shenqvII: '神躯',
                        em_shenqvII_info: '每名角色的回合开始阶段,若你的手牌数不大于体力上限,你可以摸两张牌',
                        em_shenqv: '噬焰',
                        em_shenqv_info: '每名角色的回合开始阶段,若你的手牌数不大于体力上限,你可以摸两张牌',
                        化雾: '化雾',
                        化雾_info: '当你失去最后一张手牌时,可以进入潜行状态直到你的回合开始',
                        潜伏: '匿踪',
                        潜伏_info: '当你失去最后一张手牌时,可以进入潜行状态直到你的回合开始;锁定技,你区域内的♦️️牌和♦️️判定牌均视为♣️️',
                        金身: '金身',
                        金身_info: '锁定技,每当你受到无属性伤害时,你可以防止该伤害或摸2X张牌(X等于伤害量);你的手牌上限等于你的体力上限',
                        残躯: '残躯',
                        残躯_info: '锁定技,当你即将死亡前,若你的坐骑栏没有被废除,则你废除坐骑栏,拒绝死亡并重置体力与体力上限至1点,获得2点护甲,摸三张牌,强制结束当前回合且立即进行一个额外的出牌阶段;你视为拥有技能〖追猎〗(锁定技,回合结束后,你摸一张牌并进行一个额外的回合)',
                        dclkuangguII: '狂骨',
                        dclkuangguII_info: '每当你造成1点伤害后,你可以摸一张牌,若如此做你可以弃一张手牌并回复1点体力',
                        dclkuanggu: '狂骨',
                        dclkuanggu_info: '每当你造成1点伤害后,你可以摸一张牌,若如此做你可以弃一张手牌并回复1点体力',
                        武煌: '武煌',
                        武煌_info: '你使用【杀】或【决斗】可以额外指定至多两名其他角色为目标,且目标角色需额外打出一张【闪】或【杀】',
                        武羲: '武羲',
                        武羲_info: '每当你使用【杀】造成伤害后,你可以获得该角色的一至两张牌.若你获得了该角色的两张牌,其摸一张牌;若两张均为基本牌,你将其置于弃牌堆并获得一张【决斗】;若两张均为装备牌,你失去一点体力',
                        天武: '天武',
                        天武_info: '每当你造成/受到伤害或失去体力后,你获得等量枚<武>印记;若你拥有此印记,摸牌阶段,你额外获得一张【杀】;你可以额外使用X张【杀】(X等于<武>印记数量)',
                        幻爆: '幻爆',
                        幻爆_info: '出牌阶段限一次,你可以移除六枚<武>印记,依次弃置其他所有角色装备区内的所有牌与四张手牌并对其造成一点伤害,你摸X张【杀】(X等于你已损失体力值)',
                        殉爆: '殉爆',
                        殉爆_info: '锁定技,当你死亡时,对场上所有其他角色造成1点火焰伤害',
                        旋转: '旋转',
                        旋转_info: '锁定技,回合结束后,你摸一张牌并进行一个额外的回合',
                        精锐: '闪袭',
                        精锐_info: '锁定技,回合结束后,你摸一张牌并进行一个额外的回合',
                        追猎: '追猎',
                        追猎_info: '锁定技,回合结束后,你摸一张牌并进行一个额外的回合',
                        皇祸: '皇祸',
                        皇祸_info: '每轮限一次,当你即将造成伤害,你摸两张牌,可弃置一张黑色手牌令伤害+1',
                        强击: '强击',
                        强击_info: '每当你即将造成伤害,你摸一张牌,可弃置一张黑色手牌令伤害+1',
                        飞弹: '飞弹',
                        飞弹_info: '每当你即将造成伤害,你摸一张牌,可弃置一张黑色手牌令伤害+1',
                        重击: '重击',
                        重击_info: '每当你即将造成伤害,可弃置一张黑色手牌令伤害+1',
                        反导: '反导',
                        反导_info: '每当你即将受到伤害,你摸一张牌,可弃置一张红色手牌令伤害-1',
                        精防: '精防',
                        精防_info: '每当你即将受到伤害,你摸一张牌,可弃置一张红色手牌令伤害-1',
                        神忌: '神忌',
                        神忌_info: '每轮限一次,当你即将受到伤害,你摸两张牌,可弃置一张红色手牌令伤害-1',
                        格挡: '格挡',
                        格挡_info: '每当你即将受到伤害,可弃置一张红色手牌令伤害-1',
                        强固: '强固',
                        强固_info: '锁定技,其他角色对你使用【杀】时需要弃置一张基本牌,否则此【杀】对你无效',
                        algyingzi: '英姿',
                        algyingzi_info: '锁定技,摸牌阶段摸牌时,你额外摸一张牌;你的手牌上限等于你的体力上限',
                        洗髓: '洗髓',
                        洗髓_info: '出牌阶段限两次,你可以弃置X张牌并回复X点体力,摸2X张牌',
                        无间: '无间',
                        无间_info: '锁定技,回合开始阶段,你解除横置状态,除你之外的所有角色进入横置状态;你视为拥有技能〖噬焰〗(每名角色的回合开始阶段,若你的手牌数不大于体力上限,你可以摸两张牌)',
                        同悲: '同悲',
                        同悲_info: '出牌阶段,你可以弃置所有手牌(至少八张)并获得等量护甲,对所有角色造成3点火焰伤害,失去技能〖魔眼〗、〖斩天〗、〖洗髓〗;你的下个回合开始将直接获得游戏胜利',
                        同悲II: '同悲',
                        同悲II_info: '你正在举行万古同悲仪式,下个回合开始将直接获得游戏胜利',
                        冲撞: '冲撞',
                        冲撞_info: '锁定技,你的【杀】无视距离和防具、无数量限制且不可闪避;你的【闪】和武器牌均视为杀;你区域内的♥️️牌和♥️️判定牌均视为♠️️',
                        炮台: '炮台',
                        炮台_info: '锁定技,你的【杀】无视距离和防具、无数量限制且不可闪避;你的【闪】和武器牌均视为杀',
                        轩辕: '轩辕',
                        轩辕_info: '锁定技,你视为拥有技能〖神忌〗(每轮限一次,当你即将受到伤害,你摸两张牌,可弃置一张红色手牌令伤害-1)和〖皇祸〗(每轮限一次,当你即将造成伤害,你摸两张牌,可弃置一张黑色手牌令伤害+1)',
                        无极: '无极',
                        无极_info: '锁定技,你视为拥有技能〖精防〗(每当你即将受到伤害,你摸一张牌,可弃置一张红色手牌令伤害-1)和〖强击〗(每当你即将造成伤害,你摸一张牌,可弃置一张黑色手牌令伤害+1)',
                        极意: '极意',
                        极意_info: '锁定技,你视为拥有技能〖格挡〗(每当你即将受到伤害,可弃置一张红色手牌令伤害-1)和〖重击〗(每当你即将造成伤害,可弃置一张黑色手牌令伤害+1)',
                        残暴: '残暴',
                        残暴_info: '锁定技,你视为拥有技能〖狂骨〗(每当你造成1点伤害后,你可以摸一张牌,若如此做你可以弃一张手牌并回复1点体力)和〖重击〗(每当你即将造成伤害,可弃置一张黑色手牌令伤害+1)',
                        平凡: '平凡',
                        平凡_info: '锁定技,摸牌阶段,你摸两张牌',
                        普通: '普通',
                        普通_info: '锁定技,你的手牌上限等于你的体力值',
                        伟大: '伟大',
                        伟大_info: '出牌阶段限一次,你可以令一名其他角色与你交换武将牌',
                        伟大II: '伟大',
                        伟大II_info: '出牌阶段限一次,你可以令一名其他角色与你交换武将牌',
                        juejII: '绝境',
                        juejII_info: '锁定技,摸牌阶段,你额外摸X张牌(X等于你已损失的体力值);你的手牌上限等于你的体力上限+2;当你进入或脱离濒死状态时,你摸一张牌',
                        忘忧: '忘忧',
                        忘忧_info: '每轮限一次,其他角色的判定阶段开始时,若其判定区里没有牌,你可以令其进行【乐不思蜀】判定',
                        拾忧: '拾忧',
                        拾忧_info: '一名角色于弃牌阶段弃置的牌进入弃牌堆前,你可以选择其中任意张花色各不相同的牌获得之',
                        巨兽II: '巨兽',
                        巨兽II_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合',
                        巨兽: '巨兽',
                        巨兽_info: '每轮限一次,其他角色的回合结束后,你可以进行一个额外的回合;锁定技,每名角色的准备阶段,你获得1点护甲;你区域内的♦️️牌和♦️️判定牌均视为♣️️;你视为拥有技能〖充能〗(回合开始阶段,你摸两张牌,若你没有手牌,则改为摸三张牌)、〖飞弹〗(每当你即将造成伤害,你摸一张牌,可弃置一张黑色手牌令伤害+1)和〖强袭〗(出牌阶段对每名其他角色限一次,你可以选择一项:1. 失去1点体力并对你攻击范围内的一名其他角色造成1点伤害;2. 弃置一张武器牌并对你攻击范围内的一名其他角色造成1点伤害;你与其他角色距离-1)',
                    },
                    skill: {
                        剑气: {
                            audio: '震荡',
                            group: ['剑气_1', '剑气II'],
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            filterCard: {
                                name: 'sha',
                            },
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target && player.inRange(target);
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 6 - get.value(card);
                            },
                            content() {
                                target.chooseToDiscard(cards.length, 'he', true);
                                target.damage(cards.length);
                                target.disableSkill('剑气', lib.character[target.name][3]);
                                target.addSkill('剑气_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('剑气_2');
                                            i.enableSkill('剑气');
                                            delete i.storage.剑气;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        链锯: {
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            group: ['链锯_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            filterCard: {
                                name: 'sha',
                            },
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target && player.inRange(target);
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 6 - get.value(card);
                            },
                            content() {
                                target.chooseToDiscard(cards.length, 'he', true);
                                target.damage(cards.length);
                                target.disableSkill('链锯', lib.character[target.name][3]);
                                target.addSkill('链锯_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('链锯_2');
                                            i.enableSkill('链锯');
                                            delete i.storage.链锯;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        破天III: {
                            group: ['破天III_sha', '魔眼II'],
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            audio: 'ext:神域/audio:true',
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                trigger.target.addTempSkill('破天III_mark');
                                ('step 1');
                                trigger.parent.directHit.add(trigger.target);
                            },
                            subSkill: {
                                sha: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return Infinity;
                                        },
                                    },
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && event.notLink();
                                    },
                                    forced: true,
                                    content() {
                                        trigger.num++;
                                    },
                                },
                                mark: {
                                    init(player, skill) {
                                        var skills = player.getSkills(true, false);
                                        for (var i = 0; i < skills.length; i++) {
                                            if (get.skills[i]) {
                                                skills.splice(i--, 1);
                                            }
                                        }
                                        player.disableSkill(skill, skills);
                                    },
                                    onremove(player, skill) {
                                        player.enableSkill(skill);
                                    },
                                    mark: true,
                                    marktext: '魔眼',
                                    intro: {
                                        content: '该角色所有技能已失效',
                                    },
                                },
                            },
                        },
                        破天: {
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            audio: 'ext:神域/audio:2',
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                trigger.target.addTempSkill('破天_mark');
                                ('step 1');
                                trigger.parent.directHit.add(trigger.target);
                            },
                            subSkill: {
                                mark: {
                                    init(player, skill) {
                                        var skills = player.getSkills(true, false);
                                        for (var i = 0; i < skills.length; i++) {
                                            if (get.skills[i]) {
                                                skills.splice(i--, 1);
                                            }
                                        }
                                        player.disableSkill(skill, skills);
                                    },
                                    onremove(player, skill) {
                                        player.enableSkill(skill);
                                    },
                                    mark: true,
                                    marktext: '破天',
                                    intro: {
                                        content: '该角色所有技能已失效',
                                    },
                                },
                            },
                        },
                        破天II: {
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            audio: 'ext:神域/audio:1',
                            check(event, player) {
                                return get.attitude(player, event.target) <= 0;
                            },
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            logTarget: 'target',
                            content() {
                                'step 0';
                                trigger.target.addTempSkill('破天II_mark');
                                ('step 1');
                                trigger.parent.directHit.add(trigger.target);
                            },
                            subSkill: {
                                mark: {
                                    init(player, skill) {
                                        var skills = player.getSkills(true, false);
                                        for (var i = 0; i < skills.length; i++) {
                                            if (get.skills[i]) {
                                                skills.splice(i--, 1);
                                            }
                                        }
                                        player.disableSkill(skill, skills);
                                    },
                                    onremove(player, skill) {
                                        player.enableSkill(skill);
                                    },
                                    mark: true,
                                    marktext: '破天',
                                    intro: {
                                        content: '该角色所有技能已失效',
                                    },
                                },
                            },
                        },
                        龙躯: {
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                            group: '龙躯_longqu',
                            subSkill: {
                                longqu: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        var num = trigger.player.countDisabled();
                                        if (num > 0) {
                                            for (var i = 1; i < 6; i++) {
                                                if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        北溟: {
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                            group: '北溟_beiming',
                            subSkill: {
                                beiming: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        var num = trigger.player.countDisabled();
                                        if (num > 0) {
                                            for (var i = 1; i < 6; i++) {
                                                if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        龙翼: {
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                            group: '龙翼_longyi',
                            subSkill: {
                                longyi: {
                                    trigger: {
                                        player: 'phaseZhunbeiBegin',
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        var num = trigger.player.countDisabled();
                                        if (num > 0) {
                                            for (var i = 1; i < 6; i++) {
                                                if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                            }
                                        }
                                    },
                                },
                            },
                        },
                        投影: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            audio: 'ext:神域/audio:2',
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.countCards('he') == 0) return false;
                                if (!player.hasSkill('旋风')) return true;
                                if (!player.hasSkill('地震')) return true;
                                if (!player.hasSkill('龙啸')) return true;
                                if (!player.hasSkill('龙殛')) return true;
                                return false;
                            },
                            filterCard: true,
                            position: 'he',
                            check(card) {
                                if (get.position(card) == 'e' && _status.event.player.hasSkill('旋风')) return 16 - get.value(card);
                                return 7 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var list = [];
                                if (!player.hasSkill('旋风')) list.push('旋风');
                                if (!player.hasSkill('地震')) list.push('地震');
                                if (!player.hasSkill('龙啸')) list.push('龙啸');
                                if (!player.hasSkill('龙殛')) list.push('龙殛');
                                if (list.length == 1) {
                                    player.addTempSkill(list[0]);
                                    event.finish();
                                } else {
                                    player
                                        .chooseControl(list, function () {
                                            if (list.includes('旋风') && player.countCards('he', { type: 'equip' })) return '旋风';
                                            if (!player.getStat().skill.地震) {
                                                if (player.hasSkill('地震') && player.getEquip(1) && list.includes('旋风')) return '旋风';
                                                if (list.includes('龙殛') || list.includes('地震')) {
                                                    var players = game.filterPlayer();
                                                    for (var i of players) {
                                                        if (i.hp == 1 && get.attitude(player, i) < 0) {
                                                            if (list.includes('龙殛')) return '龙殛';
                                                            if (list.includes('地震')) return '地震';
                                                        }
                                                    }
                                                }
                                            }
                                            if (list.includes('地震')) return '地震';
                                            if (list.includes('龙殛')) return '龙殛';
                                            if (list.includes('旋风')) return '旋风';
                                            return '龙啸';
                                        })
                                        .set('prompt', '选择获得一项技能直到回合结束');
                                }
                                ('step 1');
                                player.addTempSkill(result.control);
                                player.popup(get.translation(result.control));
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    if (player.countCards('e', { type: 'equip' })) return 10;
                                    if (!player.getStat().skill.地震) {
                                        if (player.hasSkill('地震') && player.getEquip(1) && !player.hasSkill('旋风')) return 10;
                                        if (player.hasSkill('龙殛')) return 1;
                                        var players = game.filterPlayer();
                                        for (var i of players) {
                                            if (i.hp == 1 && get.attitude(player, i) < 0) return 10;
                                        }
                                    }
                                    return 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('e', { type: 'equip' })) return 1;
                                        if (!player.getStat().skill.地震) {
                                            if (player.hasSkill('地震') && player.getEquip(1) && !player.hasSkill('旋风')) return 1;
                                            if (!player.hasSkill('龙殛') || !player.hasSkill('地震')) {
                                                var players = game.filterPlayer();
                                                for (var i of players) {
                                                    if (i.hp == 1 && get.attitude(player, i) < 0) return 1;
                                                }
                                            }
                                        }
                                        return 1;
                                    },
                                },
                            },
                        },
                        龙魂: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            group: ['龙魂_sha', '龙魂_shan', '龙魂_tao', '龙魂_wuxie', '龙魂_num', '龙魂_discard', '龙魂II'],
                            ai: {
                                skillTagFilter(player, tag) {
                                    switch (tag) {
                                        case 'respondSha': {
                                            if (player.countCards('he', { suit: 'diamond' }) == 0) return false;
                                            break;
                                        }
                                        case 'respondShan': {
                                            if (player.countCards('he', { suit: 'club' }) == 0) return false;
                                            break;
                                        }
                                        case 'save': {
                                            if (player.countCards('he', { suit: 'heart' }) == 0) return false;
                                            break;
                                        }
                                    }
                                },
                                save: true,
                                respondSha: true,
                                respondShan: true,
                                threaten: 1.8,
                            },
                            subSkill: {
                                num: {
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    forced: true,
                                    popup: false,
                                    filter(event, player) {
                                        var evt = event;
                                        return (evt.skill == '龙魂_sha' || evt.skill == '龙魂_tao' || (['sha', 'tao'].includes(evt.card.name) && evt.skill == '龙魂')) && evt.cards && evt.cards.length == 2;
                                    },
                                    content() {
                                        trigger.baseDamage++;
                                    },
                                },
                                discard: {
                                    trigger: {
                                        player: ['useCardAfter', 'respondAfter'],
                                    },
                                    forced: true,
                                    popup: false,
                                    logTarget() {
                                        return _status.currentPhase;
                                    },
                                    autodelay(event) {
                                        return event.name == 'respond' ? 0.5 : false;
                                    },
                                    filter(evt, player) {
                                        return (evt.skill == '龙魂_shan' || evt.skill == '龙魂_wuxie' || (['shan', 'wuxie'].includes(evt.card.name) && evt.skill == '龙魂')) && evt.cards && evt.cards.length == 2 && _status.currentPhase && _status.currentPhase != player && _status.currentPhase.countDiscardableCards(player, 'he');
                                    },
                                    content() {
                                        player.line(_status.currentPhase, 'green');
                                        player.discardPlayerCard(_status.currentPhase, 'he', true);
                                    },
                                },
                            },
                        },
                        龙魂_tao: {
                            audio: 'ext:神域/audio:2',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♥️️牌当【桃】使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'tao',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'heart' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            ai: {
                                basic: {
                                    order(card, player) {
                                        if (player.hasSkillTag('pretao')) return 5;
                                        return 2;
                                    },
                                    useful: [8, 6.5, 5, 4],
                                    value: [8, 6.5, 5, 4],
                                },
                                result: {
                                    target: 2,
                                    target_use(player, target) {
                                        if (player.hasSkillTag('nokeep', true, null, true)) return 2;
                                        var nd = player.needsToDiscard();
                                        var keep = false;
                                        if (nd <= 0) {
                                            keep = true;
                                        } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                            keep = true;
                                        }
                                        var mode = get.mode();
                                        if (target.hp >= 2 && keep && target.hasFriend()) {
                                            if (target.hp > 2 || nd == 0) return 0;
                                            if (target.hp == 2) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        if (target != current && get.attitude(target, current) >= 3) {
                                                            if (current.hp <= 1) return true;
                                                            if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                        }
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                        if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                        var att = get.attitude(player, target);
                                        if (att < 3 && att >= 0 && player != target) return 0;
                                        var tri = _status.event.getTrigger();
                                        if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                                var num = game.countPlayer(function (current) {
                                                    if (current.identity == 'fan') {
                                                        return current.countCards('h', 'tao');
                                                    }
                                                });
                                                if (num > 1 && player == target) return 2;
                                                return 0;
                                            }
                                        }
                                        if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                                return 0;
                                            }
                                        }
                                        if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                            return 0;
                                        }
                                        return 2;
                                    },
                                },
                                tag: {
                                    recover: 1,
                                    save: 1,
                                },
                            },
                        },
                        龙魂_sha: {
                            audio: 'ext:神域/audio:2',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♦️️牌当火【杀】使用或打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'sha',
                                nature: 'fire',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'diamond' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'diamond';
                            },
                            ai: {
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) return player.getCardUsable('sha') > 1 ? 3 : 3.1;
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        if (!isLink && player.hasSkill('jiu')) {
                                            if (
                                                !target.hasSkillTag('filterDamage', null, {
                                                    player: player,
                                                    card: card,
                                                    jiu: true,
                                                })
                                            ) {
                                                if (get.attitude(player, target) > 0) {
                                                    return -7;
                                                } else {
                                                    return -4;
                                                }
                                            }
                                            return -0.5;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                            },
                        },
                        龙魂_wuxie: {
                            audio: 'ext:神域/audio:2',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♠️️牌当【无懈可击】使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 7 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'wuxie',
                            },
                            viewAsFilter(player) {
                                return player.countCards('he', { suit: 'spade' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4],
                                    value: [6, 4],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        龙魂_shan: {
                            audio: 'ext:神域/audio:2',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♣️️牌当【闪】使用或打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'shan',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'club' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'club';
                            },
                            ai: {
                                order: 3,
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        臂刃: {
                            group: ['臂刃_1'],
                            audio: '践踏',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('臂刃', lib.character[target.name][3]);
                                target.addSkill('臂刃_2');
                                target.damage();
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('臂刃_2');
                                            i.enableSkill('臂刃');
                                            delete i.storage.臂刃;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        快攻: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 1;
                                },
                            },
                            audio: '龙卷',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && player.inRange(target);
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.damage();
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        龙心: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            group: ['龙心_1', '龙心_2', '龙心_3', '龙心_4', '龙心_5'],
                            audio: 'ext:神域/audio:2',
                            subSkill: {
                                1: {
                                    audio: '龙心',
                                    trigger: {
                                        player: 'phaseDrawBefore',
                                    },
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                    },
                                    ai: {
                                        noh: true,
                                    },
                                },
                                2: {
                                    trigger: {
                                        player: 'loseEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') < 4;
                                    },
                                    content() {
                                        player.draw(4 - player.countCards('h'));
                                    },
                                },
                                3: {
                                    trigger: {
                                        player: 'gainEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') > 4;
                                    },
                                    content() {
                                        player.chooseToDiscard(player.countCards('h') - 4, true);
                                    },
                                },
                                4: {
                                    trigger: {
                                        player: ['damageBegin', 'loseMaxHpBegin'],
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        trigger.cancel();
                                        player.loseHp();
                                    },
                                    mod: {
                                        maxHandcard(player, num) {
                                            return num - player.hp;
                                        },
                                    },
                                },
                                5: {
                                    trigger: {
                                        player: 'phaseUseBegin',
                                    },
                                    forced: true,
                                    content() {
                                        player.gainMaxHp();
                                        var num = trigger.player.countDisabled();
                                        if (num > 0) {
                                            for (var i = 1; i < 6; i++) {
                                                if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                            }
                                        }
                                        if (player.countCards('h') == 0) {
                                            player.draw(4);
                                        }
                                        ui.background.setBackgroundImage('extension/神域/image/虚空巨龙.jpg');
                                        player.say('∑∞≡Ω');
                                        var path = 'extension/神域/audio/bg_dragon.mp3';
                                        ui.backgroundMusic.src = path;
                                        ui.backgroundMusic.addEventListener('ended', function () {
                                            ui.backgroundMusic.src = path;
                                        });
                                    },
                                },
                            },
                        },
                        降临: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            audio: 'ext:神域/audio:2',
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            _priority: 10,
                            logTarget: 'player',
                            filter(event, player) {
                                if (event.parent.name == '降临') return false;
                                return event.player != player;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            content() {
                                const evt = _status.event.getParent('phase');
                                if (evt && evt.name) {
                                    evt.finish();
                                }
                                player.phaseUse();
                            },
                        },
                        沉眠II: {
                            trigger: {
                                global: 'phaseBegin',
                            },
                            audio: 'ext:神域/audio:1',
                            round: 1,
                            _priority: 10,
                            logTarget: 'player',
                            filter(event, player) {
                                if (event.parent.name == '沉眠II') return false;
                                return event.player != player;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            content() {
                                const evt = _status.event.getParent('phase');
                                if (evt && evt.name) {
                                    evt.finish();
                                }
                            },
                        },
                        dclqiangxi: {
                            subSkill: {
                                off: {},
                            },
                            audio: 'ext:神域/audio:2',
                            enable: 'phaseUse',
                            filterCard(card) {
                                return get.subtype(card) == 'equip1';
                            },
                            selectCard() {
                                return [0, 1];
                            },
                            filterTarget(card, player, target) {
                                if (player == target) return false;
                                if (target.hasSkill('dclqiangxi_off')) return false;
                                return player.inRange(target);
                            },
                            content() {
                                'step 0';
                                if (cards.length == 0) {
                                    player.loseHp();
                                }
                                ('step 1');
                                target.addTempSkill('dclqiangxi_off');
                                target.damage('nocard');
                            },
                            check(card) {
                                return 10 - get.value(card);
                            },
                            position: 'he',
                            ai: {
                                order: 8.5,
                                result: {
                                    target(player, target) {
                                        if (!ui.selected.cards.length) {
                                            if (player.hp < 2) return 0;
                                            if (target.hp >= player.hp) return 0;
                                        }
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                            threaten: 1.5,
                        },
                        dclxuanfeng: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                player: ['loseAfter'],
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                const evt = event.getl(player);
                                return evt && (evt.es.length || evt.cards2.length > 1);
                            },
                            content() {
                                'step 0';
                                event.count = 2;
                                event.targets = [];
                                ('step 1');
                                event.count--;
                                player
                                    .chooseTarget(get.prompt('dclxuanfeng'), '弃置一名其他角色的一张牌', function (card, player, target) {
                                        if (player == target) return false;
                                        return target.countDiscardableCards(player, 'he');
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(_status.event.player, target);
                                    });
                                ('step 2');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'green');
                                    targets.add(result.targets[0]);
                                    player.discardPlayerCard(result.targets[0], 'he', true);
                                } else if (!targets.length) event.finish();
                                ('step 3');
                                if (event.count) event.goto(1);
                                else if (player == _status.currentPhase) {
                                    player
                                        .chooseTarget('是否对一名目标角色造成1点伤害', function (card, player, target) {
                                            return _status.event.targets.includes(target);
                                        })
                                        .set('targets', targets)
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.damageEffect(target, player, player);
                                        });
                                } else event.finish();
                                ('step 4');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'thunder');
                                    result.targets[0].damage();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                    },
                                },
                                reverseEquip: true,
                                noe: true,
                                expose: 0.2,
                            },
                        },
                        旋风: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: ['loseAfter'],
                                global: ['equipAfter', 'addJudgeAfter', 'gainAfter', 'loseAsyncAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                const evt = event.getl(player);
                                return evt && (evt.es.length || evt.cards2.length > 1);
                            },
                            content() {
                                'step 0';
                                event.count = 2;
                                event.targets = [];
                                ('step 1');
                                event.count--;
                                player
                                    .chooseTarget(get.prompt('旋风'), '弃置一名其他角色的一张牌', function (card, player, target) {
                                        if (player == target) return false;
                                        return target.countDiscardableCards(player, 'he');
                                    })
                                    .set('ai', function (target) {
                                        return -get.attitude(_status.event.player, target);
                                    });
                                ('step 2');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'green');
                                    targets.add(result.targets[0]);
                                    player.discardPlayerCard(result.targets[0], 'he', true);
                                } else if (!targets.length) event.finish();
                                ('step 3');
                                if (event.count) event.goto(1);
                                else if (player == _status.currentPhase) {
                                    player
                                        .chooseTarget('是否对一名目标角色造成1点伤害', function (card, player, target) {
                                            return _status.event.targets.includes(target);
                                        })
                                        .set('targets', targets)
                                        .set('ai', function (target) {
                                            var player = _status.event.player;
                                            return get.damageEffect(target, player, player);
                                        });
                                } else event.finish();
                                ('step 4');
                                if (result.targets?.length) {
                                    player.line(result.targets[0], 'thunder');
                                    result.targets[0].damage();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                    },
                                },
                                reverseEquip: true,
                                noe: true,
                                expose: 0.2,
                            },
                        },
                        强袭: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                            subSkill: {
                                off: {},
                            },
                            audio: '无间',
                            enable: 'phaseUse',
                            filterCard(card) {
                                return get.subtype(card) == 'equip1';
                            },
                            selectCard() {
                                return [0, 1];
                            },
                            filterTarget(card, player, target) {
                                if (player == target) return false;
                                if (target.hasSkill('强袭_off')) return false;
                                return player.inRange(target);
                            },
                            content() {
                                'step 0';
                                if (cards.length == 0) {
                                    player.loseHp();
                                }
                                ('step 1');
                                target.addTempSkill('强袭_off');
                                target.damage('nocard');
                            },
                            check(card) {
                                return 10 - get.value(card);
                            },
                            position: 'he',
                            ai: {
                                order: 8.5,
                                result: {
                                    target(player, target) {
                                        if (!ui.selected.cards.length) {
                                            if (player.hp < 2) return 0;
                                            if (target.hp >= player.hp) return 0;
                                        }
                                        return get.damageEffect(target, player);
                                    },
                                },
                            },
                            threaten: 1.5,
                        },
                        龙殛: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            filterCard: true,
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 100 - get.value(card);
                            },
                            content() {
                                if (cards.length >= 2) {
                                    target.turnOver(true);
                                    target.damage('fire', cards.length * cards.length);
                                } else {
                                    target.damage('fire', cards.length);
                                }
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        龙啸: {
                            mod: {
                                targetInRange(card, player, target) {
                                    return true;
                                },
                                cardUsableTarget(card, player, target) {
                                    return true;
                                },
                            },
                            audio: 'ext:神域/audio:true',
                            group: ['龙啸_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('龙啸', lib.character[target.name][3]);
                                target.addSkill('龙啸_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('龙啸_2');
                                            i.enableSkill('龙啸');
                                            delete i.storage.龙啸;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 20,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        longxiao1: {
                            onremove(player) {
                                player.storage.longxiao1.removeSkill('longxiao2');
                                player.storage.longxiao1.unmarkSkill('longxiao1');
                                delete player.storage.longxiao1;
                            },
                            mod: {
                                targetInRange(card, player, target) {
                                    if (target.hasSkill('longxiao2')) {
                                        return true;
                                    }
                                },
                                cardUsableTarget(card, player, target) {
                                    if (target.hasSkill('longxiao2')) return true;
                                },
                            },
                        },
                        longxiao2: {
                            mod: {
                                cardEnabled2(card, player) {
                                    if (get.position(card) == 'h') return false;
                                },
                            },
                            ai: {
                                effect: {
                                    target(card, player, target) {
                                        if (get.tag(card, 'damage')) return [0, -99999];
                                    },
                                },
                            },
                        },
                        龙怒: {
                            group: ['龙怒_1', '龙怒II'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('h') >= 1;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.chooseToDiscard(player.countCards('h'), true);
                                player.recover(player.countCards('h'));
                                target.discard(target.getCards('he'));
                                target.damage('fire', player.countCards('h'));
                                target.disableSkill('龙怒', lib.character[target.name][3]);
                                target.addSkill('龙怒_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('龙怒_2');
                                            i.enableSkill('龙怒');
                                            delete i.storage.龙怒;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        龙卷: {
                            group: ['龙卷_1'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && get.distance(player, target) <= 1;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('龙卷', lib.character[target.name][3]);
                                target.addSkill('龙卷_2');
                                target.damage();
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('龙卷_2');
                                            i.enableSkill('龙卷');
                                            delete i.storage.龙卷;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        焚化: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 1;
                                },
                            },
                            group: ['焚化_1'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && player.inRange(target);
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.damage('fire', 1);
                                target.disableSkill('焚化', lib.character[target.name][3]);
                                target.addSkill('焚化_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('焚化_2');
                                            i.enableSkill('焚化');
                                            delete i.storage.焚化;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        tqfensui: {
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            filterCard: true,
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target && get.distance(player, target) <= 1;
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 6 - get.value(card);
                            },
                            content() {
                                target.chooseToDiscard(cards.length, 'he', true);
                                target.damage(cards.length);
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        无色: {
                            group: ['无色_1'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('e') >= 1;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.discard(player.getCards('e'));
                                target.discard(target.getCards('he'));
                                target.damage(1);
                                target.disableSkill('无色', lib.character[target.name][3]);
                                target.addSkill('无色_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('无色_2');
                                            i.enableSkill('无色');
                                            delete i.storage.无色;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        光耀: {
                            group: ['光耀_1'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('e') >= 1;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.discard(player.getCards('e'));
                                target.discard(target.getCards('he'));
                                target.damage('fire', 1);
                                target.disableSkill('光耀', lib.character[target.name][3]);
                                target.addSkill('光耀_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('光耀_2');
                                            i.enableSkill('光耀');
                                            delete i.storage.光耀;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        震荡: {
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            group: ['震荡_1'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.countCards('e') >= 1;
                            },
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.discard(player.getCards('e'));
                                target.discard(target.getCards('he'));
                                target.damage('thunder', 1);
                                target.disableSkill('震荡', lib.character[target.name][3]);
                                target.addSkill('震荡_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('震荡_2');
                                            i.enableSkill('震荡');
                                            delete i.storage.震荡;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        龙息: {
                            audio: 'ext:神域/audio:true',
                            group: ['龙息_1'],
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            filter(event, player) {
                                return player.countDisabled() < 1 && player.countCards('h') >= 1;
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('龙息'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.chooseToDiscard(player.countCards('h'), true);
                                    ('step 2');
                                    player.disableEquip('equip1');
                                    player.disableEquip('equip2');
                                    player.disableEquip('equip3');
                                    player.disableEquip('equip4');
                                    player.disableEquip('equip5');
                                    result.targets[0].disableSkill('龙息', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('龙息_2');
                                    result.targets[0].damage('fire', player.countCards('h'));
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('龙息_2');
                                            i.enableSkill('龙息');
                                            delete i.storage.龙息;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        diedragon: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        diedragonII: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        diemech: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        diedragonIII: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        diedragonIV: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        dierobot: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        dieghost: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        dieghostII: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            content() { },
                        },
                        autherqq: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('autherqq'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].turnOver(true);
                                    result.targets[0].damage('fire', 2292797375);
                                }
                            },
                        },
                        焚云: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            filterCard: true,
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 6 - get.value(card);
                            },
                            content() {
                                target.turnOver(true);
                                target.damage('fire', cards.length);
                            },
                            ai: {
                                order: 10,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        扫射: {
                            group: ['扫射II'],
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            position: 'he',
                            filter(event, player) {
                                return player.countCards('h', 'sha') > 0;
                            },
                            filterCard: {
                                name: 'sha',
                            },
                            selectCard() {
                                if (ui.selected.targets.length) return [1, ui.selected.targets[0].countCards('he')];
                                return [1, Infinity];
                            },
                            filterTarget(event, player, target) {
                                return player != target;
                            },
                            check(card) {
                                if (
                                    !game.hasPlayer(function (current) {
                                        return current != _status.event.player && get.attitude(_status.event.player, current) < 0;
                                    })
                                )
                                    return 0;
                                return 6 - get.value(card);
                            },
                            content() {
                                target.chooseToDiscard(cards.length, 'he', true);
                                target.damage(cards.length);
                            },
                            ai: {
                                order: 16,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        钢骨: {
                            trigger: {
                                player: ['loseHpBegin', 'loseMaxHpBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.damage();
                            },
                            group: ['钢骨_ganggu', '钢骨_hujia', '钢骨II'],
                            subSkill: {
                                ganggu: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                },
                                hujia: {
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    filter(event, player) {
                                        return event.hujia == event.num;
                                    },
                                    forced: true,
                                    content() {
                                        player.draw();
                                    },
                                },
                            },
                        },
                        血鬼: {
                            audio: '禁闭',
                            group: ['血鬼_1', '血鬼II', '血鬼III'],
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('血鬼'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('血鬼', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('血鬼_2');
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('血鬼_2');
                                            i.enableSkill('血鬼');
                                            delete i.storage.血鬼;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        血鬼II: {
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        血鬼III: {
                            trigger: {
                                player: ['loseHpBegin', 'loseMaxHpBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.damage();
                            },
                        },
                        装甲II: {
                            trigger: {
                                player: ['loseHpBegin', 'loseMaxHpBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.damage();
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                        },
                        血盾III: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                        },
                        焰甲II: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                        },
                        机甲II: {
                            trigger: {
                                player: ['loseHpBegin', 'loseMaxHpBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.damage();
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                        },
                        重甲II: {
                            trigger: {
                                player: ['loseHpBegin', 'loseMaxHpBegin'],
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                trigger.cancel();
                                player.damage();
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                            },
                        },
                        钢骨II: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return !player.hujia;
                            },
                            content() {
                                player.changeHujia();
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hujia) {
                                        return 0.5;
                                    } else {
                                        return 2;
                                    }
                                },
                            },
                        },
                        魔甲: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return !player.hujia;
                            },
                            content() {
                                player.changeHujia();
                                var path = 'extension/神域/audio/bg_sanying_before.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hujia) {
                                        return 0.5;
                                    } else {
                                        return 2;
                                    }
                                },
                            },
                        },
                        鏖战: {
                            forced: true,
                            charlotte: true,
                            group: ['鏖战_wuqi', '鏖战_fangju', '鏖战_zuoji', '鏖战_baowu'],
                            subSkill: {
                                wuqi: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (player.getEquip(1) && card.name == 'sha') return num + 1;
                                        },
                                    },
                                    sourceSkill: '鏖战',
                                },
                                fangju: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.getEquip(2) && event.num > 1;
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                    sourceSkill: '鏖战',
                                },
                                zuoji: {
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.getEquip(3) || player.getEquip(4);
                                    },
                                    content() {
                                        trigger.num++;
                                    },
                                    sourceSkill: '鏖战',
                                },
                                baowu: {
                                    trigger: {
                                        player: 'phaseJudgeBefore',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.getEquip(5);
                                    },
                                    content() {
                                        trigger.cancel();
                                        game.log(player, '跳过了判定阶段');
                                    },
                                    sourceSkill: '鏖战',
                                },
                            },
                        },
                        em_shenqvII: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.countCards('h') <= player.maxHp;
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                            },
                        },
                        酸血: {
                            audio: '尸毒',
                            trigger: {
                                player: ['damageAfter'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                if (trigger.source.hasEnabledSlot(1)) {
                                    trigger.source.disableEquip('equip1');
                                    trigger.source.loseHp();
                                } else {
                                    trigger.source.loseHp(2);
                                }
                            },
                        },
                        鬼炎: {
                            audio: '神力II',
                            trigger: {
                                player: ['damageBegin'],
                            },
                            forced: true,
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.damage();
                                trigger.source.damage('fire', 1);
                                trigger.cancel();
                            },
                        },
                        打虎: {
                            audio: 'dclxuanfeng',
                            trigger: {
                                player: ['damageBegin'],
                            },
                            forced: true,
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.turnOver(true);
                                trigger.source.damage();
                                trigger.cancel();
                            },
                        },
                        em_shenqv: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            filter(event, player) {
                                return player.countCards('h') <= player.maxHp;
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                            },
                        },
                        光箭: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                player.chooseUseTarget('###是否发动【光箭】？###视为使用一张没有距离限制的【杀】', { name: 'sha' }, false, 'nodistance');
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        神力II: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.chooseUseTarget('###是否发动【神力】？###视为使用一张没有距离限制的【杀】', { name: 'sha' }, false, 'nodistance');
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        神力: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.chooseUseTarget('###是否发动【神力】？###视为使用一张没有距离限制的【杀】', { name: 'sha' }, false, 'nodistance');
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        极道II: {
                            audio: '神力',
                            round: 1,
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.chooseUseTarget('###是否发动【极道】？###视为使用一张没有距离限制的【杀】', { name: 'sha' }, false, 'nodistance');
                            },
                            ai: {
                                threaten(player, target) {
                                    return 1.6;
                                },
                            },
                        },
                        机械: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.hujia;
                                },
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        焰甲III: {
                            audio: 'ext:神域/audio:1',
                            trigger: { player: 'damageEnd' },
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.damage().nature = ['fire'].randomGet();
                                player.changeHujia();
                            },
                        },
                        血盾II: {
                            audio: 'ext:神域/audio:1',
                            trigger: { player: 'damageEnd' },
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.damage();
                                player.changeHujia();
                            },
                        },
                        刺甲II: {
                            audio: 'ext:神域/audio:1',
                            trigger: { player: 'damageEnd' },
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.damage();
                                player.changeHujia();
                            },
                        },
                        火盾: {
                            group: ['火盾II'],
                            audio: 'ext:神域/audio:1',
                            trigger: { player: 'damageEnd' },
                            round: 1,
                            filter(event, player) {
                                return event.source != undefined;
                            },
                            logTarget: 'source',
                            content() {
                                trigger.source.damage().nature = ['fire'].randomGet();
                                player.changeHujia();
                            },
                        },
                        重甲: {
                            group: ['重甲II', '重甲_ganggu', '重甲_gangguII'],
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            subSkill: {
                                ganggu: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 2;
                                    },
                                    content() {
                                        trigger.num = 2;
                                    },
                                },
                                gangguII: {
                                    audio: 'ext:神域/audio:1',
                                    trigger: {
                                        player: 'damageEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 0;
                                    },
                                    content() {
                                        player.changeHujia();
                                    },
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        骨甲: {
                            group: ['骨甲_ganggu'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            subSkill: {
                                ganggu: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        机甲: {
                            group: ['机甲II', '机甲_ganggu'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            subSkill: {
                                ganggu: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        圣躯: {
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                                globalTo(from, to, distance) {
                                    return distance + 2;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 2;
                                },
                            },
                        },
                        血盾: {
                            group: ['血盾II', '血盾III'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        刺甲: {
                            group: ['刺甲II'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        焰甲: {
                            group: ['焰甲III'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        装甲: {
                            group: ['装甲II'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay' && player != target) {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        邪骨: {
                            group: ['绝弑'],
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay') {
                                        return false;
                                    }
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 2;
                                },
                                maxHandcard(player, num) {
                                    return num + player.maxHp;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        魔躯: {
                            group: ['不朽', '不朽II'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                                maxHandcard(player, num) {
                                    return num + player.hp;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        王座: {
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        仙体: {
                            group: ['不朽', '不朽II'],
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        忘忧: {
                            audio: 'ext:神域/audio:1',
                            round: 1,
                            trigger: { global: 'phaseJudgeBegin' },
                            filter(event, player) {
                                return event.player != player && !event.player.countCards('j');
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0 && !event.player.skipList.includes('phaseUse');
                            },
                            content() {
                                trigger.player.executeDelayCardEffect('lebu');
                            },
                        },
                        拾忧: {
                            forced: true,
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'loseAfter',
                            },
                            filter(event, player) {
                                var evt = event.getParent(3);
                                return event.type == 'discard' && evt.name == 'phaseDiscard' && evt.player == event.player && event.cards2 && event.cards2.filterInD('d').length;
                            },
                            content() {
                                'step 0';
                                event.cards = trigger.cards2.filterInD('d');
                                ('step 1');
                                var next = player
                                    .chooseCardButton(get.prompt('拾忧'), event.cards, [1, event.cards.length])
                                    .set('ai', function (button) {
                                        return get.value(button.link, player);
                                    })
                                    .set('filterButton', function (button) {
                                        for (var i = 0; i < ui.selected.buttons.length; i++) {
                                            if (ui.selected.buttons[i].link.suit == button.link.suit) return false;
                                        }
                                        return true;
                                    });
                                ('step 2');
                                if (result.links?.length) {
                                    player.gain(result.links, 'gain2', 'log');
                                }
                            },
                        },
                        积腐: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            selectCard: 2,
                            position: 'he',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('he') >= 2;
                            },
                            content() {
                                player.changeHujia(2);
                                player.addTempSkill('强固', { player: 'phaseBegin' });
                            },
                            ai: {
                                result: {
                                    player: 1,
                                },
                                order: 2.5,
                            },
                        },
                        维修: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            selectCard: 2,
                            position: 'he',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('he') >= 2;
                            },
                            content() {
                                player.changeHujia(2);
                                player.addTempSkill('强固', { player: 'phaseBegin' });
                            },
                            ai: {
                                result: {
                                    player: 1,
                                },
                                order: 2.5,
                            },
                        },
                        神域: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            group: ['神域_shenyu', '神域_shenyuII'],
                            subSkill: {
                                shenyuII: {
                                    trigger: {
                                        player: ['damageBegin', 'loseMaxHpBegin'],
                                    },
                                    forced: true,
                                    _priority: 10,
                                    content() {
                                        trigger.cancel();
                                        player.loseHp();
                                    },
                                },
                                shenyu: {
                                    equipSkill: true,
                                    trigger: {
                                        target: ['useCardToBefore'],
                                    },
                                    forced: true,
                                    _priority: 6,
                                    audio: true,
                                    filter(event, player) {
                                        if (event.card.name == 'nanman') return true;
                                        if (event.card.name == 'wanjian') return true;
                                        return event.card && event.card.name == 'sha' && !get.nature(event.card);
                                    },
                                    content() {
                                        trigger.cancel();
                                    },
                                    ai: {
                                        effect: {
                                            target(card, player, target, current) {
                                                if (card.name == 'nanman' || card.name == 'wanjian') return 'zerotarget';
                                                if (card.name == 'sha') {
                                                    var equip1 = player.getEquip(1);
                                                    if (equip1 && equip1.name == 'zhuque') return 1.9;
                                                    if (!card.nature) return 'zerotarget';
                                                }
                                            },
                                        },
                                    },
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        雷鸣: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('雷鸣'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('thunder', 3);
                                }
                            },
                        },
                        幽冥: {
                            group: ['幽冥_turn'],
                            subSkill: {
                                turn: {
                                    trigger: {
                                        player: 'turnOverBefore',
                                    },
                                    _priority: 20,
                                    forced: true,
                                    filter(event, player) {
                                        return !player.isTurnedOver();
                                    },
                                    content() {
                                        trigger.cancel();
                                        game.log(player, '取消了翻面');
                                    },
                                },
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - Infinity;
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        gdjuejing: {
                            group: ['gdjuejing_1', 'gdjuejing_2', 'gdjuejing_3'],
                            audio: 'ext:神域/audio:true',
                            subSkill: {
                                1: {
                                    audio: 'gdjuejing',
                                    trigger: {
                                        player: 'phaseDrawBefore',
                                    },
                                    forced: true,
                                    content() {
                                        trigger.cancel();
                                    },
                                    ai: {
                                        noh: true,
                                    },
                                },
                                2: {
                                    trigger: {
                                        player: 'loseEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') < 4;
                                    },
                                    content() {
                                        player.draw(4 - player.countCards('h'));
                                    },
                                },
                                3: {
                                    trigger: {
                                        player: 'gainEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.countCards('h') > 4;
                                    },
                                    content() {
                                        player.chooseToDiscard(player.countCards('h') - 4, true);
                                    },
                                },
                            },
                        },
                        gdlonghun: {
                            group: ['gdlonghun_sha', 'gdlonghun_shan', 'gdlonghun_tao', 'gdlonghun_wuxie', 'gdlonghun_num', 'gdlonghun_discard'],
                            ai: {
                                skillTagFilter(player, tag) {
                                    switch (tag) {
                                        case 'respondSha': {
                                            if (player.countCards('he', { suit: 'diamond' }) == 0) return false;
                                            break;
                                        }
                                        case 'respondShan': {
                                            if (player.countCards('he', { suit: 'club' }) == 0) return false;
                                            break;
                                        }
                                        case 'save': {
                                            if (player.countCards('he', { suit: 'heart' }) == 0) return false;
                                            break;
                                        }
                                    }
                                },
                                save: true,
                                respondSha: true,
                                respondShan: true,
                                threaten: 1.8,
                            },
                            subSkill: {
                                num: {
                                    trigger: {
                                        player: 'useCard',
                                    },
                                    forced: true,
                                    popup: false,
                                    filter(event, player) {
                                        var evt = event;
                                        return (evt.skill == 'gdlonghun_sha' || evt.skill == 'gdlonghun_tao' || (['sha', 'tao'].includes(evt.card.name) && evt.skill == 'gdlonghun')) && evt.cards && evt.cards.length == 2;
                                    },
                                    content() {
                                        trigger.baseDamage++;
                                    },
                                },
                                discard: {
                                    trigger: {
                                        player: ['useCardAfter', 'respondAfter'],
                                    },
                                    forced: true,
                                    popup: false,
                                    logTarget() {
                                        return _status.currentPhase;
                                    },
                                    autodelay(event) {
                                        return event.name == 'respond' ? 0.5 : false;
                                    },
                                    filter(evt, player) {
                                        return (evt.skill == 'gdlonghun_shan' || evt.skill == 'gdlonghun_wuxie' || (['shan', 'wuxie'].includes(evt.card.name) && evt.skill == 'gdlonghun')) && evt.cards && evt.cards.length == 2 && _status.currentPhase && _status.currentPhase != player && _status.currentPhase.countDiscardableCards(player, 'he');
                                    },
                                    content() {
                                        player.line(_status.currentPhase, 'green');
                                        player.discardPlayerCard(_status.currentPhase, 'he', true);
                                    },
                                },
                            },
                        },
                        gdlonghun_tao: {
                            audio: 'ext:神域/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♥️️牌当【桃】使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'tao',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'heart' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'heart';
                            },
                            ai: {
                                basic: {
                                    order(card, player) {
                                        if (player.hasSkillTag('pretao')) return 5;
                                        return 2;
                                    },
                                    useful: [8, 6.5, 5, 4],
                                    value: [8, 6.5, 5, 4],
                                },
                                result: {
                                    target: 2,
                                    target_use(player, target) {
                                        if (player.hasSkillTag('nokeep', true, null, true)) return 2;
                                        var nd = player.needsToDiscard();
                                        var keep = false;
                                        if (nd <= 0) {
                                            keep = true;
                                        } else if (nd == 1 && target.hp >= 2 && target.countCards('h', 'tao') <= 1) {
                                            keep = true;
                                        }
                                        var mode = get.mode();
                                        if (target.hp >= 2 && keep && target.hasFriend()) {
                                            if (target.hp > 2 || nd == 0) return 0;
                                            if (target.hp == 2) {
                                                if (
                                                    game.hasPlayer(function (current) {
                                                        if (target != current && get.attitude(target, current) >= 3) {
                                                            if (current.hp <= 1) return true;
                                                            if ((mode == 'identity' || mode == 'versus' || mode == 'chess') && current.identity == 'zhu' && current.hp <= 2) return true;
                                                        }
                                                    })
                                                ) {
                                                    return 0;
                                                }
                                            }
                                        }
                                        if (target.hp < 0 && target != player && target.identity != 'zhu') return 0;
                                        var att = get.attitude(player, target);
                                        if (att < 3 && att >= 0 && player != target) return 0;
                                        var tri = _status.event.getTrigger();
                                        if (mode == 'identity' && player.identity == 'fan' && target.identity == 'fan') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'fan' && tri.source != target) {
                                                var num = game.countPlayer(function (current) {
                                                    if (current.identity == 'fan') {
                                                        return current.countCards('h', 'tao');
                                                    }
                                                });
                                                if (num > 1 && player == target) return 2;
                                                return 0;
                                            }
                                        }
                                        if (mode == 'identity' && player.identity == 'zhu' && target.identity == 'nei') {
                                            if (tri && tri.name == 'dying' && tri.source && tri.source.identity == 'zhong') {
                                                return 0;
                                            }
                                        }
                                        if (mode == 'stone' && target.isMin() && player != target && tri && tri.name == 'dying' && player.side == target.side && tri.source != target.getEnemy()) {
                                            return 0;
                                        }
                                        return 2;
                                    },
                                },
                                tag: {
                                    recover: 1,
                                    save: 1,
                                },
                            },
                        },
                        gdlonghun_sha: {
                            audio: 'ext:神域/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♦️️牌当火【杀】使用或打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'sha',
                                nature: 'fire',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'diamond' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'diamond';
                            },
                            ai: {
                                basic: {
                                    useful: [5, 1],
                                    value: [5, 1],
                                },
                                order(item, player) {
                                    if (player.hasSkillTag('presha', true, null, true)) return 10;
                                    if (lib.linked.includes(get.nature(item))) return player.getCardUsable('sha') > 1 ? 3 : 3.1;
                                    return 3.05;
                                },
                                result: {
                                    target(player, target, card, isLink) {
                                        if (!isLink && player.hasSkill('jiu')) {
                                            if (
                                                !target.hasSkillTag('filterDamage', null, {
                                                    player: player,
                                                    card: card,
                                                    jiu: true,
                                                })
                                            ) {
                                                if (get.attitude(player, target) > 0) {
                                                    return -7;
                                                } else {
                                                    return -4;
                                                }
                                            }
                                            return -0.5;
                                        }
                                        return -1.5;
                                    },
                                },
                                tag: {
                                    respond: 1,
                                    respondShan: 1,
                                    damage(card) {
                                        if (card.nature == 'poison') return;
                                        return 1;
                                    },
                                    natureDamage(card) {
                                        if (card.nature) return 1;
                                    },
                                    fireDamage(card, nature) {
                                        if (card.nature == 'fire') return 1;
                                    },
                                    thunderDamage(card, nature) {
                                        if (card.nature == 'thunder') return 1;
                                    },
                                    poisonDamage(card, nature) {
                                        if (card.nature == 'poison') return 1;
                                    },
                                },
                                canLink(player, target, card) {
                                    if (!target.isLinked() && !player.hasSkill('wutiesuolian_skill')) return false;
                                    if (
                                        target.mayHaveShan() &&
                                        !player.hasSkillTag(
                                            'directHit_ai',
                                            true,
                                            {
                                                target: target,
                                                card: card,
                                            },
                                            true
                                        )
                                    )
                                        return false;
                                    if (player.hasSkill('jueqing') || target.hasSkill('gangzhi') || target.hasSkill('gangzhi')) return false;
                                    return true;
                                },
                                yingbian(card, player, targets, viewer) {
                                    if (get.attitude(viewer, player) <= 0) return 0;
                                    var base = 0,
                                        hit = false;
                                    if (get.cardtag(card, 'yingbian_hit')) {
                                        hit = true;
                                        if (
                                            targets.filter(function (target) {
                                                return target.hasShan() && get.attitude(viewer, target) < 0 && get.damageEffect(target, player, viewer, get.nature(card)) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_all')) {
                                        if (
                                            game.hasPlayer(function (current) {
                                                return !targets.includes(current) && lib.filter.targetEnabled2(card, player, current) && get.effect(current, card, player, player) > 0;
                                            })
                                        )
                                            base += 5;
                                    }
                                    if (get.cardtag(card, 'yingbian_damage')) {
                                        if (
                                            targets.filter(function (target) {
                                                return (
                                                    get.attitude(player, target) < 0 &&
                                                    (hit ||
                                                        !target.mayHaveShan() ||
                                                        player.hasSkillTag(
                                                            'directHit_ai',
                                                            true,
                                                            {
                                                                target: target,
                                                                card: card,
                                                            },
                                                            true
                                                        )) &&
                                                    !target.hasSkillTag('filterDamage', null, {
                                                        player: player,
                                                        card: card,
                                                        jiu: true,
                                                    })
                                                );
                                            })
                                        )
                                            base += 5;
                                    }
                                    return base;
                                },
                            },
                        },
                        gdlonghun_wuxie: {
                            audio: 'ext:神域/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♠️️牌当【无懈可击】使用';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 7 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'wuxie',
                            },
                            viewAsFilter(player) {
                                return player.countCards('he', { suit: 'spade' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'spade';
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4],
                                    value: [6, 4],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        gdlonghun_shan: {
                            audio: 'ext:神域/audio:true',
                            enable: ['chooseToUse', 'chooseToRespond'],
                            prompt() {
                                return '将至多两张♣️️牌当【闪】使用或打出';
                            },
                            position: 'he',
                            check(card, event) {
                                if (ui.selected.cards.length) return 0;
                                return 10 - get.value(card);
                            },
                            selectCard: [1, 2],
                            viewAs: {
                                name: 'shan',
                            },
                            filter(event, player) {
                                return player.countCards('he', { suit: 'club' }) > 0;
                            },
                            filterCard(card) {
                                return card.suit == 'club';
                            },
                            ai: {
                                order: 3,
                                basic: {
                                    useful: [7, 2],
                                    value: [7, 2],
                                },
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        darkurge: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 1;
                                },
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: '残虐',
                            group: ['darkurge_1'],
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('darkurge'), function (card, player, target) {
                                    return player != target && player.inRange(target);
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    ('step 2');
                                    player.loseHp();
                                    result.targets[0].disableSkill('darkurge', lib.character[result.targets[0].name][3]);
                                    result.targets[0].discard(result.targets[0].getCards('he'));
                                    result.targets[0].addSkill('darkurge_2');
                                    result.targets[0].damage(2);
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('darkurge_2');
                                            i.enableSkill('darkurge');
                                            delete i.storage.darkurge;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        gdzhanjiang: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            audio: 'ext:神域/audio:1',
                            forced: true,
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('gdzhanjiang'), function (card, player, target) {
                                    return player != target && target.hp >= player.hp;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.disableEquip('equip1');
                                    player.disableEquip('equip2');
                                    player.disableEquip('equip3');
                                    player.disableEquip('equip4');
                                    player.disableEquip('equip5');
                                    result.targets[0].turnOver(true);
                                    result.targets[0].damage('fire', 1);
                                }
                            },
                        },
                        龙佑: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.es && event.es.length;
                            },
                            content() {
                                'step 0';
                                event.count = trigger.es.length;
                                ('step 1');
                                event.count--;
                                player.changeHujia();
                            },
                            ai: {
                                noe: true,
                                reverseEquip: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip' && !get.cardtag(card, 'gifts')) return [1, 3];
                                    },
                                },
                            },
                            group: ['龙佑II'],
                        },
                        刑判: {
                            audio: 'ext:神域/audio:true',
                            forced: true,
                            trigger: {
                                player: ['damageBegin4', 'phaseZhunbeiBegin'],
                            },
                            filter(event, player, name) {
                                if (name == 'damageBegin4') {
                                    return event.num && event.num > 1;
                                }
                                return game.hasPlayer(function (target) {
                                    return player != target && get.distance(player, target) <= 1;
                                });
                            },
                            content() {
                                var name = event.triggername;
                                if (name == 'damageBegin4') {
                                    trigger.num--;
                                    return;
                                } else {
                                    game.countPlayer(function (target) {
                                        if (player != target && get.distance(player, target) <= 1) {
                                            target.damage(1, player, 'fire');
                                        }
                                    });
                                }
                            },
                        },
                        地府: {
                            forced: true,
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                global: 'gameDrawAfter',
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin', 'enterGame'],
                            },
                            filter(event, player, name) {
                                if (name == 'gameDrawAfter' || name == 'enterGame') {
                                    return true;
                                } else if (name == 'phaseZhunbeiBegin') {
                                    return player.hp < 3;
                                }
                                return true;
                            },
                            content() {
                                var name = event.triggername;
                                if (name == 'phaseZhunbeiBegin') {
                                    player.recover(3 - player.hp);
                                    return;
                                } else {
                                    player.draw(name == 'gameDrawAfter' || name == 'enterGame' ? 3 : 2);
                                }
                            },
                        },
                        铁面: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            _priority: 100,
                            filter(event, player) {
                                return event.card && get.color(event.card) == 'black' && event.player != player;
                            },
                            content() {
                                'step 0';
                                player.gain(trigger.cards);
                                player.$gain2(trigger.cards);
                                ('step 1');
                                trigger.cancel();
                            },
                        },
                        巨浪: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            usable: 1,
                            content() {
                                'step 0';
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                player.line(event.targets, 'green');
                                event.targets2 = event.targets.slice(0);
                                event.targets3 = event.targets.slice(0);
                                ('step 1');
                                if (event.targets2.length) {
                                    event.targets2.shift().damage('nocard');
                                    event.redo();
                                }
                                ('step 2');
                                if (event.targets.length) {
                                    event.current = event.targets.shift();
                                    event.current.discard(event.current.getCards('e')).delay = false;
                                }
                                ('step 3');
                                if (event.targets.length) event.goto(2);
                                ('step 4');
                                if (event.targets3.length) {
                                    var target = event.targets3.shift();
                                    target.chooseToDiscard(target.countCards('h'), 'h', true).delay = false;
                                }
                                ('step 5');
                                if (event.targets3.length) event.goto(4);
                                ('step 6');
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        风暴: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                player: 'loseAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.es && event.es.length;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('风暴'), function (card, player, target) {
                                        if (target == player) return false;
                                        return get.distance(player, target) <= 1 || player.canUse('sha', target, false);
                                    })
                                    .set('ai', function (target) {
                                        if (get.distance(player, target) <= 1) {
                                            return get.damageEffect(target, player, player) * 2;
                                        } else {
                                            return get.effect(target, { name: 'sha' }, player, player);
                                        }
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    var target = result.targets[0];
                                    var distance = get.distance(player, target);
                                    if (distance <= 1 && player.canUse('sha', target, false)) {
                                        player.chooseControl('出杀', '造成伤害').ai = function () {
                                            return '造成伤害';
                                        };
                                        event.target = target;
                                    } else if (distance <= 1) {
                                        target.damage();
                                        event.finish();
                                    } else {
                                        player.useCard({ name: 'sha' }, target, false).animate = false;
                                        event.finish();
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                var target = event.target;
                                if (result.control == '出杀') {
                                    player.useCard({ name: 'sha' }, target, false).animate = false;
                                } else {
                                    target.damage();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'equip') return [1, 3];
                                    },
                                },
                                reverseEquip: true,
                                noe: true,
                            },
                        },
                        瘴气: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return target != player;
                            },
                            selectTarget: -1,
                            multitarget: true,
                            multiline: true,
                            content() {
                                //QQQ
                                'step 0';
                                event.current = player.next;
                                event.currented = [];
                                ('step 1');
                                event.currented.push(event.current);
                                event.current.addTempClass('target');
                                event.current.chooseToUse('瘴气:使用一张杀或失去1点体力', { name: 'sha' }, function (card, player, target) {
                                    if (player == target) return false;
                                    if (!player.canUse('sha', target)) return false;
                                    if (get.distance(player, target) <= 1) return true;
                                    if (
                                        game.hasPlayer(function (current) {
                                            return current != player && get.distance(player, current) < get.distance(player, target);
                                        })
                                    ) {
                                        return false;
                                    }
                                    return true;
                                });
                                ('step 2');
                                if (result.bool == false) event.current.loseHp();
                                event.current = event.current.next;
                                if (event.current != player && !event.currented.includes(event.current)) {
                                    event.goto(1);
                                }
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player: 1,
                                },
                            },
                            intro: {
                                content: 'limited',
                            },
                            init(player, skill) {
                                player.storage[skill] = false;
                            },
                        },
                        瘟疫: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            usable: 1,
                            selectTarget: -1,
                            multitarget: true,
                            multiline: true,
                            content() {
                                'step 0';
                                event.num = 1;
                                event.targets = targets.slice(0);
                                event.targets.sort(lib.sort.seat);
                                ('step 1');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    event.target = target;
                                    var res = get.damageEffect(target, player, target, 'fire');
                                    target
                                        .chooseToDiscard('he', '弃置至少' + get.cnNumber(event.num) + '张牌或失去2点体力', [num, Infinity])
                                        .set('ai', function (card) {
                                            if (ui.selected.cards.length >= _status.event.parent.num) return -1;
                                            if (_status.event.player.hasSkillTag('nofire')) return -1;
                                            if (_status.event.res >= 0) return 6 - get.value(card);
                                            if (get.type(card) != 'basic') {
                                                return 10 - get.value(card);
                                            }
                                            return 8 - get.value(card);
                                        })
                                        .set('res', res);
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (!result.bool) {
                                    event.target.loseHp(2);
                                    event.num = 1;
                                } else {
                                    event.num = result.cards.length + 1;
                                }
                                event.goto(1);
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player: 1,
                                },
                            },
                            init(player) {
                                player.storage.瘟疫 = false;
                            },
                            intro: {
                                content: 'limited',
                            },
                        },
                        尸毒: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player && !current.isMad();
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player && !current.isMad();
                                });
                                player.chooseTarget(get.prompt('尸毒'), [1, num], function (card, player, target) {
                                    return !target.isMad() && player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].goMad({ player: 'phaseAfter' });
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        斩天: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player;
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player;
                                });
                                player.chooseTarget(get.prompt('斩天'), [1, num], function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].damage(2);
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        堕天: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player;
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player;
                                });
                                player.chooseTarget(get.prompt('堕天'), [1, num], function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].damage(2);
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        洪荒: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.countCards('he') == 0) return false;
                                if (!player.hasSkill('decadexuanfeng')) return true;
                                if (!player.hasSkill('shenji')) return true;
                                if (!player.hasSkill('new_rewusheng')) return true;
                                if (!player.hasSkill('xinkuanggu')) return true;
                                return false;
                            },
                            filterCard: true,
                            position: 'he',
                            check(card) {
                                if (get.position(card) == 'e' && _status.event.player.hasSkill('decadexuanfeng')) return 16 - get.value(card);
                                return 7 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var list = [];
                                if (!player.hasSkill('decadexuanfeng')) list.push('decadexuanfeng');
                                if (!player.hasSkill('shenji')) list.push('shenji');
                                if (!player.hasSkill('new_rewusheng')) list.push('new_rewusheng');
                                if (!player.hasSkill('xinkuanggu')) list.push('xinkuanggu');
                                if (list.length == 1) {
                                    player.addTempSkill(list[0]);
                                    event.finish();
                                } else {
                                    player
                                        .chooseControl(list, function () {
                                            if (list.includes('decadexuanfeng') && player.countCards('he', { type: 'equip' })) return 'decadexuanfeng';
                                            if (!player.getStat().skill.new_rewusheng) {
                                                if (player.hasSkill('new_rewusheng') && player.getEquip(1) && list.includes('decadexuanfeng')) return 'decadexuanfeng';
                                                if (list.includes('xinkuanggu') || list.includes('new_rewusheng')) {
                                                    var players = game.filterPlayer();
                                                    for (var i of players) {
                                                        if (i.hp == 1 && get.attitude(player, i) < 0) {
                                                            if (list.includes('xinkuanggu')) return 'xinkuanggu';
                                                            if (list.includes('new_rewusheng')) return 'new_rewusheng';
                                                        }
                                                    }
                                                }
                                            }
                                            if (list.includes('new_rewusheng')) return 'new_rewusheng';
                                            if (list.includes('xinkuanggu')) return 'xinkuanggu';
                                            if (list.includes('decadexuanfeng')) return 'decadexuanfeng';
                                            return 'shenji';
                                        })
                                        .set('prompt', '选择获得一项技能直到回合结束');
                                }
                                ('step 1');
                                player.addTempSkill(result.control);
                                player.popup(get.translation(result.control));
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    if (player.countCards('e', { type: 'equip' })) return 10;
                                    if (!player.getStat().skill.new_rewusheng) {
                                        if (player.hasSkill('new_rewusheng') && player.getEquip(1) && !player.hasSkill('decadexuanfeng')) return 10;
                                        if (player.hasSkill('xinkuanggu')) return 1;
                                        var players = game.filterPlayer();
                                        for (var i of players) {
                                            if (i.hp == 1 && get.attitude(player, i) < 0) return 10;
                                        }
                                    }
                                    return 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('e', { type: 'equip' })) return 1;
                                        if (!player.getStat().skill.new_rewusheng) {
                                            if (player.hasSkill('new_rewusheng') && player.getEquip(1) && !player.hasSkill('decadexuanfeng')) return 1;
                                            if (!player.hasSkill('xinkuanggu') || !player.hasSkill('new_rewusheng')) {
                                                var players = game.filterPlayer();
                                                for (var i of players) {
                                                    if (i.hp == 1 && get.attitude(player, i) < 0) return 1;
                                                }
                                            }
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        梦魇: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            trigger: {
                                player: 'loseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.original == 'h') return true;
                                    }
                                return false;
                            },
                            content() {
                                'step 0';
                                var players = get.players(player);
                                players.remove(player);
                                event.players = players;
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    var hs = current.getCards('h');
                                    if (hs.length) {
                                        current.lose(hs)._triggered = null;
                                        current.$throw(hs);
                                    } else {
                                        current.goMad({ player: 'phaseAfter' });
                                    }
                                    event.redo();
                                }
                            },
                        },
                        梦魇II: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                player: 'loseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.original == 'h') return true;
                                    }
                                return false;
                            },
                            content() {
                                'step 0';
                                var players = get.players(player);
                                players.remove(player);
                                event.players = players;
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    var hs = current.getCards('h');
                                    if (hs.length) {
                                        current.lose(hs)._triggered = null;
                                        current.$throw(hs);
                                    } else {
                                        current.goMad({ player: 'phaseAfter' });
                                    }
                                    event.redo();
                                }
                            },
                        },
                        沉眠: {
                            audio: 'ext:神域/audio:1',
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'dying'],
                            },
                            forced: true,
                            content() {
                                player.chooseToDiscard(player.countCards('h'), true);
                                player.recover(player.countCards('h'));
                                player.unMad();
                            },
                            group: ['沉眠II'],
                        },
                        震怒: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.countCards('he') == 0) return false;
                                if (!player.hasSkill('reqiangxi')) return true;
                                if (!player.hasSkill('retieji')) return true;
                                if (!player.hasSkill('decadexuanfeng')) return true;
                                if (!player.hasSkill('xinjuece')) return true;
                                return false;
                            },
                            filterCard: true,
                            position: 'he',
                            check(card) {
                                if (get.position(card) == 'e' && _status.event.player.hasSkill('decadexuanfeng')) return 16 - get.value(card);
                                return 7 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var list = [];
                                if (!player.hasSkill('reqiangxi')) list.push('reqiangxi');
                                if (!player.hasSkill('retieji')) list.push('retieji');
                                if (!player.hasSkill('decadexuanfeng')) list.push('decadexuanfeng');
                                if (!player.hasSkill('xinjuece')) list.push('xinjuece');
                                if (list.length == 1) {
                                    player.addTempSkill(list[0]);
                                    event.finish();
                                } else {
                                    player
                                        .chooseControl(list, function () {
                                            if (list.includes('decadexuanfeng') && player.countCards('he', { type: 'equip' })) return 'decadexuanfeng';
                                            if (!player.getStat().skill.reqiangxi) {
                                                if (player.hasSkill('reqiangxi') && player.getEquip(1) && list.includes('decadexuanfeng')) return 'decadexuanfeng';
                                                if (list.includes('xinjuece') || list.includes('reqiangxi')) {
                                                    var players = game.filterPlayer();
                                                    for (var i of players) {
                                                        if (i.hp == 1 && get.attitude(player, i) < 0) {
                                                            if (list.includes('xinjuece')) return 'xinjuece';
                                                            if (list.includes('reqiangxi')) return 'reqiangxi';
                                                        }
                                                    }
                                                }
                                            }
                                            if (list.includes('reqiangxi')) return 'reqiangxi';
                                            if (list.includes('xinjuece')) return 'xinjuece';
                                            if (list.includes('decadexuanfeng')) return 'decadexuanfeng';
                                            return 'retieji';
                                        })
                                        .set('prompt', '选择获得一项技能直到回合结束');
                                }
                                ('step 1');
                                player.addTempSkill(result.control);
                                player.popup(get.translation(result.control));
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    if (player.countCards('e', { type: 'equip' })) return 10;
                                    if (!player.getStat().skill.reqiangxi) {
                                        if (player.hasSkill('reqiangxi') && player.getEquip(1) && !player.hasSkill('decadexuanfeng')) return 10;
                                        if (player.hasSkill('xinjuece')) return 1;
                                        var players = game.filterPlayer();
                                        for (var i of players) {
                                            if (i.hp == 1 && get.attitude(player, i) < 0) return 10;
                                        }
                                    }
                                    return 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('e', { type: 'equip' })) return 1;
                                        if (!player.getStat().skill.reqiangxi) {
                                            if (player.hasSkill('reqiangxi') && player.getEquip(1) && !player.hasSkill('decadexuanfeng')) return 1;
                                            if (!player.hasSkill('xinjuece') || !player.hasSkill('reqiangxi')) {
                                                var players = game.filterPlayer();
                                                for (var i of players) {
                                                    if (i.hp == 1 && get.attitude(player, i) < 0) return 1;
                                                }
                                            }
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        极武: {
                            audio: 'ext:神域/audio:2',
                            enable: 'phaseUse',
                            filter(event, player) {
                                if (player.countCards('he') == 0) return false;
                                if (!player.hasSkill('qiangxix')) return true;
                                if (!player.hasSkill('retieji')) return true;
                                if (!player.hasSkill('olxuanfeng')) return true;
                                if (!player.hasSkill('rewansha')) return true;
                                return false;
                            },
                            filterCard: true,
                            position: 'he',
                            check(card) {
                                if (get.position(card) == 'e' && _status.event.player.hasSkill('olxuanfeng')) return 16 - get.value(card);
                                return 7 - get.value(card);
                            },
                            content() {
                                'step 0';
                                var list = [];
                                if (!player.hasSkill('qiangxix')) list.push('qiangxix');
                                if (!player.hasSkill('retieji')) list.push('retieji');
                                if (!player.hasSkill('olxuanfeng')) list.push('olxuanfeng');
                                if (!player.hasSkill('rewansha')) list.push('rewansha');
                                if (list.length == 1) {
                                    player.addTempSkill(list[0]);
                                    event.finish();
                                } else {
                                    player
                                        .chooseControl(list, function () {
                                            if (list.includes('olxuanfeng') && player.countCards('he', { type: 'equip' })) return 'olxuanfeng';
                                            if (!player.getStat().skill.qiangxix) {
                                                if (player.hasSkill('qiangxix') && player.getEquip(1) && list.includes('olxuanfeng')) return 'olxuanfeng';
                                                if (list.includes('rewansha') || list.includes('qiangxix')) {
                                                    var players = game.filterPlayer();
                                                    for (var i of players) {
                                                        if (i.hp == 1 && get.attitude(player, i) < 0) {
                                                            if (list.includes('rewansha')) return 'rewansha';
                                                            if (list.includes('qiangxix')) return 'qiangxix';
                                                        }
                                                    }
                                                }
                                            }
                                            if (list.includes('qiangxix')) return 'qiangxix';
                                            if (list.includes('rewansha')) return 'rewansha';
                                            if (list.includes('olxuanfeng')) return 'olxuanfeng';
                                            return 'retieji';
                                        })
                                        .set('prompt', '选择获得一项技能直到回合结束');
                                }
                                ('step 1');
                                player.addTempSkill(result.control);
                                player.popup(get.translation(result.control));
                            },
                            ai: {
                                order() {
                                    var player = _status.event.player;
                                    if (player.countCards('e', { type: 'equip' })) return 10;
                                    if (!player.getStat().skill.qiangxix) {
                                        if (player.hasSkill('qiangxix') && player.getEquip(1) && !player.hasSkill('olxuanfeng')) return 10;
                                        if (player.hasSkill('rewansha')) return 1;
                                        var players = game.filterPlayer();
                                        for (var i of players) {
                                            if (i.hp == 1 && get.attitude(player, i) < 0) return 10;
                                        }
                                    }
                                    return 1;
                                },
                                result: {
                                    player(player) {
                                        if (player.countCards('e', { type: 'equip' })) return 1;
                                        if (!player.getStat().skill.qiangxix) {
                                            if (player.hasSkill('qiangxix') && player.getEquip(1) && !player.hasSkill('olxuanfeng')) return 1;
                                            if (!player.hasSkill('rewansha') || !player.hasSkill('qiangxix')) {
                                                var players = game.filterPlayer();
                                                for (var i of players) {
                                                    if (i.hp == 1 && get.attitude(player, i) < 0) return 1;
                                                }
                                            }
                                        }
                                        return 0;
                                    },
                                },
                            },
                        },
                        wzlongyan: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player;
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player;
                                });
                                player.chooseTarget(get.prompt('wzlongyan'), [1, num], function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].damage('fire', 2);
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        kslbingyuan: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            audio: 'ext:神域/audio:1',
                            group: ['kslbingyuan_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('kslbingyuan', lib.character[target.name][3]);
                                target.turnOver(true);
                                target.addSkill('kslbingyuan_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('kslbingyuan_2');
                                            i.enableSkill('kslbingyuan');
                                            delete i.storage.kslbingyuan;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        kslbingyuanII: {
                            audio: 'ext:神域/audio:1',
                            group: ['kslbingyuanII_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                'step 0';
                                target.disableSkill('kslbingyuanII', lib.character[target.name][3]);
                                target.addSkill('kslbingyuanII_2');
                                player.loseHp(Math.max(0, target.hp - player.hp));
                                ('step 1');
                                target.loseHp(target.hp);
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('kslbingyuanII_2');
                                            i.enableSkill('kslbingyuanII');
                                            delete i.storage.kslbingyuanII;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 1,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        净罪: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (player) {
                                    return player.countCards('h') == 0;
                                });
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('净罪'), '令一名没有手牌的其他角色失去1点体力上限', function (card, player, target) {
                                        return player != target && target.countCards('h') == 0;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        return get.damageEffect(target, player, player);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].loseMaxHp();
                                }
                            },
                        },
                        删除: {
                            audio: 'ext:神域/audio:1',
                            group: ['删除_1'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('删除'), function (card, player, target) {
                                    return player != target && get.distance(player, target) <= 1;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.loseHp();
                                    ui.background.setBackgroundImage('extension/神域/image/数字矩阵.jpg');
                                    player.say('Delete!');
                                    result.targets[0].disableSkill('删除', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('删除_2');
                                    result.targets[0].discard(result.targets[0].getCards('he'));
                                    result.targets[0].loseHp();
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('删除_2');
                                            i.enableSkill('删除');
                                            delete i.storage.删除;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        魂牢: {
                            audio: 'ext:神域/audio:1',
                            group: ['魂牢_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('魂牢', lib.character[target.name][3]);
                                target.addSkill('魂牢_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('魂牢_2');
                                            i.enableSkill('魂牢');
                                            delete i.storage.魂牢;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 18,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        审判: {
                            audio: 'kslduanhun',
                            enable: 'phaseUse',
                            round: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h') && get.distance(player, target) <= 1;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.chooseToDiscard(target.countCards('h'), true);
                                target.damage('fire', target.countCards('h'));
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        wlbingfeng: {
                            audio: 'ext:神域/audio:1',
                            group: ['wlbingfeng_1'],
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.disableSkill('wlbingfeng', lib.character[target.name][3]);
                                target.addSkill('wlbingfeng_2');
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('wlbingfeng_2');
                                            i.enableSkill('wlbingfeng');
                                            delete i.storage.wlbingfeng;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        wljihan: {
                            trigger: {
                                player: 'phaseJieshuBefore',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('wljihan'), function (card, player, target) {
                                    return target.isEnemiesOf(player);
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].loseHp(2);
                                }
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        kslduanhun: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (player) {
                                    return player.countCards('h') == 0;
                                });
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('kslduanhun'), '令一名没有手牌的其他角色失去所有体力上限', function (card, player, target) {
                                        return player != target && target.countCards('h') == 0;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        return get.damageEffect(target, player, player);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].loseMaxHp(result.targets[0].maxHp);
                                }
                            },
                        },
                        湮灭: {
                            superCharlotte: true,
                            charlotte: true,
                            fixed: true,
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseUseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('湮灭'), '令一名其他角色死亡', function (card, player, target) {
                                        return player != target;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        return get.damageEffect(target, player, player);
                                    });
                                ('step 1');
                                if (result.bool) {
                                    player.disableEquip('equip1');
                                    player.disableEquip('equip2');
                                    player.disableEquip('equip3');
                                    player.disableEquip('equip4');
                                    player.disableEquip('equip5');
                                    result.targets[0].die();
                                }
                            },
                        },
                        mwshawei: {
                            group: ['mwshawei_1'],
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (player) {
                                    return player.countCards('h') == 0;
                                });
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseTarget(get.prompt('mwshawei'), '对一名没有手牌的其他角色造成2点伤害', function (card, player, target) {
                                        return player != target && target.countCards('h') == 0;
                                    })
                                    .set('ai', function (target) {
                                        var player = _status.event.player;
                                        return get.damageEffect(target, player, player);
                                    });
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('mwshawei', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('mwshawei_2');
                                    result.targets[0].damage(2);
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('mwshawei_2');
                                            i.enableSkill('mwshawei');
                                            delete i.storage.mwshawei;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                        },
                        mwhuangwei: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            content() {
                                player.gain(target.getCards('h'));
                                target.$give(target.getCards('h').length, player);
                            },
                            ai: {
                                order: 12,
                                result: {
                                    player: 1,
                                    target(player, target) {
                                        return -target.countCards('h');
                                    },
                                },
                            },
                        },
                        mwjiuchi: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            check(card) {
                                return 8 - get.value(card);
                            },
                            position: 'he',
                            content() {
                                'step 0';
                                player.damage();
                                ('step 1');
                                game.log(player, '获得了技能', '#g〖灭绝〗');
                                var path = 'extension/神域/audio/bg_sanying_after.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                                player.addTempSkill('灭绝');
                            },
                            ai: {
                                order: 14,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        变身: {
                            audio: 'dclfeishengII',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            selectCard: 2,
                            position: 'he',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('he') >= 2;
                            },
                            content() {
                                player.init('真魔人');
                            },
                            ai: {
                                result: {
                                    player: 1,
                                },
                                order: 2.5,
                            },
                        },
                        部署: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterCard: true,
                            selectCard: 2,
                            position: 'he',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            filter(event, player) {
                                return player.countCards('he') >= 2;
                            },
                            content() {
                                player.init('哨戒炮');
                            },
                            ai: {
                                result: {
                                    player: 1,
                                },
                                order: 2.5,
                            },
                        },
                        dclfeishengII: {
                            audio: 'ext:神域/audio:1',
                            juexingji: true,
                            forced: true,
                            trigger: {
                                player: 'phaseBegin',
                            },
                            content() {
                                game.log(player, '获得了', '#g【血神之力】');
                                player.init('飞升吸血鬼');
                                player.awakenSkill(event.name);
                                player.storage[event.name] = true;
                                player.removeSkill('dclfeishengII');
                            },
                        },
                        dclfeishengIII: {},
                        dclfeisheng: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('he') >= 4 && player.hp >= 3;
                            },
                            content() {
                                'step 0';
                                player.discard(player.getCards('he'));
                                player.loseHp(player.hp);
                                ('step 1');
                                player.addSkill('dclfeishengII');
                                player.removeSkill('dclfeisheng');
                            },
                            ai: {
                                order: 14,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        洪荒II: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            content() {
                                'step 0';
                                event.players = get.players(player);
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    if (current.isEnemiesOf(player)) {
                                        player.line(current, 'thunder');
                                        current.damage('thunder');
                                    }
                                    event.redo();
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        灭绝: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            mark: true,
                            marktext: '灭',
                            intro: {
                                content: '你造成的非传导伤害+1',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.notLink();
                            },
                            _priority: 32,
                            content() {
                                trigger.num++;
                                player.line(trigger.player, 'red');
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        堕天II: {
                            audio: '地震',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player;
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player;
                                });
                                player.chooseTarget(get.prompt('堕天II'), [1, num], function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].damage(2);
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        地震: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.notLink();
                            },
                            content() {
                                trigger.num++;
                                player.line(trigger.player, 'red');
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        歼灭: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.notLink();
                            },
                            content() {
                                trigger.num++;
                                player.line(trigger.player, 'red');
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        化首: {
                            usable: 1,
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            content() {
                                'step 0';
                                var num = player.hp - 1;
                                if (player.countCards('hs', { name: ['tao', 'jiu'] })) {
                                    num = player.hp;
                                }
                                var map = {};
                                var list = [];
                                for (var i = 1; i <= player.hp; i++) {
                                    var cn = get.cnNumber(i, true);
                                    map[cn] = i;
                                    list.push(cn);
                                }
                                event.map = map;
                                player
                                    .chooseControl(list, function () {
                                        return get.cnNumber(_status.event.goon, true);
                                    })
                                    .set('prompt', '失去任意点体力')
                                    .set('goon', num);
                                ('step 1');
                                var num = event.map[result.control] || 1;
                                player.storage.reqimou2 = num;
                                player.loseHp(num);
                                player.draw(num);
                                player.addTempSkill('reqimou2');
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        if (player.hp < 3) return false;
                                        var mindist = player.hp;
                                        if (player.countCards('hs', { name: ['tao', 'jiu'] })) mindist++;
                                        if (
                                            game.hasPlayer(function (current) {
                                                return get.distance(player, current) <= mindist && player.canUse('sha', current, false) && get.effect(current, { name: 'sha' }, player, player) > 0;
                                            })
                                        )
                                            return 1;
                                        return 0;
                                    },
                                },
                            },
                        },
                        boss__baolian: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                var num = 2;
                                if (!player.countCards('h')) {
                                    num = 3;
                                }
                                player.draw(num);
                            },
                            ai: {
                                threaten: 0.5,
                            },
                        },
                        不朽II: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBefore',
                            },
                            forced: true,
                            filter(event, player, name) {
                                return player.isDamaged();
                            },
                            content() {
                                player.recover();
                            },
                            ai: {
                                threaten: 0.5,
                            },
                        },
                        boss__baolianII: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                var num = 2;
                                if (!player.countCards('h')) {
                                    num = 3;
                                }
                                player.draw(num);
                            },
                            ai: {
                                threaten: 0.5,
                            },
                        },
                        boss__guimei: {
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (get.type(card) == 'delay') {
                                        return false;
                                    }
                                },
                            },
                        },
                        飞行: {
                            mod: {
                                globalTo(from, to, distance) {
                                    return distance + 1;
                                },
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                        },
                        尸玉: {
                            group: ['尸玉II', '尸玉III', '尸玉IV'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                                maxHandcard(player, num) {
                                    return num + 2 * player.hp;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        血祖: {
                            group: ['血祖II'],
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        boss__guihuo: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('boss__guihuo'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('fire');
                                }
                            },
                        },
                        巨炮: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('巨炮'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('fire', 3);
                                }
                            },
                        },
                        狼袭: {
                            audio: '残虐',
                            group: ['狼袭_1'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('狼袭'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('狼袭', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('狼袭_2');
                                    result.targets[0].damage(2);
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('狼袭_2');
                                            i.enableSkill('狼袭');
                                            delete i.storage.狼袭;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        重炮: {
                            audio: 'ext:神域/audio:1',
                            group: ['重炮_1'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('重炮'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('重炮', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('重炮_2');
                                    result.targets[0].damage('fire', 2);
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('重炮_2');
                                            i.enableSkill('重炮');
                                            delete i.storage.重炮;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        残虐: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 1;
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            group: ['残虐_1'],
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('残虐'), function (card, player, target) {
                                    return player != target && player.inRange(target);
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.loseHp();
                                    result.targets[0].disableSkill('残虐', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('残虐_2');
                                    result.targets[0].damage();
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('残虐_2');
                                            i.enableSkill('残虐');
                                            delete i.storage.残虐;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        血拳: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 1;
                                },
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            group: ['血拳_1'],
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('血拳'), function (card, player, target) {
                                    return player != target && player.inRange(target);
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.recover(1);
                                    result.targets[0].discard(result.targets[0].getCards('e'));
                                    result.targets[0].disableSkill('血拳', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('血拳_2');
                                    result.targets[0].damage(1);
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('血拳_2');
                                            i.enableSkill('血拳');
                                            delete i.storage.血拳;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        boss__luolei: {
                            audio: '雷鸣',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('boss__luolei'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('thunder');
                                }
                            },
                        },
                        践踏: {
                            mod: {
                                attackRange(player, num) {
                                    return num + 2;
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('践踏'), function (card, player, target) {
                                    return player != target && player.inRange(target);
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage();
                                }
                            },
                        },
                        神罚: {
                            round: 1,
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('神罚'), function (card, player, target) {
                                    return player != target && get.distance(player, target) <= 1;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.loseHp(3);
                                    result.targets[0].damage(2);
                                    result.targets[0].damage('thunder', 2);
                                    result.targets[0].damage('fire', 2);
                                }
                            },
                        },
                        轰炸: {
                            audio: 'ext:神域/audio:1',
                            group: ['轰炸_1'],
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('轰炸'), function (card, player, target) {
                                    return player != target && get.distance(player, target) <= 1;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('轰炸', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('轰炸_2');
                                    result.targets[0].damage('fire');
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        global: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('轰炸_2');
                                            i.enableSkill('轰炸');
                                            delete i.storage.轰炸;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到本回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        脉冲: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('脉冲'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('thunder');
                                }
                            },
                        },
                        boss__shanbeng: {
                            global: 'boss__shanbeng2',
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            logv: false,
                            content() {
                                var targets = game.filterPlayer(function (current) {
                                    return current.countCards('e');
                                });
                                player.line(targets, 'green');
                                game.logv(player, 'boss__shanbeng', targets, null, true);
                            },
                        },
                        boss__shanbeng2: {
                            trigger: {
                                global: 'dieAfter',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('e') > 0 && event.player.hasSkill('boss__shanbeng') && event.player.isDead();
                            },
                            content() {
                                player.discard(player.getCards('e'));
                            },
                        },
                        boss__guiji: {
                            trigger: {
                                player: 'phaseJudgeBegin',
                            },
                            forced: true,
                            content() {
                                player.discard(player.getCards('j').randomGet());
                            },
                            filter(event, player) {
                                return player.countCards('j') > 0;
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.type(card) == 'delay' && target.countCards('j') == 0) return 0.1;
                                    },
                                },
                            },
                        },
                        boss__taiping: {
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            content() {
                                trigger.num += 2;
                            },
                        },
                        尸玉II: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                var num = trigger.player.countDisabled();
                                if (num > 0) {
                                    for (var i = 1; i < 6; i++) {
                                        if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                    }
                                }
                            },
                        },
                        血祖II: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            _priority: 10,
                            content() {
                                var num = trigger.player.countDisabled();
                                if (num > 0) {
                                    for (var i = 1; i < 6; i++) {
                                        if (trigger.player.isDisabled(i)) trigger.player.enableEquip(i);
                                    }
                                }
                            },
                        },
                        boss__xiaoshou: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('boss__xiaoshou'), function (card, player, target) {
                                    return player != target && target.hp <= player.hp;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'fire');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('fire', 3);
                                }
                            },
                        },
                        boss__suoming: {
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player && !current.isLinked();
                                });
                            },
                            content() {
                                'step 0';
                                var num = game.countPlayer(function (current) {
                                    return current != player && !current.isLinked();
                                });
                                player.chooseTarget(get.prompt('boss__suoming'), [1, num], function (card, player, target) {
                                    return !target.isLinked() && player != target;
                                }).ai = function (target) {
                                    return -get.attitude(player, target);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    event.targets = result.targets;
                                    event.num = 0;
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.num < event.targets.length) {
                                    event.targets[event.num].link();
                                    event.num++;
                                    event.redo();
                                }
                            },
                        },
                        boss__xixing: {
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('boss__xixing'), function (card, player, target) {
                                    return player != target && target.isLinked();
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].damage('thunder');
                                    player.recover();
                                }
                            },
                        },
                        boss__didong: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseJieshuEnd',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('boss__didong'), function (card, player, target) {
                                    return target.isEnemiesOf(player);
                                }).ai = function (target) {
                                    var att = get.attitude(player, target);
                                    if (target.isTurnedOver()) {
                                        if (att > 0) {
                                            return att + 5;
                                        }
                                        return -1;
                                    }
                                    if (player.isTurnedOver()) {
                                        return 5 - att;
                                    }
                                    return -att;
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].turnOver();
                                }
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        冰岚: {
                            audio: 'kslbingyuan',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.chooseToDiscard(target.countCards('h'), true);
                                target.damage(target.countCards('h'));
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        狂罚: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target && target.countCards('h');
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                target.chooseToDiscard(target.countCards('h'), true);
                                target.loseHp(target.countCards('h'));
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        禁闭: {
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            group: ['禁闭_1'],
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('禁闭'), function (card, player, target) {
                                    return player != target;
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].disableSkill('禁闭', lib.character[result.targets[0].name][3]);
                                    result.targets[0].addSkill('禁闭_2');
                                }
                            },
                            subSkill: {
                                1: {
                                    trigger: {
                                        player: 'phaseEnd',
                                    },
                                    forced: true,
                                    silent: true,
                                    content() {
                                        for (var i of game.players) {
                                            i.removeSkill('禁闭_2');
                                            i.enableSkill('禁闭');
                                            delete i.storage.禁闭;
                                        }
                                    },
                                    popup: false,
                                },
                                2: {
                                    mark: true,
                                    forced: true,
                                    intro: {
                                        content: '该角色失去所有技能直到你的回合结束',
                                    },
                                },
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        boss__qiangzheng: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                player: 'phaseJieshuBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return game.hasPlayer(function (current) {
                                    return current != player && current.countCards('h');
                                });
                            },
                            content() {
                                'step 0';
                                var players = get.players(player);
                                players.remove(player);
                                event.players = players;
                                player.line(players, 'green');
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    var hs = current.getCards('h');
                                    if (hs.length) {
                                        var card = hs.randomGet();
                                        player.gain(card, current);
                                        current.$giveAuto(card, player);
                                    }
                                    event.redo();
                                }
                            },
                        },
                        极道: {
                            group: '极道II',
                            mod: {
                                targetEnabled(card, player, target) {
                                    if (card.name == 'lebu') {
                                        return false;
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        矩阵: {
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        神勇: {
                            group: ['精防', '强击'],
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        英杰: {
                            group: ['格挡', '重击'],
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        boss__shenyi: {
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        悟道: {
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        神羽: {
                            mod: {
                                judge(player, result) {
                                    if (_status.event.type == 'phase') {
                                        if (result.bool == false) {
                                            result.bool = null;
                                        } else {
                                            result.bool = false;
                                        }
                                    }
                                },
                                globalTo(from, to, distance) {
                                    return distance + 5;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        boss__shouyi: {
                            mod: {
                                targetInRange() {
                                    return true;
                                },
                            },
                            trigger: {
                                player: 'turnOverBefore',
                            },
                            _priority: 20,
                            forced: true,
                            filter(event, player) {
                                return !player.isTurnedOver();
                            },
                            content() {
                                trigger.cancel();
                                game.log(player, '取消了翻面');
                            },
                            ai: {
                                noturn: true,
                                effect: {
                                    target(card, player, target) {
                                        if (get.type(card) == 'delay') return 0.5;
                                    },
                                },
                            },
                        },
                        boss__nbaonu: {
                            mod: {
                                maxHandcard(player, num) {
                                    return Math.max(num, 3);
                                },
                            },
                            audio: 'ext:神域/audio:1',
                            group: ['boss__nbaonu_sha'],
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: -1,
                            content() {
                                trigger.num = 3 + Math.min(7, Math.max(0, player.hp - 3));
                            },
                            subSkill: {
                                sha: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha' && player.hp < 4) return Infinity;
                                        },
                                    },
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && event.notLink() && player.hp < 4;
                                    },
                                    forced: true,
                                    content() {
                                        trigger.num++;
                                    },
                                },
                            },
                        },
                        劫云: {
                            audio: 'ext:神域/audio:2',
                            group: ['劫云_sha'],
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: -1,
                            content() {
                                trigger.num = 3 + Math.min(7, player.maxHp - player.hp);
                            },
                            subSkill: {
                                sha: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            return Infinity;
                                        },
                                    },
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && event.notLink();
                                    },
                                    content() {
                                        var num = 0;
                                        if (player.hp >= 2) {
                                            num = 1;
                                        }
                                        player.loseHp(num);
                                        trigger.num++;
                                    },
                                },
                            },
                        },
                        boss__nbaonuII: {
                            audio: 'ext:神域/audio:2',
                            group: ['boss__nbaonuII_sha'],
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: -1,
                            content() {
                                trigger.num = 3 + Math.min(7, player.maxHp - player.hp);
                            },
                            subSkill: {
                                sha: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            return Infinity;
                                        },
                                    },
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    filter(event, player) {
                                        return event.card && event.card.name == 'sha' && event.notLink();
                                    },
                                    content() {
                                        var num = 0;
                                        if (player.hp >= 2) {
                                            num = 1;
                                        }
                                        player.loseHp(num);
                                        trigger.num++;
                                    },
                                },
                            },
                        },
                        boss__nbaonuIII: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: -1,
                            content() {
                                trigger.num = 9;
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + 9;
                                },
                            },
                        },
                        boss__nbaonuIV: {
                            audio: 'ext:神域/audio:2',
                            mod: {
                                cardUsable(card, player, num) {
                                    return Infinity;
                                },
                            },
                            trigger: {
                                source: 'damageBegin1',
                            },
                            filter(event, player) {
                                return event.notLink();
                            },
                            content() {
                                player.loseHp();
                                trigger.num++;
                            },
                        },
                        boss__nbaonuV: {
                            audio: 'ext:神域/audio:1',
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'spade') return 'heart';
                                },
                            },
                            trigger: {
                                player: ['useCard', 'respondEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                if (event.card.suit == 'heart') {
                                    return game.hasPlayer(function (current) {
                                        return current.isDamaged();
                                    });
                                }
                                return false;
                            },
                            content() {
                                'step 0';
                                var noneed = trigger.card.name == 'tao' && trigger.targets[0] == player && player.hp == player.maxHp - 1;
                                player
                                    .chooseTarget(get.prompt('boss__nbaonuV'), function (card, player, target) {
                                        return target.hp < target.maxHp;
                                    })
                                    .set('autodelay', true).ai = function (target) {
                                        var num = get.attitude(player, target);
                                        if (num > 0) {
                                            if (noneed && player == target) {
                                                num = 0.5;
                                            } else if (target.hp == 1) {
                                                num += 3;
                                            } else if (target.hp == 2) {
                                                num += 1;
                                            }
                                        }
                                        return num;
                                    };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].recover();
                                }
                            },
                            ai: {
                                expose: 0.3,
                                threaten: 1.5,
                            },
                        },
                        zhfenshi: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'recoverAfter',
                            },
                            forced: true,
                            content() {
                                var num = trigger.num;
                                player.draw(2 * num);
                            },
                        },
                        dclkuangyan: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'recoverAfter',
                            },
                            forced: true,
                            content() {
                                var num = trigger.num;
                                player.draw(2 * num);
                            },
                            group: ['dclkuangyan_kuangyanII', '化雾'],
                            subSkill: {
                                kuangyanII: {
                                    mod: {
                                        maxHandcard(player, num) {
                                            return num - player.hp;
                                        },
                                        globalFrom(from, to, distance) {
                                            return distance - 1;
                                        },
                                    },
                                },
                            },
                        },
                        boss__nbaonuVI: {
                            group: ['boss__nbaonuVI_recover', 'boss__nbaonuVI_equip'],
                            subSkill: {
                                recover: {
                                    audio: 'ext:神域/audio:true',
                                    trigger: {
                                        global: 'recoverAfter',
                                    },
                                    check(event, player) {
                                        return get.attitude(player, event.player) > 0;
                                    },
                                    logTarget: 'player',
                                    content() {
                                        trigger.player.draw();
                                    },
                                },
                                equip: {
                                    audio: 'ext:神域/audio:true',
                                    trigger: {
                                        player: 'loseEnd',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        if (Array.isArray(event.cards))
                                            for (var i of event.cards) {
                                                if (i.original == 'e') return true;
                                            }
                                        return false;
                                    },
                                    content() {
                                        var num = 0;
                                        if (Array.isArray(trigger.cards))
                                            for (var i of trigger.cards) {
                                                if (i.original == 'e') num += 2;
                                            }
                                        player.draw();
                                    },
                                },
                            },
                            ai: {
                                expose: 0.2,
                                threaten: 1.5,
                            },
                        },
                        boss__jingjue: {
                            trigger: {
                                player: 'loseEnd',
                            },
                            forced: true,
                            filter(event, player) {
                                return _status.currentPhase != player && player.hp < player.maxHp;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red' ? 1 : 0;
                                });
                                ('step 1');
                                if (result.color == 'red') {
                                    player.recover();
                                }
                            },
                            ai: {
                                effect: {
                                    target(card) {
                                        if (get.tag(card, 'loseCard')) {
                                            return [0.5, 1];
                                        }
                                    },
                                },
                            },
                        },
                        boss__renxing: {
                            trigger: {
                                global: ['damageEnd', 'recoverEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return _status.currentPhase != player;
                            },
                            content() {
                                player.draw();
                            },
                        },
                        boss__ruizhi: {
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.player != player && (event.player.countCards('h') > 1 || event.player.countCards('e') > 1);
                            },
                            content() {
                                'step 0';
                                player.line(trigger.player, 'green');
                                var next = trigger.player.chooseCard(true, '选择保留一张手牌和一张装备区内的牌,弃置其它牌', 'he', function (card) {
                                    switch (get.position(card)) {
                                        case 'h': {
                                            if (ui.selected.cards.length) {
                                                return get.position(ui.selected.cards[0]) == 'e';
                                            } else {
                                                return trigger.player.countCards('h') > 1;
                                            }
                                        }
                                        case 'e': {
                                            if (ui.selected.cards.length) {
                                                return get.position(ui.selected.cards[0]) == 'h';
                                            } else {
                                                return trigger.player.countCards('e') > 1;
                                            }
                                        }
                                    }
                                });
                                var num = 0;
                                if (trigger.player.countCards('h') > 1) {
                                    num++;
                                }
                                if (trigger.player.countCards('e') > 1) {
                                    num++;
                                }
                                next.selectCard = [num, num];
                                next.ai = function (card) {
                                    return get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    var he = [];
                                    var hs = trigger.player.getCards('h');
                                    var es = trigger.player.getCards('e');
                                    if (hs.length > 1) {
                                        he = he.concat(hs);
                                    }
                                    if (es.length > 1) {
                                        he = he.concat(es);
                                    }
                                    if (Array.isArray(result.cards))
                                        for (var i of result.cards) {
                                            he.remove(i);
                                        }
                                    trigger.player.discard(he);
                                }
                            },
                        },
                        boss__xiongshou: {
                            group: ['boss__xiongshou_turn', 'boss__xiongshou_damage'],
                            subSkill: {
                                damage: {
                                    trigger: {
                                        source: 'damageBegin1',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.notLink() && event.card && event.card.name == 'sha' && event.player.hp < player.hp;
                                    },
                                    content() {
                                        trigger.num++;
                                    },
                                },
                                turn: {
                                    trigger: {
                                        player: 'turnOverBefore',
                                    },
                                    _priority: 20,
                                    forced: true,
                                    filter(event, player) {
                                        return !player.isTurnedOver();
                                    },
                                    content() {
                                        trigger.cancel();
                                        game.log(player, '取消了翻面');
                                    },
                                },
                            },
                            mod: {
                                globalFrom(from, to, distance) {
                                    return distance - 1;
                                },
                            },
                            ai: {
                                noturn: true,
                            },
                        },
                        boss__zhue: {
                            audio: 'ext:神域/audio:true',
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'heart') return 'spade';
                                },
                                aiValue(player, card, num) {
                                    if (card.name != 'wuxie' && get.color(card) != 'black') return;
                                    var cards = player.getCards('hs', function (card) {
                                        return card.name == 'wuxie' || get.color(card) == 'black';
                                    });
                                    cards.sort(function (a, b) {
                                        return (b.name == 'wuxie' ? 1 : 2) - (a.name == 'wuxie' ? 1 : 2);
                                    });
                                    var geti = function () {
                                        if (cards.includes(card)) {
                                            return cards.indexOf(card);
                                        }
                                        return cards.length;
                                    };
                                    if (card.name == 'wuxie') return Math.min(num, [6, 4, 3][Math.min(geti(), 2)]) * 0.6;
                                    return Math.max(num, [6, 4, 3][Math.min(geti(), 2)]);
                                },
                                aiUseful() {
                                    return lib.skill.rekanpo.mod.aiValue.apply(this, arguments);
                                },
                            },
                            position: 'hes',
                            enable: 'chooseToUse',
                            filterCard(card) {
                                return get.color(card) == 'black';
                            },
                            viewAsFilter(player) {
                                return player.countCards('hes', { color: 'black' }) > 0;
                            },
                            viewAs: {
                                name: 'wuxie',
                            },
                            prompt: '将一张黑色牌当无懈可击使用',
                            check(card) {
                                return 8 - get.value(card);
                            },
                            ai: {
                                basic: {
                                    useful: [6, 4, 3],
                                    value: [6, 4, 3],
                                },
                                result: {
                                    player: 1,
                                },
                                expose: 0.2,
                            },
                        },
                        轮回: {
                            audio: '追猎',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            round: 1,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '轮回' && event.player != player;
                            },
                            content() {
                                player.draw(2);
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        曙光: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.draw(player.maxHp - player.hp);
                                player.hp = player.maxHp;
                            },
                        },
                        入侵: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.maxHp - player.hp;
                                },
                            },
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                player.draw(player.maxHp - player.hp);
                                player.hp = player.maxHp;
                            },
                        },
                        boss__modao: {
                            audio: '尸毒',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                            },
                        },
                        boss__moyany: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'loseEnd',
                            },
                            filter(event, player) {
                                return _status.currentPhase != player;
                            },
                            content() {
                                'step 0';
                                player.judge(function (card) {
                                    return get.color(card) == 'red' ? 1 : 0;
                                });
                                ('step 1');
                                if (result.bool) {
                                    player.chooseTarget(true, '选择一个目标对其造成2点火焰伤害', function (card, player, target) {
                                        return player != target;
                                    }).ai = function (target) {
                                        return get.damageEffect(target, player, player, 'fire');
                                    };
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.targets?.length) {
                                    player.line(result.targets, 'fire');
                                    result.targets[0].damage(2, 'fire');
                                }
                            },
                            ai: {
                                effect: {
                                    target(card) {
                                        if (get.tag(card, 'loseCard')) {
                                            return [0.5, 1];
                                        }
                                    },
                                },
                            },
                        },
                        boss__leiji: {
                            trigger: {
                                player: 'judgeEnd',
                            },
                            forced: true,
                            disableReason: ['暴虐', '助祭', '弘仪', '孤影'],
                            filter(event, player) {
                                return !lib.skill.boss__leiji.disableReason.includes(event.judgestr) && ['spade', 'club'].includes(event.result.suit);
                            },
                            content() {
                                'step 0';
                                event.num = 1 + ['club', 'spade'].indexOf(trigger.result.suit);
                                if (event.num == 1) {
                                    player.draw();
                                }
                                player.chooseTarget('雷击:是否对一名角色造成' + event.num + '点雷电伤害？', lib.filter.notMe).ai = function (target) {
                                    var player = _status.event.player;
                                    return get.damageEffect(target, player, player, 'thunder');
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    player.line(result.targets, 'thunder');
                                    result.targets[0].damage(event.num, 'thunder');
                                }
                            },
                        },
                        boss__fengdong: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                game.countPlayer(function (current) {
                                    if (current != player) current.addTempSkill('fengyin');
                                });
                            },
                        },
                        boss__fengdongII: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            content() {
                                game.countPlayer(function (current) {
                                    if (current != player) current.addTempSkill('baiban');
                                });
                            },
                        },
                        boss__juehong: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseZhunbeiBefore',
                            },
                            forced: true,
                            logTarget(event, player) {
                                return player.getEnemies();
                            },
                            content() {
                                'step 0';
                                event.list = player.getEnemies().sortBySeat();
                                ('step 1');
                                if (event.list.length) {
                                    var target = event.list.shift();
                                    if (target.countCards('he')) {
                                        var es = target.getCards('e');
                                        if (es.length) {
                                            target.discard(es);
                                        } else {
                                            player.discardPlayerCard(target, 'h', true);
                                        }
                                    }
                                    event.redo();
                                }
                            },
                        },
                        boss__lianyu: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            content() {
                                'step 0';
                                event.players = get.players(player);
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    if (current.isEnemiesOf(player)) {
                                        player.line(current, 'fire');
                                        current.damage('fire');
                                    }
                                    event.redo();
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        劫火: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            content() {
                                'step 0';
                                event.players = get.players(player);
                                player.draw(2);
                                ('step 1');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    if (current.isEnemiesOf(player)) {
                                        player.line(current, 'fire');
                                        current.damage('fire');
                                    }
                                    event.redo();
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        fengqi: {
                            trigger: {
                                player: ['phaseZhunbeiBegin', 'phaseJieshuBegin'],
                            },
                            forced: true,
                            content() {
                                'step 0';
                                var list = { basic: [], equip: [], trick: [], delay: [] };
                                for (var i = 0; i < lib.inpile.length; i++) {
                                    var name = lib.inpile[i];
                                    var info = lib.card[name];
                                    if (info.autoViewAs || name == 'yuansuhuimie') continue;
                                    if (lib.filter.cardEnabled({ name: name }, player)) {
                                        if (!list[info.type]) {
                                            list[info.type] = [];
                                        }
                                        list[info.type].push([get.translation(lib.card[name].type), '', name]);
                                    }
                                }
                                list.trick.sort(lib.sort.name);
                                var dialog = ui.create.dialog('风起', [list.trick, 'vcard']);
                                var rand1 = Math.random() < 1 / 3;
                                var rand2 = Math.random() < 0.5;
                                var rand3 = Math.random() < 1 / 3;
                                var rand4 = Math.random() < 1 / 3;
                                player.chooseButton(dialog).ai = function (button) {
                                    var name = button.link[2];
                                    if (player.hp <= 1) {
                                        switch (name) {
                                            case 'zhiliaobo':
                                                return 1;
                                            case 'dunpaigedang':
                                                return 0.8;
                                            case 'nanman':
                                                return 0.5;
                                            default:
                                                return 0;
                                        }
                                    }
                                    if (rand4 && player.countCards('h') <= 1) {
                                        switch (name) {
                                            case 'zengbin':
                                                return 1;
                                            case 'wuzhong':
                                                return 0.8;
                                            default:
                                                return 0;
                                        }
                                    }
                                    if (player.hasSkill('qinglonglingzhu')) {
                                        if (rand2) return name == 'chiyuxi' ? 0.8 : 0;
                                        return name == 'jingleishan' ? 0.8 : 0;
                                    }
                                    if (rand2) return name == 'wanjian' ? 0.8 : 0;
                                    return name == 'nanman' ? 0.8 : 0;
                                };
                                ('step 1');
                                if (result.links?.length) {
                                    player.chooseUseTarget({ name: result.links[0][2] }, true, false);
                                }
                            },
                            ai: {
                                threaten: 1.5,
                            },
                        },
                        fengqi2: {
                            mod: {
                                wuxieRespondable() {
                                    return false;
                                },
                            },
                        },
                        boss__biantian4: {
                            trigger: {
                                player: 'dieBegin',
                            },
                            forced: true,
                            popup: false,
                            content() {
                                for (var i of game.players) {
                                    if (i.hasSkill('boss__biantian3')) {
                                        i.removeSkill('boss__biantian3');
                                        i.popup('boss__biantian3');
                                    }
                                    if (i.hasSkill('boss__biantian2')) {
                                        i.removeSkill('boss__biantian2');
                                        i.popup('boss__biantian2');
                                    }
                                }
                            },
                        },
                        boss__biantian: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            audio: 'ext:神域/audio:false',
                            group: 'boss__biantian4',
                            content() {
                                'step 0';
                                for (var i of game.players) {
                                    if (i.hasSkill('boss__biantian3')) {
                                        i.removeSkill('boss__biantian3');
                                        i.popup('boss__biantian3');
                                    }
                                    if (i.hasSkill('boss__biantian2')) {
                                        i.removeSkill('boss__biantian2');
                                        i.popup('boss__biantian2');
                                    }
                                }
                                player.judge(function (card) {
                                    var color = get.color(card);
                                    if (color == 'black') return 1;
                                    if (color == 'red') return 0;
                                    return -1;
                                });
                                ('step 1');
                                var targets = [],
                                    players = game.filterPlayer();
                                if (result.color == 'red') {
                                    game.trySkillAudio('boss__biantianx2');
                                    for (var i of players) {
                                        if (i.isEnemiesOf(player)) {
                                            i.addSkill('boss__biantian3');
                                            i.popup('kuangfeng');
                                            targets.push(i);
                                        }
                                    }
                                } else if (result.color == 'black') {
                                    game.trySkillAudio('boss__biantianx1');
                                    for (var i of players) {
                                        if (i.isFriendsOf(player)) {
                                            i.addSkill('boss__biantian2');
                                            i.popup('dawu');
                                            targets.push(i);
                                        }
                                    }
                                }
                            },
                            ai: {
                                threaten: 1.6,
                            },
                        },
                        boss__biantian2: {
                            audio: 'ext:神域/audio:false',
                            trigger: {
                                player: 'damageBefore',
                            },
                            filter(event, player) {
                                if (event.nature != 'thunder') return true;
                                return false;
                            },
                            forced: true,
                            mark: true,
                            marktext: '雾',
                            intro: {
                                content: '已获得大雾标记',
                            },
                            content() {
                                trigger.cancel();
                            },
                            ai: {
                                nofire: true,
                                nodamage: true,
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'damage') && !get.tag(card, 'thunderDamage')) return [0, 0];
                                    },
                                },
                            },
                        },
                        boss__biantian3: {
                            trigger: {
                                player: 'damageBegin3',
                            },
                            filter(event, player) {
                                if (event.nature == 'fire') return true;
                                return false;
                            },
                            mark: true,
                            marktext: '风',
                            intro: {
                                content: '已获得狂风标记',
                            },
                            forced: true,
                            content() {
                                trigger.num++;
                            },
                            ai: {
                                effect: {
                                    target(card, player, target, current) {
                                        if (get.tag(card, 'fireDamage')) return 1.5;
                                    },
                                },
                            },
                        },
                        boss__fentian: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                source: 'damageBegin1',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.nature != 'fire';
                            },
                            content() {
                                trigger.nature = 'fire';
                            },
                            mod: {
                                cardUsable(card) {
                                    if (get.color(card) == 'red') return Infinity;
                                },
                                targetInRange(card) {
                                    if (get.color(card) == 'red') return true;
                                },
                                wuxieRespondable(card, player, target) {
                                    if (get.color(card) == 'red' && player != target) return false;
                                },
                            },
                            group: 'boss__fentian2',
                        },
                        boss__fentian2: {
                            trigger: {
                                player: 'useCard',
                            },
                            forced: true,
                            filter(event, player) {
                                return get.color(event.card) == 'red';
                            },
                            content() {
                                trigger.directHit.addArray(game.players);
                                trigger.directHit.remove(player);
                            },
                        },
                        boss__tianyun: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBefore',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                event.forceDie = true;
                                player.chooseTarget(get.prompt('boss__tianyun'), function (card, player, target) {
                                    return target.isEnemiesOf(player);
                                }).ai = function (target) {
                                    if (player.hp <= 1) return 0;
                                    if (get.attitude(player, target) > -3) return 0;
                                    var eff = get.damageEffect(target, player, player, 'fire');
                                    if (eff > 0) {
                                        return eff + target.countCards('e') / 2;
                                    }
                                    return 0;
                                };
                                ('step 1');
                                if (result.bool) {
                                    player.damage('fire', 1, 'nocard');
                                    event.target = result.targets[0];
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (event.target) {
                                    event.target.damage(2, 'fire');
                                }
                                ('step 3');
                                if (event.target) {
                                    var es = event.target.getCards('e');
                                    if (es.length) {
                                        event.target.discard(es);
                                    }
                                }
                            },
                            ai: {
                                threaten: 2,
                            },
                        },
                        boss__lingqu: {
                            audio: 'ext:神域/audio:true',
                            init(player) {
                                player.storage.boss__lingqu = 0;
                            },
                            trigger: {
                                player: 'damageEnd',
                            },
                            forced: true,
                            content() {
                                player.draw();
                                player.storage.boss__lingqu++;
                                player.markSkill('boss__lingqu');
                            },
                            intro: {
                                content: '手牌上限+#',
                            },
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.storage.boss__lingqu;
                                },
                            },
                            group: 'boss__lingqu_cancel',
                            subSkill: {
                                cancel: {
                                    trigger: {
                                        player: 'damageBegin4',
                                    },
                                    _priority: -11,
                                    forced: true,
                                    filter(event, player) {
                                        return event.num > 1;
                                    },
                                    content() {
                                        trigger.num = 1;
                                    },
                                },
                            },
                        },
                        boss__lingyu: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'phaseJieshuBegin',
                            },
                            forced: true,
                            content() {
                                player.draw(2);
                                player.recover();
                            },
                            ai: {
                                threaten: 0.5,
                            },
                        },
                        血咒: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            intro: {
                                content(storage, player) {
                                    var name = get.translation(player);
                                    if (storage == 1) {
                                        return '每当一名角色(' + name + '除外)受到一次伤害,该角色失去1点体力,' + name + '回复1点体力';
                                    } else if (storage == 2) {
                                        return '每当一名角色(' + name + '除外)造成一次伤害,该角色失去1点体力,' + name + '(若不是受伤害角色)回复1点体力';
                                    } else {
                                        return '未发动';
                                    }
                                },
                            },
                            content() {
                                'step 0';
                                var next = player.chooseControl('选项一', '选项二', 'cancel2', function () {
                                    if (Math.random() < 0.65) return 0;
                                    return 1;
                                });
                                next.prompt = get.prompt('xuezhou');
                                next.choiceList = ['每当一名其他角色在一个回合中首次受到伤害,该角色失去1点体力,你回复1点体力', '每当一名其他角色在一个回合中首次造成伤害,该角色失去1点体力,你(若不是受伤害角色)回复1点体力'];
                                ('step 1');
                                if (result.control == 'cancel2') {
                                    player.unmarkSkill('xuezhou');
                                    delete _status.xuezhou;
                                } else {
                                    player.storage.xuezhou = result.index + 1;
                                    player.markSkill('xuezhou');
                                    _status.xuezhou = player;
                                }
                            },
                            ai: {
                                threaten: 2.5,
                            },
                            global: 'xuezhou_hp',
                        },
                        幻术: {
                            enable: 'phaseUse',
                            usable: 1,
                            audio: 'ext:神域/audio:2',
                            filter(event, player) {
                                var hs = player.getCards('h');
                                if (!hs.length) return false;
                                for (var i = 0; i < hs.length; i++) {
                                    var mod2 = game.checkMod(hs[i], player, 'unchanged', 'cardEnabled2', player);
                                    if (mod2 === false) return false;
                                }
                                return true;
                            },
                            chooseButton: {
                                dialog(player) {
                                    var list = [];
                                    for (var i = 0; i < lib.inpile.length; i++) {
                                        if (get.type(lib.inpile[i]) == 'trick') list.push(['锦囊', '', lib.inpile[i]]);
                                    }
                                    return ui.create.dialog(get.translation('幻术'), [list, 'vcard']);
                                },
                                filter(button, player) {
                                    return lib.filter.filterCard({ name: button.link[2] }, player, _status.event.parent);
                                },
                                check(button) {
                                    var player = _status.event.player;
                                    var recover = 0,
                                        lose = 1,
                                        players = game.filterPlayer();
                                    for (var i of players) {
                                        if (i.hp == 1 && get.damageEffect(i, player, player) > 0 && !i.hasSha()) {
                                            return button.link[2] == 'juedou' ? 2 : -1;
                                        }
                                        if (!i.isOut()) {
                                            if (i.hp < i.maxHp) {
                                                if (get.attitude(player, i) > 0) {
                                                    if (i.hp < 2) {
                                                        lose--;
                                                        recover += 0.5;
                                                    }
                                                    lose--;
                                                    recover++;
                                                } else if (get.attitude(player, i) < 0) {
                                                    if (i.hp < 2) {
                                                        lose++;
                                                        recover -= 0.5;
                                                    }
                                                    lose++;
                                                    recover--;
                                                }
                                            } else {
                                                if (get.attitude(player, i) > 0) {
                                                    lose--;
                                                } else if (get.attitude(player, i) < 0) {
                                                    lose++;
                                                }
                                            }
                                        }
                                    }
                                    if (lose > recover && lose > 0) return button.link[2] == 'nanman' ? 1 : -1;
                                    if (lose < recover && recover > 0) return button.link[2] == 'taoyuan' ? 1 : -1;
                                    return button.link[2] == 'wuzhong' ? 1 : -1;
                                },
                                backup(links, player) {
                                    return {
                                        filterCard: true,
                                        selectCard: -1,
                                        position: 'h',
                                        audio: 'ext:神域/audio:1',
                                        popname: true,
                                        viewAs: { name: links[0][2] },
                                    };
                                },
                                prompt(links, player) {
                                    return '将全部手牌当作' + get.translation(links[0][2]) + '使用';
                                },
                            },
                            ai: {
                                order: 1,
                                result: {
                                    player(player) {
                                        var num = 0;
                                        var cards = player.getCards('h');
                                        if (cards.length >= 3 && player.hp >= 3) return 0;
                                        if (Array.isArray(cards))
                                            for (var i of cards) {
                                                num += Math.max(0, get.value(i, player, 'raw'));
                                            }
                                        num /= cards.length;
                                        num *= Math.min(cards.length, player.hp);
                                        return 12 - num;
                                    },
                                },
                                threaten: 1.6,
                            },
                        },
                        龙佑II: {
                            trigger: {
                                player: 'dieBefore',
                            },
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            forced: true,
                            silent: true,
                            fixed: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.recover(1 - player.hp);
                            },
                            popup: false,
                        },
                        尸玉IV: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'dieBefore',
                            },
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            forced: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.hp = player.maxHp;
                            },
                            popup: false,
                        },
                        不朽: {
                            group: ['不朽II'],
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'dieBefore',
                            },
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            forced: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.recover(1 - player.hp);
                            },
                            popup: false,
                        },
                        火盾II: {
                            mod: {
                                maxHandcard(player, num) {
                                    return num + 2 * player.hujia;
                                },
                            },
                        },
                        心毒: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseTarget(get.prompt('心毒'), function (card, player, target) {
                                    return target.isEnemiesOf(player) && !target.isMad();
                                }).ai = function (target) {
                                    return get.damageEffect(target, player, player);
                                };
                                ('step 1');
                                if (result.targets?.length) {
                                    result.targets[0].goMad({ player: 'phaseAfter' });
                                }
                            },
                            ai: {
                                threaten: 1.7,
                            },
                        },
                        龙魂II: {
                            trigger: {
                                player: 'dieBefore',
                            },
                            filter(event, player) {
                                return player.countDisabled() < 1;
                            },
                            forced: true,
                            silent: true,
                            fixed: true,
                            content() {
                                'step 0';
                                player.disableEquip('equip1');
                                player.disableEquip('equip2');
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                player.disableEquip('equip5');
                                player.recover(1 - player.hp);
                                player.phaseUse();
                                ('step 1');
                                const evt = _status.event.getParent('phase');
                                if (evt && evt.name) {
                                    evt.finish();
                                }
                            },
                            popup: false,
                        },
                        残躯: {
                            group: ['追猎'],
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'dieBefore',
                            },
                            filter(event, player) {
                                return player.hasEnabledSlot(3) || player.hasEnabledSlot(4);
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.removeSkill('musical_T800');
                                game.broadcastAll() + player.node.avatar.setBackgroundImage('extension/神域/image/终结者战损版.jpg');
                                var path = 'extension/神域/audio/bg_robot2.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                                player.disableEquip('equip3');
                                player.disableEquip('equip4');
                                ('step 1');
                                player.recover(1 - player.hp);
                                ('step 2');
                                player.maxHp = player.hp;
                                player.changeHujia(2);
                                player.draw(3);
                                player.phaseUse();
                                ('step 3');
                                const evt = _status.event.getParent('phase');
                                if (evt && evt.name) {
                                    evt.finish();
                                }
                            },
                        },
                        musical_alien: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_alien');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_alien.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_akemihomura: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_akemihomura');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_akemihomura.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_jcp: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_jcp');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_jinchipeng.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_ylong: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_ylong');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_ylong.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_gdyh: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_gdyh');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_gdyh.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_wll: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_wll');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_wll.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_jsl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_jsl');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_jsl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_lyl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_lyl');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_lyl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dragon_hhl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dragon_hhl');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_dragon_hhl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_jtxn: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_jtxn');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_jtxn.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_swns: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_swns');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_swns.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_sgz: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_sgz');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_sgz.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dclI: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dclI');
                                ('step 1');
                                player.removeSkill('musical_dclI');
                                var path = 'extension/神域/audio/bg_dclI.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dcl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dcl');
                                ('step 1');
                                ui.background.setBackgroundImage('extension/神域/image/血色古堡.jpg');
                                player.say('狩猎开始!');
                                var path = 'extension/神域/audio/bg_dcl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_bfrbt: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_bfrbt');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_bfrbt.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_lvthan: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_lvthan');
                                ('step 1');
                                player.removeSkill('musical_lvthan');
                                var path = 'extension/神域/audio/bg_lvthan.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_kingcrab: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_kingcrab');
                                ('step 1');
                                player.removeSkill('musical_kingcrab');
                                var path = 'extension/神域/audio/bg_kingcrab.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_csm: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_csm');
                                ('step 1');
                                player.removeSkill('musical_csm');
                                var path = 'extension/神域/audio/bg_csm.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_zelda: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_zelda');
                                ('step 1');
                                player.removeSkill('musical_zelda');
                                var path = 'extension/神域/audio/bg_zelda.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_gdan: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_gdan');
                                ('step 1');
                                player.removeSkill('musical_gdan');
                                var path = 'extension/神域/audio/bg_gdan.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_stnl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_stnl');
                                ('step 1');
                                player.removeSkill('musical_stnl');
                                var path = 'extension/神域/audio/bg_stnl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_kirov: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_kirov');
                                ('step 1');
                                player.removeSkill('musical_kirov');
                                var path = 'extension/神域/audio/bg_kirov.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ttj: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ttj');
                                ('step 1');
                                player.removeSkill('musical_ttj');
                                var path = 'extension/神域/audio/bg_ttj.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_doom: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_doom');
                                ('step 1');
                                player.removeSkill('musical_doom');
                                var path = 'extension/神域/audio/bg_doom.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_apoc: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_apoc');
                                ('step 1');
                                player.removeSkill('musical_apoc');
                                var path = 'extension/神域/audio/bg_apoc.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_exec: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_exec');
                                ('step 1');
                                player.removeSkill('musical_exec');
                                var path = 'extension/神域/audio/bg_exec.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_vlt: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_vlt');
                                ('step 1');
                                player.removeSkill('musical_vlt');
                                var path = 'extension/神域/audio/bg_vlt.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_alg: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_alg');
                                ('step 1');
                                player.removeSkill('musical_alg');
                                var path = 'extension/神域/audio/bg_alg.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_nemesis: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_nemesis');
                                ('step 1');
                                player.removeSkill('musical_nemesis');
                                var path = 'extension/神域/audio/bg_nemesis.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ac130: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ac130');
                                ('step 1');
                                player.removeSkill('musical_ac130');
                                var path = 'extension/神域/audio/bg_ac130.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_anh: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_anh');
                                ('step 1');
                                player.removeSkill('musical_anh');
                                var path = 'extension/神域/audio/bg_anh.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_krts: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_krts');
                                ('step 1');
                                player.removeSkill('musical_krts');
                                var path = 'extension/神域/audio/bg_krts.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_enmaai: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_enmaai');
                                ('step 1');
                                player.removeSkill('musical_enmaai');
                                var path = 'extension/神域/audio/bg_enmaai.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_devil: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_devil');
                                ('step 1');
                                player.removeSkill('musical_devil');
                                var path = 'extension/神域/audio/bg_devil.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_agl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_agl');
                                ('step 1');
                                player.removeSkill('musical_agl');
                                var path = 'extension/神域/audio/bg_agl.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_Fenrir: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_Fenrir');
                                ('step 1');
                                player.removeSkill('musical_Fenrir');
                                var path = 'extension/神域/audio/bg_Fenrir.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_apple: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_apple');
                                ('step 1');
                                player.removeSkill('musical_apple');
                                var path = 'extension/神域/audio/bg_apple.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_hunterkiller: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_hunterkiller');
                                ('step 1');
                                player.removeSkill('musical_hunterkiller');
                                var path = 'extension/神域/audio/bg_hunterkiller.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_deviltrigger: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_deviltrigger');
                                ('step 1');
                                player.removeSkill('musical_deviltrigger');
                                var path = 'extension/神域/audio/bg_deviltrigger.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ghost: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ghost');
                                ('step 1');
                                player.removeSkill('musical_ghost');
                                var path = 'extension/神域/audio/bg_ghost.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_majima: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_majima');
                                ('step 1');
                                player.removeSkill('musical_majima');
                                var path = 'extension/神域/audio/bg_majima.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ywt: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ywt');
                                ('step 1');
                                player.removeSkill('musical_ywt');
                                var path = 'extension/神域/audio/bg_ywt.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dgb: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dgb');
                                ('step 1');
                                player.removeSkill('musical_dgb');
                                var path = 'extension/神域/audio/bg_dgb.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_mechag: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_mechag');
                                ('step 1');
                                player.removeSkill('musical_mechag');
                                var path = 'extension/神域/audio/bg_mechag.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_danger: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_danger');
                                ('step 1');
                                player.removeSkill('musical_danger');
                                var path = 'extension/神域/audio/bg_danger.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_KiryuKazuma: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_KiryuKazuma');
                                ('step 1');
                                player.removeSkill('musical_KiryuKazuma');
                                var path = 'extension/神域/audio/bg_KiryuKazuma.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_esdeath: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_esdeath');
                                ('step 1');
                                player.removeSkill('musical_esdeath');
                                var path = 'extension/神域/audio/bg_esdeath.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_harpy: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_harpy');
                                ('step 1');
                                player.removeSkill('musical_harpy');
                                var path = 'extension/神域/audio/bg_harpy.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_durge: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_durge');
                                ('step 1');
                                player.removeSkill('musical_durge');
                                var path = 'extension/神域/audio/bg_durge.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_reimu: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_reimu');
                                ('step 1');
                                player.removeSkill('musical_reimu');
                                var path = 'extension/神域/audio/bg_reimu.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_cyborg: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_cyborg');
                                ('step 1');
                                player.removeSkill('musical_cyborg');
                                var path = 'extension/神域/audio/bg_cyborg.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_hacker: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_hacker');
                                ('step 1');
                                player.removeSkill('musical_hacker');
                                var path = 'extension/神域/audio/bg_hacker.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_wugengji: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_wugengji');
                                ('step 1');
                                player.removeSkill('musical_wugengji');
                                var path = 'extension/神域/audio/bg_wugengji.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_trt: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_trt');
                                ('step 1');
                                player.removeSkill('musical_trt');
                                var path = 'extension/神域/audio/bg_trt.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_bowser: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_bowser');
                                ('step 1');
                                player.removeSkill('musical_bowser');
                                var path = 'extension/神域/audio/bg_bowser.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_wargm: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_wargm');
                                ('step 1');
                                player.removeSkill('musical_wargm');
                                var path = 'extension/神域/audio/bg_wargm.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_lvbu: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_lvbu');
                                ('step 1');
                                player.removeSkill('musical_lvbu');
                                var path = 'extension/神域/audio/bg_lvbu.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_aylin: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_aylin');
                                ('step 1');
                                player.removeSkill('musical_aylin');
                                var path = 'extension/神域/audio/bg_aylin.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_horde: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_horde');
                                ('step 1');
                                player.removeSkill('musical_horde');
                                var path = 'extension/神域/audio/bg_horde.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_dk: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_dk');
                                ('step 1');
                                player.removeSkill('musical_dk');
                                var path = 'extension/神域/audio/bg_dk.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_wukong: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_wukong');
                                ('step 1');
                                player.removeSkill('musical_wukong');
                                var path = 'extension/神域/audio/bg_wukong.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_spider: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_spider');
                                ('step 1');
                                player.removeSkill('musical_spider');
                                var path = 'extension/神域/audio/bg_spider.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_lber: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_lber');
                                ('step 1');
                                player.removeSkill('musical_lber');
                                var path = 'extension/神域/audio/bg_lber.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_mipha: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_mipha');
                                ('step 1');
                                player.removeSkill('musical_mipha');
                                var path = 'extension/神域/audio/bg_mipha.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_urbz: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_urbz');
                                ('step 1');
                                player.removeSkill('musical_urbz');
                                var path = 'extension/神域/audio/bg_urbz.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_darker: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_darker');
                                ('step 1');
                                player.removeSkill('musical_darker');
                                var path = 'extension/神域/audio/bg_darker.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_link: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_link');
                                ('step 1');
                                player.removeSkill('musical_link');
                                var path = 'extension/神域/audio/bg_link.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ganon: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ganon');
                                ('step 1');
                                player.removeSkill('musical_ganon');
                                var path = 'extension/神域/audio/bg_ganon.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_tdrbot: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_tdrbot');
                                ('step 1');
                                player.removeSkill('musical_tdrbot');
                                var path = 'extension/神域/audio/bg_tdrbot.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_beimjq: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_beimjq');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_beimjq.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_nshou: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_nshou');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_nianshou.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_T800: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_T800');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_robot.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_xt: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_xt');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_xt.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_xshou: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_xshou');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_xshou.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ymdd: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ymdd');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_ymdd.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        musical_ctl: {
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            juexingji: true,
                            filter(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                player.awakenSkill('musical_ctl');
                                ('step 1');
                                var path = 'extension/神域/audio/bg_cthulu.mp3';
                                ui.backgroundMusic.src = path;
                                ui.backgroundMusic.addEventListener('ended', function () {
                                    ui.backgroundMusic.src = path;
                                });
                            },
                        },
                        boss__tiandao: {
                            audio: 'ext:神域/audio:true',
                            trigger: { global: 'judge' },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('he') > 0;
                            },
                            content() {
                                'step 0';
                                player.chooseCard(get.translation(trigger.player) + '的' + (trigger.judgestr || '') + '判定为' + get.translation(trigger.player.judging[0]) + ',' + get.prompt('boss__tiandao'), 'he').ai = function (card) {
                                    var trigger = _status.event.parent._trigger;
                                    var player = _status.event.player;
                                    var result = trigger.judge(card) - trigger.judge(trigger.player.judging[0]);
                                    var attitude = get.attitude(player, trigger.player);
                                    if (attitude == 0 || result == 0) return 0;
                                    if (attitude > 0) {
                                        return result;
                                    } else {
                                        return -result;
                                    }
                                };
                                ('step 1');
                                if (result.cards?.length) {
                                    player.respond(result.cards, 'highlight');
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.bool) {
                                    player.$gain2(trigger.player.judging[0]);
                                    player.gain(trigger.player.judging[0]);
                                    trigger.player.judging[0] = result.cards[0];
                                    trigger.position.appendChild(result.cards[0]);
                                    game.log(trigger.player, '的判定牌改为', result.cards[0]);
                                }
                                ('step 3');
                            },
                            ai: {
                                tag: {
                                    rejudge: 1,
                                },
                                threaten: 1.5,
                            },
                        },
                        金身: {
                            audio: 'ext:神域/audio:1',
                            mod: {
                                maxHandcard(player, num) {
                                    return num + player.maxHp - player.hp;
                                },
                            },
                            trigger: {
                                player: 'damageBegin4',
                            },
                            filter(event, player) {
                                return event.nature != 'fire' && event.nature != 'thunder';
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.chooseBool('〖金身〗:是否防止该伤害？').set('ai', function (target) {
                                    if (player.hp <= trigger.num && player.countCards('hs', { name: 'tao' }) < 1 && player.countCards('hs', { name: 'jiu' }) < 1) return true;
                                    return false;
                                });
                                ('step 1');
                                if (result.bool) {
                                    trigger.cancel();
                                    event.finish();
                                }
                                ('step 2');
                                var num = trigger.num;
                                player.draw(2 * num);
                            },
                            ai: {
                                maihp: true,
                                nodamage: true,
                            },
                        },
                        潜伏: {
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'loseEnd',
                            },
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.original == 'h') return true;
                                    }
                                return false;
                            },
                            content() {
                                player.tempHide();
                            },
                            ai: {
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh') {
                                        if (player.countCards('h') != 1) return false;
                                    }
                                },
                            },
                        },
                        化雾: {
                            audio: 'ext:神域/audio:true',
                            trigger: {
                                player: 'loseEnd',
                            },
                            filter(event, player) {
                                if (player.countCards('h')) return false;
                                if (Array.isArray(event.cards))
                                    for (var i of event.cards) {
                                        if (i.original == 'h') return true;
                                    }
                                return false;
                            },
                            content() {
                                player.tempHide();
                            },
                            ai: {
                                noh: true,
                                skillTagFilter(player, tag) {
                                    if (tag == 'noh') {
                                        if (player.countCards('h') != 1) return false;
                                    }
                                },
                            },
                        },
                        dclkuangguII: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            check(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                event.num = Math.min(trigger.num, 9);
                                ('step 1');
                                event.num--;
                                player.draw();
                                ('step 2');
                                var res = get.recoverEffect(player, player, player);
                                if (player.isDamaged())
                                    player
                                        .chooseToDiscard('〖狂骨〗:是否弃置一张手牌回复1点体力？', 1, 'h')
                                        .set('ai', function (card) {
                                            if (get.tag(card, 'damage')) return -1;
                                            return 1;
                                        })
                                        .set('res', res);
                                ('step 3');
                                if (result.bool) player.recover();
                                if (event.num > 0) {
                                    player.chooseBool(get.prompt2('dclkuangguII')).ai = function (event, player) {
                                        return true;
                                    };
                                } else event.finish();
                                ('step 4');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                        },
                        dclkuanggu: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                source: 'damageSource',
                            },
                            filter(event, player) {
                                return event.num > 0;
                            },
                            check(event, player) {
                                return true;
                            },
                            content() {
                                'step 0';
                                event.num = Math.min(trigger.num, 9);
                                ('step 1');
                                event.num--;
                                player.draw();
                                ('step 2');
                                var res = get.recoverEffect(player, player, player);
                                if (player.isDamaged())
                                    player
                                        .chooseToDiscard('〖狂骨〗:是否弃置一张手牌回复1点体力？', 1, 'h')
                                        .set('ai', function (card) {
                                            if (get.tag(card, 'damage')) return -1;
                                            return 1;
                                        })
                                        .set('res', res);
                                ('step 3');
                                if (result.bool) player.recover();
                                if (event.num > 0) {
                                    player.chooseBool(get.prompt2('dclkuanggu')).ai = function (event, player) {
                                        return true;
                                    };
                                } else event.finish();
                                ('step 4');
                                if (result.bool) {
                                    event.goto(1);
                                }
                            },
                        },
                        武煌: {
                            audio: 'ext:神域/audio:2',
                            mod: {
                                selectTarget(card, player, range) {
                                    if (card.name == 'juedou') range[1] += 2;
                                    if (card.name == 'sha') range[1] += 2;
                                },
                            },
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return !event.directHit;
                            },
                            _priority: -1,
                            content() {
                                if (typeof trigger.shanRequired == 'number') {
                                    trigger.shanRequired++;
                                } else {
                                    trigger.shanRequired = 2;
                                }
                            },
                            group: '武煌_juedou',
                            subSkill: {
                                juedou: {
                                    audio: 'ext:神域/audio:2',
                                    trigger: {
                                        player: 'juedou',
                                        target: 'juedou',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return event.turn != player;
                                    },
                                    _priority: -1,
                                    content() {
                                        'step 0';
                                        var next = trigger.turn.chooseToRespond({ name: 'sha' }, '请打出一张杀响应决斗');
                                        next.set('prompt2', '(共需打出2张杀)');
                                        next.autochoose = lib.filter.autoRespondSha;
                                        next.set('ai', function (card) {
                                            var player = _status.event.player;
                                            var trigger = _status.event.getTrigger();
                                            if (get.attitude(trigger.turn, player) < 0 && trigger.turn.countCards('h', 'sha') > 1) {
                                                return get.unuseful2(card);
                                            }
                                            return -1;
                                        });
                                        ('step 1');
                                        if (result.bool == false) {
                                            trigger.directHit = true;
                                        }
                                    },
                                    ai: {
                                        result: {
                                            target(card, player, target) {
                                                if (card.name == 'juedou' && target.countCards('h') > 0) return [1, 0, 0, -1];
                                            },
                                        },
                                    },
                                },
                            },
                        },
                        武羲: {
                            audio: 'ext:神域/audio:2',
                            trigger: {
                                source: 'damageAfter',
                            },
                            forced: true,
                            _priority: -1,
                            filter(event, player) {
                                if (event._notrigger.includes(event.player)) return false;
                                return event.card && event.card.name == 'sha' && event.player.isAlive() && event.player.countGainableCards(player, 'he') > 0;
                            },
                            content() {
                                'step 0';
                                player
                                    .gainPlayerCard(get.prompt2('武羲', trigger.player), trigger.player, 'he', [1, 2], 'visibleMove')
                                    .set('ai', function (button) {
                                        var player = _status.event.player;
                                        var evt = _status.event.target;
                                        if (get.type(button.link) == 'equip') {
                                            if (
                                                get.attitude(player, evt) > 0 &&
                                                game.hasPlayer(function (current) {
                                                    return player.canUse({ name: 'juedou' }, current) && current != evt.target && get.effect(current, { name: 'juedou' }, player, player) > 2;
                                                })
                                            ) {
                                                return 5;
                                            } else if (
                                                game.hasPlayer(function (current) {
                                                    return player.canUse({ name: 'juedou' }, current) && current != evt && current != player && get.effect(current, { name: 'juedou' }, player, player) < 0;
                                                })
                                            ) {
                                                return 1;
                                            } else return 4;
                                        }
                                        return 3;
                                    })
                                    ('step 1');
                                if (result.cards?.length) {
                                    if (get.type(result.cards[0]) == 'equip' && get.type(result.cards[1]) == 'equip') {
                                        player.loseHp();
                                    }
                                    if (get.type(result.cards[0]) == 'basic' && get.type(result.cards[1]) == 'basic') {
                                        player.lose(result.cards[0], ui.special2);
                                        player.lose(result.cards[1], ui.special2);
                                        player.gain(game.createCard('juedou'), 'gain2');
                                    }
                                } else {
                                    event.finish();
                                }
                                ('step 2');
                                if (result.cards?.length) {
                                    if (result.cards.length == 2) {
                                        trigger.player.draw();
                                    }
                                }
                            },
                            ai: {
                                halfneg: true,
                            },
                        },
                        天武: {
                            audio: 'ext:神域/audio:2',
                            marktext: '武',
                            intro: {
                                content: 'mark',
                            },
                            init(player) {
                                player.storage.天武 = 0;
                            },
                            trigger: {
                                source: 'damageEnd',
                                player: ['damageEnd', 'loseHpEnd'],
                            },
                            forced: true,
                            filter(event, player) {
                                return event.num > 0;
                            },
                            content() {
                                player.storage.天武 += trigger.num;
                                player.markSkill('天武');
                            },
                            ai: {
                                combo: 'shenfen',
                                maixie: true,
                                maixie_hp: true,
                            },
                            group: ['天武_draw', '天武_sha'],
                            subSkill: {
                                draw: {
                                    trigger: {
                                        player: 'phaseDrawBegin',
                                    },
                                    forced: true,
                                    filter(event, player) {
                                        return player.storage.天武 > 0;
                                    },
                                    content() {
                                        player.gain(game.createCard('sha'), 'gain2');
                                    },
                                },
                                sha: {
                                    mod: {
                                        cardUsable(card, player, num) {
                                            if (card.name == 'sha') return (num += player.storage.天武);
                                        },
                                    },
                                },
                            },
                        },
                        幻爆: {
                            audio: 'ext:神域/audio:2',
                            enable: 'phaseUse',
                            usable: 1,
                            filter(event, player) {
                                return player.storage.天武 >= 6;
                            },
                            juexingji: true,
                            content() {
                                'step 0';
                                player.storage.天武 -= 6;
                                ('step 1');
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                event.targets2 = event.targets.slice(0);
                                player.line(event.targets, 'green');
                                ('step 2');
                                if (event.targets2.length) {
                                    var cur = event.targets2.shift();
                                    if (cur) {
                                        cur.chooseToDiscard('e', Infinity, true);
                                        cur.chooseToDiscard('h', true, 4).set('ai', function (card) {
                                            return 6 - get.useful(card);
                                        });
                                        cur.damage(true, player);
                                    }
                                    event.redo();
                                }
                                ('step 3');
                                var cards = [];
                                for (var i = 0; i < player.getDamagedHp(); i++) {
                                    cards.push(game.createCard('sha'));
                                }
                                player.gain(cards, 'gain2');
                            },
                            ai: {
                                combo: '天武',
                                order: 10,
                                result: {
                                    player(player) {
                                        return game.countPlayer(function (current) {
                                            if (current != player) {
                                                return get.sgn(get.damageEffect(current, player, player));
                                            }
                                        });
                                    },
                                },
                            },
                        },
                        殉爆: {
                            global: '殉爆2',
                        },
                        殉爆2: {
                            trigger: { global: 'dieAfter' },
                            forced: true,
                            filter(event, player) {
                                return event.player.hasSkill('殉爆') && event.player.isDead();
                            },
                            content() {
                                trigger.player.line(player, 'fire');
                                player.damage('nosource', 'fire').animate = false;
                                player.$damage(trigger.player);
                                player.$damagepop(-1, 'fire');
                                if (lib.config.animation && !lib.config.low_performance) {
                                    player.$fire();
                                }
                                if (!event.parent.parent.殉爆_logv) {
                                    event.parent.parent.殉爆_logv = true;
                                    game.logv(trigger.player, '殉爆', game.filterPlayer(), event.parent.parent);
                                }
                            },
                        },
                        光刃: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'useCardToPlayered',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && event.isFirstTarget;
                            },
                            content() {
                                'step 0';
                                player
                                    .chooseButton([
                                        get.prompt('光刃'),
                                        [
                                            [
                                                ['draw', '摸一张牌'],
                                                ['discard', '弃置' + (trigger.targets.length == 1 ? get.translation(trigger.targets[0]) : '一名目标角色') + '的一张牌'],
                                            ],
                                            'textbutton',
                                        ],
                                    ])
                                    .set('filterButton', (button) => {
                                        if (
                                            button.link == 'discard' &&
                                            _status.event.getTrigger().targets.every((target) => {
                                                return target.countDiscardableCards(_status.event.player, 'he') == 0;
                                            })
                                        )
                                            return false;
                                        return true;
                                    })
                                    .set('ai', function (button) {
                                        if (
                                            button.link == 'discard' &&
                                            _status.event.getTrigger().targets.every((target) => {
                                                return get.effect(target, { name: 'guohe_copy2' }, _status.event.player) <= 0;
                                            })
                                        )
                                            return 0;
                                        return 1;
                                    })
                                    .set('selectButton', [1, 2]);
                                ('step 1');
                                if (result.links?.length) {
                                    var choices = result.links;
                                    event.choices = choices;
                                    if (choices.includes('draw')) {
                                        game.log(player, '选择了', '#y选项一');
                                        player.draw();
                                    }
                                    if (choices.includes('discard')) {
                                        game.log(player, '选择了', '#y选项二');
                                        if (trigger.targets.length == 1) event.directtarget = trigger.targets[0];
                                        else
                                            player
                                                .chooseTarget('光刃:弃置一名目标角色的一张牌', true, (card, player, target) => {
                                                    return _status.event.getTrigger().targets.includes(target) && target.countDiscardableCards(player, 'he') > 0;
                                                })
                                                .set('ai', (target) => {
                                                    return get.effect(target, { name: 'guohe_copy2' }, _status.event.player);
                                                });
                                    } else event.finish();
                                    if (choices.length >= 2) {
                                        player.addTempSkill('光刃_conseq');
                                        player.markAuto('光刃_conseq', [trigger.card]);
                                    }
                                } else event.finish();
                                ('step 2');
                                player.discardPlayerCard(event.directtarget || result.targets[0], true, 'he').boolline = true;
                            },
                            subSkill: {
                                conseq: {
                                    trigger: {
                                        global: ['shaMiss', 'useCardToExcluded', 'eventNeutralized', 'shaCancelled'],
                                    },
                                    forced: true,
                                    popup: false,
                                    charlotte: true,
                                    filter(event, player, name) {
                                        if (!event.card) return false;
                                        var cards = player.getStorage('光刃_conseq');
                                        if (!cards.includes(event.card)) return false;
                                        return true;
                                    },
                                    content() {
                                        trigger.target.discardPlayerCard(player, true, 'he').boolline = true;
                                    },
                                    sourceSkill: '光刃',
                                },
                            },
                        },
                        尸玉III: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            round: 1,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '尸玉III' && event.player != player;
                            },
                            content() {
                                player.draw();
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        精锐: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '精锐';
                            },
                            content() {
                                player.draw();
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        追猎: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '追猎';
                            },
                            content() {
                                player.draw();
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        旋转: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseAfter',
                            },
                            forced: true,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '旋转';
                            },
                            content() {
                                player.draw();
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        格挡: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h', { color: 'red' }) > 0;
                            },
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard(get.prompt('格挡', trigger.player), {
                                    color: 'red',
                                });
                                next.ai = function (card) {
                                    return 7 - get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num--;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        神忌: {
                            round: 1,
                            audio: '格挡',
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw(2);
                                var next = player.chooseToDiscard(get.prompt('神忌', trigger.player), {
                                    color: 'red',
                                });
                                next.ai = function (card) {
                                    return 7 - get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num--;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        精防: {
                            audio: '格挡',
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            _priority: 3,
                            content() {
                                'step 0';
                                player.draw();
                                var next = player.chooseToDiscard(get.prompt('精防', trigger.player), {
                                    color: 'red',
                                });
                                next.ai = function (card) {
                                    return 7 - get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num--;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        反导: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw();
                                var next = player.chooseToDiscard(get.prompt('反导', trigger.player), {
                                    color: 'red',
                                });
                                next.ai = function (card) {
                                    return 7 - get.value(card);
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num--;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        皇祸: {
                            round: 1,
                            audio: '重击',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw(2);
                                var next = player.chooseToDiscard(get.prompt('皇祸', trigger.player), {
                                    color: 'black',
                                });
                                next.ai = function (card) {
                                    if (get.attitude(player, trigger.player) < 0) {
                                        return 7 - get.value(card);
                                    }
                                    return -1;
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num++;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        强击: {
                            audio: '重击',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw();
                                var next = player.chooseToDiscard(get.prompt('强击', trigger.player), {
                                    color: 'black',
                                });
                                next.ai = function (card) {
                                    if (get.attitude(player, trigger.player) < 0) {
                                        return 7 - get.value(card);
                                    }
                                    return -1;
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num++;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        重击: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                return player.countCards('h', { color: 'black' }) > 0;
                            },
                            content() {
                                'step 0';
                                var next = player.chooseToDiscard(get.prompt('重击', trigger.player), {
                                    color: 'black',
                                });
                                next.ai = function (card) {
                                    if (get.attitude(player, trigger.player) < 0) {
                                        return 7 - get.value(card);
                                    }
                                    return -1;
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num++;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        飞弹: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                source: 'damageBegin',
                            },
                            forced: true,
                            content() {
                                'step 0';
                                player.draw();
                                var next = player.chooseToDiscard(get.prompt('飞弹', trigger.player), {
                                    color: 'black',
                                });
                                next.ai = function (card) {
                                    if (get.attitude(player, trigger.player) < 0) {
                                        return 7 - get.value(card);
                                    }
                                    return -1;
                                };
                                ('step 1');
                                if (result.bool) {
                                    trigger.num++;
                                }
                            },
                            ai: {
                                threaten: 1.3,
                            },
                        },
                        algyingzi: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            forced: true,
                            filter(event, player) {
                                return !event.numFixed;
                            },
                            content() {
                                trigger.num++;
                            },
                            ai: {
                                threaten: 1.5,
                            },
                            mod: {
                                maxHandcardBase(player, num) {
                                    return num + player.maxHp - player.hp;
                                },
                            },
                        },
                        强固: {
                            trigger: {
                                target: 'useCardToBefore',
                            },
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha';
                            },
                            content() {
                                'step 0';
                                var eff;
                                eff = get.effect(player, trigger.card, trigger.player, trigger.player);
                                trigger.player
                                    .chooseToDiscard('强固:弃置一张基本牌,否则杀对' + get.translation(player) + '无效', function (card) {
                                        return get.type(card) == 'basic';
                                    })
                                    .set('ai', function (card) {
                                        if (_status.event.eff > 0) {
                                            return 10 - get.value(card);
                                        }
                                        return 0;
                                    })
                                    .set('eff', eff);
                                ('step 1');
                                if (result.bool == false) {
                                    trigger.cancel();
                                }
                            },
                            ai: {
                                effect: {
                                    target_use(card, player, target, current) {
                                        if (card.name == 'sha') {
                                            if (_status.event.name == '强固') return;
                                            if (get.attitude(player, target) > 0) return;
                                            var bs = player.getCards('h', { type: 'basic' });
                                            if (bs.length < 2) return 0;
                                            if (player.hasSkill('jiu') || player.hasSkill('tianxianjiu')) return;
                                            if (bs.length <= 3 && player.countCards('h', 'sha') <= 1) {
                                                for (var i = 0; i < bs.length; i++) {
                                                    if (bs[i].name != 'sha' && get.value(bs[i]) < 7) {
                                                        return [1, 0, 1, -0.5];
                                                    }
                                                }
                                                return 0;
                                            }
                                            return [1, 0, 1, -0.5];
                                        }
                                    },
                                },
                            },
                        },
                        无间: {
                            group: ['em_shenqv'],
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseBegin',
                            },
                            forced: true,
                            filter(event, player) {
                                if (player.isLinked()) return true;
                                return game.hasPlayer(function (current) {
                                    return current != player && !current.isLinked();
                                });
                            },
                            content() {
                                'step 0';
                                event.targets = game.filterPlayer();
                                event.targets.remove(player);
                                event.targets.sort(lib.sort.seat);
                                if (player.isLinked()) player.link();
                                ('step 1');
                                if (event.targets.length) {
                                    var target = event.targets.shift();
                                    if (!target.isLinked()) {
                                        target.link();
                                        player.line(target, 'green');
                                    }
                                    event.redo();
                                }
                            },
                        },
                        洗髓: {
                            audio: 'ext:神域/audio:1',
                            mod: {
                                aiOrder(player, card, num) {
                                    if (num <= 0 || get.itemtype(card) !== 'card' || get.type(card) !== 'equip') return num;
                                    let eq = player.getEquip(get.subtype(card));
                                    if (eq && get.equipValue(card) - get.equipValue(eq) < Math.max(1.2, 6 - player.hp)) return 0;
                                },
                            },
                            enable: 'phaseUse',
                            usable: 2,
                            position: 'he',
                            filterCard: true,
                            selectCard: [1, Infinity],
                            prompt: '弃置X张牌并回复X点体力,摸2X张牌',
                            check(card) {
                                return 6 - get.value(card);
                            },
                            content: async function (event, trigger, player) {
                                player.recover(event.cards.length);
                                player.draw(event.cards.length * 2);
                            },
                            ai: {
                                order: 15,
                                result: {
                                    player: 1,
                                },
                                threaten: 1.5,
                            },
                        },
                        同悲: {
                            audio: 'ext:神域/audio:1',
                            enable: 'phaseUse',
                            filter(event, player) {
                                return player.countCards('h') >= 8;
                            },
                            content() {
                                'step 0';
                                player.chooseToDiscard(player.countCards('h'), true);
                                player.changeHujia(player.countCards('h'));
                                event.players = get.players(player);
                                ('step 1');
                                player.addSkill('同悲II');
                                player.removeSkill('同悲');
                                player.removeSkill('斩天');
                                player.removeSkill('破天III');
                                player.removeSkill('洗髓');
                                ui.background.setBackgroundImage('extension/神域/image/万古同悲!.jpg');
                                player.say('万古同悲!');
                                if (event.players.length) {
                                    var current = event.players.shift();
                                    player.line(current, 'fire');
                                    current.damage('fire', 3);
                                    event.redo();
                                }
                            },
                            ai: {
                                order: 14,
                                result: {
                                    player: 1,
                                },
                            },
                        },
                        同悲II: {
                            audio: 'ext:神域/audio:1',
                            juexingji: true,
                            forced: true,
                            trigger: {
                                player: 'phaseBegin',
                            },
                            content() {
                                'step 0';
                                player.awakenSkill(event.name);
                                player.storage[event.name] = true;
                                ('step 1');
                                if (game.showIdentity) {
                                    game.showIdentity();
                                }
                                if (player.isUnderControl(true) || player.getFriends().includes(game.me)) {
                                    game.over(true);
                                } else {
                                    game.over(false);
                                }
                            },
                        },
                        剑气II: {
                            mod: {
                                cardname(card, player) {
                                    if (['equip1'].includes(lib.card[card.name].subtype)) return 'sha';
                                },
                            },
                        },
                        扫射II: {
                            mod: {
                                cardname(card, player) {
                                    if (['equip1'].includes(lib.card[card.name].subtype)) return 'sha';
                                },
                            },
                        },
                        轩辕: {
                            forced: true,
                            group: ['神忌', '皇祸'],
                        },
                        无极: {
                            forced: true,
                            group: ['精防', '强击'],
                        },
                        残暴: {
                            forced: true,
                            group: ['dclkuangguII', '重击'],
                        },
                        极意: {
                            forced: true,
                            group: ['格挡', '重击'],
                        },
                        力竭: {
                            forced: true,
                            audio: '瘴气',
                            trigger: {
                                player: 'phaseEnd',
                                global: 'gameStart',
                            },
                            content() {
                                player.init('维吉尔');
                            },
                        },
                        力竭II: {
                            audio: '瘴气',
                            trigger: {
                                player: 'dieBefore',
                            },
                            forced: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.init('维吉尔');
                            },
                            popup: false,
                        },
                        炮台V: {
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'phaseUseEnd',
                            },
                            content() {
                                player.init('防爆特警');
                            },
                        },
                        炮台IV: {
                            group: ['炮台V'],
                            audio: 'ext:神域/audio:1',
                            trigger: {
                                player: 'dieBefore',
                            },
                            forced: true,
                            content() {
                                trigger.untrigger();
                                trigger.finish();
                                player.init('防爆特警');
                            },
                            popup: false,
                        },
                        冲撞II: {
                            mod: {
                                cardname(card, player) {
                                    if (card.name == 'shan') return 'sha';
                                },
                            },
                            ai: {
                                skillTagFilter(player) {
                                    if (!player.countCards('h', 'shan')) return false;
                                },
                                respondSha: true,
                            },
                            trigger: {
                                player: ['useCard1', 'respond'],
                            },
                            firstDo: true,
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && !event.skill && event.cards.length == 1 && event.cards[0].name == 'shan';
                            },
                            content() { },
                        },
                        冲撞III: {
                            mod: {
                                cardname(card, player) {
                                    if (['equip1'].includes(lib.card[card.name].subtype)) return 'sha';
                                },
                            },
                        },
                        冲撞: {
                            audio: '龙卷',
                            group: ['冲撞II', '冲撞III'],
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'heart') return 'spade';
                                },
                                targetInRange(card, player, target, now) {
                                    if (card.name == 'sha') return true;
                                },
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return Infinity;
                                },
                            },
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            content() {
                                trigger.directHit = true;
                            },
                            ai: {
                                unequip: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        炮台: {
                            audio: 'ext:神域/audio:1',
                            group: ['炮台II', '炮台III'],
                            mod: {
                                targetInRange(card, player, target, now) {
                                    if (card.name == 'sha') return true;
                                },
                                cardUsable(card, player, num) {
                                    if (card.name == 'sha') return Infinity;
                                },
                            },
                            trigger: {
                                player: 'shaBegin',
                            },
                            forced: true,
                            content() {
                                trigger.directHit = true;
                            },
                            ai: {
                                unequip: true,
                                skillTagFilter(player, tag, arg) {
                                    if (arg && arg.name == 'sha') return true;
                                    return false;
                                },
                            },
                        },
                        炮台II: {
                            mod: {
                                cardname(card, player) {
                                    if (card.name == 'shan') return 'sha';
                                },
                            },
                            ai: {
                                skillTagFilter(player) {
                                    if (!player.countCards('h', 'shan')) return false;
                                },
                                respondSha: true,
                            },
                            trigger: {
                                player: ['useCard1', 'respond'],
                            },
                            firstDo: true,
                            forced: true,
                            filter(event, player) {
                                return event.card && event.card.name == 'sha' && !event.skill && event.cards.length == 1 && event.cards[0].name == 'shan';
                            },
                            content() { },
                        },
                        炮台III: {
                            mod: {
                                cardname(card, player) {
                                    if (['equip1'].includes(lib.card[card.name].subtype)) return 'sha';
                                },
                            },
                        },
                        平凡: {
                            trigger: {
                                player: 'phaseDrawBegin',
                            },
                            forced: true,
                            _priority: -1,
                            content() {
                                trigger.num = 2;
                            },
                        },
                        普通: {
                            forced: true,
                            mod: {
                                maxHandcard(player, num) {
                                    return player.hp;
                                },
                            },
                        },
                        伟大: {
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.init(target.name);
                                player.addSkill('伟大');
                                target.init('普通人');
                                player.removeSkill('伟大');
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        伟大II: {
                            enable: 'phaseUse',
                            usable: 1,
                            filterTarget(card, player, target) {
                                return player != target;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) <= 0;
                            },
                            selectTarget: 1,
                            content() {
                                player.init(target.name);
                                player.addSkill('伟大II');
                                target.init('普通人II');
                                player.removeSkill('伟大II');
                            },
                            ai: {
                                order: 13,
                                result: {
                                    target: -1,
                                },
                            },
                        },
                        juejII: {
                            mod: {
                                maxHandcardBase(player, num) {
                                    return num + player.maxHp - player.hp;
                                },
                            },
                            group: ['xinjuejing'],
                            audio: 'xinjuejing',
                            trigger: {
                                player: 'phaseDrawBegin2',
                            },
                            filter(event, player) {
                                return !event.numFixed && player.getHp() < player.maxHp;
                            },
                            forced: true,
                            content() {
                                trigger.num += player.getDamagedHp();
                            },
                        },
                        龙怒II: {
                            audio: '追猎',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            round: 1,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '龙怒II' && event.player != player;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        魔眼II: {
                            audio: '追猎',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            round: 1,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '魔眼II' && event.player != player;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        巨兽II: {
                            audio: '追猎',
                            trigger: {
                                global: 'phaseAfter',
                            },
                            round: 1,
                            _priority: -50,
                            filter(event, player) {
                                return event.skill != '巨兽II' && event.player != player;
                            },
                            content() {
                                player.phase('nodelay');
                            },
                            ai: {
                                threaten: 1.8,
                            },
                            _priority: -5000,
                        },
                        巨兽: {
                            mod: {
                                suit(card, suit) {
                                    if (suit == 'diamond') return 'club';
                                },
                            },
                            audio: '魔甲',
                            group: ['boss__baolianII', '飞弹', '强袭', '巨兽II'],
                            trigger: {
                                global: 'phaseZhunbeiBegin',
                            },
                            forced: true,
                            content() {
                                player.changeHujia();
                            },
                            ai: {
                                threaten(player, target) {
                                    if (target.hujia) {
                                        return 0.5;
                                    } else {
                                        return 2;
                                    }
                                },
                            },
                        },
                        绝弑: {
                            audio: '瘴气',
                            trigger: {
                                global: 'dying',
                            },
                            _priority: 9,
                            filter(event, player) {
                                return event.player != player && event.player.hp <= 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            forced: true,
                            logTarget: 'player',
                            content() {
                                'step 0';
                                trigger.player.die();
                                ('step 1');
                                if (!trigger.player.isAlive()) {
                                    trigger.cancel(true);
                                }
                            },
                            _priority: 900,
                        },
                        死神: {
                            round: 1,
                            audio: 'kslbingyuanII',
                            trigger: {
                                global: 'dying',
                            },
                            _priority: 9,
                            filter(event, player) {
                                return event.player != player && event.player.hp <= 0;
                            },
                            check(event, player) {
                                return get.attitude(player, event.player) < 0;
                            },
                            logTarget: 'player',
                            content() {
                                'step 0';
                                trigger.player.die();
                                ('step 1');
                                if (!trigger.player.isAlive()) {
                                    trigger.cancel(true);
                                }
                            },
                            _priority: 900,
                        },
                    },
                };
                lib.config.all.characters.add('神域');
                lib.config.characters.add('神域');
                for (var i in QQQ.character) {
                    QQQ.character[i][4].add(`ext:神域/image/${i}.jpg`)
                }
                lib.translate['神域_character_config'] = `神域`;
                return QQQ;
            });
        },
        package: {
            intro: `<br><br><span style='color: gold'>潜水的火修复版<br>『无名杀扩展大全群』:771901025<br><br></span>`,
            author: 'LINK(2292797375),尧(2177808337),雾纱弄尘(2985679615)',
            version: '0.0',
        },
    };
});
